#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_AchievementTracker

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AC_AchievementTracker.AC_AchievementTracker_C.AddKillData
// 0x03F8 (0x03F8 - 0x0000)
struct AC_AchievementTracker_C_AddKillData final
{
public:
	struct FKillInfo                              KillInfo;                                          // 0x0000(0x03D8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                Location;                                          // 0x03D8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1; // 0x03F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AchievementTracker_C_AddKillData) == 0x000008, "Wrong alignment on AC_AchievementTracker_C_AddKillData");
static_assert(sizeof(AC_AchievementTracker_C_AddKillData) == 0x0003F8, "Wrong size on AC_AchievementTracker_C_AddKillData");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, KillInfo) == 0x000000, "Member 'AC_AchievementTracker_C_AddKillData::KillInfo' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, Location) == 0x0003D8, "Member 'AC_AchievementTracker_C_AddKillData::Location' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x0003F0, "Member 'AC_AchievementTracker_C_AddKillData::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x0003F1, "Member 'AC_AchievementTracker_C_AddKillData::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, CallFunc_BooleanAND_ReturnValue) == 0x0003F2, "Member 'AC_AchievementTracker_C_AddKillData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_AddKillData, CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1) == 0x0003F3, "Member 'AC_AchievementTracker_C_AddKillData::CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1' has a wrong offset!");

// Function AC_AchievementTracker.AC_AchievementTracker_C.CheckHouseEssentialsDestruction
// 0x0058 (0x0058 - 0x0000)
struct AC_AchievementTracker_C_CheckHouseEssentialsDestruction final
{
public:
	bool                                          NoEssentialsDestroyed;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundDestroyedEssential;                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HouseEssential_Cube_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HouseEssential_Cube_C*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction) == 0x000008, "Wrong alignment on AC_AchievementTracker_C_CheckHouseEssentialsDestruction");
static_assert(sizeof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction) == 0x000058, "Wrong size on AC_AchievementTracker_C_CheckHouseEssentialsDestruction");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, NoEssentialsDestroyed) == 0x000000, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::NoEssentialsDestroyed' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, FoundDestroyedEssential) == 0x000001, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::FoundDestroyedEssential' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, Temp_byte_Variable) == 0x000010, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_Array_Get_Item) == 0x000030, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, K2Node_DynamicCast_AsTeamable_Interface) == 0x000038, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_GetTeamID_ReturnValue) == 0x000049, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_GetTeamID_ReturnValue_1) == 0x00004A, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004B, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_CheckHouseEssentialsDestruction, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'AC_AchievementTracker_C_CheckHouseEssentialsDestruction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AC_AchievementTracker.AC_AchievementTracker_C.CheckTrickshotAchievement
// 0x0018 (0x0018 - 0x0000)
struct AC_AchievementTracker_C_CheckTrickshotAchievement final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AchievementTracker_C_CheckTrickshotAchievement) == 0x000008, "Wrong alignment on AC_AchievementTracker_C_CheckTrickshotAchievement");
static_assert(sizeof(AC_AchievementTracker_C_CheckTrickshotAchievement) == 0x000018, "Wrong size on AC_AchievementTracker_C_CheckTrickshotAchievement");
static_assert(offsetof(AC_AchievementTracker_C_CheckTrickshotAchievement, Location) == 0x000000, "Member 'AC_AchievementTracker_C_CheckTrickshotAchievement::Location' has a wrong offset!");

// Function AC_AchievementTracker.AC_AchievementTracker_C.ExecuteUbergraph_AC_AchievementTracker
// 0x04A0 (0x04A0 - 0x0000)
struct AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAchievementsGameInstanceSubsystem*     CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKillInfo                              K2Node_CustomEvent_KillInfo;                       // 0x00A8(0x03D8)()
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0498(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker) == 0x000008, "Wrong alignment on AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker");
static_assert(sizeof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker) == 0x0004A0, "Wrong size on AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, EntryPoint) == 0x000000, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000008, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, K2Node_CustomEvent_Location_1) == 0x000010, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_Vector_Distance_ReturnValue) == 0x000050, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000070, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, Temp_int_Variable) == 0x000078, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00007C, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000080, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000088, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000090, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, K2Node_CustomEvent_KillInfo) == 0x0000A8, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::K2Node_CustomEvent_KillInfo' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, K2Node_CustomEvent_Location) == 0x000480, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000498, "Member 'AC_AchievementTracker_C_ExecuteUbergraph_AC_AchievementTracker::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AC_AchievementTracker.AC_AchievementTracker_C.Owner_SetKillData
// 0x03F0 (0x03F0 - 0x0000)
struct AC_AchievementTracker_C_Owner_SetKillData final
{
public:
	struct FKillInfo                              KillInfo;                                          // 0x0000(0x03D8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                Location;                                          // 0x03D8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AchievementTracker_C_Owner_SetKillData) == 0x000008, "Wrong alignment on AC_AchievementTracker_C_Owner_SetKillData");
static_assert(sizeof(AC_AchievementTracker_C_Owner_SetKillData) == 0x0003F0, "Wrong size on AC_AchievementTracker_C_Owner_SetKillData");
static_assert(offsetof(AC_AchievementTracker_C_Owner_SetKillData, KillInfo) == 0x000000, "Member 'AC_AchievementTracker_C_Owner_SetKillData::KillInfo' has a wrong offset!");
static_assert(offsetof(AC_AchievementTracker_C_Owner_SetKillData, Location) == 0x0003D8, "Member 'AC_AchievementTracker_C_Owner_SetKillData::Location' has a wrong offset!");

}

