#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_CharacterNamePlate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.BindHealthChangedListeners
// 0x0030 (0x0030 - 0x0000)
struct AC_CharacterNamePlate_C_BindHealthChangedListeners final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ActorWithHealth_C>  K2Node_DynamicCast_AsI_Actor_with_Health;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ActorWithHealth_HealthChangedReceiver_C> CallFunc_AddOnHealthChangedListener_Listener_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_BindHealthChangedListeners) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_BindHealthChangedListeners");
static_assert(sizeof(AC_CharacterNamePlate_C_BindHealthChangedListeners) == 0x000030, "Wrong size on AC_CharacterNamePlate_C_BindHealthChangedListeners");
static_assert(offsetof(AC_CharacterNamePlate_C_BindHealthChangedListeners, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'AC_CharacterNamePlate_C_BindHealthChangedListeners::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindHealthChangedListeners, K2Node_DynamicCast_AsI_Actor_with_Health) == 0x000008, "Member 'AC_CharacterNamePlate_C_BindHealthChangedListeners::K2Node_DynamicCast_AsI_Actor_with_Health' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindHealthChangedListeners, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_CharacterNamePlate_C_BindHealthChangedListeners::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindHealthChangedListeners, CallFunc_AddOnHealthChangedListener_Listener_CastInput) == 0x000020, "Member 'AC_CharacterNamePlate_C_BindHealthChangedListeners::CallFunc_AddOnHealthChangedListener_Listener_CastInput' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.BindTeamChangedListeners
// 0x0030 (0x0030 - 0x0000)
struct AC_CharacterNamePlate_C_BindTeamChangedListeners final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ActorWithChangeableTeam_C> K2Node_DynamicCast_AsI_Actor_with_Changeable_Team; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ActorWithChangeableTeam_TeamChangedReceiver_C> CallFunc_AddOnTeamChangedListener_Listener_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_BindTeamChangedListeners) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_BindTeamChangedListeners");
static_assert(sizeof(AC_CharacterNamePlate_C_BindTeamChangedListeners) == 0x000030, "Wrong size on AC_CharacterNamePlate_C_BindTeamChangedListeners");
static_assert(offsetof(AC_CharacterNamePlate_C_BindTeamChangedListeners, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'AC_CharacterNamePlate_C_BindTeamChangedListeners::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindTeamChangedListeners, K2Node_DynamicCast_AsI_Actor_with_Changeable_Team) == 0x000008, "Member 'AC_CharacterNamePlate_C_BindTeamChangedListeners::K2Node_DynamicCast_AsI_Actor_with_Changeable_Team' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindTeamChangedListeners, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_CharacterNamePlate_C_BindTeamChangedListeners::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_BindTeamChangedListeners, CallFunc_AddOnTeamChangedListener_Listener_CastInput) == 0x000020, "Member 'AC_CharacterNamePlate_C_BindTeamChangedListeners::CallFunc_AddOnTeamChangedListener_Listener_CastInput' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.DebugPrintHealth
// 0x01A0 (0x01A0 - 0x0000)
struct AC_CharacterNamePlate_C_DebugPrintHealth final
{
public:
	class FString                                 ContextName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0118(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_DebugPrintHealth) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_DebugPrintHealth");
static_assert(sizeof(AC_CharacterNamePlate_C_DebugPrintHealth) == 0x0001A0, "Wrong size on AC_CharacterNamePlate_C_DebugPrintHealth");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, ContextName) == 0x000000, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::ContextName' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, K2Node_MakeStruct_FormatArgumentData_3) == 0x000118, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_Get_ClassLog_Name_name) == 0x000160, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, K2Node_MakeArray_Array) == 0x000170, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_Format_ReturnValue) == 0x000180, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintHealth, CallFunc_Conv_TextToString_ReturnValue) == 0x000190, "Member 'AC_CharacterNamePlate_C_DebugPrintHealth::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.DebugPrintPlayerName
// 0x0168 (0x0168 - 0x0000)
struct AC_CharacterNamePlate_C_DebugPrintPlayerName final
{
public:
	class FString                                 ContextName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_DebugPrintPlayerName) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_DebugPrintPlayerName");
static_assert(sizeof(AC_CharacterNamePlate_C_DebugPrintPlayerName) == 0x000168, "Wrong size on AC_CharacterNamePlate_C_DebugPrintPlayerName");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, ContextName) == 0x000000, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::ContextName' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000D0, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Get_ClassLog_Name_name) == 0x000128, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, K2Node_MakeArray_Array) == 0x000138, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Format_ReturnValue) == 0x000148, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintPlayerName, CallFunc_Conv_TextToString_ReturnValue) == 0x000158, "Member 'AC_CharacterNamePlate_C_DebugPrintPlayerName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.DebugPrintTeam
// 0x0178 (0x0178 - 0x0000)
struct AC_CharacterNamePlate_C_DebugPrintTeam final
{
public:
	class FString                                 ContextName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00E0(0x0010)()
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_DebugPrintTeam) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_DebugPrintTeam");
static_assert(sizeof(AC_CharacterNamePlate_C_DebugPrintTeam) == 0x000178, "Wrong size on AC_CharacterNamePlate_C_DebugPrintTeam");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, ContextName) == 0x000000, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::ContextName' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000D0, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000E0, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Get_ClassLog_Name_name) == 0x0000F0, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, K2Node_MakeArray_Array) == 0x000148, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Format_ReturnValue) == 0x000158, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_DebugPrintTeam, CallFunc_Conv_TextToString_ReturnValue) == 0x000168, "Member 'AC_CharacterNamePlate_C_DebugPrintTeam::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.ExecuteUbergraph_AC_CharacterNamePlate
// 0x00D8 (0x00D8 - 0x0000)
struct AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_CurrentHealth;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_MaxHealth;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_CurrentHealthFraction;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryReadHealthStateVariablesFromCharacter_Success; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryReadNameStateVariablesFromCharacter_Success; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryReadNameStateVariablesFromCharacter_Success_1; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_Team_ID;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     K2Node_Event_Team_Type;                            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryReadTeamStateVariablesFromCharacter_Success; // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StealthActive;                        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEnemyToLocalPlayer;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Stealth_C>          K2Node_DynamicCast_AsI_Stealth;                    // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Dead_C>             K2Node_DynamicCast_AsI_Dead;                       // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_1; // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_2; // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate");
static_assert(sizeof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate) == 0x0000D8, "Wrong size on AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, EntryPoint) == 0x000000, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_Get_ClassLog_Name_name) == 0x000008, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_Enable) == 0x000019, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000020, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue) == 0x000029, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_EndPlayReason) == 0x00002B, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_CurrentHealth) == 0x000030, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_CurrentHealth' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_MaxHealth) == 0x000038, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_MaxHealth' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_CurrentHealthFraction) == 0x000040, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_CurrentHealthFraction' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_TryReadHealthStateVariablesFromCharacter_Success) == 0x000048, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_TryReadHealthStateVariablesFromCharacter_Success' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_TryReadNameStateVariablesFromCharacter_Success) == 0x000049, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_TryReadNameStateVariablesFromCharacter_Success' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_TryReadNameStateVariablesFromCharacter_Success_1) == 0x00004A, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_TryReadNameStateVariablesFromCharacter_Success_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_Team_ID) == 0x00004B, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_Team_ID' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_Team_Type) == 0x00004C, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_Team_Type' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_TryReadTeamStateVariablesFromCharacter_Success) == 0x00004D, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_TryReadTeamStateVariablesFromCharacter_Success' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000050, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_StealthActive) == 0x000059, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_StealthActive' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_Event_IsEnemyToLocalPlayer) == 0x00005A, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_Event_IsEnemyToLocalPlayer' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_GetWidget_ReturnValue) == 0x000060, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_AsI_Stealth) == 0x000068, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_AsI_Stealth' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_AsI_Dead) == 0x000090, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_AsI_Dead' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000A8, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_1) == 0x0000B1, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_2) == 0x0000B2, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_IsOwnerCharacterLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x0000B8, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_AsBP_Resident_Character) == 0x0000C8, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D1, "Member 'AC_CharacterNamePlate_C_ExecuteUbergraph_AC_CharacterNamePlate::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.Get Distance To Camera
// 0x0070 (0x0070 - 0x0000)
struct AC_CharacterNamePlate_C_Get_Distance_To_Camera final
{
public:
	class APlayerCameraManager*                   Player_Camera_Manager;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_To_Camera;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_Get_Distance_To_Camera) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_Get_Distance_To_Camera");
static_assert(sizeof(AC_CharacterNamePlate_C_Get_Distance_To_Camera) == 0x000070, "Wrong size on AC_CharacterNamePlate_C_Get_Distance_To_Camera");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, Player_Camera_Manager) == 0x000000, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, Distance_To_Camera) == 0x000008, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::Distance_To_Camera' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_GetCameraLocation_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_Get_Distance_To_Camera, CallFunc_Abs_ReturnValue) == 0x000068, "Member 'AC_CharacterNamePlate_C_Get_Distance_To_Camera::CallFunc_Abs_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.GetCharacterLocatorWidget
// 0x0018 (0x0018 - 0x0000)
struct AC_CharacterNamePlate_C_GetCharacterLocatorWidget final
{
public:
	class UWI_CharacterLocator_C*                 WI_CharacterLocator;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CharacterNamePlate_C*               CallFunc_GetCharacterNamePlateWidget_Character_Name_Plate; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_GetCharacterLocatorWidget) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_GetCharacterLocatorWidget");
static_assert(sizeof(AC_CharacterNamePlate_C_GetCharacterLocatorWidget) == 0x000018, "Wrong size on AC_CharacterNamePlate_C_GetCharacterLocatorWidget");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterLocatorWidget, WI_CharacterLocator) == 0x000000, "Member 'AC_CharacterNamePlate_C_GetCharacterLocatorWidget::WI_CharacterLocator' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterLocatorWidget, CallFunc_GetCharacterNamePlateWidget_Character_Name_Plate) == 0x000008, "Member 'AC_CharacterNamePlate_C_GetCharacterLocatorWidget::CallFunc_GetCharacterNamePlateWidget_Character_Name_Plate' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterLocatorWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_GetCharacterLocatorWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.GetCharacterNamePlateWidget
// 0x0020 (0x0020 - 0x0000)
struct AC_CharacterNamePlate_C_GetCharacterNamePlateWidget final
{
public:
	class UWI_CharacterNamePlate_C*               Character_Name_Plate;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CharacterNamePlate_C*               K2Node_DynamicCast_AsWI_Character_Name_Plate;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_GetCharacterNamePlateWidget");
static_assert(sizeof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget) == 0x000020, "Wrong size on AC_CharacterNamePlate_C_GetCharacterNamePlateWidget");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget, Character_Name_Plate) == 0x000000, "Member 'AC_CharacterNamePlate_C_GetCharacterNamePlateWidget::Character_Name_Plate' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'AC_CharacterNamePlate_C_GetCharacterNamePlateWidget::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget, K2Node_DynamicCast_AsWI_Character_Name_Plate) == 0x000010, "Member 'AC_CharacterNamePlate_C_GetCharacterNamePlateWidget::K2Node_DynamicCast_AsWI_Character_Name_Plate' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_CharacterNamePlate_C_GetCharacterNamePlateWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetCharacterNamePlateWidget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AC_CharacterNamePlate_C_GetCharacterNamePlateWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.GetHasLineOfSight
// 0x01B0 (0x01B0 - 0x0000)
struct AC_CharacterNamePlate_C_GetHasLineOfSight final
{
public:
	class APlayerCameraManager*                   Player_Camera_Manager;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Line_Of_Sight_0;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface_1;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_GetHasLineOfSight) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_GetHasLineOfSight");
static_assert(sizeof(AC_CharacterNamePlate_C_GetHasLineOfSight) == 0x0001B0, "Wrong size on AC_CharacterNamePlate_C_GetHasLineOfSight");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, Player_Camera_Manager) == 0x000000, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, Has_Line_Of_Sight_0) == 0x000008, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::Has_Line_Of_Sight_0' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, Temp_byte_Variable) == 0x000009, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetCameraLocation_ReturnValue) == 0x000010, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, Temp_byte_Variable_1) == 0x000028, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, K2Node_DynamicCast_AsTeamable_Interface) == 0x000040, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetTeamID_ReturnValue) == 0x000051, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, K2Node_DynamicCast_AsTeamable_Interface_1) == 0x000060, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::K2Node_DynamicCast_AsTeamable_Interface_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetTeamID_ReturnValue_1) == 0x000071, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_IsValid_ReturnValue) == 0x000072, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_K2_GetPawn_ReturnValue) == 0x000080, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000088, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, K2Node_MakeArray_Array) == 0x0000A0, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_LineTraceSingle_OutHit) == 0x0000B0, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_LineTraceSingle_ReturnValue) == 0x0001A8, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_CharacterNamePlate_C_GetHasLineOfSight, CallFunc_Not_PreBool_ReturnValue) == 0x0001A9, "Member 'AC_CharacterNamePlate_C_GetHasLineOfSight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.GetStealthActive
// 0x0001 (0x0001 - 0x0000)
struct AC_CharacterNamePlate_C_GetStealthActive final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_GetStealthActive) == 0x000001, "Wrong alignment on AC_CharacterNamePlate_C_GetStealthActive");
static_assert(sizeof(AC_CharacterNamePlate_C_GetStealthActive) == 0x000001, "Wrong size on AC_CharacterNamePlate_C_GetStealthActive");
static_assert(offsetof(AC_CharacterNamePlate_C_GetStealthActive, Return) == 0x000000, "Member 'AC_CharacterNamePlate_C_GetStealthActive::Return' has a wrong offset!");

// Function AC_CharacterNamePlate.AC_CharacterNamePlate_C.HandleHealthChanged
// 0x0018 (0x0018 - 0x0000)
struct AC_CharacterNamePlate_C_HandleHealthChanged final
{
public:
	double                                        CurrentHealth_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealthFraction;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_CharacterNamePlate_C_HandleHealthChanged) == 0x000008, "Wrong alignment on AC_CharacterNamePlate_C_HandleHealthChanged");
static_assert(sizeof(AC_CharacterNamePlate_C_HandleHealthChanged) == 0x000018, "Wrong size on AC_CharacterNamePlate_C_HandleHealthChanged");
static_assert(offsetof(AC_CharacterNamePlate_C_HandleHealthChanged, CurrentHealth_0) == 0x000000, "Member 'AC_CharacterNamePlate_C_HandleHealthChanged::CurrentHealth_0' has a wrong offset!");
