#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_MusicManagerNew

#include "Basic.hpp"

#include "E_TimeOfDay_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function AC_MusicManagerNew.AC_MusicManagerNew_C.Attach Audio ComponentTo Jackhammer
// 0x0008 (0x0008 - 0x0000)
struct AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer final
{
public:
	class USceneComponent*                        ComponentToAttachTo;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer) == 0x000008, "Wrong alignment on AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer");
static_assert(sizeof(AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer) == 0x000008, "Wrong size on AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer");
static_assert(offsetof(AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer, ComponentToAttachTo) == 0x000000, "Member 'AC_MusicManagerNew_C_Attach_Audio_ComponentTo_Jackhammer::ComponentToAttachTo' has a wrong offset!");

// Function AC_MusicManagerNew.AC_MusicManagerNew_C.ExecuteUbergraph_AC_MusicManagerNew
// 0x00C8 (0x00C8 - 0x0000)
struct AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable_4;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InitialState;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   K2Node_CustomEvent_TimeOfDay;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   Temp_byte_Variable_6;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMusicStates                                  K2Node_Select_Default_1;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool InitialState, E_TimeOfDay TimeOfDay)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MatchIntro_Manager_C*               CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_ComponentToAttachTo;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew) == 0x000008, "Wrong alignment on AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew");
static_assert(sizeof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew) == 0x0000C8, "Wrong size on AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, EntryPoint) == 0x000000, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_GetIsPie_ReturnValue) == 0x000004, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable) == 0x000005, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_1) == 0x000006, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_2) == 0x000007, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_3) == 0x000008, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_4) == 0x000009, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_5) == 0x00000B, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_object_Variable) == 0x000010, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_object_Variable_1) == 0x000018, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_object_Variable_2) == 0x000020, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_object_Variable_3) == 0x000028, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_object_Variable_4) == 0x000030, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CustomEvent_InitialState) == 0x000058, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CustomEvent_InitialState' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CustomEvent_TimeOfDay) == 0x000059, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CustomEvent_TimeOfDay' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsPlaying_ReturnValue) == 0x00005A, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, Temp_byte_Variable_6) == 0x00005B, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_Select_Default) == 0x000060, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_Select_Default_1) == 0x000068, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000080, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsValid_ReturnValue_3) == 0x000088, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000089, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_SpawnSound2D_ReturnValue) == 0x000090, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000098, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsValid_ReturnValue_4) == 0x0000A1, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A2, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CustomEvent_ComponentToAttachTo) == 0x0000A8, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CustomEvent_ComponentToAttachTo' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000C0, "Member 'AC_MusicManagerNew_C_ExecuteUbergraph_AC_MusicManagerNew::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function AC_MusicManagerNew.AC_MusicManagerNew_C.On_Client_TimeOfDayChange_Event
// 0x0002 (0x0002 - 0x0000)
struct AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event final
{
public:
	bool                                          InitialState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event) == 0x000001, "Wrong alignment on AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event");
static_assert(sizeof(AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event) == 0x000002, "Wrong size on AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event");
static_assert(offsetof(AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event, InitialState) == 0x000000, "Member 'AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event::InitialState' has a wrong offset!");
static_assert(offsetof(AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event, TimeOfDay) == 0x000001, "Member 'AC_MusicManagerNew_C_On_Client_TimeOfDayChange_Event::TimeOfDay' has a wrong offset!");

}

