#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_POI_ItemMarker

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function AC_POI_ItemMarker.AC_POI_ItemMarker_C.ExecuteUbergraph_AC_POI_ItemMarker
// 0x0070 (0x0070 - 0x0000)
struct AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ItemSource_C>       K2Node_DynamicCast_AsI_Item_Source;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FObjectiveTracker>& ObjectiveTrackers)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FObjectiveTracker>              K2Node_CustomEvent_ObjectiveTrackers;              // 0x0040(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UObjectiveTrackingManager*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrackingObjective_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker) == 0x000008, "Wrong alignment on AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker");
static_assert(sizeof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker) == 0x000070, "Wrong size on AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, EntryPoint) == 0x000000, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_DynamicCast_AsI_Item_Source) == 0x000010, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_DynamicCast_AsI_Item_Source' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_CustomEvent_ObjectiveTrackers) == 0x000040, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_CustomEvent_ObjectiveTrackers' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000060, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker, CallFunc_IsTrackingObjective_ReturnValue) == 0x000069, "Member 'AC_POI_ItemMarker_C_ExecuteUbergraph_AC_POI_ItemMarker::CallFunc_IsTrackingObjective_ReturnValue' has a wrong offset!");

// Function AC_POI_ItemMarker.AC_POI_ItemMarker_C.ObjectiveTrackingChanged
// 0x0010 (0x0010 - 0x0000)
struct AC_POI_ItemMarker_C_ObjectiveTrackingChanged final
{
public:
	TArray<struct FObjectiveTracker>              ObjectiveTrackers;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AC_POI_ItemMarker_C_ObjectiveTrackingChanged) == 0x000008, "Wrong alignment on AC_POI_ItemMarker_C_ObjectiveTrackingChanged");
static_assert(sizeof(AC_POI_ItemMarker_C_ObjectiveTrackingChanged) == 0x000010, "Wrong size on AC_POI_ItemMarker_C_ObjectiveTrackingChanged");
static_assert(offsetof(AC_POI_ItemMarker_C_ObjectiveTrackingChanged, ObjectiveTrackers) == 0x000000, "Member 'AC_POI_ItemMarker_C_ObjectiveTrackingChanged::ObjectiveTrackers' has a wrong offset!");

}

