#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_PlayItemMontage

#include "Basic.hpp"

#include "GASIW_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_PlayItemMontage.AN_PlayItemMontage_C.GetChargedPlayRate
// 0x0038 (0x0038 - 0x0000)
struct AN_PlayItemMontage_C_GetChargedPlayRate final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlayItemMontage_C_GetChargedPlayRate) == 0x000008, "Wrong alignment on AN_PlayItemMontage_C_GetChargedPlayRate");
static_assert(sizeof(AN_PlayItemMontage_C_GetChargedPlayRate) == 0x000038, "Wrong size on AN_PlayItemMontage_C_GetChargedPlayRate");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, ReturnValue) == 0x000000, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_SafeDivide_ReturnValue) == 0x000020, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_SafeDivide_ReturnValue_1) == 0x000028, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_GetChargedPlayRate, CallFunc_SafeDivide_A_ImplicitCast) == 0x000030, "Member 'AN_PlayItemMontage_C_GetChargedPlayRate::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");

// Function AN_PlayItemMontage.AN_PlayItemMontage_C.CalculatePlayRate
// 0x0070 (0x0070 - 0x0000)
struct AN_PlayItemMontage_C_CalculatePlayRate final
{
public:
	class UItemInstance*                          InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlayItemMontage_C_CalculatePlayRate) == 0x000008, "Wrong alignment on AN_PlayItemMontage_C_CalculatePlayRate");
static_assert(sizeof(AN_PlayItemMontage_C_CalculatePlayRate) == 0x000070, "Wrong size on AN_PlayItemMontage_C_CalculatePlayRate");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, InputPin) == 0x000000, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::InputPin' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, ReturnValue) == 0x000008, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, Temp_bool_Variable) == 0x000010, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_GetTagStackCount_ReturnValue) == 0x000014, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000018, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_GetTagStackCount_ReturnValue_2) == 0x00001C, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_GetTagStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Multiply_IntInt_ReturnValue) == 0x000020, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000030, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_SafeDivide_ReturnValue) == 0x000038, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, K2Node_Select_Default) == 0x000050, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_SafeDivide_ReturnValue_1) == 0x000058, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, K2Node_Select_Option_0_ImplicitCast) == 0x000060, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_CalculatePlayRate, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'AN_PlayItemMontage_C_CalculatePlayRate::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function AN_PlayItemMontage.AN_PlayItemMontage_C.PlayMontageLogic
// 0x00D8 (0x00D8 - 0x0000)
struct AN_PlayItemMontage_C_PlayMontageLogic final
{
public:
	class AActor*                                 Actor_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageLeader;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           UseMontage;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        InPlayRate;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentActiveMontage;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          FollowerAnimInstance;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Equipable_C>        K2Node_DynamicCast_AsI_Equipable;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Equipable_C>        K2Node_DynamicCast_AsI_Equipable_1;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentViewMode                            CallFunc_GetViewMode_ViewMode;                     // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculatePlayRate_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlayItemMontage_C_PlayMontageLogic) == 0x000008, "Wrong alignment on AN_PlayItemMontage_C_PlayMontageLogic");
static_assert(sizeof(AN_PlayItemMontage_C_PlayMontageLogic) == 0x0000D8, "Wrong size on AN_PlayItemMontage_C_PlayMontageLogic");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, Actor_0) == 0x000000, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::Actor_0' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, MeshComp) == 0x000008, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, MontageLeader) == 0x000010, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::MontageLeader' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, UseMontage) == 0x000018, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::UseMontage' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, InPlayRate) == 0x000020, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::InPlayRate' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CurrentActiveMontage) == 0x000028, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CurrentActiveMontage' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, FollowerAnimInstance) == 0x000030, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::FollowerAnimInstance' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, K2Node_DynamicCast_AsI_Equipable) == 0x000040, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::K2Node_DynamicCast_AsI_Equipable' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, K2Node_DynamicCast_AsI_Equipable_1) == 0x000060, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::K2Node_DynamicCast_AsI_Equipable_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetViewMode_ViewMode) == 0x000072, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetViewMode_ViewMode' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000078, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetAnimInstance_ReturnValue) == 0x000088, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000098, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x0000A8, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000B0, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_GetFirstItemOfType_ReturnValue) == 0x0000B8, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_CalculatePlayRate_ReturnValue) == 0x0000C0, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_CalculatePlayRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_PlayMontageLogic, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'AN_PlayItemMontage_C_PlayMontageLogic::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function AN_PlayItemMontage.AN_PlayItemMontage_C.Received_Notify
// 0x0410 (0x0410 - 0x0000)
struct AN_PlayItemMontage_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UseActor;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentActiveMontage;                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        InPlayRate;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageLeader;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          FollowerAnimInstance;                              // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NeighborPreviewActor_C> K2Node_DynamicCast_AsBPI_Neighbor_Preview_Actor;   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllCurrentlySpawnedActors_SpawnedActors; // 0x0120(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEquipmentInstance*>             CallFunc_GetEquipmentInstancesOfType_ReturnValue;  // 0x0158(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x01A8(0x0010)(ReferenceParm)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item_3;                         // 0x01C0(0x0100)(NoDestructor)
	struct FSpawnedActorData                      CallFunc_Array_Get_Item_4;                         // 0x02C0(0x0100)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_InPlayRate_ImplicitCast;     // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlayItemMontage_C_Received_Notify) == 0x000010, "Wrong alignment on AN_PlayItemMontage_C_Received_Notify");
static_assert(sizeof(AN_PlayItemMontage_C_Received_Notify) == 0x000410, "Wrong size on AN_PlayItemMontage_C_Received_Notify");
static_assert(offsetof(AN_PlayItemMontage_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_PlayItemMontage_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_Received_Notify, Animation) == 0x000008, "Member 'AN_PlayItemMontage_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_PlayItemMontage_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_PlayItemMontage_C_Received_Notify::EventReference' has a wrong offset!");
