#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_SetBaseAnimationOnPreviewActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_SetBaseAnimationOnPreviewActor.AN_SetBaseAnimationOnPreviewActor_C.Received_Notify
// 0x0100 (0x0100 - 0x0000)
struct AN_SetBaseAnimationOnPreviewActor_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	class UABP_JP_TPP_Preview_C*                  K2Node_DynamicCast_AsABP_JP_TPP_Preview;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify) == 0x000008, "Wrong alignment on AN_SetBaseAnimationOnPreviewActor_C_Received_Notify");
static_assert(sizeof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify) == 0x000100, "Wrong size on AN_SetBaseAnimationOnPreviewActor_C_Received_Notify");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, Animation) == 0x000008, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_GetIsPie_ReturnValue) == 0x000041, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, K2Node_DynamicCast_AsABP_JP_TPP_Preview) == 0x0000B8, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::K2Node_DynamicCast_AsABP_JP_TPP_Preview' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, K2Node_MakeArray_Array) == 0x0000C8, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SetBaseAnimationOnPreviewActor_C_Received_Notify, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F0, "Member 'AN_SetBaseAnimationOnPreviewActor_C_Received_Notify::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

