#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BearTrap_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct BearTrap_AnimBP.BearTrap_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x042F (0x0430 - 0x0001)
struct BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_97;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_98;                             // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_99;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_100;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_101;                              // 0x0034(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_102;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_103;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_104;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_105;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_106;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_107;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_108;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_109;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_110;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_111;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_112;                                // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_113;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_114;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_115;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_116;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_117;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;                 // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;                   // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0400(0x0030)()
};
static_assert(alignof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000430, "Wrong size on BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x00000C, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x000014, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_97) == 0x000018, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_97' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_98) == 0x000020, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_98' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000028, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_100) == 0x000030, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_100' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_101) == 0x000034, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_101' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000060, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_103) == 0x000064, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_103' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_104) == 0x00006C, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_104' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_105) == 0x000070, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_105' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_106) == 0x000074, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_106' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_107) == 0x000075, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_107' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_108) == 0x000078, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_108' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_109) == 0x000080, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_109' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_110) == 0x000088, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_110' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_111) == 0x000089, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_111' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_112) == 0x00008A, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_112' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x00008C, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_114) == 0x000094, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_114' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_115) == 0x00009C, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_115' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_116) == 0x0000A4, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_116' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_117) == 0x0000A8, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_117' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000160, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000190, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001C0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0001F0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000220, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000250, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000280, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x0002B0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0002E0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000310, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000340, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000370, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0003A0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0003D0, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000400, "Member 'BearTrap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

}

