#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseballPitcherDestroyed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseballPitcherDestroyed.BP_BaseballPitcherDestroyed_C.ExecuteUbergraph_BP_BaseballPitcherDestroyed
// 0x00A0 (0x00A0 - 0x0000)
struct BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         CallFunc_SetRadialFalloff_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_SetCullingField_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed) == 0x000008, "Wrong alignment on BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed");
static_assert(sizeof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed) == 0x0000A0, "Wrong size on BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, EntryPoint) == 0x000000, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000050, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_SetRadialVector_ReturnValue) == 0x000068, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_SetRadialFalloff_ReturnValue) == 0x000070, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_SetRadialFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_SetCullingField_ReturnValue) == 0x000078, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_SetCullingField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_GetUpVector_ReturnValue) == 0x000080, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed, CallFunc_SetUniformVector_ReturnValue) == 0x000098, "Member 'BP_BaseballPitcherDestroyed_C_ExecuteUbergraph_BP_BaseballPitcherDestroyed::CallFunc_SetUniformVector_ReturnValue' has a wrong offset!");

}

