#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BoxingGlove_Default_Right_Equipable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BoxingGlove_Default_Right_Equipable.BP_BoxingGlove_Default_Right_Equipable_C.EnableTrail
// 0x0010 (0x0010 - 0x0000)
struct BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail) == 0x000008, "Wrong alignment on BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail");
static_assert(sizeof(BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail) == 0x000010, "Wrong size on BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail, Enable) == 0x000000, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail::Enable' has a wrong offset!");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail, Duration) == 0x000008, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_EnableTrail::Duration' has a wrong offset!");

// Function BP_BoxingGlove_Default_Right_Equipable.BP_BoxingGlove_Default_Right_Equipable_C.ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable
// 0x0018 (0x0018 - 0x0000)
struct BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Duration;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable) == 0x000008, "Wrong alignment on BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable");
static_assert(sizeof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable) == 0x000018, "Wrong size on BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable, EntryPoint) == 0x000000, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable, K2Node_Event_Enable) == 0x000004, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable, K2Node_Event_Duration) == 0x000008, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable, CallFunc_Delay_Duration_ImplicitCast) == 0x000010, "Member 'BP_BoxingGlove_Default_Right_Equipable_C_ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

