#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonDropSpawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.AddSegmentsToSpline
// 0x0080 (0x0080 - 0x0000)
struct BP_BalloonDropSpawn_C_AddSegmentsToSpline final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_AddSegmentsToSpline) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_AddSegmentsToSpline");
static_assert(sizeof(BP_BalloonDropSpawn_C_AddSegmentsToSpline) == 0x000080, "Wrong size on BP_BalloonDropSpawn_C_AddSegmentsToSpline");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, Distance) == 0x000000, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::Distance' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, Temp_int_Variable) == 0x000008, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_NormalizeToRange_ReturnValue) == 0x000038, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_VLerp_ReturnValue) == 0x000058, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSegmentsToSpline, CallFunc_VLerp_Alpha_ImplicitCast) == 0x000078, "Member 'BP_BalloonDropSpawn_C_AddSegmentsToSpline::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.AddSwayToSpline
// 0x00F8 (0x00F8 - 0x0000)
struct BP_BalloonDropSpawn_C_AddSwayToSpline final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVectorAtSplinePoint_ReturnValue;  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_AddSwayToSpline) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_AddSwayToSpline");
static_assert(sizeof(BP_BalloonDropSpawn_C_AddSwayToSpline) == 0x0000F8, "Wrong size on BP_BalloonDropSpawn_C_AddSwayToSpline");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, Temp_int_Variable) == 0x000000, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000040, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000050, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000070, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000088, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_GetRightVectorAtSplinePoint_ReturnValue) == 0x000090, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_GetRightVectorAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_AddSwayToSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_BalloonDropSpawn_C_AddSwayToSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.CreateSpline
// 0x01E0 (0x01E0 - 0x0000)
struct BP_BalloonDropSpawn_C_CreateSpline final
{
public:
	bool                                          CallFunc_TraceForGround_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TraceForGround_OutHit;                    // 0x0008(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AddSegmentsToSpline_Distance_ImplicitCast; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_CreateSpline) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_CreateSpline");
static_assert(sizeof(BP_BalloonDropSpawn_C_CreateSpline) == 0x0001E0, "Wrong size on BP_BalloonDropSpawn_C_CreateSpline");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_TraceForGround_ReturnValue) == 0x000000, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_TraceForGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_TraceForGround_OutHit) == 0x000008, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_TraceForGround_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_bBlockingHit) == 0x000100, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_bInitialOverlap) == 0x000101, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_Time) == 0x000104, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_Distance) == 0x000108, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_Location) == 0x000110, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_Normal) == 0x000140, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_ImpactNormal) == 0x000158, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_PhysMat) == 0x000170, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_HitActor) == 0x000178, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_HitComponent) == 0x000180, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_HitBoneName) == 0x000188, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_BoneName) == 0x000190, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_HitItem) == 0x000198, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_ElementIndex) == 0x00019C, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_FaceIndex) == 0x0001A0, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_BreakHitResult_TraceEnd) == 0x0001C0, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_CreateSpline, CallFunc_AddSegmentsToSpline_Distance_ImplicitCast) == 0x0001D8, "Member 'BP_BalloonDropSpawn_C_CreateSpline::CallFunc_AddSegmentsToSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.ExecuteUbergraph_BP_BalloonDropSpawn
// 0x0090 (0x0090 - 0x0000)
struct BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_BoxVariantToSpawn;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_ItemInside;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropCrate_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn) == 0x000010, "Wrong alignment on BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn");
static_assert(sizeof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn) == 0x000090, "Wrong size on BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, EntryPoint) == 0x000000, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, K2Node_CustomEvent_BoxVariantToSpawn) == 0x000008, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::K2Node_CustomEvent_BoxVariantToSpawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, K2Node_CustomEvent_ItemInside) == 0x000010, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::K2Node_CustomEvent_ItemInside' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'BP_BalloonDropSpawn_C_ExecuteUbergraph_BP_BalloonDropSpawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.Server_SpawnCrate
// 0x0010 (0x0010 - 0x0000)
struct BP_BalloonDropSpawn_C_Server_SpawnCrate final
{
public:
	class UClass*                                 BoxVariantToSpawn;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemInside;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_Server_SpawnCrate) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_Server_SpawnCrate");
static_assert(sizeof(BP_BalloonDropSpawn_C_Server_SpawnCrate) == 0x000010, "Wrong size on BP_BalloonDropSpawn_C_Server_SpawnCrate");
static_assert(offsetof(BP_BalloonDropSpawn_C_Server_SpawnCrate, BoxVariantToSpawn) == 0x000000, "Member 'BP_BalloonDropSpawn_C_Server_SpawnCrate::BoxVariantToSpawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_Server_SpawnCrate, ItemInside) == 0x000008, "Member 'BP_BalloonDropSpawn_C_Server_SpawnCrate::ItemInside' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.StraightenEndPoint
// 0x0058 (0x0058 - 0x0000)
struct BP_BalloonDropSpawn_C_StraightenEndPoint final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_StraightenEndPoint) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_StraightenEndPoint");
static_assert(sizeof(BP_BalloonDropSpawn_C_StraightenEndPoint) == 0x000058, "Wrong size on BP_BalloonDropSpawn_C_StraightenEndPoint");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000008, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_StraightenEndPoint, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'BP_BalloonDropSpawn_C_StraightenEndPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropSpawn.BP_BalloonDropSpawn_C.TraceForGround
// 0x02C8 (0x02C8 - 0x0000)
struct BP_BalloonDropSpawn_C_TraceForGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             OutHit;                                            // 0x0008(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0140(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropSpawn_C_TraceForGround) == 0x000008, "Wrong alignment on BP_BalloonDropSpawn_C_TraceForGround");
static_assert(sizeof(BP_BalloonDropSpawn_C_TraceForGround) == 0x0002C8, "Wrong size on BP_BalloonDropSpawn_C_TraceForGround");
static_assert(offsetof(BP_BalloonDropSpawn_C_TraceForGround, ReturnValue) == 0x000000, "Member 'BP_BalloonDropSpawn_C_TraceForGround::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_TraceForGround, OutHit) == 0x000008, "Member 'BP_BalloonDropSpawn_C_TraceForGround::OutHit' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropSpawn_C_TraceForGround, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000100, "Member 'BP_BalloonDropSpawn_C_TraceForGround::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
