#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonDropFlare

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BalloonDropFlare.BP_BalloonDropFlare_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_BalloonDropFlare_C final : public AActor
{
public:
	class UAudioComponent*                        Audio;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FlareSound;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BalloonDropFlare_C">();
	}
	static class ABP_BalloonDropFlare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BalloonDropFlare_C>();
	}
};
static_assert(alignof(ABP_BalloonDropFlare_C) == 0x000008, "Wrong alignment on ABP_BalloonDropFlare_C");
static_assert(sizeof(ABP_BalloonDropFlare_C) == 0x0002B0, "Wrong size on ABP_BalloonDropFlare_C");
static_assert(offsetof(ABP_BalloonDropFlare_C, Audio) == 0x000290, "Member 'ABP_BalloonDropFlare_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropFlare_C, Niagara) == 0x000298, "Member 'ABP_BalloonDropFlare_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropFlare_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_BalloonDropFlare_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropFlare_C, FlareSound) == 0x0002A8, "Member 'ABP_BalloonDropFlare_C::FlareSound' has a wrong offset!");

}

