#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonCrate_Trap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonCrate_Trap.BP_BalloonCrate_Trap_C.ExecuteUbergraph_BP_BalloonCrate_Trap
// 0x0460 (0x0460 - 0x0000)
struct BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonCrateExplosion_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0180(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x1];                                      // 0x027B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0350(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap) == 0x000010, "Wrong alignment on BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap");
static_assert(sizeof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap) == 0x000460, "Wrong size on BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, EntryPoint) == 0x000000, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, Temp_object_Variable) == 0x000020, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000038, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E8, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F0, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F8, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_GetActorUpVector_ReturnValue) == 0x000110, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000138, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000150, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000180, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000278, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_bBlockingHit) == 0x000279, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_bInitialOverlap) == 0x00027A, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_Time) == 0x00027C, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_Distance) == 0x000280, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_Location) == 0x000288, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_ImpactPoint) == 0x0002A0, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_Normal) == 0x0002B8, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_ImpactNormal) == 0x0002D0, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_PhysMat) == 0x0002E8, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_HitActor) == 0x0002F0, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_HitComponent) == 0x0002F8, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_HitBoneName) == 0x000300, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_BoneName) == 0x000308, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_HitItem) == 0x000310, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_ElementIndex) == 0x000314, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_FaceIndex) == 0x000318, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_TraceStart) == 0x000320, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_BreakHitResult_TraceEnd) == 0x000338, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000350, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000448, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_Delay_Duration_ImplicitCast) == 0x00044C, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000450, "Member 'BP_BalloonCrate_Trap_C_ExecuteUbergraph_BP_BalloonCrate_Trap::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

