#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonCrateExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonCrateExplosion.BP_BalloonCrateExplosion_C.DealDamage
// 0x0358 (0x0358 - 0x0000)
struct BP_BalloonCrateExplosion_C_DealDamage final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_DeliveryTruck_C>    K2Node_DynamicCast_AsI_Delivery_Truck;             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ActorWithName_C>    K2Node_DynamicCast_AsI_Actor_with_Name;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetName_Name;                             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKillData                              K2Node_MakeStruct_KillData;                        // 0x00A0(0x00C0)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0188(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0290(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x02A0(0x0010)()
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x02D0(0x0018)()
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x02E8(0x0060)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonCrateExplosion_C_DealDamage) == 0x000008, "Wrong alignment on BP_BalloonCrateExplosion_C_DealDamage");
static_assert(sizeof(BP_BalloonCrateExplosion_C_DealDamage) == 0x000358, "Wrong size on BP_BalloonCrateExplosion_C_DealDamage");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, HitActors) == 0x000000, "Member 'BP_BalloonCrateExplosion_C_DealDamage::HitActors' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_BalloonCrateExplosion_C_DealDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, Temp_byte_Variable) == 0x000018, "Member 'BP_BalloonCrateExplosion_C_DealDamage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_AsI_Delivery_Truck) == 0x000028, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_AsI_Delivery_Truck' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_AsI_Actor_with_Name) == 0x000040, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_AsI_Actor_with_Name' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_AsTeamable_Interface) == 0x000058, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_GetName_Name) == 0x000070, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_GetName_Name' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_GetTeamID_ReturnValue) == 0x000080, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_MakeStruct_KillData) == 0x0000A0, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_MakeStruct_KillData' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_AsCharacter) == 0x000178, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_MakeHitResult_ReturnValue) == 0x000188, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_GetComponentByClass_ReturnValue) == 0x000280, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_IsValid_ReturnValue) == 0x000288, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000290, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0002A0, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_MakeVector_ReturnValue) == 0x0002B0, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0002C8, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_GetEffectContext_ReturnValue) == 0x0002D0, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, K2Node_MakeStruct_CombatParticipant) == 0x0002E8, "Member 'BP_BalloonCrateExplosion_C_DealDamage::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, Temp_int_Loop_Counter_Variable) == 0x000348, "Member 'BP_BalloonCrateExplosion_C_DealDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_Less_IntInt_ReturnValue) == 0x00034C, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DealDamage, CallFunc_Add_IntInt_ReturnValue) == 0x000350, "Member 'BP_BalloonCrateExplosion_C_DealDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BalloonCrateExplosion.BP_BalloonCrateExplosion_C.DelayedExplosion
// 0x0010 (0x0010 - 0x0000)
struct BP_BalloonCrateExplosion_C_DelayedExplosion final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_BalloonCrateExplosion_C_DelayedExplosion) == 0x000008, "Wrong alignment on BP_BalloonCrateExplosion_C_DelayedExplosion");
static_assert(sizeof(BP_BalloonCrateExplosion_C_DelayedExplosion) == 0x000010, "Wrong size on BP_BalloonCrateExplosion_C_DelayedExplosion");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DelayedExplosion, Targets) == 0x000000, "Member 'BP_BalloonCrateExplosion_C_DelayedExplosion::Targets' has a wrong offset!");

// Function BP_BalloonCrateExplosion.BP_BalloonCrateExplosion_C.DoExplode
// 0x0010 (0x0010 - 0x0000)
struct BP_BalloonCrateExplosion_C_DoExplode final
{
public:
	TArray<class AActor*>                         ActorsInLineOfSight_0;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_BalloonCrateExplosion_C_DoExplode) == 0x000008, "Wrong alignment on BP_BalloonCrateExplosion_C_DoExplode");
static_assert(sizeof(BP_BalloonCrateExplosion_C_DoExplode) == 0x000010, "Wrong size on BP_BalloonCrateExplosion_C_DoExplode");
static_assert(offsetof(BP_BalloonCrateExplosion_C_DoExplode, ActorsInLineOfSight_0) == 0x000000, "Member 'BP_BalloonCrateExplosion_C_DoExplode::ActorsInLineOfSight_0' has a wrong offset!");

// Function BP_BalloonCrateExplosion.BP_BalloonCrateExplosion_C.ExecuteUbergraph_BP_BalloonCrateExplosion
// 0x0018 (0x0018 - 0x0000)
struct BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_Targets;                        // 0x0008(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion) == 0x000008, "Wrong alignment on BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion");
static_assert(sizeof(BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion) == 0x000018, "Wrong size on BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion");
static_assert(offsetof(BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion, EntryPoint) == 0x000000, "Member 'BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion, K2Node_CustomEvent_Targets) == 0x000008, "Member 'BP_BalloonCrateExplosion_C_ExecuteUbergraph_BP_BalloonCrateExplosion::K2Node_CustomEvent_Targets' has a wrong offset!");

}

