#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BarricadeDeployable

#include "Basic.hpp"

#include "E_MaterialTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_BarricadeDeployable.BP_BarricadeDeployable_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_BarricadeDeployable.BP_BarricadeDeployable_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_BarricadeDeployable_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_BarricadeDeployable.BP_BarricadeDeployable_C.ExecuteUbergraph_BP_BarricadeDeployable
// 0x0A60 (0x0A60 - 0x0000)
struct BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x0070(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x00D0(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x03B8(0x0018)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxHealth;                            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitImpact;                      // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0448(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48B[0x5];                                      // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemCompatibleInfoWI_C*                K2Node_DynamicCast_AsItem_Compatible_Info_WI;      // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0500(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0560(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0650(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0658(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0660(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0670(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0680(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0778(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0788(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x07A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x07B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x07B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B3[0x5];                                      // 0x07B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x07B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0820(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91A[0x2];                                      // 0x091A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_924[0x4];                                      // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0928(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0940(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0958(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0970(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0988(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0990(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0998(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x09B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x09B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BC[0x4];                                      // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x09C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x09D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      K2Node_DynamicCast_AsCapsule_Collision;            // 0x09F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0A00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0A09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0A0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0B[0x5];                                      // 0x0A0B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0A10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0A20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A41[0x7];                                      // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateProgressbar_Value_ImplicitCast;     // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Max_ImplicitCast;       // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable) == 0x000010, "Wrong alignment on BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable");
static_assert(sizeof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable) == 0x000A60, "Wrong size on BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, EntryPoint) == 0x000000, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_IsDedicatedServer_ReturnValue) == 0x00001C, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000038, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_HasAuthority_ReturnValue) == 0x000039, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_AttackingActor) == 0x000040, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_AttackingActor' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Direction) == 0x000048, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Delta) == 0x000060, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Causer) == 0x000068, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_CombatParticipant) == 0x000070, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_KillMethod) == 0x0000D0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_KillMethod' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Location) == 0x0003B8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Health) == 0x0003D0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_MaxHealth) == 0x0003D4, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_MaxHealth' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0003D8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_CustomEvent_Location) == 0x0003E0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_CustomEvent_HitImpact) == 0x0003F8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_CustomEvent_HitImpact' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000410, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000428, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000430, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000448, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Array_Get_Item) == 0x000450, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Array_Get_Item_1) == 0x000468, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Array_Length_ReturnValue) == 0x000480, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Array_Length_ReturnValue_1) == 0x000484, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Less_IntInt_ReturnValue) == 0x000488, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Less_IntInt_ReturnValue_1) == 0x000489, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_HasAuthority_ReturnValue_1) == 0x00048A, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_GetUpVector_ReturnValue) == 0x000490, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0004A8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0004B0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_AsItem_Compatible_Info_WI) == 0x0004C8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_AsItem_Compatible_Info_WI' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_bSuccess) == 0x0004D0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Add_VectorVector_ReturnValue) == 0x0004D8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0004F0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_GetTransform_ReturnValue) == 0x000500, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_GetTransform_ReturnValue_1) == 0x000560, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Location) == 0x0005C0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Rotation) == 0x0005D8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Scale) == 0x0005F0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Location_1) == 0x000608, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Rotation_1) == 0x000620, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakTransform_Scale_1) == 0x000638, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000650, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000658, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000660, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000668, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000670, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000678, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_bFromSweep) == 0x00067C, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_SweepResult) == 0x000680, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000778, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherActor) == 0x000780, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherComp) == 0x000788, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000790, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_AsPawn) == 0x000798, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_bSuccess_1) == 0x0007A0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_AsPawn_1) == 0x0007A8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_bSuccess_2) == 0x0007B0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_IsLocallyControlled_ReturnValue) == 0x0007B1, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0007B2, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_MyComp) == 0x0007B8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Other) == 0x0007C0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_OtherComp) == 0x0007C8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_bSelfMoved) == 0x0007D0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_HitLocation) == 0x0007D8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_HitNormal) == 0x0007F0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_NormalImpulse) == 0x000808, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_Event_Hit) == 0x000820, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_bBlockingHit) == 0x000918, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_bInitialOverlap) == 0x000919, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_Time) == 0x00091C, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_Distance) == 0x000920, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_Location) == 0x000928, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_ImpactPoint) == 0x000940, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_Normal) == 0x000958, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_ImpactNormal) == 0x000970, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_PhysMat) == 0x000988, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_HitActor) == 0x000990, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_HitComponent) == 0x000998, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_HitBoneName) == 0x0009A0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_BoneName) == 0x0009A8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_HitItem) == 0x0009B0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_ElementIndex) == 0x0009B4, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_FaceIndex) == 0x0009B8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_TraceStart) == 0x0009C0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_BreakHitResult_TraceEnd) == 0x0009D8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_AsCapsule_Collision) == 0x0009F0, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_AsCapsule_Collision' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_bSuccess_3) == 0x0009F8, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000A00, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, K2Node_DynamicCast_bSuccess_4) == 0x000A08, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_GetTeamID_ReturnValue) == 0x000A09, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000A0A, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Get_ClassLog_Name_name) == 0x000A10, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Vector_Up_ReturnValue) == 0x000A20, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Dot_VectorVector_ReturnValue) == 0x000A38, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000A40, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_UpdateProgressbar_Value_ImplicitCast) == 0x000A48, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_UpdateProgressbar_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000A50, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable, CallFunc_UpdateProgressbar_Max_ImplicitCast) == 0x000A58, "Member 'BP_BarricadeDeployable_C_ExecuteUbergraph_BP_BarricadeDeployable::CallFunc_UpdateProgressbar_Max_ImplicitCast' has a wrong offset!");

// Function BP_BarricadeDeployable.BP_BarricadeDeployable_C.GetDurabilityCostWhenHit
// 0x0008 (0x0008 - 0x0000)
struct BP_BarricadeDeployable_C_GetDurabilityCostWhenHit final
{
public:
