#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Base_WorldEventRunner

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Base_WorldEventRunner.BP_Base_WorldEventRunner_C.HandleServersideBoughtInShop
// 0x0020 (0x0020 - 0x0000)
struct BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop final
{
public:
	class UShopInteractionAC_C*                   BuyerShopInteraction;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                BuyerCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OwningPawn;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HandleBoughtSuccess;                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop) == 0x000008, "Wrong alignment on BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop");
static_assert(sizeof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop) == 0x000020, "Wrong size on BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop");
static_assert(offsetof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop, BuyerShopInteraction) == 0x000000, "Member 'BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop::BuyerShopInteraction' has a wrong offset!");
static_assert(offsetof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop, BuyerCharacter) == 0x000008, "Member 'BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop::BuyerCharacter' has a wrong offset!");
static_assert(offsetof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop, OwningPawn) == 0x000010, "Member 'BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop::OwningPawn' has a wrong offset!");
static_assert(offsetof(BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop, HandleBoughtSuccess) == 0x000018, "Member 'BP_Base_WorldEventRunner_C_HandleServersideBoughtInShop::HandleBoughtSuccess' has a wrong offset!");

}

