#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseballBat_ProjectileOverlapVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseballBat_ProjectileOverlapVolume.BP_BaseballBat_ProjectileOverlapVolume_C.ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume
// 0x0570 (0x0570 - 0x0000)
struct BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0108(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_InstigatorPawn;                 // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileBase_C*                   K2Node_DynamicCast_AsBP_Projectile_Base;           // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_4;        // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_5;        // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x0538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume) == 0x000008, "Wrong alignment on BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume");
static_assert(sizeof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume) == 0x000570, "Wrong size on BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, EntryPoint) == 0x000000, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000020, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_GetUpVector_ReturnValue) == 0x000048, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000060, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_GetForwardVector_ReturnValue) == 0x000078, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000F0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000108, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000200, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000208, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_BreakVector_X) == 0x000220, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_BreakVector_Y) == 0x000228, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_BreakVector_Z) == 0x000230, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000238, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000240, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000248, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_Event_OtherActor) == 0x000260, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000268, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000280, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000298, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x0002B0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_bSuccess_1) == 0x0002B8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0002C0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0003B8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_GetUpVector_ReturnValue_1) == 0x0003C0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0003D8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Normal_ReturnValue) == 0x0003F0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_GetForwardVector_ReturnValue_1) == 0x000408, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_CustomEvent_InstigatorPawn) == 0x000420, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_CustomEvent_InstigatorPawn' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Normal_ReturnValue_1) == 0x000428, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x000440, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_AsBP_Projectile_Base) == 0x000458, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_AsBP_Projectile_Base' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, K2Node_DynamicCast_bSuccess_2) == 0x000460, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000468, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_GetComponentByClass_ReturnValue) == 0x000480, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000488, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_IsValid_ReturnValue) == 0x0004A0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue_4) == 0x0004A8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Conv_DoubleToVector_ReturnValue_5) == 0x0004C0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Conv_DoubleToVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0004D8, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0004F0, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000508, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000520, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Normal_ReturnValue_2) == 0x000538, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x000550, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume, CallFunc_Delay_Duration_ImplicitCast) == 0x000568, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ExecuteUbergraph_BP_BaseballBat_ProjectileOverlapVolume::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_BaseballBat_ProjectileOverlapVolume.BP_BaseballBat_ProjectileOverlapVolume_C.InitializeOverlapVolume
// 0x0008 (0x0008 - 0x0000)
struct BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume final
{
public:
	class APawn*                                  InstigatorPawn_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume) == 0x000008, "Wrong alignment on BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume");
static_assert(sizeof(BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume) == 0x000008, "Wrong size on BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume, InstigatorPawn_0) == 0x000000, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_InitializeOverlapVolume::InstigatorPawn_0' has a wrong offset!");

// Function BP_BaseballBat_ProjectileOverlapVolume.BP_BaseballBat_ProjectileOverlapVolume_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_BaseballBat_ProjectileOverlapVolume_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

