#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BenchmarkChicken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BenchmarkChicken.BP_BenchmarkChicken_C.ExecuteUbergraph_BP_BenchmarkChicken
// 0x0090 (0x0090 - 0x0000)
struct BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Abp_Egg_Projectile_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken) == 0x000010, "Wrong alignment on BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken");
static_assert(sizeof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken) == 0x000090, "Wrong size on BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, EntryPoint) == 0x000000, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'BP_BenchmarkChicken_C_ExecuteUbergraph_BP_BenchmarkChicken::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

