#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CompostBin

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CompostBin.BP_CompostBin_C.ExecuteUbergraph_BP_CompostBin
// 0x0018 (0x0018 - 0x0000)
struct BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hedge_Garbage_C*                    K2Node_DynamicCast_AsBP_Hedge_Garbage;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin) == 0x000008, "Wrong alignment on BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin");
static_assert(sizeof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin) == 0x000018, "Wrong size on BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin");
static_assert(offsetof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin, EntryPoint) == 0x000000, "Member 'BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin, K2Node_DynamicCast_AsBP_Hedge_Garbage) == 0x000008, "Member 'BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin::K2Node_DynamicCast_AsBP_Hedge_Garbage' has a wrong offset!");
static_assert(offsetof(BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CompostBin_C_ExecuteUbergraph_BP_CompostBin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

