#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_Dust_Decal

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bp_Dust_Decal.Bp_Dust_Decal_C.ExecuteUbergraph_Bp_Dust_Decal
// 0x0004 (0x0004 - 0x0000)
struct Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal) == 0x000004, "Wrong alignment on Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal");
static_assert(sizeof(Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal) == 0x000004, "Wrong size on Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal");
static_assert(offsetof(Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal, EntryPoint) == 0x000000, "Member 'Bp_Dust_Decal_C_ExecuteUbergraph_Bp_Dust_Decal::EntryPoint' has a wrong offset!");

// Function Bp_Dust_Decal.Bp_Dust_Decal_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Bp_Dust_Decal_C_UserConstructionScript final
{
public:
	class UMaterial*                              CallFunc_Array_Random_OutItem;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_Dust_Decal_C_UserConstructionScript) == 0x000008, "Wrong alignment on Bp_Dust_Decal_C_UserConstructionScript");
static_assert(sizeof(Bp_Dust_Decal_C_UserConstructionScript) == 0x000010, "Wrong size on Bp_Dust_Decal_C_UserConstructionScript");
static_assert(offsetof(Bp_Dust_Decal_C_UserConstructionScript, CallFunc_Array_Random_OutItem) == 0x000000, "Member 'Bp_Dust_Decal_C_UserConstructionScript::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Bp_Dust_Decal_C_UserConstructionScript, CallFunc_Array_Random_OutIndex) == 0x000008, "Member 'Bp_Dust_Decal_C_UserConstructionScript::CallFunc_Array_Random_OutIndex' has a wrong offset!");

}

