#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryService

#include "Basic.hpp"

#include "S_DeliveryOrder_structs.hpp"
#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ImportantNotificationReceivedMessage_structs.hpp"
#include "S_EventMessageParams_structs.hpp"


namespace SDK::Params
{

// Function BP_DeliveryService.BP_DeliveryService_C.AddTeamMembersFromPlayerWhoOrdered
// 0x0040 (0x0040 - 0x0000)
struct BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetPlayerControllerTeamMembers_PlayerControllers; // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered) == 0x000008, "Wrong alignment on BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered");
static_assert(sizeof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered) == 0x000040, "Wrong size on BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, PlayerController) == 0x000000, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_GetPlayerControllerTeamMembers_PlayerControllers) == 0x000008, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_GetPlayerControllerTeamMembers_PlayerControllers' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Array_Contains_ReturnValue) == 0x000034, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BP_DeliveryService_C_AddTeamMembersFromPlayerWhoOrdered::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.ApplyDamage
// 0x0368 (0x0368 - 0x0000)
struct BP_DeliveryService_C_ApplyDamage final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Team_BP_C>          K2Node_DynamicCast_AsI_Team_BP;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ActorWithName_C>    K2Node_DynamicCast_AsI_Actor_with_Name;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_Return;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetName_Name;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKillData                              K2Node_MakeStruct_KillData;                        // 0x0078(0x00C0)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0138(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0148(0x0010)()
	TScriptInterface<class II_DeliveryTruck_C>    K2Node_DynamicCast_AsI_Delivery_Truck;             // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0170(0x0018)()
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x0188(0x0060)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x01E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed; // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue; // 0x0344(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryService_C_ApplyDamage) == 0x000008, "Wrong alignment on BP_DeliveryService_C_ApplyDamage");
static_assert(sizeof(BP_DeliveryService_C_ApplyDamage) == 0x000368, "Wrong size on BP_DeliveryService_C_ApplyDamage");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, Target) == 0x000000, "Member 'BP_DeliveryService_C_ApplyDamage::Target' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_AsI_Team_BP) == 0x000020, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_AsI_Team_BP' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_AsI_Actor_with_Name) == 0x000038, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_AsI_Actor_with_Name' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetTeamID_Return) == 0x000049, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetTeamID_Return' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetName_Name) == 0x000050, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetName_Name' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000070, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_MakeStruct_KillData) == 0x000078, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_MakeStruct_KillData' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000138, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000148, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_AsI_Delivery_Truck) == 0x000158, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_AsI_Delivery_Truck' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetEffectContext_ReturnValue) == 0x000170, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_MakeStruct_CombatParticipant) == 0x000188, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_MakeHitResult_ReturnValue) == 0x0001E8, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0002E0, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0002F8, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000300, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000318, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, K2Node_DynamicCast_bSuccess_3) == 0x000320, "Member 'BP_DeliveryService_C_ApplyDamage::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_BreakVector_X) == 0x000328, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_BreakVector_Y) == 0x000330, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_BreakVector_Z) == 0x000338, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed) == 0x000340, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue) == 0x000344, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ApplyDamage, CallFunc_MakeVector_ReturnValue) == 0x000350, "Member 'BP_DeliveryService_C_ApplyDamage::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DeliveryService_C_BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.CreateDeliveryTimeWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_DeliveryService_C_CreateDeliveryTimeWidget final
{
public:
	class UWI_DeliveryServiceTimer_C*             Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_DeliveryServiceTimer_C*>     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_DeliveryServiceTimer_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryService_C_CreateDeliveryTimeWidget) == 0x000008, "Wrong alignment on BP_DeliveryService_C_CreateDeliveryTimeWidget");
static_assert(sizeof(BP_DeliveryService_C_CreateDeliveryTimeWidget) == 0x000028, "Wrong size on BP_DeliveryService_C_CreateDeliveryTimeWidget");
static_assert(offsetof(BP_DeliveryService_C_CreateDeliveryTimeWidget, Return) == 0x000000, "Member 'BP_DeliveryService_C_CreateDeliveryTimeWidget::Return' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_CreateDeliveryTimeWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_DeliveryService_C_CreateDeliveryTimeWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_CreateDeliveryTimeWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000009, "Member 'BP_DeliveryService_C_CreateDeliveryTimeWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_CreateDeliveryTimeWidget, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_DeliveryService_C_CreateDeliveryTimeWidget::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_CreateDeliveryTimeWidget, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_DeliveryService_C_CreateDeliveryTimeWidget::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.Drop Packages
// 0x0008 (0x0008 - 0x0000)
struct BP_DeliveryService_C_Drop_Packages final
{
public:
	class ABP_DeliveryDropZone_C*                 DeliveryDropZone;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryService_C_Drop_Packages) == 0x000008, "Wrong alignment on BP_DeliveryService_C_Drop_Packages");
static_assert(sizeof(BP_DeliveryService_C_Drop_Packages) == 0x000008, "Wrong size on BP_DeliveryService_C_Drop_Packages");
static_assert(offsetof(BP_DeliveryService_C_Drop_Packages, DeliveryDropZone) == 0x000000, "Member 'BP_DeliveryService_C_Drop_Packages::DeliveryDropZone' has a wrong offset!");

// Function BP_DeliveryService.BP_DeliveryService_C.ExecuteUbergraph_BP_DeliveryService
// 0x07B8 (0x07B8 - 0x0000)
struct BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_LocationAndRotatationAlongSpline_ReturnValue; // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Get_LocationAndRotatationAlongSpline_ReturnValue2; // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UClass*                           K2Node_CustomEvent_Actor_1;                        // 0x00C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  K2Node_CustomEvent_Team_1;                         // 0x00D0(0x0038)(ConstParm, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_OrderingPlayerController;       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DeliveryOrder                       K2Node_MakeStruct_S_DeliveryOrder;                 // 0x0110(0x0040)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeliveryDropZone_C*                 K2Node_CustomEvent_DeliveryDropZone_1;             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_FindDeliverablesToTeam_Deliverables;      // 0x0170(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_DeliveryDropZone_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0188(0x0010)(ReferenceParm)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FItemDeliveryRewardMessage             Temp_struct_Variable_1;                            // 0x01A0(0x0010)(NoDestructor)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x01B0(0x0038)(ConstParm, NoDestructor)
	class UItemTiersDefinition*                   K2Node_DynamicCast_AsItem_Tiers_Definition;        // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DeliveryOrder                       K2Node_MakeStruct_S_DeliveryOrder_1;               // 0x01F8(0x0040)(NoDestructor, HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x0238(0x0050)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x02B0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x03F0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x04F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP*                           K2Node_DynamicCast_AsGame_State_JP;                // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WarmupComponent_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_CustomEvent_Actor;                          // 0x0540(0x0010)(ConstParm, ReferenceParm)
	struct FTeam                                  K2Node_CustomEvent_Team;                           // 0x0550(0x0038)(ConstParm, NoDestructor)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DeliveryOrder                       K2Node_MakeStruct_S_DeliveryOrder_2;               // 0x0598(0x0040)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DeliveryDropZone_C*>         CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x05E0(0x0010)(ReferenceParm)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x05F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryDropZone_C*                 K2Node_CustomEvent_DeliveryDropZone;               // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDeliveryRewardMessage             Temp_struct_Variable_2;                            // 0x0618(0x0010)(NoDestructor)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0630(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryDropZone_C*                 K2Node_CustomEvent_DeliveryZone;                   // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_CustomEvent_ItemsToDeliver;                 // 0x0748(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_DeliveryDropZone_C* DeliveryDropZone)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0760(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x077C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item_2;                         // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryDropZone_C*                 CallFunc_Array_Get_Item_3;                         // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x07A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A7[0x1];                                      // 0x07A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_LocationAndRotatationAlongSpline_Alpha_ImplicitCast; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService) == 0x000008, "Wrong alignment on BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService");
static_assert(sizeof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService) == 0x0007B8, "Wrong size on BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, EntryPoint) == 0x000000, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_object_Variable) == 0x000010, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, K2Node_ClassDynamicCast_AsActor) == 0x000020, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000040, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_int_Array_Index_Variable) == 0x000054, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_HasAuthority_ReturnValue) == 0x000059, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_bool_Has_Been_Initd_Variable_1) == 0x00006C, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_DeliveryService_C_ExecuteUbergraph_BP_DeliveryService::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
