#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecoyFirecracker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.DamageActor
// 0x01B0 (0x01B0 - 0x0000)
struct BP_DecoyFirecracker_C_DamageActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0020(0x0010)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0158(0x0010)()
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0170(0x0018)()
	bool                                          CallFunc_EffectContextIsValid_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue_1;                    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_DamageActor) == 0x000008, "Wrong alignment on BP_DecoyFirecracker_C_DamageActor");
static_assert(sizeof(BP_DecoyFirecracker_C_DamageActor) == 0x0001B0, "Wrong size on BP_DecoyFirecracker_C_DamageActor");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, Actor) == 0x000000, "Member 'BP_DecoyFirecracker_C_DamageActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetPawn_ReturnValue) == 0x000010, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000018, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000020, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_MakeHitResult_ReturnValue) == 0x000058, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000158, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000168, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetEffectContext_ReturnValue) == 0x000170, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_EffectContextIsValid_ReturnValue) == 0x000188, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_EffectContextIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000189, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_BooleanAND_ReturnValue) == 0x00018A, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_BooleanAND_ReturnValue_1) == 0x00018B, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_HasAuthority_ReturnValue) == 0x00018C, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetPawn_ReturnValue_1) == 0x000190, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000198, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0001A0, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0001A8, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActor, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x0001AC, "Member 'BP_DecoyFirecracker_C_DamageActor::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.DamageActorsInDamageSphere
// 0x02B0 (0x02B0 - 0x0000)
struct BP_DecoyFirecracker_C_DamageActorsInDamageSphere final
{
public:
	TArray<class AActor*>                         L_HitActors;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Knockbackable_C>    K2Node_DynamicCast_AsI_Knockbackable;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Knockback_Void;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Hittable_C>         K2Node_DynamicCast_AsI_Hittable;                   // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ImpactCosmetics_ChangedAttributes;        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere) == 0x000008, "Wrong alignment on BP_DecoyFirecracker_C_DamageActorsInDamageSphere");
static_assert(sizeof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere) == 0x0002B0, "Wrong size on BP_DecoyFirecracker_C_DamageActorsInDamageSphere");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, L_HitActors) == 0x000000, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::L_HitActors' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000050, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_AsI_Knockbackable) == 0x000058, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_AsI_Knockbackable' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Knockback_Void) == 0x000069, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Knockback_Void' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, Temp_object_Variable) == 0x000088, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000098, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x0000A8, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A9, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001AA, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_Time) == 0x0001AC, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_Distance) == 0x0001B0, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_Location) == 0x0001B8, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D0, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_ImpactNormal) == 0x000200, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_PhysMat) == 0x000218, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_HitActor) == 0x000220, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_HitComponent) == 0x000228, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_HitBoneName) == 0x000230, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_BoneName) == 0x000238, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_TraceStart) == 0x000250, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_AsI_Hittable) == 0x000280, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_AsI_Hittable' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_bSuccess_1) == 0x000290, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Array_Add_ReturnValue) == 0x000294, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_ImpactCosmetics_ChangedAttributes) == 0x000298, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_ImpactCosmetics_ChangedAttributes' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_Array_Contains_ReturnValue) == 0x000299, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_AsCharacter) == 0x0002A0, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_DamageActorsInDamageSphere, CallFunc_DoesImplementInterface_ReturnValue) == 0x0002A9, "Member 'BP_DecoyFirecracker_C_DamageActorsInDamageSphere::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.ExecuteUbergraph_BP_DecoyFirecracker
// 0x0130 (0x0130 - 0x0000)
struct BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0070(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAttachToNearbyTarget_Return;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker) == 0x000010, "Wrong alignment on BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker");
static_assert(sizeof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker) == 0x000130, "Wrong size on BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, EntryPoint) == 0x000000, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000058, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000060, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_GetTransform_ReturnValue) == 0x000070, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_BreakTransform_Rotation) == 0x0000E8, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_RandomFloatInRange_ReturnValue) == 0x000118, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000120, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_TryAttachToNearbyTarget_Return) == 0x000128, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_TryAttachToNearbyTarget_Return' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker, CallFunc_Delay_Duration_ImplicitCast) == 0x00012C, "Member 'BP_DecoyFirecracker_C_ExecuteUbergraph_BP_DecoyFirecracker::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.GetSoundSpawnLocation
// 0x0090 (0x0090 - 0x0000)
struct BP_DecoyFirecracker_C_GetSoundSpawnLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_GetSoundSpawnLocation) == 0x000008, "Wrong alignment on BP_DecoyFirecracker_C_GetSoundSpawnLocation");
static_assert(sizeof(BP_DecoyFirecracker_C_GetSoundSpawnLocation) == 0x000090, "Wrong size on BP_DecoyFirecracker_C_GetSoundSpawnLocation");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, ReturnValue) == 0x000000, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, CallFunc_GetUpVector_ReturnValue) == 0x000048, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_GetSoundSpawnLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_DecoyFirecracker_C_GetSoundSpawnLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.HitValidTarget
// 0x0010 (0x0010 - 0x0000)
struct BP_DecoyFirecracker_C_HitValidTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_HitValidTarget) == 0x000008, "Wrong alignment on BP_DecoyFirecracker_C_HitValidTarget");
static_assert(sizeof(BP_DecoyFirecracker_C_HitValidTarget) == 0x000010, "Wrong size on BP_DecoyFirecracker_C_HitValidTarget");
static_assert(offsetof(BP_DecoyFirecracker_C_HitValidTarget, Target) == 0x000000, "Member 'BP_DecoyFirecracker_C_HitValidTarget::Target' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_HitValidTarget, ReturnValue) == 0x000008, "Member 'BP_DecoyFirecracker_C_HitValidTarget::ReturnValue' has a wrong offset!");

// Function BP_DecoyFirecracker.BP_DecoyFirecracker_C.TryAttachToNearbyTarget
// 0x0078 (0x0078 - 0x0000)
struct BP_DecoyFirecracker_C_TryAttachToNearbyTarget final
{
public:
	bool                                          Return_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecoyFirecracker_C_TryAttachToNearbyTarget) == 0x000008, "Wrong alignment on BP_DecoyFirecracker_C_TryAttachToNearbyTarget");
static_assert(sizeof(BP_DecoyFirecracker_C_TryAttachToNearbyTarget) == 0x000078, "Wrong size on BP_DecoyFirecracker_C_TryAttachToNearbyTarget");
static_assert(offsetof(BP_DecoyFirecracker_C_TryAttachToNearbyTarget, Return_0) == 0x000000, "Member 'BP_DecoyFirecracker_C_TryAttachToNearbyTarget::Return_0' has a wrong offset!");
static_assert(offsetof(BP_DecoyFirecracker_C_TryAttachToNearbyTarget, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_DecoyFirecracker_C_TryAttachToNearbyTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
