#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryService

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_DeliveryOrder_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeliveryService.BP_DeliveryService_C
// 0x0188 (0x0418 - 0x0290)
class ABP_DeliveryService_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AudioPackageDelivered;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              AbilitySystemComponentIW;                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SM_Veh_Truck_Delivery_01;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneLaunchLocation;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioTireSqueal;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HornBox;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_Indicator_C*                        AC_Indicator;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioThrowPackage;                                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioImpact;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioHorn;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioEngineLocation;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TruckLocation_Alpha_7625F909406BCED5E38A76A46AFFAB27; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TruckLocation__Direction_7625F909406BCED5E38A76A46AFFAB27; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TruckLocation;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DeliveryDropZone_C*>         DeliveryDropZones;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TArray<struct FS_DeliveryOrder>               CurrentDeliveryOrders;                             // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_DeliveryOrder>               BacklogDeliveryOrders;                             // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULevelStreamingDynamic*                 Level1;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ULevelStreamingDynamic*>         AllLevels;                                         // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OutForDelivery;                                    // 0x0360(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              PlayerControllersWhoOrdered;                       // 0x0368(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TArray<class AActor*>                         RecentlyHitActors;                                 // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           DeliveryTimer;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StartDeliveryTimeStamp;                            // 0x0390(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        DeliveryInterval;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedRunning;                                    // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_DeliveryDropZone_C*>         PassedDeliveryDropZones;                           // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         PlayRate;                                          // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioEngine;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RunOverKillFeedIcon;                               // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class ABP_Base_VehiclePathSpline_C*           TargetSpline;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Items;                                             // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIteration;                                  // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_DeliveryServiceTimer_C*             DeliveryServiceTimerWI;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoStartDeliveryTimer;                            // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeliveryDisabledByCheat;                           // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddTeamMembersFromPlayerWhoOrdered(class APlayerController* PlayerController);
	void ApplyDamage(class AActor* Target);
	void Audio_Throw_Package();
	void BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ClearOrdersAndAddBacklogged();
	void Cosmetics_Hit_Object();
	void CreateDeliveryTimeWidget(class UWI_DeliveryServiceTimer_C** Return);
	void DisableDelivery();
	void Drop_Packages(class ABP_DeliveryDropZone_C* DeliveryDropZone);
	void ExecuteUbergraph_BP_DeliveryService(int32 EntryPoint);
	void FindDeliverablesToTeam(class ABP_DeliveryDropZone_C* DeliveryDropZone, TArray<class UClass*>* Deliverables);
	struct FVector Get_LocationAndRotatationAlongSpline(double Alpha, struct FRotator* ReturnValue2);
	void GetClosestDeliveryZone(class ABP_DeliveryDropZone_C** DeliveryDropZone, bool* Valid_Drop_Found);
	void GetPlayerControllerTeamMembers(class APlayerController* PlayerController, TArray<class APlayerController*>* PlayerControllers);
	void Impact(class AActor* Actor);
	void Launch_House_Addition_Crates(class ABP_DeliveryDropZone_C* DeliveryDropZone, class UClass* Deliverables);
	void MessageOrderingPlayers();
	void Multi_Audio_Tire_Squeal();
	void Multi_Cosmetics_Throw_Package();
	void On_DeliveryTruckCollision(class ABP_DeliveryDropZone_C* DeliveryDropZone);
	void On_WarmupEnded();
	void OnEnded_0EE68EB44E88CA501C6DF893F91A65BC();
	void OnGameEnded();
	void OnLoaded_2B73AFD941A354882B2D6CA82C87B149(class UObject* Loaded);
	void OnMessageReceived_43D771CC494F470952B2D7A0CFDFB618(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnRep_OutForDelivery();
	void OnRep_PlayerControllersWhoOrdered();
	void OnRep_StartDeliveryTimeStamp();
	void ReceiveBeginPlay();
	void Reset_Do_Once_Array_Delivery();
	void SendDeliveryEventToLog(const class FText& ItemName, uint8 TeamId);
	void Server_Add_Array_Delivery_Order(const TArray<class UClass*>& Actor, const struct FTeam& Team);
	void Server_Add_Delivery_Order(const class UClass*& Actor, const struct FTeam& Team, class APlayerController* OrderingPlayerController);
	void Server_DropPackages(class ABP_DeliveryDropZone_C* DeliveryZone, const TArray<class UClass*>& ItemsToDeliver);
	void Server_Start_Delivery();
	void SetDeadly(bool Deadly);
	void StopDelivery();
	void TruckLocation__FinishedFunc();
	void TruckLocation__TireSqueal__EventFunc();
	void TruckLocation__UpdateFunc();
	void UpdateDeliveryTimeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeliveryService_C">();
	}
	static class ABP_DeliveryService_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeliveryService_C>();
	}
};
static_assert(alignof(ABP_DeliveryService_C) == 0x000008, "Wrong alignment on ABP_DeliveryService_C");
static_assert(sizeof(ABP_DeliveryService_C) == 0x000418, "Wrong size on ABP_DeliveryService_C");
static_assert(offsetof(ABP_DeliveryService_C, UberGraphFrame) == 0x000290, "Member 'ABP_DeliveryService_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioPackageDelivered) == 0x000298, "Member 'ABP_DeliveryService_C::AudioPackageDelivered' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AbilitySystemComponentIW) == 0x0002A0, "Member 'ABP_DeliveryService_C::AbilitySystemComponentIW' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, SkeletalMesh) == 0x0002A8, "Member 'ABP_DeliveryService_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, SM_Veh_Truck_Delivery_01) == 0x0002B0, "Member 'ABP_DeliveryService_C::SM_Veh_Truck_Delivery_01' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, Scene) == 0x0002B8, "Member 'ABP_DeliveryService_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, SceneLaunchLocation) == 0x0002C0, "Member 'ABP_DeliveryService_C::SceneLaunchLocation' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioTireSqueal) == 0x0002C8, "Member 'ABP_DeliveryService_C::AudioTireSqueal' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, HornBox) == 0x0002D0, "Member 'ABP_DeliveryService_C::HornBox' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AC_Indicator) == 0x0002D8, "Member 'ABP_DeliveryService_C::AC_Indicator' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioThrowPackage) == 0x0002E0, "Member 'ABP_DeliveryService_C::AudioThrowPackage' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioImpact) == 0x0002E8, "Member 'ABP_DeliveryService_C::AudioImpact' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioHorn) == 0x0002F0, "Member 'ABP_DeliveryService_C::AudioHorn' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioEngineLocation) == 0x0002F8, "Member 'ABP_DeliveryService_C::AudioEngineLocation' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DefaultSceneRoot) == 0x000300, "Member 'ABP_DeliveryService_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, TruckLocation_Alpha_7625F909406BCED5E38A76A46AFFAB27) == 0x000308, "Member 'ABP_DeliveryService_C::TruckLocation_Alpha_7625F909406BCED5E38A76A46AFFAB27' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, TruckLocation__Direction_7625F909406BCED5E38A76A46AFFAB27) == 0x00030C, "Member 'ABP_DeliveryService_C::TruckLocation__Direction_7625F909406BCED5E38A76A46AFFAB27' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, TruckLocation) == 0x000310, "Member 'ABP_DeliveryService_C::TruckLocation' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DeliveryDropZones) == 0x000318, "Member 'ABP_DeliveryService_C::DeliveryDropZones' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, CurrentDeliveryOrders) == 0x000328, "Member 'ABP_DeliveryService_C::CurrentDeliveryOrders' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, BacklogDeliveryOrders) == 0x000338, "Member 'ABP_DeliveryService_C::BacklogDeliveryOrders' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, Level1) == 0x000348, "Member 'ABP_DeliveryService_C::Level1' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AllLevels) == 0x000350, "Member 'ABP_DeliveryService_C::AllLevels' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, OutForDelivery) == 0x000360, "Member 'ABP_DeliveryService_C::OutForDelivery' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, PlayerControllersWhoOrdered) == 0x000368, "Member 'ABP_DeliveryService_C::PlayerControllersWhoOrdered' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, RecentlyHitActors) == 0x000378, "Member 'ABP_DeliveryService_C::RecentlyHitActors' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DeliveryTimer) == 0x000388, "Member 'ABP_DeliveryService_C::DeliveryTimer' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, StartDeliveryTimeStamp) == 0x000390, "Member 'ABP_DeliveryService_C::StartDeliveryTimeStamp' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DeliveryInterval) == 0x000398, "Member 'ABP_DeliveryService_C::DeliveryInterval' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, StartedRunning) == 0x0003A0, "Member 'ABP_DeliveryService_C::StartedRunning' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, PassedDeliveryDropZones) == 0x0003A8, "Member 'ABP_DeliveryService_C::PassedDeliveryDropZones' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, PlayRate) == 0x0003B8, "Member 'ABP_DeliveryService_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AudioEngine) == 0x0003C0, "Member 'ABP_DeliveryService_C::AudioEngine' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, Async_Action) == 0x0003C8, "Member 'ABP_DeliveryService_C::Async_Action' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, RunOverKillFeedIcon) == 0x0003D0, "Member 'ABP_DeliveryService_C::RunOverKillFeedIcon' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, TargetSpline) == 0x0003F8, "Member 'ABP_DeliveryService_C::TargetSpline' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, Items) == 0x000400, "Member 'ABP_DeliveryService_C::Items' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, CurrentIteration) == 0x000404, "Member 'ABP_DeliveryService_C::CurrentIteration' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DeliveryServiceTimerWI) == 0x000408, "Member 'ABP_DeliveryService_C::DeliveryServiceTimerWI' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, AutoStartDeliveryTimer) == 0x000410, "Member 'ABP_DeliveryService_C::AutoStartDeliveryTimer' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryService_C, DeliveryDisabledByCheat) == 0x000411, "Member 'ABP_DeliveryService_C::DeliveryDisabledByCheat' has a wrong offset!");

}

