#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DriveByMortarShell

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DriveByMortarShell.BP_DriveByMortarShell_C.ExecuteUbergraph_BP_DriveByMortarShell
// 0x0190 (0x0190 - 0x0000)
struct BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegreesFromStream_ReturnValue; // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x017C(0x0008)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SpawnBomblette_Speed_ImplicitCast;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell) == 0x000010, "Wrong alignment on BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell");
static_assert(sizeof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell) == 0x000190, "Wrong size on BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, EntryPoint) == 0x000000, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000020, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, Temp_int_Variable) == 0x000028, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, Temp_int_Variable_1) == 0x00002C, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000078, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000080, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_RandomUnitVectorInConeInDegreesFromStream_ReturnValue) == 0x0000A0, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_RandomUnitVectorInConeInDegreesFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000B8, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000D8, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000F0, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000160, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_GetGameState_ReturnValue) == 0x000168, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000170, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_Round_ReturnValue) == 0x000178, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_MakeRandomStream_ReturnValue) == 0x00017C, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell, CallFunc_SpawnBomblette_Speed_ImplicitCast) == 0x000188, "Member 'BP_DriveByMortarShell_C_ExecuteUbergraph_BP_DriveByMortarShell::CallFunc_SpawnBomblette_Speed_ImplicitCast' has a wrong offset!");

// Function BP_DriveByMortarShell.BP_DriveByMortarShell_C.HandleProjectileStop
// 0x0280 (0x0280 - 0x0000)
struct BP_DriveByMortarShell_C_HandleProjectileStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Explosion_Seagull_Large_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByMortarShell_C_HandleProjectileStop) == 0x000010, "Wrong alignment on BP_DriveByMortarShell_C_HandleProjectileStop");
static_assert(sizeof(BP_DriveByMortarShell_C_HandleProjectileStop) == 0x000280, "Wrong size on BP_DriveByMortarShell_C_HandleProjectileStop");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, Hit) == 0x000000, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::Hit' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_HasAuthority_ReturnValue) == 0x0000F8, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F9, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000FA, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_Time) == 0x0000FC, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_Distance) == 0x000100, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_Location) == 0x000108, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_ImpactPoint) == 0x000120, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_Normal) == 0x000138, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_ImpactNormal) == 0x000150, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_PhysMat) == 0x000168, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_HitActor) == 0x000170, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_HitComponent) == 0x000178, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_HitBoneName) == 0x000180, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_BoneName) == 0x000188, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_HitItem) == 0x000190, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_ElementIndex) == 0x000194, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_FaceIndex) == 0x000198, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_TraceStart) == 0x0001A0, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BreakHitResult_TraceEnd) == 0x0001B8, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_Add_VectorVector_ReturnValue) == 0x000230, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000248, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000250, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_FinishSpawningActor_ReturnValue) == 0x000258, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_HandleProjectileStop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000260, "Member 'BP_DriveByMortarShell_C_HandleProjectileStop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_DriveByMortarShell.BP_DriveByMortarShell_C.SpawnBomblette
// 0x00F0 (0x00F0 - 0x0000)
struct BP_DriveByMortarShell_C_SpawnBomblette final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gravity;                                           // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectPoolingSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APooledActor*                           CallFunc_GetInactiveObjectOfClass_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DriveByBomblette_C*                 K2Node_DynamicCast_AsBP_Drive_by_Bomblette;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByMortarShell_C_SpawnBomblette) == 0x000010, "Wrong alignment on BP_DriveByMortarShell_C_SpawnBomblette");
static_assert(sizeof(BP_DriveByMortarShell_C_SpawnBomblette) == 0x0000F0, "Wrong size on BP_DriveByMortarShell_C_SpawnBomblette");
static_assert(offsetof(BP_DriveByMortarShell_C_SpawnBomblette, Transform) == 0x000000, "Member 'BP_DriveByMortarShell_C_SpawnBomblette::Transform' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_SpawnBomblette, Speed) == 0x000060, "Member 'BP_DriveByMortarShell_C_SpawnBomblette::Speed' has a wrong offset!");
static_assert(offsetof(BP_DriveByMortarShell_C_SpawnBomblette, Gravity) == 0x000068, "Member 'BP_DriveByMortarShell_C_SpawnBomblette::Gravity' has a wrong offset!");
