#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DriveByBomblette

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DriveByBomblette.BP_DriveByBomblette_C
// 0x0020 (0x0548 - 0x0528)
class ABP_DriveByBomblette_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DriveByBomblette_C;              // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x0538(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OwningPlayerState;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DriveByBomblette(int32 EntryPoint);
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DriveByBomblette_C">();
	}
	static class ABP_DriveByBomblette_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DriveByBomblette_C>();
	}
};
static_assert(alignof(ABP_DriveByBomblette_C) == 0x000008, "Wrong alignment on ABP_DriveByBomblette_C");
static_assert(sizeof(ABP_DriveByBomblette_C) == 0x000548, "Wrong size on ABP_DriveByBomblette_C");
static_assert(offsetof(ABP_DriveByBomblette_C, UberGraphFrame_BP_DriveByBomblette_C) == 0x000528, "Member 'ABP_DriveByBomblette_C::UberGraphFrame_BP_DriveByBomblette_C' has a wrong offset!");
static_assert(offsetof(ABP_DriveByBomblette_C, RotatingMovement) == 0x000530, "Member 'ABP_DriveByBomblette_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_DriveByBomblette_C, Team) == 0x000538, "Member 'ABP_DriveByBomblette_C::Team' has a wrong offset!");
static_assert(offsetof(ABP_DriveByBomblette_C, OwningPlayerState) == 0x000540, "Member 'ABP_DriveByBomblette_C::OwningPlayerState' has a wrong offset!");

}

