#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_DirtDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HouseDecalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_DirtDecal.Bp_DirtDecal_C
// 0x0028 (0x0368 - 0x0340)
class ABp_DirtDecal_C final : public ABP_HouseDecalBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Bp_DirtDecal_C;                     // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Particle_System;                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterial*>                      Decals;                                            // 0x0350(0x0010)(Edit, BlueprintVisible)
	int32                                         SelectedDecal;                                     // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_DirtDecal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_DirtDecal_C">();
	}
	static class ABp_DirtDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_DirtDecal_C>();
	}
};
static_assert(alignof(ABp_DirtDecal_C) == 0x000008, "Wrong alignment on ABp_DirtDecal_C");
static_assert(sizeof(ABp_DirtDecal_C) == 0x000368, "Wrong size on ABp_DirtDecal_C");
static_assert(offsetof(ABp_DirtDecal_C, UberGraphFrame_Bp_DirtDecal_C) == 0x000340, "Member 'ABp_DirtDecal_C::UberGraphFrame_Bp_DirtDecal_C' has a wrong offset!");
static_assert(offsetof(ABp_DirtDecal_C, Niagara_Particle_System) == 0x000348, "Member 'ABp_DirtDecal_C::Niagara_Particle_System' has a wrong offset!");
static_assert(offsetof(ABp_DirtDecal_C, Decals) == 0x000350, "Member 'ABp_DirtDecal_C::Decals' has a wrong offset!");
static_assert(offsetof(ABp_DirtDecal_C, SelectedDecal) == 0x000360, "Member 'ABp_DirtDecal_C::SelectedDecal' has a wrong offset!");

}

