#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructionObjective

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructionObjective.BP_DestructionObjective_C.ExecuteUbergraph_BP_DestructionObjective
// 0x0030 (0x0030 - 0x0000)
struct BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SpawnTasks_ReturnValue;                   // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective) == 0x000008, "Wrong alignment on BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective");
static_assert(sizeof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective) == 0x000030, "Wrong size on BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, EntryPoint) == 0x000000, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, CallFunc_SpawnTasks_ReturnValue) == 0x000008, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::CallFunc_SpawnTasks_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'BP_DestructionObjective_C_ExecuteUbergraph_BP_DestructionObjective::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_DestructionObjective.BP_DestructionObjective_C.GetState
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructionObjective_C_GetState final
{
public:
	EObjectiveState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructionObjective_C_GetState) == 0x000001, "Wrong alignment on BP_DestructionObjective_C_GetState");
static_assert(sizeof(BP_DestructionObjective_C_GetState) == 0x000001, "Wrong size on BP_DestructionObjective_C_GetState");
static_assert(offsetof(BP_DestructionObjective_C_GetState, ReturnValue) == 0x000000, "Member 'BP_DestructionObjective_C_GetState::ReturnValue' has a wrong offset!");

}

