#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_Dust_Decal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HouseDecalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_Dust_Decal.Bp_Dust_Decal_C
// 0x0020 (0x0360 - 0x0340)
class ABp_Dust_Decal_C final : public ABP_HouseDecalBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Bp_Dust_Decal_C;                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Particle_System;                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterial*>                      Decals;                                            // 0x0350(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Bp_Dust_Decal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_Dust_Decal_C">();
	}
	static class ABp_Dust_Decal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_Dust_Decal_C>();
	}
};
static_assert(alignof(ABp_Dust_Decal_C) == 0x000008, "Wrong alignment on ABp_Dust_Decal_C");
static_assert(sizeof(ABp_Dust_Decal_C) == 0x000360, "Wrong size on ABp_Dust_Decal_C");
static_assert(offsetof(ABp_Dust_Decal_C, UberGraphFrame_Bp_Dust_Decal_C) == 0x000340, "Member 'ABp_Dust_Decal_C::UberGraphFrame_Bp_Dust_Decal_C' has a wrong offset!");
static_assert(offsetof(ABp_Dust_Decal_C, Niagara_Particle_System) == 0x000348, "Member 'ABp_Dust_Decal_C::Niagara_Particle_System' has a wrong offset!");
static_assert(offsetof(ABp_Dust_Decal_C, Decals) == 0x000350, "Member 'ABp_Dust_Decal_C::Decals' has a wrong offset!");

}

