#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DriveByMortarShell

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DriveByMortarShell.BP_DriveByMortarShell_C
// 0x0050 (0x0578 - 0x0528)
class ABP_DriveByMortarShell_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DriveByMortarShell_C;            // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Radius;                                            // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Stream;                                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	int32                                         ClusterAmount;                                     // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotator>                       FireDirections;                                    // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerState*                           OwningPlayerState;                                 // 0x0568(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SpawnCount;                                        // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Detonate_Mortar();
	void ExecuteUbergraph_BP_DriveByMortarShell(int32 EntryPoint);
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();
	void Spawn_Projectile();
	void SpawnBomblette(const struct FTransform& Transform, double Speed, double Gravity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DriveByMortarShell_C">();
	}
	static class ABP_DriveByMortarShell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DriveByMortarShell_C>();
	}
};
static_assert(alignof(ABP_DriveByMortarShell_C) == 0x000008, "Wrong alignment on ABP_DriveByMortarShell_C");
static_assert(sizeof(ABP_DriveByMortarShell_C) == 0x000578, "Wrong size on ABP_DriveByMortarShell_C");
static_assert(offsetof(ABP_DriveByMortarShell_C, UberGraphFrame_BP_DriveByMortarShell_C) == 0x000528, "Member 'ABP_DriveByMortarShell_C::UberGraphFrame_BP_DriveByMortarShell_C' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, RotatingMovement) == 0x000530, "Member 'ABP_DriveByMortarShell_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, Team) == 0x000538, "Member 'ABP_DriveByMortarShell_C::Team' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, Radius) == 0x000540, "Member 'ABP_DriveByMortarShell_C::Radius' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, Stream) == 0x000548, "Member 'ABP_DriveByMortarShell_C::Stream' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, ClusterAmount) == 0x000550, "Member 'ABP_DriveByMortarShell_C::ClusterAmount' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, FireDirections) == 0x000558, "Member 'ABP_DriveByMortarShell_C::FireDirections' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, OwningPlayerState) == 0x000568, "Member 'ABP_DriveByMortarShell_C::OwningPlayerState' has a wrong offset!");
static_assert(offsetof(ABP_DriveByMortarShell_C, SpawnCount) == 0x000570, "Member 'ABP_DriveByMortarShell_C::SpawnCount' has a wrong offset!");

}

