#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorBell

#include "Basic.hpp"

#include "InteractableBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DoorBell.BP_DoorBell_C
// 0x0030 (0x0310 - 0x02E0)
class ABP_DoorBell_C final : public AInteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DoorBell_C;                      // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BoxInteraction;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Press;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Bell;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMeshBounceComponent_C*                 MeshBounceComponent;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void CheckAchievement(class UObject* InteractingActor_0);
	void ExecuteUbergraph_BP_DoorBell(int32 EntryPoint);
	void GetWidgetLocation(struct FVector* Location);
	void Multi_Ring(class AActor* InteractingActor_0);
	void PostInteract(class AActor* InteractingActor_0, class UPrimitiveComponent* InteractionComponent);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DoorBell_C">();
	}
	static class ABP_DoorBell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DoorBell_C>();
	}
};
static_assert(alignof(ABP_DoorBell_C) == 0x000008, "Wrong alignment on ABP_DoorBell_C");
static_assert(sizeof(ABP_DoorBell_C) == 0x000310, "Wrong size on ABP_DoorBell_C");
static_assert(offsetof(ABP_DoorBell_C, UberGraphFrame_BP_DoorBell_C) == 0x0002E0, "Member 'ABP_DoorBell_C::UberGraphFrame_BP_DoorBell_C' has a wrong offset!");
static_assert(offsetof(ABP_DoorBell_C, BoxInteraction) == 0x0002E8, "Member 'ABP_DoorBell_C::BoxInteraction' has a wrong offset!");
static_assert(offsetof(ABP_DoorBell_C, Audio_Press) == 0x0002F0, "Member 'ABP_DoorBell_C::Audio_Press' has a wrong offset!");
static_assert(offsetof(ABP_DoorBell_C, Audio_Bell) == 0x0002F8, "Member 'ABP_DoorBell_C::Audio_Bell' has a wrong offset!");
static_assert(offsetof(ABP_DoorBell_C, MeshBounceComponent) == 0x000300, "Member 'ABP_DoorBell_C::MeshBounceComponent' has a wrong offset!");
static_assert(offsetof(ABP_DoorBell_C, StaticMesh) == 0x000308, "Member 'ABP_DoorBell_C::StaticMesh' has a wrong offset!");

}

