#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_GardenGate_Small_Level2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C
// 0x0050 (0x0568 - 0x0518)
class ABP_Door_GardenGate_Small_Level2_C : public ADoorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Door_GardenGate_Small_Level2_C;  // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Sign;                                           // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Sign1;                                          // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractCollider;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_WaveAmplitude_A605902C46F54D359E51BC999B9BEA34; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_A605902C46F54D359E51BC999B9BEA34; // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Door_Type;                                         // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Cosmetics_State_Sabotaged();
	void ExecuteUbergraph_BP_Door_GardenGate_Small_Level2(int32 EntryPoint);
	void GetLockPickDuration(int32* Return);
	void GetOptionalText(class FText* Return, class FText* Optional_Second_Line);
	void GetPriority(int32* Priority);
	void IsClosed(bool* Open_0);
	void IsNotLockpickable(bool* IsNotLockpickable_0);
	void LockpickBegin(class APlayerController* PickerController);
	void LockpickSuccess(class APlayerController* PickerController);
	void ReceiveBeginPlay();
	void Sabotage(class AActor* SabotagingActor);
	void SetMaterialBasedOnLevel();
	void SpawnDestroyedDoor();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Update_Alpha(double Alpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Door_GardenGate_Small_Level2_C">();
	}
	static class ABP_Door_GardenGate_Small_Level2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_GardenGate_Small_Level2_C>();
	}
};
static_assert(alignof(ABP_Door_GardenGate_Small_Level2_C) == 0x000008, "Wrong alignment on ABP_Door_GardenGate_Small_Level2_C");
static_assert(sizeof(ABP_Door_GardenGate_Small_Level2_C) == 0x000568, "Wrong size on ABP_Door_GardenGate_Small_Level2_C");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, UberGraphFrame_BP_Door_GardenGate_Small_Level2_C) == 0x000518, "Member 'ABP_Door_GardenGate_Small_Level2_C::UberGraphFrame_BP_Door_GardenGate_Small_Level2_C' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, SM_Sign) == 0x000520, "Member 'ABP_Door_GardenGate_Small_Level2_C::SM_Sign' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, SM_Sign1) == 0x000528, "Member 'ABP_Door_GardenGate_Small_Level2_C::SM_Sign1' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, InteractCollider) == 0x000530, "Member 'ABP_Door_GardenGate_Small_Level2_C::InteractCollider' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Door) == 0x000538, "Member 'ABP_Door_GardenGate_Small_Level2_C::Door' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Timeline_WaveAmplitude_A605902C46F54D359E51BC999B9BEA34) == 0x000540, "Member 'ABP_Door_GardenGate_Small_Level2_C::Timeline_WaveAmplitude_A605902C46F54D359E51BC999B9BEA34' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Timeline__Direction_A605902C46F54D359E51BC999B9BEA34) == 0x000544, "Member 'ABP_Door_GardenGate_Small_Level2_C::Timeline__Direction_A605902C46F54D359E51BC999B9BEA34' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Timeline) == 0x000548, "Member 'ABP_Door_GardenGate_Small_Level2_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Door_Type) == 0x000550, "Member 'ABP_Door_GardenGate_Small_Level2_C::Door_Type' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, Material) == 0x000558, "Member 'ABP_Door_GardenGate_Small_Level2_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_Small_Level2_C, DynamicMaterialInstance) == 0x000560, "Member 'ABP_Door_GardenGate_Small_Level2_C::DynamicMaterialInstance' has a wrong offset!");

}

