#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DriveByManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DriveByManager.BP_DriveByManager_C.ExecuteUbergraph_BP_DriveByManager
// 0x0170 (0x0170 - 0x0000)
struct BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_TeamIdThatOrdered;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_TeamIdToAttack;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_OrderingPlayerState;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_GetSplineComponent_Spline;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           CallFunc_GetSplinePointAt_ReturnValue;             // 0x0018(0x0088)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DriveByVan_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DriveByVan_C*                       K2Node_CustomEvent_DriveByVan;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_DriveByVan_C* DriveByVan)> K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	TArray<float>                                 K2Node_Select_Default;                             // 0x0158(0x0010)(ReferenceParm)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager) == 0x000010, "Wrong alignment on BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager");
static_assert(sizeof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager) == 0x000170, "Wrong size on BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, EntryPoint) == 0x000000, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, Temp_byte_Variable) == 0x000004, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_CustomEvent_TeamIdThatOrdered) == 0x000005, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_CustomEvent_TeamIdThatOrdered' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_CustomEvent_TeamIdToAttack) == 0x000006, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_CustomEvent_TeamIdToAttack' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_CustomEvent_OrderingPlayerState) == 0x000008, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_CustomEvent_OrderingPlayerState' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_GetSplineComponent_Spline) == 0x000010, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_GetSplineComponent_Spline' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_GetSplinePointAt_ReturnValue) == 0x000018, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_GetSplinePointAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_Array_AddUnique_ReturnValue) == 0x000120, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_CustomEvent_DriveByVan) == 0x000128, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_CustomEvent_DriveByVan' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_IsValidClass_ReturnValue) == 0x000130, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_Array_RemoveItem_ReturnValue) == 0x000144, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, K2Node_Select_Default) == 0x000158, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000168, "Member 'BP_DriveByManager_C_ExecuteUbergraph_BP_DriveByManager::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

// Function BP_DriveByManager.BP_DriveByManager_C.HandleDrivingCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_DriveByManager_C_HandleDrivingCompleted final
{
public:
	class ABP_DriveByVan_C*                       DriveByVan;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByManager_C_HandleDrivingCompleted) == 0x000008, "Wrong alignment on BP_DriveByManager_C_HandleDrivingCompleted");
static_assert(sizeof(BP_DriveByManager_C_HandleDrivingCompleted) == 0x000008, "Wrong size on BP_DriveByManager_C_HandleDrivingCompleted");
static_assert(offsetof(BP_DriveByManager_C_HandleDrivingCompleted, DriveByVan) == 0x000000, "Member 'BP_DriveByManager_C_HandleDrivingCompleted::DriveByVan' has a wrong offset!");

// Function BP_DriveByManager.BP_DriveByManager_C.StartDriveBy
// 0x0010 (0x0010 - 0x0000)
struct BP_DriveByManager_C_StartDriveBy final
{
public:
	uint8                                         TeamIdThatOrdered;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamIdToAttack;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OrderingPlayerState;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DriveByManager_C_StartDriveBy) == 0x000008, "Wrong alignment on BP_DriveByManager_C_StartDriveBy");
static_assert(sizeof(BP_DriveByManager_C_StartDriveBy) == 0x000010, "Wrong size on BP_DriveByManager_C_StartDriveBy");
static_assert(offsetof(BP_DriveByManager_C_StartDriveBy, TeamIdThatOrdered) == 0x000000, "Member 'BP_DriveByManager_C_StartDriveBy::TeamIdThatOrdered' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_StartDriveBy, TeamIdToAttack) == 0x000001, "Member 'BP_DriveByManager_C_StartDriveBy::TeamIdToAttack' has a wrong offset!");
static_assert(offsetof(BP_DriveByManager_C_StartDriveBy, OrderingPlayerState) == 0x000008, "Member 'BP_DriveByManager_C_StartDriveBy::OrderingPlayerState' has a wrong offset!");

}

