#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EndOfGameCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EndOfGameCamera.BP_EndOfGameCamera_C.AssignTeamsToBases
// 0x0150 (0x0150 - 0x0000)
struct BP_EndOfGameCamera_C_AssignTeamsToBases final
{
public:
	uint8                                         WinningTeamID;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 RemainingTeams;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item_1;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfGameCamera_C_AssignTeamsToBases) == 0x000010, "Wrong alignment on BP_EndOfGameCamera_C_AssignTeamsToBases");
static_assert(sizeof(BP_EndOfGameCamera_C_AssignTeamsToBases) == 0x000150, "Wrong size on BP_EndOfGameCamera_C_AssignTeamsToBases");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, WinningTeamID) == 0x000000, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::WinningTeamID' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, RemainingTeams) == 0x000008, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::RemainingTeams' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, Temp_bool_IsClosed_Variable) == 0x000019, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_Array_Get_Item) == 0x00001A, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_Array_Get_Item_1) == 0x00001B, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001C, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000090, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_AssignTeamsToBases, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0000F0, "Member 'BP_EndOfGameCamera_C_AssignTeamsToBases::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");

// Function BP_EndOfGameCamera.BP_EndOfGameCamera_C.GetSpawnTransformFromTeam
// 0x00F0 (0x00F0 - 0x0000)
struct BP_EndOfGameCamera_C_GetSpawnTransformFromTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundTransform;                                    // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam) == 0x000010, "Wrong alignment on BP_EndOfGameCamera_C_GetSpawnTransformFromTeam");
static_assert(sizeof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam) == 0x0000F0, "Wrong size on BP_EndOfGameCamera_C_GetSpawnTransformFromTeam");
static_assert(offsetof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam, TeamId) == 0x000000, "Member 'BP_EndOfGameCamera_C_GetSpawnTransformFromTeam::TeamId' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam, Transform) == 0x000010, "Member 'BP_EndOfGameCamera_C_GetSpawnTransformFromTeam::Transform' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam, FoundTransform) == 0x000070, "Member 'BP_EndOfGameCamera_C_GetSpawnTransformFromTeam::FoundTransform' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam, CallFunc_Map_Find_Value) == 0x000080, "Member 'BP_EndOfGameCamera_C_GetSpawnTransformFromTeam::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_GetSpawnTransformFromTeam, CallFunc_Map_Find_ReturnValue) == 0x0000E0, "Member 'BP_EndOfGameCamera_C_GetSpawnTransformFromTeam::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_EndOfGameCamera.BP_EndOfGameCamera_C.InitLeftTeamBase
// 0x02B8 (0x02B8 - 0x0000)
struct BP_EndOfGameCamera_C_InitLeftTeamBase final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfGameCamera_C_InitLeftTeamBase) == 0x000008, "Wrong alignment on BP_EndOfGameCamera_C_InitLeftTeamBase");
static_assert(sizeof(BP_EndOfGameCamera_C_InitLeftTeamBase) == 0x0002B8, "Wrong size on BP_EndOfGameCamera_C_InitLeftTeamBase");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_GetRightVector_ReturnValue) == 0x000048, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000078, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A8, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000C0, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001B8, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitLeftTeamBase, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0002B0, "Member 'BP_EndOfGameCamera_C_InitLeftTeamBase::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_EndOfGameCamera.BP_EndOfGameCamera_C.InitRightTeamBase
// 0x02E8 (0x02E8 - 0x0000)
struct BP_EndOfGameCamera_C_InitRightTeamBase final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0060(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfGameCamera_C_InitRightTeamBase) == 0x000008, "Wrong alignment on BP_EndOfGameCamera_C_InitRightTeamBase");
static_assert(sizeof(BP_EndOfGameCamera_C_InitRightTeamBase) == 0x0002E8, "Wrong size on BP_EndOfGameCamera_C_InitRightTeamBase");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x000048, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000060, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000158, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_GetRightVector_ReturnValue) == 0x000170, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000188, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001A0, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001B8, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D0, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001E8, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitRightTeamBase, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0002E0, "Member 'BP_EndOfGameCamera_C_InitRightTeamBase::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_EndOfGameCamera.BP_EndOfGameCamera_C.InitWinningTeamBase
// 0x0190 (0x0190 - 0x0000)
struct BP_EndOfGameCamera_C_InitWinningTeamBase final
{
public:
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0090(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfGameCamera_C_InitWinningTeamBase) == 0x000008, "Wrong alignment on BP_EndOfGameCamera_C_InitWinningTeamBase");
static_assert(sizeof(BP_EndOfGameCamera_C_InitWinningTeamBase) == 0x000190, "Wrong size on BP_EndOfGameCamera_C_InitWinningTeamBase");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000000, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000048, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x000078, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000090, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EndOfGameCamera_C_InitWinningTeamBase, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000188, "Member 'BP_EndOfGameCamera_C_InitWinningTeamBase::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

}

