#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FenceEndLvl2

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FenceEndLvl2.BP_FenceEndLvl2_C.ExecuteUbergraph_BP_FenceEndLvl2
// 0x0030 (0x0030 - 0x0000)
struct BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2) == 0x000008, "Wrong alignment on BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2");
static_assert(sizeof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2) == 0x000030, "Wrong size on BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, EntryPoint) == 0x000000, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'BP_FenceEndLvl2_C_ExecuteUbergraph_BP_FenceEndLvl2::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_FenceEndLvl2.BP_FenceEndLvl2_C.SetMaterialBasedOnLevel
// 0x0018 (0x0018 - 0x0000)
struct BP_FenceEndLvl2_C_SetMaterialBasedOnLevel final
{
public:
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceEndLvl2_C_SetMaterialBasedOnLevel) == 0x000008, "Wrong alignment on BP_FenceEndLvl2_C_SetMaterialBasedOnLevel");
static_assert(sizeof(BP_FenceEndLvl2_C_SetMaterialBasedOnLevel) == 0x000018, "Wrong size on BP_FenceEndLvl2_C_SetMaterialBasedOnLevel");
static_assert(offsetof(BP_FenceEndLvl2_C_SetMaterialBasedOnLevel, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000000, "Member 'BP_FenceEndLvl2_C_SetMaterialBasedOnLevel::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceEndLvl2_C_SetMaterialBasedOnLevel, K2Node_SwitchString_CmpSuccess) == 0x000010, "Member 'BP_FenceEndLvl2_C_SetMaterialBasedOnLevel::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

}

