#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FenceShortLvl2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FenceShortLvl2.BP_FenceShortLvl2_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_FenceShortLvl2_C : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_WaveAmplitude_A5277293416602D253DBBF8739129656; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_A5277293416602D253DBBF8739129656; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FenceShortLvl2(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetMaterialBasedOnLevel();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FenceShortLvl2_C">();
	}
	static class ABP_FenceShortLvl2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FenceShortLvl2_C>();
	}
};
static_assert(alignof(ABP_FenceShortLvl2_C) == 0x000008, "Wrong alignment on ABP_FenceShortLvl2_C");
static_assert(sizeof(ABP_FenceShortLvl2_C) == 0x0002C0, "Wrong size on ABP_FenceShortLvl2_C");
static_assert(offsetof(ABP_FenceShortLvl2_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_FenceShortLvl2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FenceShortLvl2_C, Timeline_WaveAmplitude_A5277293416602D253DBBF8739129656) == 0x0002A8, "Member 'ABP_FenceShortLvl2_C::Timeline_WaveAmplitude_A5277293416602D253DBBF8739129656' has a wrong offset!");
static_assert(offsetof(ABP_FenceShortLvl2_C, Timeline__Direction_A5277293416602D253DBBF8739129656) == 0x0002AC, "Member 'ABP_FenceShortLvl2_C::Timeline__Direction_A5277293416602D253DBBF8739129656' has a wrong offset!");
static_assert(offsetof(ABP_FenceShortLvl2_C, Timeline) == 0x0002B0, "Member 'ABP_FenceShortLvl2_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_FenceShortLvl2_C, DynamicMaterialInstance) == 0x0002B8, "Member 'ABP_FenceShortLvl2_C::DynamicMaterialInstance' has a wrong offset!");

}

