#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FenceTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_SplinePointPositions_structs.hpp"
#include "Struct_SingleFenceDetails_structs.hpp"
#include "Struct_FullFenceDetatils_structs.hpp"


namespace SDK::Params
{

// Function BP_FenceTool.BP_FenceTool_C.AddColumnStatitcMeshComponent
// 0x01B0 (0x01B0 - 0x0000)
struct BP_FenceTool_C_AddColumnStatitcMeshComponent final
{
public:
	struct FVector                                FinalLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Orientation;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                SectionSize;                                       // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SingleFenceDetails             PlacedFence;                                       // 0x0048(0x0060)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SingleFenceDetails             K2Node_MakeStruct_Struct_SingleFenceDetails;       // 0x0140(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceTool_C_AddColumnStatitcMeshComponent) == 0x000010, "Wrong alignment on BP_FenceTool_C_AddColumnStatitcMeshComponent");
static_assert(sizeof(BP_FenceTool_C_AddColumnStatitcMeshComponent) == 0x0001B0, "Wrong size on BP_FenceTool_C_AddColumnStatitcMeshComponent");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, FinalLocation) == 0x000000, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::FinalLocation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, Orientation) == 0x000018, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::Orientation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, SectionSize) == 0x000030, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::SectionSize' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, PlacedFence) == 0x000048, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::PlacedFence' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_BreakRotator_Roll) == 0x0000A8, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_BreakRotator_Pitch) == 0x0000AC, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_BreakRotator_Yaw) == 0x0000B0, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_AddComponentByClass_ReturnValue) == 0x000130, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_Array_Add_ReturnValue) == 0x000138, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, K2Node_MakeStruct_Struct_SingleFenceDetails) == 0x000140, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::K2Node_MakeStruct_Struct_SingleFenceDetails' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddColumnStatitcMeshComponent, CallFunc_SetStaticMesh_ReturnValue) == 0x0001A0, "Member 'BP_FenceTool_C_AddColumnStatitcMeshComponent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_FenceTool.BP_FenceTool_C.AddFenceStatitcMeshComponent
// 0x01C0 (0x01C0 - 0x0000)
struct BP_FenceTool_C_AddFenceStatitcMeshComponent final
{
public:
	struct FVector                                MeshLocation;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               MeshOrientation;                                   // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FenceShouldBeSmall;                                // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SingleFenceDetails             PlacedFence;                                       // 0x0038(0x0060)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          StaticMesh;                                        // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UStaticMeshComponent*>           K2Node_Select_Default;                             // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SingleFenceDetails             K2Node_MakeStruct_Struct_SingleFenceDetails;       // 0x0158(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceTool_C_AddFenceStatitcMeshComponent) == 0x000010, "Wrong alignment on BP_FenceTool_C_AddFenceStatitcMeshComponent");
static_assert(sizeof(BP_FenceTool_C_AddFenceStatitcMeshComponent) == 0x0001C0, "Wrong size on BP_FenceTool_C_AddFenceStatitcMeshComponent");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, MeshLocation) == 0x000000, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::MeshLocation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, MeshOrientation) == 0x000018, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::MeshOrientation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, FenceShouldBeSmall) == 0x000030, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::FenceShouldBeSmall' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, PlacedFence) == 0x000038, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::PlacedFence' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, StaticMesh) == 0x000098, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, Temp_bool_Variable) == 0x0000A0, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_BreakRotator_Roll) == 0x0000A4, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_BreakRotator_Pitch) == 0x0000A8, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_BreakRotator_Yaw) == 0x0000AC, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, Temp_bool_Variable_1) == 0x0000B0, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, K2Node_Select_Default) == 0x0000D0, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_AddComponentByClass_ReturnValue) == 0x000140, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_Array_Add_ReturnValue) == 0x000148, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, K2Node_Select_Default_1) == 0x000150, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, K2Node_MakeStruct_Struct_SingleFenceDetails) == 0x000158, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::K2Node_MakeStruct_Struct_SingleFenceDetails' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_AddFenceStatitcMeshComponent, CallFunc_SetStaticMesh_ReturnValue) == 0x0001B8, "Member 'BP_FenceTool_C_AddFenceStatitcMeshComponent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_FenceTool.BP_FenceTool_C.CalculateFenceAmountBetweenPoints
// 0x0070 (0x0070 - 0x0000)
struct BP_FenceTool_C_CalculateFenceAmountBetweenPoints final
{
public:
	struct FVector                                CurrentPoint;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NextPoint;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FenceAmount;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStaticMeshSize_MeshHeight;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStaticMeshSize_MeshWidth;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStaticMeshSize_MeshDepth;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints) == 0x000008, "Wrong alignment on BP_FenceTool_C_CalculateFenceAmountBetweenPoints");
static_assert(sizeof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints) == 0x000070, "Wrong size on BP_FenceTool_C_CalculateFenceAmountBetweenPoints");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CurrentPoint) == 0x000000, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CurrentPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, NextPoint) == 0x000018, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::NextPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, FenceAmount) == 0x000030, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::FenceAmount' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_Vector_Distance_ReturnValue) == 0x000038, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_GetStaticMeshSize_MeshHeight) == 0x000040, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_GetStaticMeshSize_MeshHeight' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_GetStaticMeshSize_MeshWidth) == 0x000048, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_GetStaticMeshSize_MeshWidth' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_GetStaticMeshSize_MeshDepth) == 0x000050, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_GetStaticMeshSize_MeshDepth' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFenceAmountBetweenPoints, CallFunc_FCeil_ReturnValue) == 0x000068, "Member 'BP_FenceTool_C_CalculateFenceAmountBetweenPoints::CallFunc_FCeil_ReturnValue' has a wrong offset!");

// Function BP_FenceTool.BP_FenceTool_C.CalculateFencePositionsBetweenPoints
// 0x00B8 (0x00B8 - 0x0000)
struct BP_FenceTool_C_CalculateFencePositionsBetweenPoints final
{
public:
	int32                                         CurrentFence;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FenceAmount;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentPoint;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NextPoint;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FenceShouldBeSmall;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrentFencePosition;                              // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints) == 0x000008, "Wrong alignment on BP_FenceTool_C_CalculateFencePositionsBetweenPoints");
static_assert(sizeof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints) == 0x0000B8, "Wrong size on BP_FenceTool_C_CalculateFencePositionsBetweenPoints");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CurrentFence) == 0x000000, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CurrentFence' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, FenceAmount) == 0x000004, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::FenceAmount' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CurrentPoint) == 0x000008, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CurrentPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, NextPoint) == 0x000020, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::NextPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, FenceShouldBeSmall) == 0x000038, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::FenceShouldBeSmall' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CurrentFencePosition) == 0x000040, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CurrentFencePosition' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, Temp_bool_Variable) == 0x000070, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, K2Node_Select_Default) == 0x000088, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_VLerp_ReturnValue) == 0x000098, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CalculateFencePositionsBetweenPoints, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0000B0, "Member 'BP_FenceTool_C_CalculateFencePositionsBetweenPoints::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_FenceTool.BP_FenceTool_C.CreateColumnSection
// 0x03C8 (0x03C8 - 0x0000)
struct BP_FenceTool_C_CreateColumnSection final
{
public:
	struct FVector                                Size;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OrientToSpline;                                    // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CreatedSection;                                    // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NewCreatedSection;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SectionLength;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfInstances;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalLocation;                                     // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SectionMaterial;                                   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SectionMesh;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SectionIndex;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SectionOrientToS;                                  // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SectionLocation;                                   // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SectionOffset;                                     // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SectionSize;                                       // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Orientation;                                       // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SingleFenceDetails             CallFunc_AddColumnStatitcMeshComponent_PlacedFence; // 0x0108(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SingleFenceDetails             CallFunc_AddColumnStatitcMeshComponent_PlacedFence_1; // 0x0168(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetColumnPositionWithSmallerFence_ReturnValue; // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SingleFenceDetails             CallFunc_AddColumnStatitcMeshComponent_PlacedFence_2; // 0x0208(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceTool_C_CreateColumnSection) == 0x000008, "Wrong alignment on BP_FenceTool_C_CreateColumnSection");
static_assert(sizeof(BP_FenceTool_C_CreateColumnSection) == 0x0003C8, "Wrong size on BP_FenceTool_C_CreateColumnSection");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Size) == 0x000000, "Member 'BP_FenceTool_C_CreateColumnSection::Size' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Offset) == 0x000018, "Member 'BP_FenceTool_C_CreateColumnSection::Offset' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Location) == 0x000030, "Member 'BP_FenceTool_C_CreateColumnSection::Location' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, OrientToSpline) == 0x000048, "Member 'BP_FenceTool_C_CreateColumnSection::OrientToSpline' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Index_0) == 0x00004C, "Member 'BP_FenceTool_C_CreateColumnSection::Index_0' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CreatedSection) == 0x000050, "Member 'BP_FenceTool_C_CreateColumnSection::CreatedSection' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, NewCreatedSection) == 0x000058, "Member 'BP_FenceTool_C_CreateColumnSection::NewCreatedSection' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionLength) == 0x000060, "Member 'BP_FenceTool_C_CreateColumnSection::SectionLength' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, NumberOfInstances) == 0x000068, "Member 'BP_FenceTool_C_CreateColumnSection::NumberOfInstances' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, FinalLocation) == 0x000070, "Member 'BP_FenceTool_C_CreateColumnSection::FinalLocation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionMaterial) == 0x000088, "Member 'BP_FenceTool_C_CreateColumnSection::SectionMaterial' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionMesh) == 0x000090, "Member 'BP_FenceTool_C_CreateColumnSection::SectionMesh' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionIndex) == 0x000098, "Member 'BP_FenceTool_C_CreateColumnSection::SectionIndex' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionOrientToS) == 0x00009C, "Member 'BP_FenceTool_C_CreateColumnSection::SectionOrientToS' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionLocation) == 0x0000A0, "Member 'BP_FenceTool_C_CreateColumnSection::SectionLocation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionOffset) == 0x0000B8, "Member 'BP_FenceTool_C_CreateColumnSection::SectionOffset' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, SectionSize) == 0x0000D0, "Member 'BP_FenceTool_C_CreateColumnSection::SectionSize' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Orientation) == 0x0000E8, "Member 'BP_FenceTool_C_CreateColumnSection::Orientation' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000100, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BooleanAND_ReturnValue) == 0x000101, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_AddColumnStatitcMeshComponent_PlacedFence) == 0x000108, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_AddColumnStatitcMeshComponent_PlacedFence' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_AddColumnStatitcMeshComponent_PlacedFence_1) == 0x000168, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_AddColumnStatitcMeshComponent_PlacedFence_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetColumnPositionWithSmallerFence_ReturnValue) == 0x0001C8, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetColumnPositionWithSmallerFence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001E0, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, Temp_bool_Variable) == 0x0001E1, "Member 'BP_FenceTool_C_CreateColumnSection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, K2Node_Select_Default) == 0x0001E8, "Member 'BP_FenceTool_C_CreateColumnSection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Array_Add_ReturnValue) == 0x000200, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_AddColumnStatitcMeshComponent_PlacedFence_2) == 0x000208, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_AddColumnStatitcMeshComponent_PlacedFence_2' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Array_Add_ReturnValue_1) == 0x000268, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00026C, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Subtract_IntInt_ReturnValue) == 0x000270, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Array_Add_ReturnValue_2) == 0x000274, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000278, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BooleanAND_ReturnValue_1) == 0x000279, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x00027C, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000280, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000284, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BooleanAND_ReturnValue_2) == 0x000285, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Add_IntInt_ReturnValue) == 0x000288, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BooleanAND_ReturnValue_3) == 0x00028C, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000290, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x0002A8, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x0002C0, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x0002D8, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002F0, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Roll) == 0x000308, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Pitch) == 0x00030C, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Yaw) == 0x000310, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_MakeRotator_ReturnValue) == 0x000318, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_SelectRotator_ReturnValue) == 0x000330, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000348, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Roll_1) == 0x000360, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Pitch_1) == 0x000364, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_BreakRotator_Yaw_1) == 0x000368, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Add_VectorVector_ReturnValue) == 0x000370, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000388, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_SelectFloat_ReturnValue) == 0x000390, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_MakeRotator_ReturnValue_1) == 0x000398, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_SelectFloat_B_ImplicitCast) == 0x0003B0, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0003B8, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FenceTool_C_CreateColumnSection, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0003C0, "Member 'BP_FenceTool_C_CreateColumnSection::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_FenceTool.BP_FenceTool_C.CreateFenceSection
// 0x0358 (0x0358 - 0x0000)
struct BP_FenceTool_C_CreateFenceSection final
{
public:
	struct FVector                                Size;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OrientToSpline;                                    // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SectionIndex;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SectionLength;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfInstances;                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalLocation;                                     // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SectionOrientToS;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SectionLocation;                                   // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SectionOffset;                                     // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SectionSize;                                       // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Orientation;                                       // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_2; // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2; // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_3; // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_3; // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateFenceAmountBetweenPoints_FenceAmount; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
