#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FenceLvl2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FenceLvl2.BP_FenceLvl2_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_FenceLvl2_C : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ShakeTimeline_WaveAmplitude_DAA7428049172729636CCB9A0B013EC2; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShakeTimeline__Direction_DAA7428049172729636CCB9A0B013EC2; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShakeTimeline;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FenceLvl2(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetMaterialBasedOnLevel();
	void ShakeTimeline__FinishedFunc();
	void ShakeTimeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FenceLvl2_C">();
	}
	static class ABP_FenceLvl2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FenceLvl2_C>();
	}
};
static_assert(alignof(ABP_FenceLvl2_C) == 0x000008, "Wrong alignment on ABP_FenceLvl2_C");
static_assert(sizeof(ABP_FenceLvl2_C) == 0x0002C0, "Wrong size on ABP_FenceLvl2_C");
static_assert(offsetof(ABP_FenceLvl2_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_FenceLvl2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FenceLvl2_C, ShakeTimeline_WaveAmplitude_DAA7428049172729636CCB9A0B013EC2) == 0x0002A8, "Member 'ABP_FenceLvl2_C::ShakeTimeline_WaveAmplitude_DAA7428049172729636CCB9A0B013EC2' has a wrong offset!");
static_assert(offsetof(ABP_FenceLvl2_C, ShakeTimeline__Direction_DAA7428049172729636CCB9A0B013EC2) == 0x0002AC, "Member 'ABP_FenceLvl2_C::ShakeTimeline__Direction_DAA7428049172729636CCB9A0B013EC2' has a wrong offset!");
static_assert(offsetof(ABP_FenceLvl2_C, ShakeTimeline) == 0x0002B0, "Member 'ABP_FenceLvl2_C::ShakeTimeline' has a wrong offset!");
static_assert(offsetof(ABP_FenceLvl2_C, DynamicMaterialInstance) == 0x0002B8, "Member 'ABP_FenceLvl2_C::DynamicMaterialInstance' has a wrong offset!");

}

