#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FrictionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AimAssistScripts_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FrictionComponent.BP_FrictionComponent_C
// 0x0028 (0x0208 - 0x01E0)
class UBP_FrictionComponent_C final : public UFrictionComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSlateColor                            ReticleColor;                                      // 0x01E8(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_AimAssistReticle_C*                  AimAssistReticle;                                  // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	bool CanTargetActor(const class AActor* HitActor);
	void ExecuteUbergraph_BP_FrictionComponent(int32 EntryPoint);
	void OnAimAssistEnabled_Event(bool IsEnabled);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FrictionComponent_C">();
	}
	static class UBP_FrictionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FrictionComponent_C>();
	}
};
static_assert(alignof(UBP_FrictionComponent_C) == 0x000008, "Wrong alignment on UBP_FrictionComponent_C");
static_assert(sizeof(UBP_FrictionComponent_C) == 0x000208, "Wrong size on UBP_FrictionComponent_C");
static_assert(offsetof(UBP_FrictionComponent_C, UberGraphFrame) == 0x0001E0, "Member 'UBP_FrictionComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FrictionComponent_C, ReticleColor) == 0x0001E8, "Member 'UBP_FrictionComponent_C::ReticleColor' has a wrong offset!");
static_assert(offsetof(UBP_FrictionComponent_C, AimAssistReticle) == 0x000200, "Member 'UBP_FrictionComponent_C::AimAssistReticle' has a wrong offset!");

}

