#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FenceLvl3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FenceLvl3.BP_FenceLvl3_C.ExecuteUbergraph_BP_FenceLvl3
// 0x0188 (0x0188 - 0x0000)
struct BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_ElectricFence_C>    K2Node_DynamicCast_AsI_Electric_Fence;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0070(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3) == 0x000008, "Wrong alignment on BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3");
static_assert(sizeof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3) == 0x000188, "Wrong size on BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, EntryPoint) == 0x000000, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, Temp_bool_Variable) == 0x000004, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, K2Node_DynamicCast_AsI_Electric_Fence) == 0x000008, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::K2Node_DynamicCast_AsI_Electric_Fence' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, Temp_real_Variable) == 0x000020, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, Temp_real_Variable_1) == 0x000028, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_RandomBool_ReturnValue) == 0x000030, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_Contains_ReturnValue) == 0x000048, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, K2Node_Select_Default) == 0x000050, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000070, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000168, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000180, "Member 'BP_FenceLvl3_C_ExecuteUbergraph_BP_FenceLvl3::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_FenceLvl3.BP_FenceLvl3_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_FenceLvl3_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FenceLvl3_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FenceLvl3_C_UserConstructionScript");
static_assert(sizeof(BP_FenceLvl3_C_UserConstructionScript) == 0x000038, "Wrong size on BP_FenceLvl3_C_UserConstructionScript");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_FenceLvl3_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_FenceLvl3_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_FenceLvl3_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'BP_FenceLvl3_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, CallFunc_RandomInteger_ReturnValue) == 0x000020, "Member 'BP_FenceLvl3_C_UserConstructionScript::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, K2Node_Select_Default) == 0x000028, "Member 'BP_FenceLvl3_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FenceLvl3_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000030, "Member 'BP_FenceLvl3_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

