#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FanOfNeedleCosmeticProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FanOfNeedleCosmeticProjectile.BP_FanOfNeedleCosmeticProjectile_C.BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0030(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000128, "Wrong size on BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit_0) == 0x000030, "Member 'BP_FanOfNeedleCosmeticProjectile_C_BndEvt__BP_FanOfNeedleCosmeticProjectile_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit_0' has a wrong offset!");

// Function BP_FanOfNeedleCosmeticProjectile.BP_FanOfNeedleCosmeticProjectile_C.ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile
// 0x0188 (0x0188 - 0x0000)
struct BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0038(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile) == 0x000008, "Wrong alignment on BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile");
static_assert(sizeof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile) == 0x000188, "Wrong size on BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, EntryPoint) == 0x000000, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, K2Node_ComponentBoundEvent_Hit) == 0x000038, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000130, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000160, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000168, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000180, "Member 'BP_FanOfNeedleCosmeticProjectile_C_ExecuteUbergraph_BP_FanOfNeedleCosmeticProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

}

