#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireSpot

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FireSpot.BP_FireSpot_C.BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_FireSpot.BP_FireSpot_C.BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_FireSpot_C_BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_FireSpot.BP_FireSpot_C.ExecuteUbergraph_BP_FireSpot
// 0x01B0 (0x01B0 - 0x0000)
struct BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetBaseDuration_Duration;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot) == 0x000008, "Wrong alignment on BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot");
static_assert(sizeof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot) == 0x0001B0, "Wrong size on BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, EntryPoint) == 0x000000, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_DynamicCast_AsPawn) == 0x000140, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_DynamicCast_AsPawn_1) == 0x000150, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_GetBaseDuration_Duration) == 0x000160, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_GetBaseDuration_Duration' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000168, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000178, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_IsValid_ReturnValue_2) == 0x000180, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_DoesImplementInterface_ReturnValue) == 0x000181, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000188, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0001A0, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot, CallFunc_IsValid_ReturnValue_3) == 0x0001A8, "Member 'BP_FireSpot_C_ExecuteUbergraph_BP_FireSpot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_FireSpot.BP_FireSpot_C.GetBaseDuration
// 0x0038 (0x0038 - 0x0000)
struct BP_FireSpot_C_GetBaseDuration final
{
public:
	bool                                          HitPawn;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireSpot_C_GetBaseDuration) == 0x000008, "Wrong alignment on BP_FireSpot_C_GetBaseDuration");
static_assert(sizeof(BP_FireSpot_C_GetBaseDuration) == 0x000038, "Wrong size on BP_FireSpot_C_GetBaseDuration");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, HitPawn) == 0x000000, "Member 'BP_FireSpot_C_GetBaseDuration::HitPawn' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, Duration) == 0x000008, "Member 'BP_FireSpot_C_GetBaseDuration::Duration' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000010, "Member 'BP_FireSpot_C_GetBaseDuration::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_FireSpot_C_GetBaseDuration::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_FireSpot_C_GetBaseDuration::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'BP_FireSpot_C_GetBaseDuration::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_GetBaseDuration, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'BP_FireSpot_C_GetBaseDuration::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_FireSpot.BP_FireSpot_C.HitValidTarget
// 0x0058 (0x0058 - 0x0000)
struct BP_FireSpot_C_HitValidTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHouseActorBase_C*                      K2Node_DynamicCast_AsHouse_Actor_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface_1;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireSpot_C_HitValidTarget) == 0x000008, "Wrong alignment on BP_FireSpot_C_HitValidTarget");
static_assert(sizeof(BP_FireSpot_C_HitValidTarget) == 0x000058, "Wrong size on BP_FireSpot_C_HitValidTarget");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, Target) == 0x000000, "Member 'BP_FireSpot_C_HitValidTarget::Target' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, ReturnValue) == 0x000008, "Member 'BP_FireSpot_C_HitValidTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, Temp_byte_Variable) == 0x000009, "Member 'BP_FireSpot_C_HitValidTarget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_AsTeamable_Interface) == 0x000010, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_GetTeamID_ReturnValue) == 0x000021, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_AsHouse_Actor_Base) == 0x000028, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_AsHouse_Actor_Base' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_DoesImplementInterface_ReturnValue) == 0x000031, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, Temp_byte_Variable_1) == 0x000033, "Member 'BP_FireSpot_C_HitValidTarget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000034, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_GetPawn_ReturnValue) == 0x000038, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_AsTeamable_Interface_1) == 0x000040, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_AsTeamable_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_FireSpot_C_HitValidTarget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_HitValidTarget, CallFunc_GetTeamID_ReturnValue_1) == 0x000051, "Member 'BP_FireSpot_C_HitValidTarget::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");

// Function BP_FireSpot.BP_FireSpot_C.SetTargetOnFire
// 0x01D8 (0x01D8 - 0x0000)
struct BP_FireSpot_C_SetTargetOnFire final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HitValidTarget_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0030(0x0010)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0058(0x0010)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0068(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0168(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2; // 0x0178(0x0010)()
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0190(0x0018)()
	bool                                          CallFunc_EffectContextIsValid_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue_1;                    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireSpot_C_SetTargetOnFire) == 0x000008, "Wrong alignment on BP_FireSpot_C_SetTargetOnFire");
static_assert(sizeof(BP_FireSpot_C_SetTargetOnFire) == 0x0001D8, "Wrong size on BP_FireSpot_C_SetTargetOnFire");
static_assert(offsetof(BP_FireSpot_C_SetTargetOnFire, Actor) == 0x000000, "Member 'BP_FireSpot_C_SetTargetOnFire::Actor' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_SetTargetOnFire, Duration) == 0x000008, "Member 'BP_FireSpot_C_SetTargetOnFire::Duration' has a wrong offset!");
static_assert(offsetof(BP_FireSpot_C_SetTargetOnFire, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_FireSpot_C_SetTargetOnFire::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
