#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Firework_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Firework_Projectile.BP_Firework_Projectile_C
// 0x0020 (0x0548 - 0x0528)
class ABP_Firework_Projectile_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Firework_Projectile_C;           // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BounceCount;                                       // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LifetimeHandle;                                    // 0x0538(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           OwningPlayerState;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Firework_Projectile(int32 EntryPoint);
	void ExplodeOnLifeTimeEnd();
	void HandleBounce(const struct FHitResult& Hit, const struct FVector& Impact_Velocity);
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Firework_Projectile_C">();
	}
	static class ABP_Firework_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Firework_Projectile_C>();
	}
};
static_assert(alignof(ABP_Firework_Projectile_C) == 0x000008, "Wrong alignment on ABP_Firework_Projectile_C");
static_assert(sizeof(ABP_Firework_Projectile_C) == 0x000548, "Wrong size on ABP_Firework_Projectile_C");
static_assert(offsetof(ABP_Firework_Projectile_C, UberGraphFrame_BP_Firework_Projectile_C) == 0x000528, "Member 'ABP_Firework_Projectile_C::UberGraphFrame_BP_Firework_Projectile_C' has a wrong offset!");
static_assert(offsetof(ABP_Firework_Projectile_C, BounceCount) == 0x000530, "Member 'ABP_Firework_Projectile_C::BounceCount' has a wrong offset!");
static_assert(offsetof(ABP_Firework_Projectile_C, LifetimeHandle) == 0x000538, "Member 'ABP_Firework_Projectile_C::LifetimeHandle' has a wrong offset!");
static_assert(offsetof(ABP_Firework_Projectile_C, OwningPlayerState) == 0x000540, "Member 'ABP_Firework_Projectile_C::OwningPlayerState' has a wrong offset!");

}

