#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_GeneratedFloor

#include "Basic.hpp"

#include "Bp_GeneratedGeometry_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_GeneratedFloor.Bp_GeneratedFloor_C
// 0x0018 (0x0300 - 0x02E8)
class ABp_GeneratedFloor_C final : public ABp_GeneratedGeometry_C
{
public:
	bool                                          Flip;                                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UVScale;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Height;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_GeneratedFloor_C">();
	}
	static class ABp_GeneratedFloor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_GeneratedFloor_C>();
	}
};
static_assert(alignof(ABp_GeneratedFloor_C) == 0x000008, "Wrong alignment on ABp_GeneratedFloor_C");
static_assert(sizeof(ABp_GeneratedFloor_C) == 0x000300, "Wrong size on ABp_GeneratedFloor_C");
static_assert(offsetof(ABp_GeneratedFloor_C, Flip) == 0x0002E8, "Member 'ABp_GeneratedFloor_C::Flip' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFloor_C, UVScale) == 0x0002F0, "Member 'ABp_GeneratedFloor_C::UVScale' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFloor_C, Height) == 0x0002F8, "Member 'ABp_GeneratedFloor_C::Height' has a wrong offset!");

}

