#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_GeneratedFence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_GeneratedFence.Bp_GeneratedFence_C
// 0x0098 (0x0328 - 0x0290)
class ABp_GeneratedFence_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        SplinePoints;                                      // 0x02A8(0x0010)(Edit, BlueprintVisible, AdvancedDisplay, ExposeOnSpawn)
	TArray<struct FVector>                        Previous_Tangents;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, AdvancedDisplay, ExposeOnSpawn)
	class UStaticMesh*                            Fence_Model;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Module_Location;                                   // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRotator                               Module_Rotation;                                   // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn)
	struct FVector                                Module_Scale;                                      // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Module_Spacing;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Allow_Stretching;                                  // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_GeneratedFence_C">();
	}
	static class ABp_GeneratedFence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_GeneratedFence_C>();
	}
};
static_assert(alignof(ABp_GeneratedFence_C) == 0x000008, "Wrong alignment on ABp_GeneratedFence_C");
static_assert(sizeof(ABp_GeneratedFence_C) == 0x000328, "Wrong size on ABp_GeneratedFence_C");
static_assert(offsetof(ABp_GeneratedFence_C, Billboard) == 0x000290, "Member 'ABp_GeneratedFence_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, InstancedStaticMesh) == 0x000298, "Member 'ABp_GeneratedFence_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABp_GeneratedFence_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, SplinePoints) == 0x0002A8, "Member 'ABp_GeneratedFence_C::SplinePoints' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Previous_Tangents) == 0x0002B8, "Member 'ABp_GeneratedFence_C::Previous_Tangents' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Fence_Model) == 0x0002C8, "Member 'ABp_GeneratedFence_C::Fence_Model' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Module_Location) == 0x0002D0, "Member 'ABp_GeneratedFence_C::Module_Location' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Module_Rotation) == 0x0002E8, "Member 'ABp_GeneratedFence_C::Module_Rotation' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Module_Scale) == 0x000300, "Member 'ABp_GeneratedFence_C::Module_Scale' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Module_Spacing) == 0x000318, "Member 'ABp_GeneratedFence_C::Module_Spacing' has a wrong offset!");
static_assert(offsetof(ABp_GeneratedFence_C, Allow_Stretching) == 0x000320, "Member 'ABp_GeneratedFence_C::Allow_Stretching' has a wrong offset!");

}

