#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Benchmark_Neighbourhood

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Benchmark_Neighbourhood.BP_GM_Benchmark_Neighbourhood_C.ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood
// 0x00A0 (0x00A0 - 0x0000)
struct BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LightingAndPostProcessController_C* CallFunc_GetActorOfClass_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Benchmark_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess_1; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood) == 0x000010, "Wrong alignment on BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood");
static_assert(sizeof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood) == 0x0000A0, "Wrong size on BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, EntryPoint) == 0x000000, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess) == 0x000004, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue) == 0x000008, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_GetActorOfClass_ReturnValue) == 0x000078, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess_1) == 0x000089, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood, CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue_1) == 0x000090, "Member 'BP_GM_Benchmark_Neighbourhood_C_ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood::CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue_1' has a wrong offset!");

// Function BP_GM_Benchmark_Neighbourhood.BP_GM_Benchmark_Neighbourhood_C.GetDefaultPawnClassForController
// 0x0010 (0x0010 - 0x0000)
struct BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController) == 0x000008, "Wrong alignment on BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController");
static_assert(sizeof(BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController) == 0x000010, "Wrong size on BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController, InController) == 0x000000, "Member 'BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController::InController' has a wrong offset!");
static_assert(offsetof(BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController, ReturnValue) == 0x000008, "Member 'BP_GM_Benchmark_Neighbourhood_C_GetDefaultPawnClassForController::ReturnValue' has a wrong offset!");

}

