#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseScreen_PetStartWorldSlot

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Message_TabOpened_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot
// 0x0328 (0x0328 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x01D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x024C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_2;                 // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable_2;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name_3;                 // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_4;                 // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_5;                 // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_6;                 // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPetPosition_RotationFraction_ImplicitCast; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetPetPosition_PositionFraction_ImplicitCast; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot) == 0x000008, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot) == 0x000328, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, EntryPoint) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_struct_Variable) == 0x000028, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_struct_Variable_1) == 0x000030, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_object_Variable) == 0x000038, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Conv_NameToText_ReturnValue) == 0x000040, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000098, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_14) == 0x0000E4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_13) == 0x0000EC, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_12) == 0x000104, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x00010C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_11) == 0x00011C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_4) == 0x000124, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_10) == 0x000134, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_5) == 0x00013C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_name_Variable) == 0x00014C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_6) == 0x000154, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_9) == 0x000164, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_8) == 0x00016C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_7) == 0x000174, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_7) == 0x000184, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_8) == 0x00018C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_6) == 0x00019C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001A4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_5) == 0x0001B4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001BC, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_name_Variable_1) == 0x0001CC, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001D4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_4) == 0x0001E4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_3) == 0x0001EC, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001F4, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_2) == 0x000204, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_13) == 0x00020C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName_1) == 0x00021C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_14) == 0x000224, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CustomEvent_NotifyName) == 0x000234, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, K2Node_CreateDelegate_OutputDelegate_15) == 0x00023C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_name_Variable_2) == 0x00024C, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000254, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name) == 0x000258, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_1) == 0x000268, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_2) == 0x000278, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, Temp_struct_Variable_2) == 0x000288, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_GetPayload_ReturnValue) == 0x000290, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000298, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_IsValid_ReturnValue_1) == 0x0002A0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0002A8, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x0002B0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_IsValid_ReturnValue_2) == 0x0002B8, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_IsValid_ReturnValue_3) == 0x0002B9, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_3) == 0x0002C0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_4) == 0x0002D0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_5) == 0x0002E0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Get_ClassLog_Name_name_6) == 0x0002F0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Get_ClassLog_Name_name_6' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000300, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_SetPetPosition_RotationFraction_ImplicitCast) == 0x000308, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_SetPetPosition_RotationFraction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_SetPetPosition_PositionFraction_ImplicitCast) == 0x000310, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_SetPetPosition_PositionFraction_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000318, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000320, "Member 'BP_HouseScreen_PetStartWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_PetStartWorldSlot::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.FacePetEndWorldSlot
// 0x01F0 (0x01F0 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_LookAt_ReturnValue;                    // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot) == 0x000010, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot) == 0x0001F0, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_K2_LookAt_ReturnValue) == 0x000080, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_K2_LookAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000E8, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_FacePetEndWorldSlot::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.MakeEndWorldSlotFaceAway
// 0x01F0 (0x01F0 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_LookAt_ReturnValue;                    // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway) == 0x000010, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway) == 0x0001F0, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_K2_LookAt_ReturnValue) == 0x000080, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_K2_LookAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000E8, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E0, "Member 'BP_HouseScreen_PetStartWorldSlot_C_MakeEndWorldSlotFaceAway::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_06E098FB43F57CF7B1CDE38D186BC86E::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_3FD7DDCC4ABB9D4AE9C360A32498E2BC::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnBlendOut_E9D4E555473FCE73351D18B7401EBEC1::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_06E098FB43F57CF7B1CDE38D186BC86E::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_3FD7DDCC4ABB9D4AE9C360A32498E2BC::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnCompleted_E9D4E555473FCE73351D18B7401EBEC1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnCompleted_E9D4E555473FCE73351D18B7401EBEC1::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_06E098FB43F57CF7B1CDE38D186BC86E::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_3FD7DDCC4ABB9D4AE9C360A32498E2BC::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnInterrupted_E9D4E555473FCE73351D18B7401EBEC1::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D
// 0x0010 (0x0010 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D) == 0x000008, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D) == 0x000010, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D, ProxyObject) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D, ActualChannel) == 0x000008, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnMessageReceived_1D7AEAB1463FA3B2646138BDACF97B2D::ActualChannel' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_06E098FB43F57CF7B1CDE38D186BC86E::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_3FD7DDCC4ABB9D4AE9C360A32498E2BC::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnNotifyBegin_E9D4E555473FCE73351D18B7401EBEC1::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E");
static_assert(offsetof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E, NotifyName) == 0x000000, "Member 'BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_06E098FB43F57CF7B1CDE38D186BC86E::NotifyName' has a wrong offset!");

// Function BP_HouseScreen_PetStartWorldSlot.BP_HouseScreen_PetStartWorldSlot_C.OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000004, "Wrong alignment on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
static_assert(sizeof(BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC) == 0x000008, "Wrong size on BP_HouseScreen_PetStartWorldSlot_C_OnNotifyEnd_3FD7DDCC4ABB9D4AE9C360A32498E2BC");
