#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_HillsideVilla_Preview

#include "Basic.hpp"

#include "Bp_HousePreview_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_HillsideVilla_Preview.Bp_HillsideVilla_Preview_C
// 0x0020 (0x02D8 - 0x02B8)
class ABp_HillsideVilla_Preview_C final : public ABp_HousePreview_Base_C
{
public:
	class UNiagaraComponent*                      HouseBoughtParticles1;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HouseBoughtParticles2;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HouseBoughtParticles3;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Fence_HighSimple_200CM;                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_HillsideVilla_Preview_C">();
	}
	static class ABp_HillsideVilla_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_HillsideVilla_Preview_C>();
	}
};
static_assert(alignof(ABp_HillsideVilla_Preview_C) == 0x000008, "Wrong alignment on ABp_HillsideVilla_Preview_C");
static_assert(sizeof(ABp_HillsideVilla_Preview_C) == 0x0002D8, "Wrong size on ABp_HillsideVilla_Preview_C");
static_assert(offsetof(ABp_HillsideVilla_Preview_C, HouseBoughtParticles1) == 0x0002B8, "Member 'ABp_HillsideVilla_Preview_C::HouseBoughtParticles1' has a wrong offset!");
static_assert(offsetof(ABp_HillsideVilla_Preview_C, HouseBoughtParticles2) == 0x0002C0, "Member 'ABp_HillsideVilla_Preview_C::HouseBoughtParticles2' has a wrong offset!");
static_assert(offsetof(ABp_HillsideVilla_Preview_C, HouseBoughtParticles3) == 0x0002C8, "Member 'ABp_HillsideVilla_Preview_C::HouseBoughtParticles3' has a wrong offset!");
static_assert(offsetof(ABp_HillsideVilla_Preview_C, Sm_Fence_HighSimple_200CM) == 0x0002D0, "Member 'ABp_HillsideVilla_Preview_C::Sm_Fence_HighSimple_200CM' has a wrong offset!");

}

