#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeldMessItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HeldMessItem.BP_HeldMessItem_C.DisableCollisionAndHide
// 0x0018 (0x0018 - 0x0000)
struct BP_HeldMessItem_C_DisableCollisionAndHide final
{
public:
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeldMessItem_C_DisableCollisionAndHide) == 0x000008, "Wrong alignment on BP_HeldMessItem_C_DisableCollisionAndHide");
static_assert(sizeof(BP_HeldMessItem_C_DisableCollisionAndHide) == 0x000018, "Wrong size on BP_HeldMessItem_C_DisableCollisionAndHide");
static_assert(offsetof(BP_HeldMessItem_C_DisableCollisionAndHide, CallFunc_GetInstigator_ReturnValue) == 0x000000, "Member 'BP_HeldMessItem_C_DisableCollisionAndHide::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_DisableCollisionAndHide, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_HeldMessItem_C_DisableCollisionAndHide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_DisableCollisionAndHide, CallFunc_GetInstigator_ReturnValue_1) == 0x000010, "Member 'BP_HeldMessItem_C_DisableCollisionAndHide::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");

// Function BP_HeldMessItem.BP_HeldMessItem_C.ExecuteUbergraph_BP_HeldMessItem
// 0x0078 (0x0078 - 0x0000)
struct BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Velocity_1;                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInitializationStateEnded_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem) == 0x000008, "Wrong alignment on BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem");
static_assert(sizeof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem) == 0x000078, "Wrong size on BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, EntryPoint) == 0x000000, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, K2Node_CustomEvent_Velocity_1) == 0x000008, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::K2Node_CustomEvent_Velocity_1' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_HasAuthority_ReturnValue_1) == 0x000020, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000028, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, K2Node_CustomEvent_Velocity) == 0x000038, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_HasInitializationStateEnded_ReturnValue) == 0x000050, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_HasInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_HeldMessItem_C_ExecuteUbergraph_BP_HeldMessItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_HeldMessItem.BP_HeldMessItem_C.Multi_Throw
// 0x0018 (0x0018 - 0x0000)
struct BP_HeldMessItem_C_Multi_Throw final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeldMessItem_C_Multi_Throw) == 0x000008, "Wrong alignment on BP_HeldMessItem_C_Multi_Throw");
static_assert(sizeof(BP_HeldMessItem_C_Multi_Throw) == 0x000018, "Wrong size on BP_HeldMessItem_C_Multi_Throw");
static_assert(offsetof(BP_HeldMessItem_C_Multi_Throw, Velocity) == 0x000000, "Member 'BP_HeldMessItem_C_Multi_Throw::Velocity' has a wrong offset!");

// Function BP_HeldMessItem.BP_HeldMessItem_C.ReleaseFromInventory
// 0x0018 (0x0018 - 0x0000)
struct BP_HeldMessItem_C_ReleaseFromInventory final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeldMessItem_C_ReleaseFromInventory) == 0x000008, "Wrong alignment on BP_HeldMessItem_C_ReleaseFromInventory");
static_assert(sizeof(BP_HeldMessItem_C_ReleaseFromInventory) == 0x000018, "Wrong size on BP_HeldMessItem_C_ReleaseFromInventory");
static_assert(offsetof(BP_HeldMessItem_C_ReleaseFromInventory, Velocity) == 0x000000, "Member 'BP_HeldMessItem_C_ReleaseFromInventory::Velocity' has a wrong offset!");

}

