#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseADestroyed

#include "Basic.hpp"

#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HouseADestroyed.BP_HouseADestroyed_C
// 0x0218 (0x04B0 - 0x0298)
class ABP_HouseADestroyed_C final : public AHousePreviewActorBase
{
public:
	class UChildActorComponent*                   BP_DecorativeHouseDecalEgg;                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalPie;                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato;                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalEgg1;                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalEgg2;                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalEgg3;                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalEgg4;                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato1;                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TinCanAlarmSystem1;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TinCanAlarmSystem;                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato2;                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Destroyed2;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Destroyed1;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato3;                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato4;                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalPie1;                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_DecorativeHouseDecalTomato5;                    // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Tree_SwansGolden_LargeDestroyed;                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Chicken3;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Chicken2;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GarageDoor;                                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_Length5_2;                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_Length5_3;                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Windows_WindowFrame_Large_B_Broken;             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_Length9_2;                      // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_Length9_3;                      // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_Length9_4;                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Chicken1;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Windows_SM_WindowFrame_Standard_B_Broken;       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WindowShutters;                                 // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WindowShutters1;                                // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WindowShutters2;                                // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Windows_SM_WindowFrame_Standard_B_Broken1;      // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Chicken;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ToiletRoll;                                     // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube4;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube5;                                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube6;                                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube7;                                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube8;                                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube2;                                             // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_toiletroll1;                                    // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_toiletroll2;                                    // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_toiletroll3;                                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_toiletroll4;                                    // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Tree_SwansGolden_MediumDestroyed;               // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Destroyed;                                      // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HouseMesh;                                         // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HouseADestroyed_C">();
	}
	static class ABP_HouseADestroyed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HouseADestroyed_C>();
	}
};
static_assert(alignof(ABP_HouseADestroyed_C) == 0x000008, "Wrong alignment on ABP_HouseADestroyed_C");
static_assert(sizeof(ABP_HouseADestroyed_C) == 0x0004B0, "Wrong size on ABP_HouseADestroyed_C");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalEgg) == 0x000298, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalEgg' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalPie) == 0x0002A0, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalPie' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato) == 0x0002A8, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalEgg1) == 0x0002B0, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalEgg1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalEgg2) == 0x0002B8, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalEgg2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalEgg3) == 0x0002C0, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalEgg3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalEgg4) == 0x0002C8, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalEgg4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato1) == 0x0002D0, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_TinCanAlarmSystem1) == 0x0002D8, "Member 'ABP_HouseADestroyed_C::SM_TinCanAlarmSystem1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh4) == 0x0002E0, "Member 'ABP_HouseADestroyed_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh5) == 0x0002E8, "Member 'ABP_HouseADestroyed_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh6) == 0x0002F0, "Member 'ABP_HouseADestroyed_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh7) == 0x0002F8, "Member 'ABP_HouseADestroyed_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh8) == 0x000300, "Member 'ABP_HouseADestroyed_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh9) == 0x000308, "Member 'ABP_HouseADestroyed_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_TinCanAlarmSystem) == 0x000310, "Member 'ABP_HouseADestroyed_C::SM_TinCanAlarmSystem' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh3) == 0x000318, "Member 'ABP_HouseADestroyed_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato2) == 0x000320, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Arrow) == 0x000328, "Member 'ABP_HouseADestroyed_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Billboard) == 0x000330, "Member 'ABP_HouseADestroyed_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Decal) == 0x000338, "Member 'ABP_HouseADestroyed_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Decal1) == 0x000340, "Member 'ABP_HouseADestroyed_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, PS_Destroyed2) == 0x000348, "Member 'ABP_HouseADestroyed_C::PS_Destroyed2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Decal2) == 0x000350, "Member 'ABP_HouseADestroyed_C::Decal2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Decal3) == 0x000358, "Member 'ABP_HouseADestroyed_C::Decal3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, PS_Destroyed1) == 0x000360, "Member 'ABP_HouseADestroyed_C::PS_Destroyed1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato3) == 0x000368, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato4) == 0x000370, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalPie1) == 0x000378, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalPie1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, BP_DecorativeHouseDecalTomato5) == 0x000380, "Member 'ABP_HouseADestroyed_C::BP_DecorativeHouseDecalTomato5' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_Tree_SwansGolden_LargeDestroyed) == 0x000388, "Member 'ABP_HouseADestroyed_C::Sm_Tree_SwansGolden_LargeDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SK_Chicken3) == 0x000390, "Member 'ABP_HouseADestroyed_C::SK_Chicken3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube1) == 0x000398, "Member 'ABP_HouseADestroyed_C::Cube1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SK_Chicken2) == 0x0003A0, "Member 'ABP_HouseADestroyed_C::SK_Chicken2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_GarageDoor) == 0x0003A8, "Member 'ABP_HouseADestroyed_C::SM_GarageDoor' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Plank_Barricade_Length5_2) == 0x0003B0, "Member 'ABP_HouseADestroyed_C::SM_Plank_Barricade_Length5_2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Plank_Barricade_Length5_3) == 0x0003B8, "Member 'ABP_HouseADestroyed_C::SM_Plank_Barricade_Length5_3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Windows_WindowFrame_Large_B_Broken) == 0x0003C0, "Member 'ABP_HouseADestroyed_C::SM_Windows_WindowFrame_Large_B_Broken' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Plank_Barricade_Length9_2) == 0x0003C8, "Member 'ABP_HouseADestroyed_C::SM_Plank_Barricade_Length9_2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Plank_Barricade_Length9_3) == 0x0003D0, "Member 'ABP_HouseADestroyed_C::SM_Plank_Barricade_Length9_3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Plank_Barricade_Length9_4) == 0x0003D8, "Member 'ABP_HouseADestroyed_C::SM_Plank_Barricade_Length9_4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SK_Chicken1) == 0x0003E0, "Member 'ABP_HouseADestroyed_C::SK_Chicken1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Windows_SM_WindowFrame_Standard_B_Broken) == 0x0003E8, "Member 'ABP_HouseADestroyed_C::SM_Windows_SM_WindowFrame_Standard_B_Broken' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_WindowShutters) == 0x0003F0, "Member 'ABP_HouseADestroyed_C::SM_WindowShutters' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_WindowShutters1) == 0x0003F8, "Member 'ABP_HouseADestroyed_C::SM_WindowShutters1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_WindowShutters2) == 0x000400, "Member 'ABP_HouseADestroyed_C::SM_WindowShutters2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_Windows_SM_WindowFrame_Standard_B_Broken1) == 0x000408, "Member 'ABP_HouseADestroyed_C::SM_Windows_SM_WindowFrame_Standard_B_Broken1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SK_Chicken) == 0x000410, "Member 'ABP_HouseADestroyed_C::SK_Chicken' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, SM_ToiletRoll) == 0x000418, "Member 'ABP_HouseADestroyed_C::SM_ToiletRoll' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube4) == 0x000420, "Member 'ABP_HouseADestroyed_C::Cube4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube5) == 0x000428, "Member 'ABP_HouseADestroyed_C::Cube5' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube6) == 0x000430, "Member 'ABP_HouseADestroyed_C::Cube6' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube3) == 0x000438, "Member 'ABP_HouseADestroyed_C::Cube3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube7) == 0x000440, "Member 'ABP_HouseADestroyed_C::Cube7' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube8) == 0x000448, "Member 'ABP_HouseADestroyed_C::Cube8' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh1) == 0x000450, "Member 'ABP_HouseADestroyed_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, StaticMesh2) == 0x000458, "Member 'ABP_HouseADestroyed_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube2) == 0x000460, "Member 'ABP_HouseADestroyed_C::Cube2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_toiletroll1) == 0x000468, "Member 'ABP_HouseADestroyed_C::Sm_toiletroll1' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_toiletroll2) == 0x000470, "Member 'ABP_HouseADestroyed_C::Sm_toiletroll2' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_toiletroll3) == 0x000478, "Member 'ABP_HouseADestroyed_C::Sm_toiletroll3' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_toiletroll4) == 0x000480, "Member 'ABP_HouseADestroyed_C::Sm_toiletroll4' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Sm_Tree_SwansGolden_MediumDestroyed) == 0x000488, "Member 'ABP_HouseADestroyed_C::Sm_Tree_SwansGolden_MediumDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, Cube) == 0x000490, "Member 'ABP_HouseADestroyed_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, PS_Destroyed) == 0x000498, "Member 'ABP_HouseADestroyed_C::PS_Destroyed' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, HouseMesh) == 0x0004A0, "Member 'ABP_HouseADestroyed_C::HouseMesh' has a wrong offset!");
static_assert(offsetof(ABP_HouseADestroyed_C, DefaultSceneRoot) == 0x0004A8, "Member 'ABP_HouseADestroyed_C::DefaultSceneRoot' has a wrong offset!");

}

