#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseIdentifier

#include "Basic.hpp"

#include "S_IndicatorData_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.CreateModifiedIndicatorData
// 0x0290 (0x0290 - 0x0000)
struct BP_HouseIdentifier_C_CreateModifiedIndicatorData final
{
public:
	struct FS_IndicatorData                       OriginalIndicatorData_0;                           // 0x0000(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Visible_Through_Walls;                             // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_IndicatorData                       ModifiedIndicatorData_0;                           // 0x00E0(0x00D8)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_IndicatorData                       K2Node_MakeStruct_S_IndicatorData;                 // 0x01B8(0x00D8)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_CreateModifiedIndicatorData) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_CreateModifiedIndicatorData");
static_assert(sizeof(BP_HouseIdentifier_C_CreateModifiedIndicatorData) == 0x000290, "Wrong size on BP_HouseIdentifier_C_CreateModifiedIndicatorData");
static_assert(offsetof(BP_HouseIdentifier_C_CreateModifiedIndicatorData, OriginalIndicatorData_0) == 0x000000, "Member 'BP_HouseIdentifier_C_CreateModifiedIndicatorData::OriginalIndicatorData_0' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_CreateModifiedIndicatorData, Visible_Through_Walls) == 0x0000D8, "Member 'BP_HouseIdentifier_C_CreateModifiedIndicatorData::Visible_Through_Walls' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_CreateModifiedIndicatorData, ModifiedIndicatorData_0) == 0x0000E0, "Member 'BP_HouseIdentifier_C_CreateModifiedIndicatorData::ModifiedIndicatorData_0' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_CreateModifiedIndicatorData, K2Node_MakeStruct_S_IndicatorData) == 0x0001B8, "Member 'BP_HouseIdentifier_C_CreateModifiedIndicatorData::K2Node_MakeStruct_S_IndicatorData' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.ExecuteUbergraph_BP_HouseIdentifier
// 0x04A8 (0x04A8 - 0x0000)
struct BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateStarted*            CallFunc_ListenToInitializationStateStarted_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0048(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerLookingAtWidget_ReturnValue; // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_IndicatorData                       CallFunc_CreateModifiedIndicatorData_ModifiedIndicatorData; // 0x0148(0x00D8)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0220(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue_2;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_HouseIdentifier_C*                  K2Node_DynamicCast_AsWI_House_Identifier;          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime_1; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ease_ReturnValue;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0368(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0460(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsWarmupActive_WarmupActive;              // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue;        // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier");
static_assert(sizeof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier) == 0x0004A8, "Wrong size on BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, EntryPoint) == 0x000000, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_ListenToInitializationStateStarted_ReturnValue) == 0x000008, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_ListenToInitializationStateStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, Temp_bool_Has_Been_Initd_Variable) == 0x000012, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, Temp_bool_Has_Been_Initd_Variable_1) == 0x000013, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_IsDedicatedServer_ReturnValue) == 0x000024, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_SwitchInteger_CmpSuccess) == 0x00002C, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTimeSeconds_ReturnValue) == 0x000030, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000038, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime) == 0x000040, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000048, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_IsLocalPlayerLookingAtWidget_ReturnValue) == 0x000141, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_IsLocalPlayerLookingAtWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_CreateModifiedIndicatorData_ModifiedIndicatorData) == 0x000148, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_CreateModifiedIndicatorData_ModifiedIndicatorData' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000220, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000318, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTimeSeconds_ReturnValue_2) == 0x000320, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_DynamicCast_AsWI_House_Identifier) == 0x000328, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_DynamicCast_AsWI_House_Identifier' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_DynamicCast_bSuccess) == 0x000330, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime_1) == 0x000338, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTweenUpFromCenterHouseEndTime_EndTime_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_MapRangeClamped_ReturnValue) == 0x000340, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_Ease_ReturnValue) == 0x000348, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_VLerp_ReturnValue) == 0x000350, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000368, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTeam_ReturnValue) == 0x000460, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_IsWarmupActive_WarmupActive) == 0x000498, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_IsWarmupActive_WarmupActive' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_Not_PreBool_ReturnValue) == 0x000499, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_GetTeamTypeFromTeamId_ReturnValue) == 0x00049A, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_GetTeamTypeFromTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, K2Node_SwitchEnum_CmpSuccess) == 0x00049B, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, Temp_bool_IsClosed_Variable_1) == 0x00049C, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0004A0, "Member 'BP_HouseIdentifier_C_ExecuteUbergraph_BP_HouseIdentifier::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.GetLocalPlayerTeamId
// 0x0020 (0x0020 - 0x0000)
struct BP_HouseIdentifier_C_GetLocalPlayerTeamId final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_GetLocalPlayerTeamId) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_GetLocalPlayerTeamId");
static_assert(sizeof(BP_HouseIdentifier_C_GetLocalPlayerTeamId) == 0x000020, "Wrong size on BP_HouseIdentifier_C_GetLocalPlayerTeamId");
static_assert(offsetof(BP_HouseIdentifier_C_GetLocalPlayerTeamId, ReturnValue) == 0x000000, "Member 'BP_HouseIdentifier_C_GetLocalPlayerTeamId::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GetLocalPlayerTeamId, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_HouseIdentifier_C_GetLocalPlayerTeamId::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GetLocalPlayerTeamId, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP) == 0x000010, "Member 'BP_HouseIdentifier_C_GetLocalPlayerTeamId::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GetLocalPlayerTeamId, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_HouseIdentifier_C_GetLocalPlayerTeamId::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GetLocalPlayerTeamId, CallFunc_GetTeamID_ReturnValue) == 0x000019, "Member 'BP_HouseIdentifier_C_GetLocalPlayerTeamId::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.GetTweenUpFromCenterHouseEndTime
// 0x0010 (0x0010 - 0x0000)
struct BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime final
{
public:
	double                                        EndTime;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime");
static_assert(sizeof(BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime) == 0x000010, "Wrong size on BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime");
static_assert(offsetof(BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime, EndTime) == 0x000000, "Member 'BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime::EndTime' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_HouseIdentifier_C_GetTweenUpFromCenterHouseEndTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.GotoNextPhase
// 0x0180 (0x0180 - 0x0000)
struct BP_HouseIdentifier_C_GotoNextPhase final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0008(0x0038)(ConstParm, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_GotoNextPhase) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_GotoNextPhase");
static_assert(sizeof(BP_HouseIdentifier_C_GotoNextPhase) == 0x000180, "Wrong size on BP_HouseIdentifier_C_GotoNextPhase");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, Temp_int_Variable) == 0x000000, "Member 'BP_HouseIdentifier_C_GotoNextPhase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_GetTeam_ReturnValue) == 0x000008, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000050, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_HouseIdentifier_C_GotoNextPhase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_HouseIdentifier_C_GotoNextPhase::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E8, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Get_ClassLog_Name_name) == 0x0000F0, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'BP_HouseIdentifier_C_GotoNextPhase::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_HouseIdentifier_C_GotoNextPhase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Format_ReturnValue) == 0x000158, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000168, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_GotoNextPhase, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'BP_HouseIdentifier_C_GotoNextPhase::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.IsLocalPlayerLookingAtWidget
// 0x0002 (0x0002 - 0x0000)
struct BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSceneComponentOnScreen_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget) == 0x000001, "Wrong alignment on BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget");
static_assert(sizeof(BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget) == 0x000002, "Wrong size on BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget");
static_assert(offsetof(BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget, ReturnValue) == 0x000000, "Member 'BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget, CallFunc_IsSceneComponentOnScreen_ReturnValue) == 0x000001, "Member 'BP_HouseIdentifier_C_IsLocalPlayerLookingAtWidget::CallFunc_IsSceneComponentOnScreen_ReturnValue' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.IsWarmupActive
// 0x0020 (0x0020 - 0x0000)
struct BP_HouseIdentifier_C_IsWarmupActive final
{
public:
	bool                                          WarmupActive;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_IsWarmupActive) == 0x000008, "Wrong alignment on BP_HouseIdentifier_C_IsWarmupActive");
static_assert(sizeof(BP_HouseIdentifier_C_IsWarmupActive) == 0x000020, "Wrong size on BP_HouseIdentifier_C_IsWarmupActive");
static_assert(offsetof(BP_HouseIdentifier_C_IsWarmupActive, WarmupActive) == 0x000000, "Member 'BP_HouseIdentifier_C_IsWarmupActive::WarmupActive' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_IsWarmupActive, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_HouseIdentifier_C_IsWarmupActive::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_IsWarmupActive, K2Node_DynamicCast_AsGame_State_JP_Match_BP) == 0x000010, "Member 'BP_HouseIdentifier_C_IsWarmupActive::K2Node_DynamicCast_AsGame_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(BP_HouseIdentifier_C_IsWarmupActive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_HouseIdentifier_C_IsWarmupActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_HouseIdentifier.BP_HouseIdentifier_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HouseIdentifier_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseIdentifier_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HouseIdentifier_C_ReceiveTick");
static_assert(sizeof(BP_HouseIdentifier_C_ReceiveTick) == 0x000004, "Wrong size on BP_HouseIdentifier_C_ReceiveTick");
static_assert(offsetof(BP_HouseIdentifier_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HouseIdentifier_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

