#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hedge_Garbage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_Hedge_Garbage.BP_Hedge_Garbage_C.ExecuteUbergraph_BP_Hedge_Garbage
// 0x0004 (0x0004 - 0x0000)
struct BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage) == 0x000004, "Wrong alignment on BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage");
static_assert(sizeof(BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage) == 0x000004, "Wrong size on BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage");
static_assert(offsetof(BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage, EntryPoint) == 0x000000, "Member 'BP_Hedge_Garbage_C_ExecuteUbergraph_BP_Hedge_Garbage::EntryPoint' has a wrong offset!");

// Function BP_Hedge_Garbage.BP_Hedge_Garbage_C.FindTeamTrashCan
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Hedge_Garbage_C_FindTeamTrashCan final
{
public:
	TArray<class ABP_Trashcan_C*>                 TrashCan;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class ABP_Trashcan_C*>                 FoundCompostBins;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CompostBin_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0050(0x0038)(NoDestructor)
	class ABP_Trashcan_C*                         CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Garbage_C_FindTeamTrashCan) == 0x000008, "Wrong alignment on BP_Hedge_Garbage_C_FindTeamTrashCan");
static_assert(sizeof(BP_Hedge_Garbage_C_FindTeamTrashCan) == 0x0000A0, "Wrong size on BP_Hedge_Garbage_C_FindTeamTrashCan");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, TrashCan) == 0x000000, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::TrashCan' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, FoundCompostBins) == 0x000010, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::FoundCompostBins' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000030, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_GetTeam_ReturnValue) == 0x000050, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_FindTeamTrashCan, CallFunc_IsLocallyControlled_ReturnValue) == 0x00009A, "Member 'BP_Hedge_Garbage_C_FindTeamTrashCan::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function BP_Hedge_Garbage.BP_Hedge_Garbage_C.LaunchTowardsGroundskeeper
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper final
{
public:
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGroundsKeeperAtPoint_bFoundTeam;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATeamVolume*>                    CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes; // 0x0038(0x0010)(ReferenceParm)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeperAtPoint_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper) == 0x000008, "Wrong alignment on BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper");
static_assert(sizeof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper) == 0x0000C8, "Wrong size on BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000000, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_bFoundTeam) == 0x000030, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes) == 0x000038, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_ReturnValue) == 0x000048, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_Hedge_Garbage_C_LaunchTowardsGroundskeeper::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

}

