#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseScreen_ForSaleSign

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_PreviewHouseChangedMessage_structs.hpp"
#include "S_HouseBoughtMessage_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseScreen_ForSaleSign.BP_HouseScreen_ForSaleSign_C.ExecuteUbergraph_BP_HouseScreen_ForSaleSign
// 0x01A0 (0x01A0 - 0x0000)
struct BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_PreviewHouseChangedMessage          Temp_struct_Variable;                              // 0x0028(0x0030)(HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HouseBoughtMessage                  Temp_struct_Variable_2;                            // 0x0078(0x0028)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HouseBoughtMessage                  Temp_struct_Variable_3;                            // 0x00C0(0x0028)(HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PreviewHouseChangedMessage          Temp_struct_Variable_5;                            // 0x0108(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_SelectedHouseDefinition;        // 0x0140(0x0028)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOwned;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_BoughtHouseDefinition;          // 0x0170(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign) == 0x000008, "Wrong alignment on BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign");
static_assert(sizeof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign) == 0x0001A0, "Wrong size on BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, EntryPoint) == 0x000000, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_ProxyObject_1) == 0x000018, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_ActualChannel_1) == 0x000020, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable) == 0x000028, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable_1) == 0x000058, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_object_Variable) == 0x000060, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000068, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable_2) == 0x000078, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_ProxyObject) == 0x0000A0, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_ActualChannel) == 0x0000A8, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable_3) == 0x0000C0, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable_4) == 0x0000E8, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_object_Variable_1) == 0x0000F0, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_GetPayload_ReturnValue) == 0x0000F8, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000100, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, Temp_struct_Variable_5) == 0x000108, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_GetPayload_ReturnValue_1) == 0x000138, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_IsValid_ReturnValue_1) == 0x000139, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_SelectedHouseDefinition) == 0x000140, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_SelectedHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_IsOwned) == 0x000168, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_IsOwned' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, K2Node_CustomEvent_BoughtHouseDefinition) == 0x000170, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::K2Node_CustomEvent_BoughtHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_IsValid_ReturnValue_2) == 0x000198, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_IsValid_ReturnValue_3) == 0x000199, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign, CallFunc_IsValid_ReturnValue_4) == 0x00019A, "Member 'BP_HouseScreen_ForSaleSign_C_ExecuteUbergraph_BP_HouseScreen_ForSaleSign::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function BP_HouseScreen_ForSaleSign.BP_HouseScreen_ForSaleSign_C.HandleHouseBought
// 0x0028 (0x0028 - 0x0000)
struct BP_HouseScreen_ForSaleSign_C_HandleHouseBought final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        BoughtHouseDefinition;                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_ForSaleSign_C_HandleHouseBought) == 0x000008, "Wrong alignment on BP_HouseScreen_ForSaleSign_C_HandleHouseBought");
static_assert(sizeof(BP_HouseScreen_ForSaleSign_C_HandleHouseBought) == 0x000028, "Wrong size on BP_HouseScreen_ForSaleSign_C_HandleHouseBought");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_HandleHouseBought, BoughtHouseDefinition) == 0x000000, "Member 'BP_HouseScreen_ForSaleSign_C_HandleHouseBought::BoughtHouseDefinition' has a wrong offset!");

// Function BP_HouseScreen_ForSaleSign.BP_HouseScreen_ForSaleSign_C.HandlePreviewHouseChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        SelectedHouseDefinition;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged) == 0x000008, "Wrong alignment on BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged");
static_assert(sizeof(BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged) == 0x000030, "Wrong size on BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged, SelectedHouseDefinition) == 0x000000, "Member 'BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged::SelectedHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged, IsOwned) == 0x000028, "Member 'BP_HouseScreen_ForSaleSign_C_HandlePreviewHouseChanged::IsOwned' has a wrong offset!");

// Function BP_HouseScreen_ForSaleSign.BP_HouseScreen_ForSaleSign_C.OnMessageReceived_69C7053241A22F4F17B971A7F64C929F
// 0x0010 (0x0010 - 0x0000)
struct BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F) == 0x000008, "Wrong alignment on BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F");
static_assert(sizeof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F) == 0x000010, "Wrong size on BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F, ProxyObject) == 0x000000, "Member 'BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F, ActualChannel) == 0x000008, "Member 'BP_HouseScreen_ForSaleSign_C_OnMessageReceived_69C7053241A22F4F17B971A7F64C929F::ActualChannel' has a wrong offset!");

// Function BP_HouseScreen_ForSaleSign.BP_HouseScreen_ForSaleSign_C.OnMessageReceived_89280B884B97888668A83881C34190E5
// 0x0010 (0x0010 - 0x0000)
struct BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5) == 0x000008, "Wrong alignment on BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5");
static_assert(sizeof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5) == 0x000010, "Wrong size on BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5, ProxyObject) == 0x000000, "Member 'BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5, ActualChannel) == 0x000008, "Member 'BP_HouseScreen_ForSaleSign_C_OnMessageReceived_89280B884B97888668A83881C34190E5::ActualChannel' has a wrong offset!");

}

