#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseDecalBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.ExecuteUbergraph_BP_HouseDecalBase
// 0x0578 (0x0578 - 0x0000)
struct BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_Direction;                            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x0060(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x00C0(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x03A8(0x0018)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Causer;                         // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxHealth;                            // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x04E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HighlightManager_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x0514(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0520(0x0038)(ConstParm, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0568(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase");
static_assert(sizeof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase) == 0x000578, "Wrong size on BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, EntryPoint) == 0x000000, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_MakeRotFromZ_ReturnValue) == 0x000020, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_Direction) == 0x000038, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_Delta) == 0x000050, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_Causer) == 0x000058, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_CombatParticipant) == 0x000060, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_KillMethod) == 0x0000C0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_KillMethod' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_Location) == 0x0003A8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_CustomEvent_Causer) == 0x0003C0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_CustomEvent_Causer' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_IsValid_ReturnValue) == 0x0003C8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003D0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003E8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_Health) == 0x000400, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_MaxHealth) == 0x000404, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_MaxHealth' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000408, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000410, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000418, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000430, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000438, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000450, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000468, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x000480, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetActorUpVector_ReturnValue) == 0x000498, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_MakeRotFromY_ReturnValue) == 0x0004B0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_MakeRotFromY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_BreakVector_X) == 0x0004C8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_BreakVector_Y) == 0x0004D0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_BreakVector_Z) == 0x0004D8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, K2Node_Event_AttackingActor) == 0x0004E0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::K2Node_Event_AttackingActor' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0004E8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetActorOfClass_ReturnValue) == 0x0004F0, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004F8, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000510, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x000514, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000520, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000558, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_IsValid_ReturnValue_1) == 0x000560, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000568, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000570, "Member 'BP_HouseDecalBase_C_ExecuteUbergraph_BP_HouseDecalBase::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.GetDurabilityCostWhenHit
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseDecalBase_C_GetDurabilityCostWhenHit final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_GetDurabilityCostWhenHit");
static_assert(sizeof(BP_HouseDecalBase_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong size on BP_HouseDecalBase_C_GetDurabilityCostWhenHit");
static_assert(offsetof(BP_HouseDecalBase_C_GetDurabilityCostWhenHit, Amount) == 0x000000, "Member 'BP_HouseDecalBase_C_GetDurabilityCostWhenHit::Amount' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.GetMaterialType
// 0x0001 (0x0001 - 0x0000)
struct BP_HouseDecalBase_C_GetMaterialType final
{
public:
	E_MaterialTypes                               MaterialType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_GetMaterialType) == 0x000001, "Wrong alignment on BP_HouseDecalBase_C_GetMaterialType");
static_assert(sizeof(BP_HouseDecalBase_C_GetMaterialType) == 0x000001, "Wrong size on BP_HouseDecalBase_C_GetMaterialType");
static_assert(offsetof(BP_HouseDecalBase_C_GetMaterialType, MaterialType) == 0x000000, "Member 'BP_HouseDecalBase_C_GetMaterialType::MaterialType' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.Hit Cosmetics
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseDecalBase_C_Hit_Cosmetics final
{
public:
	class APawn*                                  Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_Hit_Cosmetics) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_Hit_Cosmetics");
static_assert(sizeof(BP_HouseDecalBase_C_Hit_Cosmetics) == 0x000008, "Wrong size on BP_HouseDecalBase_C_Hit_Cosmetics");
static_assert(offsetof(BP_HouseDecalBase_C_Hit_Cosmetics, Causer) == 0x000000, "Member 'BP_HouseDecalBase_C_Hit_Cosmetics::Causer' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.HitInterface
// 0x0018 (0x0018 - 0x0000)
struct BP_HouseDecalBase_C_HitInterface final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_HitInterface) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_HitInterface");
static_assert(sizeof(BP_HouseDecalBase_C_HitInterface) == 0x000018, "Wrong size on BP_HouseDecalBase_C_HitInterface");
static_assert(offsetof(BP_HouseDecalBase_C_HitInterface, Direction) == 0x000000, "Member 'BP_HouseDecalBase_C_HitInterface::Direction' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.ImpactCosmetics
// 0x0048 (0x0048 - 0x0000)
struct BP_HouseDecalBase_C_ImpactCosmetics final
{
public:
	class APawn*                                  ImpactCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                ImpactEffect;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x003C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedAttributes;                                 // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_ImpactCosmetics) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_ImpactCosmetics");
static_assert(sizeof(BP_HouseDecalBase_C_ImpactCosmetics) == 0x000048, "Wrong size on BP_HouseDecalBase_C_ImpactCosmetics");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, ImpactCauser) == 0x000000, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::ImpactCauser' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, Location) == 0x000008, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::Location' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, HitImpulse) == 0x000020, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::HitImpulse' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, ImpactEffect) == 0x000038, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::ImpactEffect' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, BoneName) == 0x00003C, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::BoneName' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ImpactCosmetics, ChangedAttributes) == 0x000044, "Member 'BP_HouseDecalBase_C_ImpactCosmetics::ChangedAttributes' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.MeleeHit
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseDecalBase_C_MeleeHit final
{
public:
	const class AActor*                           AttackingActor;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_MeleeHit) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_MeleeHit");
static_assert(sizeof(BP_HouseDecalBase_C_MeleeHit) == 0x000008, "Wrong size on BP_HouseDecalBase_C_MeleeHit");
static_assert(offsetof(BP_HouseDecalBase_C_MeleeHit, AttackingActor) == 0x000000, "Member 'BP_HouseDecalBase_C_MeleeHit::AttackingActor' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.OnDamaged
// 0x0370 (0x0370 - 0x0000)
struct BP_HouseDecalBase_C_OnDamaged final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     CombatParticipant;                                 // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            KillMethod;                                        // 0x0070(0x02E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector_NetQuantize                    Location;                                          // 0x0358(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_OnDamaged) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_OnDamaged");
static_assert(sizeof(BP_HouseDecalBase_C_OnDamaged) == 0x000370, "Wrong size on BP_HouseDecalBase_C_OnDamaged");
static_assert(offsetof(BP_HouseDecalBase_C_OnDamaged, Delta) == 0x000000, "Member 'BP_HouseDecalBase_C_OnDamaged::Delta' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_OnDamaged, Causer) == 0x000008, "Member 'BP_HouseDecalBase_C_OnDamaged::Causer' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_OnDamaged, CombatParticipant) == 0x000010, "Member 'BP_HouseDecalBase_C_OnDamaged::CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_OnDamaged, KillMethod) == 0x000070, "Member 'BP_HouseDecalBase_C_OnDamaged::KillMethod' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_OnDamaged, Location) == 0x000358, "Member 'BP_HouseDecalBase_C_OnDamaged::Location' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.OnHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseDecalBase_C_OnHealthChanged final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_OnHealthChanged) == 0x000004, "Wrong alignment on BP_HouseDecalBase_C_OnHealthChanged");
static_assert(sizeof(BP_HouseDecalBase_C_OnHealthChanged) == 0x000008, "Wrong size on BP_HouseDecalBase_C_OnHealthChanged");
static_assert(offsetof(BP_HouseDecalBase_C_OnHealthChanged, Health) == 0x000000, "Member 'BP_HouseDecalBase_C_OnHealthChanged::Health' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_OnHealthChanged, MaxHealth) == 0x000004, "Member 'BP_HouseDecalBase_C_OnHealthChanged::MaxHealth' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.RemoveDecalHealth
// 0x0018 (0x0018 - 0x0000)
struct BP_HouseDecalBase_C_RemoveDecalHealth final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_RemoveDecalHealth) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_RemoveDecalHealth");
static_assert(sizeof(BP_HouseDecalBase_C_RemoveDecalHealth) == 0x000018, "Wrong size on BP_HouseDecalBase_C_RemoveDecalHealth");
static_assert(offsetof(BP_HouseDecalBase_C_RemoveDecalHealth, Amount) == 0x000000, "Member 'BP_HouseDecalBase_C_RemoveDecalHealth::Amount' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_RemoveDecalHealth, CallFunc_IsServer_ReturnValue) == 0x000008, "Member 'BP_HouseDecalBase_C_RemoveDecalHealth::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_RemoveDecalHealth, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'BP_HouseDecalBase_C_RemoveDecalHealth::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_RemoveDecalHealth, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_HouseDecalBase_C_RemoveDecalHealth::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.Score
// 0x0001 (0x0001 - 0x0000)
struct BP_HouseDecalBase_C_Score final
{
public:
	bool                                          GainScore;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_Score) == 0x000001, "Wrong alignment on BP_HouseDecalBase_C_Score");
static_assert(sizeof(BP_HouseDecalBase_C_Score) == 0x000001, "Wrong size on BP_HouseDecalBase_C_Score");
static_assert(offsetof(BP_HouseDecalBase_C_Score, GainScore) == 0x000000, "Member 'BP_HouseDecalBase_C_Score::GainScore' has a wrong offset!");

// Function BP_HouseDecalBase.BP_HouseDecalBase_C.ShowScoreNotification
// 0x0028 (0x0028 - 0x0000)
struct BP_HouseDecalBase_C_ShowScoreNotification final
{
public:
	bool                                          AddScore;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseDecalBase_C_ShowScoreNotification) == 0x000008, "Wrong alignment on BP_HouseDecalBase_C_ShowScoreNotification");
static_assert(sizeof(BP_HouseDecalBase_C_ShowScoreNotification) == 0x000028, "Wrong size on BP_HouseDecalBase_C_ShowScoreNotification");
static_assert(offsetof(BP_HouseDecalBase_C_ShowScoreNotification, AddScore) == 0x000000, "Member 'BP_HouseDecalBase_C_ShowScoreNotification::AddScore' has a wrong offset!");
static_assert(offsetof(BP_HouseDecalBase_C_ShowScoreNotification, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_HouseDecalBase_C_ShowScoreNotification::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
