#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IndoorTrashcan

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_IndoorTrashcan.BP_IndoorTrashcan_C.BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_IndoorTrashcan.BP_IndoorTrashcan_C.BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_IndoorTrashcan_C_BndEvt__BP_Trashcan_Capsule_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_IndoorTrashcan.BP_IndoorTrashcan_C.ExecuteUbergraph_BP_IndoorTrashcan
// 0x01D0 (0x01D0 - 0x0000)
struct BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0008(0x0038)(ConstParm, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCollectEffectLocation_SpawnLocation;   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0098(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GarbageItem_C*                      K2Node_DynamicCast_AsBP_Garbage_Item;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan) == 0x000008, "Wrong alignment on BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan");
static_assert(sizeof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan) == 0x0001D0, "Wrong size on BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, EntryPoint) == 0x000000, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_GetTeam_ReturnValue) == 0x000008, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_GetCollectEffectLocation_SpawnLocation) == 0x000050, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_GetCollectEffectLocation_SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000070, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000078, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000080, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000088, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000090, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_bFromSweep) == 0x000094, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_SweepResult) == 0x000098, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000190, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherActor) == 0x000198, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherComp) == 0x0001A0, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001A8, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_DynamicCast_AsBP_Garbage_Item) == 0x0001B0, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_DynamicCast_AsBP_Garbage_Item' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B9, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_Not_PreBool_ReturnValue) == 0x0001BA, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_IsValid_ReturnValue) == 0x0001BB, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_HasAuthority_ReturnValue) == 0x0001BC, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001BD, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_IsBeingHeld_ReturnValue) == 0x0001BE, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001C0, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_IsBeingHeld_ReturnValue_1) == 0x0001C8, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_IsBeingHeld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_IsValid_ReturnValue_1) == 0x0001C9, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001CA, "Member 'BP_IndoorTrashcan_C_ExecuteUbergraph_BP_IndoorTrashcan::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function BP_IndoorTrashcan.BP_IndoorTrashcan_C.GetCollectEffectLocation
// 0x0090 (0x0090 - 0x0000)
struct BP_IndoorTrashcan_C_GetCollectEffectLocation final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndoorTrashcan_C_GetCollectEffectLocation) == 0x000008, "Wrong alignment on BP_IndoorTrashcan_C_GetCollectEffectLocation");
static_assert(sizeof(BP_IndoorTrashcan_C_GetCollectEffectLocation) == 0x000090, "Wrong size on BP_IndoorTrashcan_C_GetCollectEffectLocation");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, SpawnLocation) == 0x000000, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, CallFunc_GetUpVector_ReturnValue) == 0x000018, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000048, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_GetCollectEffectLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_IndoorTrashcan_C_GetCollectEffectLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_IndoorTrashcan.BP_IndoorTrashcan_C.SetGarbageCollectionPath
// 0x0050 (0x0050 - 0x0000)
struct BP_IndoorTrashcan_C_SetGarbageCollectionPath final
{
public:
	class ABP_GarbageItem_C*                      Garbage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IndoorTrashcan_C_SetGarbageCollectionPath) == 0x000008, "Wrong alignment on BP_IndoorTrashcan_C_SetGarbageCollectionPath");
static_assert(sizeof(BP_IndoorTrashcan_C_SetGarbageCollectionPath) == 0x000050, "Wrong size on BP_IndoorTrashcan_C_SetGarbageCollectionPath");
static_assert(offsetof(BP_IndoorTrashcan_C_SetGarbageCollectionPath, Garbage) == 0x000000, "Member 'BP_IndoorTrashcan_C_SetGarbageCollectionPath::Garbage' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_SetGarbageCollectionPath, CallFunc_GetActorScale3D_ReturnValue) == 0x000008, "Member 'BP_IndoorTrashcan_C_SetGarbageCollectionPath::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_SetGarbageCollectionPath, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_IndoorTrashcan_C_SetGarbageCollectionPath::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IndoorTrashcan_C_SetGarbageCollectionPath, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_IndoorTrashcan_C_SetGarbageCollectionPath::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

}

