#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IWPhysicalHitComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.CheckIfCharacterIsDead
// 0x0020 (0x0020 - 0x0000)
struct BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead final
{
public:
	bool                                          Dead;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead) == 0x000008, "Wrong alignment on BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead) == 0x000020, "Wrong size on BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead, Dead) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead::Dead' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000010, "Member 'BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_IWPhysicalHitComponent_C_CheckIfCharacterIsDead::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.ExecuteUbergraph_BP_IWPhysicalHitComponent
// 0x03E8 (0x03E8 - 0x0000)
struct BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x01F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   K2Node_CustomEvent_Bone;                           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x0320(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0374(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x03A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x03B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7[0x1];                                      // 0x03B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast_1;  // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast_2;  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent) == 0x000008, "Wrong alignment on BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent) == 0x0003E8, "Wrong size on BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, EntryPoint) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_18) == 0x000004, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000010, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_17) == 0x00002C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_17' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_16) == 0x000034, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_15) == 0x00004C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, Temp_name_Variable) == 0x000064, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_14) == 0x00007C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_13) == 0x000084, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00008C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_12) == 0x00009C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_11) == 0x0000B4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000BC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_10) == 0x0000CC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000D4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, Temp_name_Variable_1) == 0x0000E4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000EC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_9) == 0x0000FC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_8) == 0x000104, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_9) == 0x00010C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_7) == 0x00011C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_10) == 0x000124, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_6) == 0x000134, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_11) == 0x00013C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_5) == 0x00014C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_12) == 0x000154, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, Temp_name_Variable_2) == 0x000164, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_13) == 0x00016C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_4) == 0x00017C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_3) == 0x000184, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_14) == 0x00018C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_15) == 0x00019C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_2) == 0x0001AC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_1) == 0x0001B4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_16) == 0x0001BC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_17) == 0x0001CC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName) == 0x0001DC, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, Temp_name_Variable_3) == 0x0001E4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_Hit) == 0x0001F0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_Bone) == 0x0002E8, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_Bone' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_HitLocation) == 0x0002F0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_Normal_ReturnValue) == 0x000308, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_18) == 0x000320, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000330, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_Event_DeltaSeconds) == 0x000348, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_GetOwner_ReturnValue) == 0x000350, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_DynamicCast_AsBP_Movement_Character) == 0x000358, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_DynamicCast_AsBP_Movement_Character' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000368, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_IsValid_ReturnValue_1) == 0x000370, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CustomEvent_NotifyName_19) == 0x000374, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CustomEvent_NotifyName_19' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000380, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_BreakRotator_Roll) == 0x000398, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_BreakRotator_Pitch) == 0x00039C, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_BreakRotator_Yaw) == 0x0003A0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, K2Node_CreateDelegate_OutputDelegate_19) == 0x0003A4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0003B4, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x0003B5, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_ReturnValue_2) == 0x0003B6, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x0003B8, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3) == 0x0003C0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_IsValid_ReturnValue_2) == 0x0003C8, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_IsValid_ReturnValue_3) == 0x0003C9, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x0003D0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_Value_ImplicitCast_1) == 0x0003D8, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent, CallFunc_InRange_FloatFloat_Value_ImplicitCast_2) == 0x0003E0, "Member 'BP_IWPhysicalHitComponent_C_ExecuteUbergraph_BP_IWPhysicalHitComponent::CallFunc_InRange_FloatFloat_Value_ImplicitCast_2' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.HitReaction
// 0x0118 (0x0118 - 0x0000)
struct BP_IWPhysicalHitComponent_C_HitReaction final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   bone_0;                                            // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0100(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_HitReaction) == 0x000008, "Wrong alignment on BP_IWPhysicalHitComponent_C_HitReaction");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_HitReaction) == 0x000118, "Wrong size on BP_IWPhysicalHitComponent_C_HitReaction");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_HitReaction, Hit) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_HitReaction::Hit' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_HitReaction, bone_0) == 0x0000F8, "Member 'BP_IWPhysicalHitComponent_C_HitReaction::bone_0' has a wrong offset!");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_HitReaction, HitLocation) == 0x000100, "Member 'BP_IWPhysicalHitComponent_C_HitReaction::HitLocation' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnBlendOut_198DBF694DD37CB7161C70A966AA9D49
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnBlendOut_198DBF694DD37CB7161C70A966AA9D49::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnBlendOut_1ED3BE07422F964A71FAD1B7692CB91E::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnBlendOut_9ADA364E4DCF5865D1AD72AFD6F6616F::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnBlendOut_FB076E644545CCC0733C448FC0FE309C
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnBlendOut_FB076E644545CCC0733C448FC0FE309C::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnCompleted_198DBF694DD37CB7161C70A966AA9D49
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnCompleted_198DBF694DD37CB7161C70A966AA9D49::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnCompleted_1ED3BE07422F964A71FAD1B7692CB91E::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnCompleted_9ADA364E4DCF5865D1AD72AFD6F6616F::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnCompleted_FB076E644545CCC0733C448FC0FE309C
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnCompleted_FB076E644545CCC0733C448FC0FE309C::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnInterrupted_198DBF694DD37CB7161C70A966AA9D49
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnInterrupted_198DBF694DD37CB7161C70A966AA9D49::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnInterrupted_1ED3BE07422F964A71FAD1B7692CB91E::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnInterrupted_9ADA364E4DCF5865D1AD72AFD6F6616F::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnInterrupted_FB076E644545CCC0733C448FC0FE309C
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnInterrupted_FB076E644545CCC0733C448FC0FE309C::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyBegin_198DBF694DD37CB7161C70A966AA9D49::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyBegin_1ED3BE07422F964A71FAD1B7692CB91E::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyBegin_9ADA364E4DCF5865D1AD72AFD6F6616F::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyBegin_FB076E644545CCC0733C448FC0FE309C::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyEnd_198DBF694DD37CB7161C70A966AA9D49::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000004, "Wrong alignment on BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(sizeof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E) == 0x000008, "Wrong size on BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E");
static_assert(offsetof(BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E, NotifyName) == 0x000000, "Member 'BP_IWPhysicalHitComponent_C_OnNotifyEnd_1ED3BE07422F964A71FAD1B7692CB91E::NotifyName' has a wrong offset!");

// Function BP_IWPhysicalHitComponent.BP_IWPhysicalHitComponent_C.OnNotifyEnd_9ADA364E4DCF5865D1AD72AFD6F6616F
// 0x0008 (0x0008 - 0x0000)
struct BP_IWPhysicalHitComponent_C_OnNotifyEnd_9ADA364E4DCF5865D1AD72AFD6F6616F final
{
public:
