#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IncomeNotificationManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_IncomeNotificationManager.BP_IncomeNotificationManager_C.AllowedToShow
// 0x00C8 (0x00C8 - 0x0000)
struct BP_IncomeNotificationManager_C_AllowedToShow final
{
public:
	double                                        Score;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowNotification;                                  // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0038(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamIDFromPawn_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamIDFromPawn_ReturnValue_1;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotificationManager_C_AllowedToShow) == 0x000008, "Wrong alignment on BP_IncomeNotificationManager_C_AllowedToShow");
static_assert(sizeof(BP_IncomeNotificationManager_C_AllowedToShow) == 0x0000C8, "Wrong size on BP_IncomeNotificationManager_C_AllowedToShow");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, Score) == 0x000000, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::Score' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, TeamId) == 0x000008, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::TeamId' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, Location) == 0x000010, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::Location' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, ShowNotification) == 0x000028, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::ShowNotification' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000029, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x00002C, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000038, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000070, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000071, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000078, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000081, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000082, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetPlayerController_ReturnValue) == 0x000088, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000090, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_K2_GetPawn_ReturnValue) == 0x000098, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetTeamIDFromPawn_ReturnValue) == 0x0000A1, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetTeamIDFromPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A8, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_K2_GetPawn_ReturnValue_1) == 0x0000B8, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_GetTeamIDFromPawn_ReturnValue_1) == 0x0000C1, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_GetTeamIDFromPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C2, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C3, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_BooleanAND_ReturnValue_2) == 0x0000C4, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_AllowedToShow, CallFunc_BooleanAND_ReturnValue_3) == 0x0000C5, "Member 'BP_IncomeNotificationManager_C_AllowedToShow::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function BP_IncomeNotificationManager.BP_IncomeNotificationManager_C.ExecuteUbergraph_BP_IncomeNotificationManager
// 0x00E0 (0x00E0 - 0x0000)
struct BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_IncomeNotification_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Score;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_TeamID;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowedToShow_ShowNotification;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_IncomeNotification_C*               CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager) == 0x000010, "Wrong alignment on BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager");
static_assert(sizeof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager) == 0x0000E0, "Wrong size on BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, EntryPoint) == 0x000000, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000070, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, K2Node_CustomEvent_Location) == 0x000088, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, K2Node_CustomEvent_Score) == 0x0000A0, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::K2Node_CustomEvent_Score' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, K2Node_CustomEvent_TeamID) == 0x0000A8, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::K2Node_CustomEvent_TeamID' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_AllowedToShow_ShowNotification) == 0x0000B0, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_AllowedToShow_ShowNotification' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, Temp_int_Variable) == 0x0000B4, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_IncomeNotificationManager_C_ExecuteUbergraph_BP_IncomeNotificationManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_IncomeNotificationManager.BP_IncomeNotificationManager_C.IsLocationSameTeamAsLocalPlayer
// 0x00A0 (0x00A0 - 0x0000)
struct BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         OptionalTeamID;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0038(0x0038)(ConstParm, NoDestructor)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamIDFromPawn_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamIDFromPawn_ReturnValue_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer) == 0x000008, "Wrong alignment on BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer");
static_assert(sizeof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer) == 0x0000A0, "Wrong size on BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, Point) == 0x000000, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::Point' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, OptionalTeamID) == 0x000018, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::OptionalTeamID' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, ReturnValue) == 0x000019, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000028, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x00002C, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000038, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_K2_GetPawn_ReturnValue) == 0x000070, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetTeamIDFromPawn_ReturnValue) == 0x000078, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetTeamIDFromPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetPlayerController_ReturnValue_1) == 0x000080, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000088, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000090, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000098, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_GetTeamIDFromPawn_ReturnValue_1) == 0x000099, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_GetTeamIDFromPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00009A, "Member 'BP_IncomeNotificationManager_C_IsLocationSameTeamAsLocalPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function BP_IncomeNotificationManager.BP_IncomeNotificationManager_C.Play Income Notification
// 0x0028 (0x0028 - 0x0000)
struct BP_IncomeNotificationManager_C_Play_Income_Notification final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotificationManager_C_Play_Income_Notification) == 0x000008, "Wrong alignment on BP_IncomeNotificationManager_C_Play_Income_Notification");
static_assert(sizeof(BP_IncomeNotificationManager_C_Play_Income_Notification) == 0x000028, "Wrong size on BP_IncomeNotificationManager_C_Play_Income_Notification");
static_assert(offsetof(BP_IncomeNotificationManager_C_Play_Income_Notification, Location) == 0x000000, "Member 'BP_IncomeNotificationManager_C_Play_Income_Notification::Location' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotificationManager_C_Play_Income_Notification, Score) == 0x000018, "Member 'BP_IncomeNotificationManager_C_Play_Income_Notification::Score' has a wrong offset!");
