#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IncomeNotificationManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IncomeNotificationManager.BP_IncomeNotificationManager_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_IncomeNotificationManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_IncomeNotification_C*>       IncomeNotifications;                               // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         CurrentNotification;                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AllowedToShow(double Score, uint8 TeamId, const struct FVector& Location, bool* ShowNotification);
	void ExecuteUbergraph_BP_IncomeNotificationManager(int32 EntryPoint);
	bool IsLocationSameTeamAsLocalPlayer(const struct FVector& Point, uint8 OptionalTeamID);
	void Play_Income_Notification(const struct FVector& Location, double Score, uint8 TeamId);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IncomeNotificationManager_C">();
	}
	static class ABP_IncomeNotificationManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IncomeNotificationManager_C>();
	}
};
static_assert(alignof(ABP_IncomeNotificationManager_C) == 0x000008, "Wrong alignment on ABP_IncomeNotificationManager_C");
static_assert(sizeof(ABP_IncomeNotificationManager_C) == 0x0002C0, "Wrong size on ABP_IncomeNotificationManager_C");
static_assert(offsetof(ABP_IncomeNotificationManager_C, UberGraphFrame) == 0x000290, "Member 'ABP_IncomeNotificationManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IncomeNotificationManager_C, Billboard) == 0x000298, "Member 'ABP_IncomeNotificationManager_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_IncomeNotificationManager_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_IncomeNotificationManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_IncomeNotificationManager_C, IncomeNotifications) == 0x0002A8, "Member 'ABP_IncomeNotificationManager_C::IncomeNotifications' has a wrong offset!");
static_assert(offsetof(ABP_IncomeNotificationManager_C, CurrentNotification) == 0x0002B8, "Member 'ABP_IncomeNotificationManager_C::CurrentNotification' has a wrong offset!");

}

