#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JP_PP

#include "Basic.hpp"

#include "S_Lighting_Preset_structs.hpp"


namespace SDK::Params
{

// Function BP_JP_PP.BP_JP_PP_C.ExecuteUbergraph_BP_JP_PP
// 0x0790 (0x0790 - 0x0000)
struct BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Lighting_Preset                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0760)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP) == 0x000010, "Wrong alignment on BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP");
static_assert(sizeof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP) == 0x000790, "Wrong size on BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP");
static_assert(offsetof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP, EntryPoint) == 0x000000, "Member 'BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000780, "Member 'BP_JP_PP_C_ExecuteUbergraph_BP_JP_PP::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_JP_PP.BP_JP_PP_C.UserConstructionScript
// 0x0790 (0x0790 - 0x0000)
struct BP_JP_PP_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Lighting_Preset                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0760)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JP_PP_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_JP_PP_C_UserConstructionScript");
static_assert(sizeof(BP_JP_PP_C_UserConstructionScript) == 0x000790, "Wrong size on BP_JP_PP_C_UserConstructionScript");
static_assert(offsetof(BP_JP_PP_C_UserConstructionScript, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000000, "Member 'BP_JP_PP_C_UserConstructionScript::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'BP_JP_PP_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_JP_PP_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_JP_PP_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000780, "Member 'BP_JP_PP_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

