#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JPUIControllerBase

#include "Basic.hpp"

#include "CommonGame_structs.hpp"
#include "Engine_structs.hpp"
#include "IWOnlineServices_structs.hpp"


namespace SDK::Params
{

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.ExecuteUbergraph_BP_JPUIControllerBase
// 0x0378 (0x0378 - 0x0000)
struct BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message_2;                      // 0x0008(0x0010)(ConstParm)
	class UAsyncAction_LoginWithInitialization*   CallFunc_LoginWithInitialization_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result_1;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ErrorMessage, const class FString& ErrorCode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage_2;                 // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorCode_2;                    // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage_1;                 // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorCode_1;                    // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, const class FString& ErrorCode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorCode;                      // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, const class FString& ErrorCode)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAsyncAction_ResolvePartyState*         CallFunc_ResolvePartyState_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_WaitForLoggedIn*           CallFunc_WaitForLoggedIn_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_WaitForClientAuthenticationInitialized* CallFunc_WaitForClientAuthenticationInitialized_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlaytestEnded_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_WaitForLoadingScreenToHide* CallFunc_WaitForLoadingScreenToHide_ReturnValue;   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable_1;                              // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingScreenManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULoadingScreenManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULoadingScreenManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x01B0(0x0010)()
	bool                                          CallFunc_TryJoinRequestedSession_ReturnValue;      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_1;     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Messaging;                      // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0208(0x0010)()
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate_10;           // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonGameDialogDescriptor*            CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationCustom_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsLoggedIn_ReturnValue;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0258(0x0010)(ConstParm)
	class UGameInstanceJP*                        K2Node_DynamicCast_AsGame_Instance_JP;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimaryGameLayout*                     CallFunc_GetPrimaryGameLayoutForPrimaryPlayer_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsLoggedIn_ReturnValue_1;              // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EClientIdentityLoginState                     CallFunc_GetClientLoginState_ReturnValue;          // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate_11;           // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message_1;                      // 0x0298(0x0010)(ConstParm)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MainMenuTabManager_C*               CallFunc_GetActorOfClass_ReturnValue;              // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLaunchOption_ReturnValue;              // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate_13;           // 0x02D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_2;                 // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_3;                 // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Message;                              // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0338(0x0010)()
	class UCommonGameDialogDescriptor*            CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue_1; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationCustom_ReturnValue_1;     // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name_4;                 // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase");
static_assert(sizeof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase) == 0x000378, "Wrong size on BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, EntryPoint) == 0x000000, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Message_2) == 0x000008, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_LoginWithInitialization_ReturnValue) == 0x000018, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_LoginWithInitialization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Result_1) == 0x000031, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, Temp_byte_Variable) == 0x000032, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorMessage_2) == 0x000048, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorMessage_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorCode_2) == 0x000058, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorCode_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorMessage_1) == 0x000068, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorMessage_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorCode_1) == 0x000078, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorMessage) == 0x000098, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_ErrorCode) == 0x0000A8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, Temp_string_Variable) == 0x0000C8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, Temp_string_Variable_1) == 0x0000D8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_ResolvePartyState_ReturnValue) == 0x0000E8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_ResolvePartyState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_WaitForLoggedIn_ReturnValue) == 0x000108, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_WaitForLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x000110, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_WaitForClientAuthenticationInitialized_ReturnValue) == 0x000128, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_WaitForClientAuthenticationInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000130, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_HasPlaytestEnded_ReturnValue) == 0x000138, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_HasPlaytestEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_3) == 0x000139, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000140, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x000148, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_WaitForLoadingScreenToHide_ReturnValue) == 0x000158, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_WaitForLoadingScreenToHide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x000160, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_4) == 0x000170, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Result) == 0x000171, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, Temp_byte_Variable_1) == 0x000172, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000174, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x000184, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000198, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001A0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0001A8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, Temp_text_Variable) == 0x0001B0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_TryJoinRequestedSession_ReturnValue) == 0x0001C0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_TryJoinRequestedSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Conv_TextToString_ReturnValue) == 0x0001C8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPlayerController_ReturnValue) == 0x0001D8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x0001E0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001E8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_PushWidgetToLayerStack_ReturnValue_1) == 0x0001F0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_PushWidgetToLayerStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Messaging) == 0x0001F8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Messaging' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000208, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x000218, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue) == 0x000228, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_ShowConfirmationCustom_ReturnValue) == 0x000230, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_ShowConfirmationCustom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_5) == 0x000238, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPlayerController_ReturnValue_2) == 0x000240, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_K2_IsLoggedIn_ReturnValue) == 0x000248, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_K2_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetGameInstance_ReturnValue) == 0x000250, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Message) == 0x000258, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_DynamicCast_AsGame_Instance_JP) == 0x000268, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_DynamicCast_AsGame_Instance_JP' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPrimaryGameLayoutForPrimaryPlayer_ReturnValue) == 0x000278, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPrimaryGameLayoutForPrimaryPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_6) == 0x000280, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_K2_IsLoggedIn_ReturnValue_1) == 0x000281, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_K2_IsLoggedIn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetClientLoginState_ReturnValue) == 0x000282, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetClientLoginState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_11) == 0x000284, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_SwitchEnum_CmpSuccess) == 0x000294, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CustomEvent_Message_1) == 0x000298, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_Event_EndPlayReason) == 0x0002A8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetActorOfClass_ReturnValue) == 0x0002B0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_12) == 0x0002B8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002C8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetIsPie_ReturnValue) == 0x0002D0, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_HasLaunchOption_ReturnValue) == 0x0002D1, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_HasLaunchOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_CreateDelegate_OutputDelegate_13) == 0x0002D4, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_BooleanOR_ReturnValue) == 0x0002E4, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Get_ClassLog_Name_name) == 0x0002E8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Get_ClassLog_Name_name_1) == 0x0002F8, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Get_ClassLog_Name_name_2) == 0x000308, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Get_ClassLog_Name_name_2' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Get_ClassLog_Name_name_3) == 0x000318, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Get_ClassLog_Name_name_3' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, K2Node_Event_Message) == 0x000328, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000338, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue_1) == 0x000348, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetClientGameInitializationFailedDescriptor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_ShowConfirmationCustom_ReturnValue_1) == 0x000350, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_ShowConfirmationCustom_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_GetPlayerController_ReturnValue_4) == 0x000358, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_IsValid_ReturnValue_7) == 0x000360, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase, CallFunc_Get_ClassLog_Name_name_4) == 0x000368, "Member 'BP_JPUIControllerBase_C_ExecuteUbergraph_BP_JPUIControllerBase::CallFunc_Get_ClassLog_Name_name_4' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.HandleInitializationFailed
// 0x0010 (0x0010 - 0x0000)
struct BP_JPUIControllerBase_C_HandleInitializationFailed final
{
public:
	class FString                                 Messaging;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_HandleInitializationFailed) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_HandleInitializationFailed");
static_assert(sizeof(BP_JPUIControllerBase_C_HandleInitializationFailed) == 0x000010, "Wrong size on BP_JPUIControllerBase_C_HandleInitializationFailed");
static_assert(offsetof(BP_JPUIControllerBase_C_HandleInitializationFailed, Messaging) == 0x000000, "Member 'BP_JPUIControllerBase_C_HandleInitializationFailed::Messaging' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.IsFirstPlayerLoggedIn
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn final
{
public:
	bool                                          IsFirstPlayerLoggedIn_0;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UCommonUserInfo*                  CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn");
static_assert(sizeof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, IsFirstPlayerLoggedIn_0) == 0x000000, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::IsFirstPlayerLoggedIn_0' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue) == 0x000010, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_JPUIControllerBase_C_IsFirstPlayerLoggedIn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnError_DE92C3084071DF154BE5D6954DD0000F
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ErrorCode;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F, ErrorMessage) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F::ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F, ErrorCode) == 0x000010, "Member 'BP_JPUIControllerBase_C_OnError_DE92C3084071DF154BE5D6954DD0000F::ErrorCode' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnEulaError
// 0x0010 (0x0010 - 0x0000)
struct BP_JPUIControllerBase_C_OnEulaError final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnEulaError) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnEulaError");
static_assert(sizeof(BP_JPUIControllerBase_C_OnEulaError) == 0x000010, "Wrong size on BP_JPUIControllerBase_C_OnEulaError");
static_assert(offsetof(BP_JPUIControllerBase_C_OnEulaError, Message) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnEulaError::Message' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnFailed_1D8DE6434084EC2678B5CFB5325E136F
// 0x0010 (0x0010 - 0x0000)
struct BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F) == 0x000010, "Wrong size on BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F, Message) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnFailed_1D8DE6434084EC2678B5CFB5325E136F::Message' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnFinished_1D8DE6434084EC2678B5CFB5325E136F
// 0x0010 (0x0010 - 0x0000)
struct BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F) == 0x000010, "Wrong size on BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F, Message) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnFinished_1D8DE6434084EC2678B5CFB5325E136F::Message' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnFoundParty_DE92C3084071DF154BE5D6954DD0000F
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ErrorCode;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F, ErrorMessage) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F::ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F, ErrorCode) == 0x000010, "Member 'BP_JPUIControllerBase_C_OnFoundParty_DE92C3084071DF154BE5D6954DD0000F::ErrorCode' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnNoParty_DE92C3084071DF154BE5D6954DD0000F
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ErrorCode;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F, ErrorMessage) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F::ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F, ErrorCode) == 0x000010, "Member 'BP_JPUIControllerBase_C_OnNoParty_DE92C3084071DF154BE5D6954DD0000F::ErrorCode' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772
// 0x0001 (0x0001 - 0x0000)
struct BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772 final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772) == 0x000001, "Wrong alignment on BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772");
static_assert(sizeof(BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772) == 0x000001, "Wrong size on BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772");
static_assert(offsetof(BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772, Result) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnResult_292EF5DE4C6D1336F2B8BF9D8A1CC772::Result' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnResult_AD2F26B34712637F5E9155B6299981CC
// 0x0001 (0x0001 - 0x0000)
struct BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC) == 0x000001, "Wrong alignment on BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC");
static_assert(sizeof(BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC) == 0x000001, "Wrong size on BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC");
static_assert(offsetof(BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC, Result) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnResult_AD2F26B34712637F5E9155B6299981CC::Result' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F
// 0x0010 (0x0010 - 0x0000)
struct BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(sizeof(BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F) == 0x000010, "Wrong size on BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F");
static_assert(offsetof(BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F, Message) == 0x000000, "Member 'BP_JPUIControllerBase_C_OnStepUpdate_1D8DE6434084EC2678B5CFB5325E136F::Message' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_JPUIControllerBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_JPUIControllerBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_JPUIControllerBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_JPUIControllerBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_JPUIControllerBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_JPUIControllerBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.ShowIWLogoWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_ShowIWLogoWidget final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_ShowIWLogoWidget) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_ShowIWLogoWidget");
static_assert(sizeof(BP_JPUIControllerBase_C_ShowIWLogoWidget) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_ShowIWLogoWidget");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowIWLogoWidget, Delegate) == 0x000000, "Member 'BP_JPUIControllerBase_C_ShowIWLogoWidget::Delegate' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowIWLogoWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_JPUIControllerBase_C_ShowIWLogoWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowIWLogoWidget, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000018, "Member 'BP_JPUIControllerBase_C_ShowIWLogoWidget::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");

// Function BP_JPUIControllerBase.BP_JPUIControllerBase_C.ShowOtherLogoWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_JPUIControllerBase_C_ShowOtherLogoWidget final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JPUIControllerBase_C_ShowOtherLogoWidget) == 0x000008, "Wrong alignment on BP_JPUIControllerBase_C_ShowOtherLogoWidget");
static_assert(sizeof(BP_JPUIControllerBase_C_ShowOtherLogoWidget) == 0x000020, "Wrong size on BP_JPUIControllerBase_C_ShowOtherLogoWidget");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowOtherLogoWidget, Delegate) == 0x000000, "Member 'BP_JPUIControllerBase_C_ShowOtherLogoWidget::Delegate' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowOtherLogoWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_JPUIControllerBase_C_ShowOtherLogoWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JPUIControllerBase_C_ShowOtherLogoWidget, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000018, "Member 'BP_JPUIControllerBase_C_ShowOtherLogoWidget::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");

