#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LobbyV3_HouseWorldSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot
// 0x0470 (0x0470 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_HouseID;                        // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHouseDefinition*                       K2Node_CustomEvent_HouseDefinition;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_SoftHouseDefinition;            // 0x0048(0x0028)(HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP*                           CallFunc_GetGameStateJP_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  K2Node_CustomEvent_affectedTeam;                   // 0x0098(0x0038)(ConstParm, NoDestructor)
	TDelegate<void(struct FTeam& AffectedTeam)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_HousePreviewActorClass;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHousePreviewActorBase*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetHouseIdForTeamOrDefault_HouseId;       // 0x0164(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0248(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FWrap_ReturnValue;                        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0310(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0370(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot) == 0x000010, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot) == 0x000470, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, EntryPoint) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000004, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x000008, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x000030, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000031, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, Temp_bool_Has_Been_Initd_Variable) == 0x000032, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_HouseID) == 0x000034, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_HouseID' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_HouseDefinition) == 0x000040, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_HouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_SoftHouseDefinition) == 0x000048, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_SoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_Loaded_1) == 0x000070, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000078, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_GetGameStateJP_ReturnValue) == 0x000090, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_GetGameStateJP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_affectedTeam) == 0x000098, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_affectedTeam' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_HousePreviewActorClass) == 0x0000E0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_HousePreviewActorClass' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000E9, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, Temp_bool_IsClosed_Variable) == 0x000161, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000162, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000163, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_GetHouseIdForTeamOrDefault_HouseId) == 0x000164, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_GetHouseIdForTeamOrDefault_HouseId' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x00016C, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_GetPlayerController_ReturnValue) == 0x000180, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_Event_DeltaSeconds) == 0x000188, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000190, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_BreakTransform_Location) == 0x0001F0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_BreakTransform_Rotation) == 0x000208, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_BreakTransform_Scale) == 0x000220, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_GetTimeSeconds_ReturnValue) == 0x000238, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, Temp_class_Variable) == 0x000240, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_CustomEvent_Loaded) == 0x000248, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base) == 0x000250, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_ClassDynamicCast_bSuccess) == 0x000258, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000260, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_FWrap_ReturnValue) == 0x000268, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_FWrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000270, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000278, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Sin_ReturnValue) == 0x000280, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000288, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_MakeRotator_ReturnValue) == 0x000290, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0002A8, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_ComposeRotators_ReturnValue) == 0x0002B0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_MakeVector_ReturnValue) == 0x0002C8, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, Temp_object_Variable) == 0x0002E0, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_Add_VectorVector_ReturnValue) == 0x0002E8, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_DynamicCast_AsHouse_Definition) == 0x000300, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_MakeTransform_ReturnValue) == 0x000310, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000370, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000468, "Member 'BP_LobbyV3_HouseWorldSlot_C_ExecuteUbergraph_BP_LobbyV3_HouseWorldSlot::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.GetHouseIdForTeamOrDefault
// 0x0078 (0x0078 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault final
{
public:
	uint8                                         TeamId_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DefaultHouseId_0;                                  // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HouseID;                                           // 0x000C(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTeam>                          CallFunc_GetTeams_ReturnValue;                     // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_Array_Get_Item;                           // 0x0038(0x0038)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault) == 0x000078, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, TeamId_0) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::TeamId_0' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, DefaultHouseId_0) == 0x000004, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::DefaultHouseId_0' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, HouseID) == 0x00000C, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::HouseID' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_GetTeams_ReturnValue) == 0x000020, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'BP_LobbyV3_HouseWorldSlot_C_GetHouseIdForTeamOrDefault::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.HandleTeamChanged
// 0x0038 (0x0038 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged final
{
public:
	struct FTeam                                  AffectedTeam;                                      // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged) == 0x000038, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged, AffectedTeam) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_HandleTeamChanged::AffectedTeam' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.OnLoaded_3ED491094BE92E2CE57DA197593EB2CF
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF) == 0x000008, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF, Loaded) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_OnLoaded_3ED491094BE92E2CE57DA197593EB2CF::Loaded' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB) == 0x000008, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB, Loaded) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_OnLoaded_AF8D0C95462F1CD2F637C3A21235A0BB::Loaded' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_ReceiveTick");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_ReceiveTick) == 0x000004, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_ReceiveTick");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SetHouseDefinition
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition final
{
public:
	class UHouseDefinition*                       HouseDefinition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition) == 0x000008, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition, HouseDefinition) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinition::HouseDefinition' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SetHouseDefinitionAsync
// 0x0028 (0x0028 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        SoftHouseDefinition;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync) == 0x000028, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync, SoftHouseDefinition) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionAsync::SoftHouseDefinition' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SetHouseDefinitionByIdAsync
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync final
{
public:
	struct FGameplayTag                           HouseID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync) == 0x000004, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync) == 0x000008, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync, HouseID) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseDefinitionByIdAsync::HouseID' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SetHouseVisibility
// 0x0003 (0x0003 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility) == 0x000001, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility) == 0x000003, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility, Visible) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility::Visible' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetHouseVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SetQuestionMarkVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility) == 0x000001, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility) == 0x000001, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility, Visible) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SetQuestionMarkVisibility::Visible' has a wrong offset!");

// Function BP_LobbyV3_HouseWorldSlot.BP_LobbyV3_HouseWorldSlot_C.SpawnHousePreviewActor
// 0x0008 (0x0008 - 0x0000)
struct BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor final
{
public:
	class UClass*                                 HousePreviewActorClass;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor) == 0x000008, "Wrong alignment on BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor");
static_assert(sizeof(BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor) == 0x000008, "Wrong size on BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor");
static_assert(offsetof(BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor, HousePreviewActorClass) == 0x000000, "Member 'BP_LobbyV3_HouseWorldSlot_C_SpawnHousePreviewActor::HousePreviewActorClass' has a wrong offset!");

}

