#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MannedCannon_EggBombProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MannedCannon_EggBombProjectile.BP_MannedCannon_EggBombProjectile_C
// 0x0028 (0x0550 - 0x0528)
class ABP_MannedCannon_EggBombProjectile_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MannedCannon_EggBombProjectile_C; // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      P_Projectile_2;                                    // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Radius;                                  // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Explosion_Damage;                                  // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MannedCannon_EggBombProjectile(int32 EntryPoint);
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MannedCannon_EggBombProjectile_C">();
	}
	static class ABP_MannedCannon_EggBombProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MannedCannon_EggBombProjectile_C>();
	}
};
static_assert(alignof(ABP_MannedCannon_EggBombProjectile_C) == 0x000008, "Wrong alignment on ABP_MannedCannon_EggBombProjectile_C");
static_assert(sizeof(ABP_MannedCannon_EggBombProjectile_C) == 0x000550, "Wrong size on ABP_MannedCannon_EggBombProjectile_C");
static_assert(offsetof(ABP_MannedCannon_EggBombProjectile_C, UberGraphFrame_BP_MannedCannon_EggBombProjectile_C) == 0x000528, "Member 'ABP_MannedCannon_EggBombProjectile_C::UberGraphFrame_BP_MannedCannon_EggBombProjectile_C' has a wrong offset!");
static_assert(offsetof(ABP_MannedCannon_EggBombProjectile_C, RotatingMovement) == 0x000530, "Member 'ABP_MannedCannon_EggBombProjectile_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_MannedCannon_EggBombProjectile_C, P_Projectile_2) == 0x000538, "Member 'ABP_MannedCannon_EggBombProjectile_C::P_Projectile_2' has a wrong offset!");
static_assert(offsetof(ABP_MannedCannon_EggBombProjectile_C, Explosion_Radius) == 0x000540, "Member 'ABP_MannedCannon_EggBombProjectile_C::Explosion_Radius' has a wrong offset!");
static_assert(offsetof(ABP_MannedCannon_EggBombProjectile_C, Explosion_Damage) == 0x000548, "Member 'ABP_MannedCannon_EggBombProjectile_C::Explosion_Damage' has a wrong offset!");

}

