#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Magpie_Projectile

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_Magpie_Projectile.BP_Magpie_Projectile_C.ApplyKillAssistedEffect
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Magpie_Projectile_C_ApplyKillAssistedEffect final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              AssistGESpecHandle;                                // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0020(0x0018)()
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     CallFunc_CreateCombatParticipantFromPlayer_ReturnValue; // 0x0058(0x0060)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x00C0(0x0010)()
};
static_assert(alignof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect) == 0x000008, "Wrong alignment on BP_Magpie_Projectile_C_ApplyKillAssistedEffect");
static_assert(sizeof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect) == 0x0000D0, "Wrong size on BP_Magpie_Projectile_C_ApplyKillAssistedEffect");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, TargetASC) == 0x000000, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, AssistGESpecHandle) == 0x000008, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::AssistGESpecHandle' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_GetEffectContext_ReturnValue) == 0x000020, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_GetPawn_ReturnValue) == 0x000038, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000040, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000050, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_CreateCombatParticipantFromPlayer_ReturnValue) == 0x000058, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_CreateCombatParticipantFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0000B8, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_ApplyKillAssistedEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x0000C0, "Member 'BP_Magpie_Projectile_C_ApplyKillAssistedEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");

// Function BP_Magpie_Projectile.BP_Magpie_Projectile_C.CheckImpactAbilitySystemComponents
// 0x0328 (0x0328 - 0x0000)
struct BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Reason;                                            // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Is_Valid;                                          // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Instigator_ASC;                                    // 0x0110(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Target_ASC;                                        // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundValidASCs;                                    // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Hit_Actor_Ability_System_Component;                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Instigator_Ability_System_Component;               // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid;  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid_1; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_1; // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid_2; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_2; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents) == 0x000008, "Wrong alignment on BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents");
static_assert(sizeof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents) == 0x000328, "Wrong size on BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Hit) == 0x000000, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Hit' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Reason) == 0x0000F8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Reason' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Is_Valid) == 0x000108, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Is_Valid' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Instigator_ASC) == 0x000110, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Instigator_ASC' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Target_ASC) == 0x000118, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Target_ASC' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, FoundValidASCs) == 0x000120, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::FoundValidASCs' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Hit_Actor_Ability_System_Component) == 0x000128, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Hit_Actor_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, Instigator_Ability_System_Component) == 0x000130, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::Instigator_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bBlockingHit) == 0x000138, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bInitialOverlap) == 0x000139, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Time) == 0x00013C, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Distance) == 0x000140, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Location) == 0x000148, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Normal) == 0x000178, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_BoneName) == 0x0001C8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitItem) == 0x0001D0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ElementIndex) == 0x0001D4, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_FaceIndex) == 0x0001D8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceStart) == 0x0001E0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceEnd) == 0x0001F8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_GetInstigator_ReturnValue) == 0x000210, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000218, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000219, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Time_1) == 0x00021C, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Distance_1) == 0x000220, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Location_1) == 0x000228, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000240, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Normal_1) == 0x000258, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000270, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_PhysMat_1) == 0x000288, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitActor_1) == 0x000290, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitComponent_1) == 0x000298, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitBoneName_1) == 0x0002A0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_BoneName_1) == 0x0002A8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitItem_1) == 0x0002B0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ElementIndex_1) == 0x0002B4, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_FaceIndex_1) == 0x0002B8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceStart_1) == 0x0002C0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceEnd_1) == 0x0002D8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_is_Valid) == 0x0002F0, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_is_Valid' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component) == 0x0002F8, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_is_Valid_1) == 0x000300, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_is_Valid_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_1) == 0x000308, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_GetInstigator_ReturnValue_1) == 0x000310, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_is_Valid_2) == 0x000318, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_is_Valid_2' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents, CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_2) == 0x000320, "Member 'BP_Magpie_Projectile_C_CheckImpactAbilitySystemComponents::CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_2' has a wrong offset!");

// Function BP_Magpie_Projectile.BP_Magpie_Projectile_C.DamageAppliedCue
// 0x0108 (0x0108 - 0x0000)
struct BP_Magpie_Projectile_C_DamageAppliedCue final
{
public:
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0030(0x00D8)(ContainsInstancedReference)
};
static_assert(alignof(BP_Magpie_Projectile_C_DamageAppliedCue) == 0x000008, "Wrong alignment on BP_Magpie_Projectile_C_DamageAppliedCue");
static_assert(sizeof(BP_Magpie_Projectile_C_DamageAppliedCue) == 0x000108, "Wrong size on BP_Magpie_Projectile_C_DamageAppliedCue");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageAppliedCue, CallFunc_Get_ClassLog_Name_name) == 0x000000, "Member 'BP_Magpie_Projectile_C_DamageAppliedCue::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageAppliedCue, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'BP_Magpie_Projectile_C_DamageAppliedCue::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageAppliedCue, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Magpie_Projectile_C_DamageAppliedCue::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageAppliedCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000030, "Member 'BP_Magpie_Projectile_C_DamageAppliedCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function BP_Magpie_Projectile.BP_Magpie_Projectile_C.DamageTarget
// 0x05C0 (0x05C0 - 0x0000)
struct BP_Magpie_Projectile_C_DamageTarget final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                Instigator_Ability_System_Component;               // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Hit_Actor_Ability_System_Component;                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DamageToDeal;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Remove_this;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Test;                                              // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0120(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSameTeam_Return;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue; // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0240(0x0010)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0250(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0260(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0310(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0338(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0348(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0468(0x0010)()
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0488(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x04D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x04E0(0x0010)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x04F0(0x0020)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetDamage_ReturnValue;                    // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ModifyOutgoingDamageByPerk_ModifiedOutgoingDamage; // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0558(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0568(0x0010)()
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0580(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0594(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x05A0(0x0018)()
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Magpie_Projectile_C_DamageTarget) == 0x000008, "Wrong alignment on BP_Magpie_Projectile_C_DamageTarget");
static_assert(sizeof(BP_Magpie_Projectile_C_DamageTarget) == 0x0005C0, "Wrong size on BP_Magpie_Projectile_C_DamageTarget");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, Hit) == 0x000000, "Member 'BP_Magpie_Projectile_C_DamageTarget::Hit' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, Instigator_Ability_System_Component) == 0x0000F8, "Member 'BP_Magpie_Projectile_C_DamageTarget::Instigator_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, Hit_Actor_Ability_System_Component) == 0x000100, "Member 'BP_Magpie_Projectile_C_DamageTarget::Hit_Actor_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, DamageToDeal) == 0x000108, "Member 'BP_Magpie_Projectile_C_DamageTarget::DamageToDeal' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, Remove_this) == 0x000110, "Member 'BP_Magpie_Projectile_C_DamageTarget::Remove_this' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, Test) == 0x000118, "Member 'BP_Magpie_Projectile_C_DamageTarget::Test' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_MakeEffectContext_ReturnValue) == 0x000120, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_IsSameTeam_Return) == 0x000140, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_IsSameTeam_Return' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_GetInstigator_ReturnValue) == 0x000148, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_ObjectIsA_ReturnValue) == 0x000150, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue) == 0x000158, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_bBlockingHit) == 0x000168, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_bInitialOverlap) == 0x000169, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Time) == 0x00016C, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Distance) == 0x000170, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_ImpactPoint) == 0x000190, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Normal) == 0x0001A8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_BoneName) == 0x0001F8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_HitItem) == 0x000200, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_ElementIndex) == 0x000204, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_FaceIndex) == 0x000208, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_TraceStart) == 0x000210, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_TraceEnd) == 0x000228, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Conv_StringToText_ReturnValue) == 0x000240, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000250, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, K2Node_MakeStruct_FormatArgumentData) == 0x000260, "Member 'BP_Magpie_Projectile_C_DamageTarget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002A8, "Member 'BP_Magpie_Projectile_C_DamageTarget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, K2Node_MakeArray_Array) == 0x0002F0, "Member 'BP_Magpie_Projectile_C_DamageTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Get_ClassLog_Name_name) == 0x000300, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Format_ReturnValue) == 0x000310, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Conv_TextToString_ReturnValue) == 0x000320, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_GetInstigator_ReturnValue_1) == 0x000330, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000338, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, K2Node_MakeStruct_FormatArgumentData_2) == 0x000348, "Member 'BP_Magpie_Projectile_C_DamageTarget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000390, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000391, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Time_1) == 0x000394, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Distance_1) == 0x000398, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Location_1) == 0x0003A0, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003B8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_Normal_1) == 0x0003D0, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003E8, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_PhysMat_1) == 0x000400, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Magpie_Projectile_C_DamageTarget, CallFunc_BreakHitResult_HitActor_1) == 0x000408, "Member 'BP_Magpie_Projectile_C_DamageTarget::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
