#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MessScoreZoneComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C
// 0x0070 (0x05D0 - 0x0560)
class UBP_MessScoreZoneComponent_C final : public UReceptacleComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          NewVar_0;                                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSet<EReceptacleType>                         ReceptacleCategoriesOverride;                      // 0x0570(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UStaticMeshComponent*                   Mesh;                                              // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MessScoreZoneComponent(int32 EntryPoint);
	bool HandleIncomingItem(class UObject* Object);
	bool HandleIncomingItemNoHeldCheck(class UObject* Object);
	bool HandleOutgoingItem(class UObject* Object);
	void HandleOutgoingItemHeldCheck(class UObject* Object, bool* Return);
	void On_Overlap_Begin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ReceiveBeginPlay();
	void RetriggerOverlapBegin(class AActor* MessItem);
	void RetriggerOverlapEnd(class AActor* MessItem);
	void SetVisible(bool bNewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MessScoreZoneComponent_C">();
	}
	static class UBP_MessScoreZoneComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MessScoreZoneComponent_C>();
	}
};
static_assert(alignof(UBP_MessScoreZoneComponent_C) == 0x000010, "Wrong alignment on UBP_MessScoreZoneComponent_C");
static_assert(sizeof(UBP_MessScoreZoneComponent_C) == 0x0005D0, "Wrong size on UBP_MessScoreZoneComponent_C");
static_assert(offsetof(UBP_MessScoreZoneComponent_C, UberGraphFrame) == 0x000560, "Member 'UBP_MessScoreZoneComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MessScoreZoneComponent_C, NewVar_0) == 0x000568, "Member 'UBP_MessScoreZoneComponent_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_MessScoreZoneComponent_C, ReceptacleCategoriesOverride) == 0x000570, "Member 'UBP_MessScoreZoneComponent_C::ReceptacleCategoriesOverride' has a wrong offset!");
static_assert(offsetof(UBP_MessScoreZoneComponent_C, Mesh) == 0x0005C0, "Member 'UBP_MessScoreZoneComponent_C::Mesh' has a wrong offset!");

}

