#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MediaSound

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MediaSound.BP_MediaSound_C.ExecuteUbergraph_BP_MediaSound
// 0x0038 (0x0038 - 0x0000)
struct BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MediaSound_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MediaSound_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound) == 0x000008, "Wrong alignment on BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound");
static_assert(sizeof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound) == 0x000038, "Wrong size on BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, EntryPoint) == 0x000000, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, Temp_int_Variable) == 0x000004, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_Array_RemoveItem_ReturnValue) == 0x000020, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MediaSound_C_ExecuteUbergraph_BP_MediaSound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

