#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIntro_Manager

#include "Basic.hpp"

#include "E_IntroType_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.CreateIntroWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_MatchIntro_Manager_C_CreateIntroWidget final
{
public:
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_IntroOverlayBase_C*                 K2Node_DynamicCast_AsWI_Intro_Overlay_Base;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntro_Manager_C_CreateIntroWidget) == 0x000008, "Wrong alignment on BP_MatchIntro_Manager_C_CreateIntroWidget");
static_assert(sizeof(BP_MatchIntro_Manager_C_CreateIntroWidget) == 0x000020, "Wrong size on BP_MatchIntro_Manager_C_CreateIntroWidget");
static_assert(offsetof(BP_MatchIntro_Manager_C_CreateIntroWidget, CallFunc_FTrunc_ReturnValue) == 0x000000, "Member 'BP_MatchIntro_Manager_C_CreateIntroWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_CreateIntroWidget, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000008, "Member 'BP_MatchIntro_Manager_C_CreateIntroWidget::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_CreateIntroWidget, K2Node_DynamicCast_AsWI_Intro_Overlay_Base) == 0x000010, "Member 'BP_MatchIntro_Manager_C_CreateIntroWidget::K2Node_DynamicCast_AsWI_Intro_Overlay_Base' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_CreateIntroWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MatchIntro_Manager_C_CreateIntroWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.DetermineIntrosToPlay
// 0x0130 (0x0130 - 0x0000)
struct BP_MatchIntro_Manager_C_DetermineIntrosToPlay final
{
public:
	E_IntroType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_1;                              // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_2;                              // 0x0002(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_3;                              // 0x0003(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_4;                              // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0010(0x0058)(ConstParm)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue_1;      // 0x0068(0x0058)(ConstParm)
	E_IntroType                                   Temp_byte_Variable_5;                              // 0x00C0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue_2;      // 0x00D0(0x0058)(ConstParm)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay) == 0x000008, "Wrong alignment on BP_MatchIntro_Manager_C_DetermineIntrosToPlay");
static_assert(sizeof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay) == 0x000130, "Wrong size on BP_MatchIntro_Manager_C_DetermineIntrosToPlay");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable) == 0x000000, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable_1) == 0x000001, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable_2) == 0x000002, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable_3) == 0x000003, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable_4) == 0x000004, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue_1) == 0x00000C, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000010, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_GetMatchConfiguration_ReturnValue_1) == 0x000068, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_GetMatchConfiguration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, Temp_byte_Variable_5) == 0x0000C0, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue_2) == 0x0000C4, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue_3) == 0x0000C8, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue_4) == 0x0000CC, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_GetMatchConfiguration_ReturnValue_2) == 0x0000D0, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_GetMatchConfiguration_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_DetermineIntrosToPlay, CallFunc_Array_Add_ReturnValue_5) == 0x000128, "Member 'BP_MatchIntro_Manager_C_DetermineIntrosToPlay::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.ExecuteUbergraph_BP_MatchIntro_Manager
// 0x02C8 (0x02C8 - 0x0000)
struct BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_TeamCamera_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseEssential_Cube_C*              K2Node_CustomEvent_Actor;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TeamCamera_C*                       CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnSameTeamAsPlayer_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   K2Node_CustomEvent_Intro;                          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAcceptableEssentialIndex_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsAcceptableEssentialIndex_Index;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HouseEssential_Cube_C*              CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MatchIntroCamera_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseEssential_Cube_C*              CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP*                           CallFunc_GetGameStateJP_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP*                           CallFunc_GetGameStateJP_ReturnValue_1;             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UJPHUDWidget_Match*                     CallFunc_GetMatchHUDWidget_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_IntroManagerLoadScreen_C*           CallFunc_Create_ReturnValue;                       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_4;     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue_1;       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP;       // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP_1;     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue_2;       // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue_3;       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP_2;     // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP_3;     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue_1;             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_SetInputContextToIntro_ReturnValue;       // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager) == 0x000008, "Wrong alignment on BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager");
static_assert(sizeof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager) == 0x0002C8, "Wrong size on BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, EntryPoint) == 0x000000, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000018, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00004C, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CustomEvent_Actor) == 0x000050, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsOnSameTeamAsPlayer_ReturnValue) == 0x000068, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsOnSameTeamAsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CustomEvent_Intro) == 0x000069, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CustomEvent_Intro' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000070, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsAcceptableEssentialIndex_ReturnValue) == 0x0000A8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsAcceptableEssentialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsAcceptableEssentialIndex_Index) == 0x0000AC, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsAcceptableEssentialIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetActorOfClass_ReturnValue) == 0x0000B8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C4, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue) == 0x0000E0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CustomEvent_OldPawn) == 0x0000E8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CustomEvent_NewPawn) == 0x0000F0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000F8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_2) == 0x000108, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000114, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetIsPie_ReturnValue) == 0x000118, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_5) == 0x00011C, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_3) == 0x000130, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_4) == 0x000138, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000140, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000148, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000150, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000158, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_5) == 0x000160, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_6) == 0x000168, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerState_ReturnValue) == 0x000170, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerName_ReturnValue) == 0x000178, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_6) == 0x000188, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Concat_StrStr_ReturnValue) == 0x000198, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, Temp_int_Variable) == 0x0001C8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_ReturnValue) == 0x0001D0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_ReturnValue_1) == 0x0001D8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_SpawnSound2D_ReturnValue) == 0x0001E0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_HasMatchStarted_ReturnValue) == 0x0001E8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_HasMatchStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Not_PreBool_ReturnValue) == 0x0001E9, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x0001F0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetMatchHUDWidget_ReturnValue) == 0x0001F8, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetMatchHUDWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerController_ReturnValue_7) == 0x000208, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Create_ReturnValue) == 0x000210, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerCameraManager_ReturnValue_4) == 0x000218, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerCameraManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000220, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_Match_ReturnValue_1) == 0x000228, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_Match_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_AsGame_State_JP_Match_BP) == 0x000230, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_AsGame_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_AsGame_State_JP_Match_BP_1) == 0x000240, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_AsGame_State_JP_Match_BP_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_Match_ReturnValue_2) == 0x000250, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_Match_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetGameStateJP_Match_ReturnValue_3) == 0x000258, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetGameStateJP_Match_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_AsGame_State_JP_Match_BP_2) == 0x000260, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_AsGame_State_JP_Match_BP_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_bSuccess_2) == 0x000268, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_AsGame_State_JP_Match_BP_3) == 0x000270, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_AsGame_State_JP_Match_BP_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_DynamicCast_bSuccess_3) == 0x000278, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, K2Node_CreateDelegate_OutputDelegate_7) == 0x00027C, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Not_PreBool_ReturnValue_1) == 0x00028C, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Not_PreBool_ReturnValue_2) == 0x00028D, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerState_ReturnValue_1) == 0x000290, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Not_PreBool_ReturnValue_3) == 0x000298, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_GetPlayerName_ReturnValue_1) == 0x0002A0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_GetPlayerName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002B0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager, CallFunc_SetInputContextToIntro_ReturnValue) == 0x0002C0, "Member 'BP_MatchIntro_Manager_C_ExecuteUbergraph_BP_MatchIntro_Manager::CallFunc_SetInputContextToIntro_ReturnValue' has a wrong offset!");

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.FilterEssentialsBasedOnTeam
// 0x0040 (0x0040 - 0x0000)
struct BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HouseEssential_Cube_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class ABP_HouseEssential_Cube_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnSameTeamAsPlayer_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam) == 0x000008, "Wrong alignment on BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam");
static_assert(sizeof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam) == 0x000040, "Wrong size on BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_IsOnSameTeamAsPlayer_ReturnValue) == 0x000028, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_IsOnSameTeamAsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam, CallFunc_Array_Add_ReturnValue_1) == 0x000038, "Member 'BP_MatchIntro_Manager_C_FilterEssentialsBasedOnTeam::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.FilterSafesBasedOnTeam
// 0x0038 (0x0038 - 0x0000)
struct BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CaptureTheFlagDeedSafe_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CaptureTheFlagDeedSafe_C*           CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnSameTeamAsPlayer_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam) == 0x000008, "Wrong alignment on BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam");
static_assert(sizeof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam) == 0x000038, "Wrong size on BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam, CallFunc_IsOnSameTeamAsPlayer_ReturnValue) == 0x000031, "Member 'BP_MatchIntro_Manager_C_FilterSafesBasedOnTeam::CallFunc_IsOnSameTeamAsPlayer_ReturnValue' has a wrong offset!");

// Function BP_MatchIntro_Manager.BP_MatchIntro_Manager_C.HideUI AndRemoveControls
// 0x0018 (0x0018 - 0x0000)
struct BP_MatchIntro_Manager_C_HideUI_AndRemoveControls final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_SetInputContextToIntro_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
