#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NeutralBearTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NeutralBearTrap.BP_NeutralBearTrap_C
// 0x0070 (0x0300 - 0x0290)
class ABP_NeutralBearTrap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TriggerBox;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Run_Over_Kill_Feed_Icon;                           // 0x02D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FTimerHandle                           DestroyTimer;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_NeutralBearTrap_ProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void BndEvt__BP_NeutralBearTrap_TriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void DamageCharacter(class AActor* Target);
	void DestroyAfterDelay();
	void ExecuteUbergraph_BP_NeutralBearTrap(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NeutralBearTrap_C">();
	}
	static class ABP_NeutralBearTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NeutralBearTrap_C>();
	}
};
static_assert(alignof(ABP_NeutralBearTrap_C) == 0x000008, "Wrong alignment on ABP_NeutralBearTrap_C");
static_assert(sizeof(ABP_NeutralBearTrap_C) == 0x000300, "Wrong size on ABP_NeutralBearTrap_C");
static_assert(offsetof(ABP_NeutralBearTrap_C, UberGraphFrame) == 0x000290, "Member 'ABP_NeutralBearTrap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, TriggerBox) == 0x000298, "Member 'ABP_NeutralBearTrap_C::TriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, Box) == 0x0002A0, "Member 'ABP_NeutralBearTrap_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, ProjectileMovement) == 0x0002A8, "Member 'ABP_NeutralBearTrap_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, SkeletalMesh) == 0x0002B0, "Member 'ABP_NeutralBearTrap_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, Direction) == 0x0002B8, "Member 'ABP_NeutralBearTrap_C::Direction' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, Run_Over_Kill_Feed_Icon) == 0x0002D0, "Member 'ABP_NeutralBearTrap_C::Run_Over_Kill_Feed_Icon' has a wrong offset!");
static_assert(offsetof(ABP_NeutralBearTrap_C, DestroyTimer) == 0x0002F8, "Member 'ABP_NeutralBearTrap_C::DestroyTimer' has a wrong offset!");

}

