#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NeighborsController

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_NeighborsCharacterChangedMessage_structs.hpp"


namespace SDK::Params
{

// Function BP_NeighborsController.BP_NeighborsController_C.ExecuteUbergraph_BP_NeighborsController
// 0x0098 (0x0098 - 0x0000)
struct BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NeighborsCharacterChangedMessage    Temp_struct_Variable;                              // 0x0008(0x0028)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_NeighborsCharacterChangedMessage    Temp_struct_Variable_1;                            // 0x0050(0x0028)(HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController) == 0x000008, "Wrong alignment on BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController");
static_assert(sizeof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController) == 0x000098, "Wrong size on BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, EntryPoint) == 0x000000, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, Temp_struct_Variable) == 0x000008, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, K2Node_CustomEvent_ProxyObject) == 0x000030, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, K2Node_CustomEvent_ActualChannel) == 0x000038, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, Temp_struct_Variable_1) == 0x000050, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, Temp_struct_Variable_2) == 0x000078, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, Temp_object_Variable) == 0x000080, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000088, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, CallFunc_GetPayload_ReturnValue) == 0x000090, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_NeighborsController_C_ExecuteUbergraph_BP_NeighborsController::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_NeighborsController.BP_NeighborsController_C.OnMessageReceived_049353D746FB272C71135295B562F9EE
// 0x0010 (0x0010 - 0x0000)
struct BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE) == 0x000008, "Wrong alignment on BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE");
static_assert(sizeof(BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE) == 0x000010, "Wrong size on BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE");
static_assert(offsetof(BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE, ProxyObject) == 0x000000, "Member 'BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE, ActualChannel) == 0x000008, "Member 'BP_NeighborsController_C_OnMessageReceived_049353D746FB272C71135295B562F9EE::ActualChannel' has a wrong offset!");

}

