#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrangeProj

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrangeProj.BP_OrangeProj_C
// 0x0018 (0x0540 - 0x0528)
class ABP_OrangeProj_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_OrangeProj_C;                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SceneForward;                                      // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Bounces;                                           // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_Destroyed();
	void ExecuteUbergraph_BP_OrangeProj(int32 EntryPoint);
	void HandleBounce(const struct FHitResult& Hit, const struct FVector& Impact_Velocity);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrangeProj_C">();
	}
	static class ABP_OrangeProj_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrangeProj_C>();
	}
};
static_assert(alignof(ABP_OrangeProj_C) == 0x000008, "Wrong alignment on ABP_OrangeProj_C");
static_assert(sizeof(ABP_OrangeProj_C) == 0x000540, "Wrong size on ABP_OrangeProj_C");
static_assert(offsetof(ABP_OrangeProj_C, UberGraphFrame_BP_OrangeProj_C) == 0x000528, "Member 'ABP_OrangeProj_C::UberGraphFrame_BP_OrangeProj_C' has a wrong offset!");
static_assert(offsetof(ABP_OrangeProj_C, SceneForward) == 0x000530, "Member 'ABP_OrangeProj_C::SceneForward' has a wrong offset!");
static_assert(offsetof(ABP_OrangeProj_C, Bounces) == 0x000538, "Member 'ABP_OrangeProj_C::Bounces' has a wrong offset!");

}

