#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrangeProj

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_OrangeProj.BP_OrangeProj_C.ExecuteUbergraph_BP_OrangeProj
// 0x0004 (0x0004 - 0x0000)
struct BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj) == 0x000004, "Wrong alignment on BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj");
static_assert(sizeof(BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj) == 0x000004, "Wrong size on BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj");
static_assert(offsetof(BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj, EntryPoint) == 0x000000, "Member 'BP_OrangeProj_C_ExecuteUbergraph_BP_OrangeProj::EntryPoint' has a wrong offset!");

// Function BP_OrangeProj.BP_OrangeProj_C.HandleBounce
// 0x0118 (0x0118 - 0x0000)
struct BP_OrangeProj_C_HandleBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact_Velocity;                                   // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrangeProj_C_HandleBounce) == 0x000008, "Wrong alignment on BP_OrangeProj_C_HandleBounce");
static_assert(sizeof(BP_OrangeProj_C_HandleBounce) == 0x000118, "Wrong size on BP_OrangeProj_C_HandleBounce");
static_assert(offsetof(BP_OrangeProj_C_HandleBounce, Hit) == 0x000000, "Member 'BP_OrangeProj_C_HandleBounce::Hit' has a wrong offset!");
static_assert(offsetof(BP_OrangeProj_C_HandleBounce, Impact_Velocity) == 0x0000F8, "Member 'BP_OrangeProj_C_HandleBounce::Impact_Velocity' has a wrong offset!");
static_assert(offsetof(BP_OrangeProj_C_HandleBounce, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'BP_OrangeProj_C_HandleBounce::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrangeProj_C_HandleBounce, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'BP_OrangeProj_C_HandleBounce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

