#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlungerGun_Equipable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Equipable_classes.hpp"
#include "GASIW_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlungerGun_Equipable.BP_PlungerGun_Equipable_C
// 0x0050 (0x0310 - 0x02C0)
class ABP_PlungerGun_Equipable_C final : public ABP_Equipable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlungerGun_Equipable_C;          // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveInterpolationComponent*           CurveInterpolation;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        Cable;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plunger;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MuzzlePoint;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MissTargetLocation;                                // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PlungerGun_Equipable_CurveInterpolation_K2Node_ComponentBoundEvent_0_OnCurveInterpolationUpdate__DelegateSignature(float InterpolatedValue);
	void BndEvt__BP_PlungerGun_Equipable_CurveInterpolation_K2Node_ComponentBoundEvent_1_OnCurveInterpolationComplete__DelegateSignature();
	void EnableTrail(bool Enable, double Duration);
	void ExecuteUbergraph_BP_PlungerGun_Equipable(int32 EntryPoint);
	void GetMuzzleSceneComponent(class USceneComponent** Return);
	void OnHandleViewMode(EEquipmentViewMode ViewMode);
	void Play_Plunger_Cosmetics(const struct FVector& EndLocation, const struct FRotator& Rotation);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlungerGun_Equipable_C">();
	}
	static class ABP_PlungerGun_Equipable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlungerGun_Equipable_C>();
	}
};
static_assert(alignof(ABP_PlungerGun_Equipable_C) == 0x000008, "Wrong alignment on ABP_PlungerGun_Equipable_C");
static_assert(sizeof(ABP_PlungerGun_Equipable_C) == 0x000310, "Wrong size on ABP_PlungerGun_Equipable_C");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, UberGraphFrame_BP_PlungerGun_Equipable_C) == 0x0002C0, "Member 'ABP_PlungerGun_Equipable_C::UberGraphFrame_BP_PlungerGun_Equipable_C' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, CurveInterpolation) == 0x0002C8, "Member 'ABP_PlungerGun_Equipable_C::CurveInterpolation' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, Cable) == 0x0002D0, "Member 'ABP_PlungerGun_Equipable_C::Cable' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, SM_Plunger) == 0x0002D8, "Member 'ABP_PlungerGun_Equipable_C::SM_Plunger' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, MuzzlePoint) == 0x0002E0, "Member 'ABP_PlungerGun_Equipable_C::MuzzlePoint' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, SkeletalMesh) == 0x0002E8, "Member 'ABP_PlungerGun_Equipable_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, NewVar) == 0x0002F0, "Member 'ABP_PlungerGun_Equipable_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_PlungerGun_Equipable_C, MissTargetLocation) == 0x0002F8, "Member 'ABP_PlungerGun_Equipable_C::MissTargetLocation' has a wrong offset!");

}

