#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_PieDecal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_PieDecal.Bp_PieDecal_C.ExecuteUbergraph_Bp_PieDecal
// 0x0050 (0x0050 - 0x0000)
struct Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal) == 0x000008, "Wrong alignment on Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal");
static_assert(sizeof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal) == 0x000050, "Wrong size on Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, EntryPoint) == 0x000000, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000020, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue) == 0x000040, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000048, "Member 'Bp_PieDecal_C_ExecuteUbergraph_Bp_PieDecal::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

}

