#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreviewMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreviewMesh.BP_PreviewMesh_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_PreviewMesh_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PreviewMesh;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_EquipmentInstance_C*                Equipable;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PreviewMesh(int32 EntryPoint);
	void IncrementMesh(bool* Success);
	void OnUnequipped();
	void OwnerDied(class ACharacter* Character);
	void ReceiveBeginPlay();
	void ResetMesh(bool* Success);
	void SetMesh(int32 ArraySlot, bool* Success);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PreviewMesh_C">();
	}
	static class ABP_PreviewMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PreviewMesh_C>();
	}
};
static_assert(alignof(ABP_PreviewMesh_C) == 0x000008, "Wrong alignment on ABP_PreviewMesh_C");
static_assert(sizeof(ABP_PreviewMesh_C) == 0x0002C0, "Wrong size on ABP_PreviewMesh_C");
static_assert(offsetof(ABP_PreviewMesh_C, UberGraphFrame) == 0x000290, "Member 'ABP_PreviewMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PreviewMesh_C, PreviewMesh) == 0x000298, "Member 'ABP_PreviewMesh_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_PreviewMesh_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_PreviewMesh_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PreviewMesh_C, Meshes) == 0x0002A8, "Member 'ABP_PreviewMesh_C::Meshes' has a wrong offset!");
static_assert(offsetof(ABP_PreviewMesh_C, Equipable) == 0x0002B8, "Member 'ABP_PreviewMesh_C::Equipable' has a wrong offset!");

}

