#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreviewPawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreviewPawn.BP_PreviewPawn_C
// 0x0020 (0x0338 - 0x0318)
class ABP_PreviewPawn_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PreviewPawn(int32 EntryPoint);
	void GetBaseAnimationValues(ECharacterName CharacterName, ECharacterName* Character, class UAnimMontage** MontageToPlay);
	void OnBlendOut_4AD4CE67401BD37B6FF5109F83AD4D26(class FName NotifyName);
	void OnBlendOut_5DB600FE40A05D4C0F2D79A50EE9506D(class FName NotifyName);
	void OnCompleted_4AD4CE67401BD37B6FF5109F83AD4D26(class FName NotifyName);
	void OnCompleted_5DB600FE40A05D4C0F2D79A50EE9506D(class FName NotifyName);
	void OnInterrupted_4AD4CE67401BD37B6FF5109F83AD4D26(class FName NotifyName);
	void OnInterrupted_5DB600FE40A05D4C0F2D79A50EE9506D(class FName NotifyName);
	void OnNotifyBegin_4AD4CE67401BD37B6FF5109F83AD4D26(class FName NotifyName);
	void OnNotifyBegin_5DB600FE40A05D4C0F2D79A50EE9506D(class FName NotifyName);
	void OnNotifyEnd_4AD4CE67401BD37B6FF5109F83AD4D26(class FName NotifyName);
	void OnNotifyEnd_5DB600FE40A05D4C0F2D79A50EE9506D(class FName NotifyName);
	void Play_Player_Input_Montage(class UAnimMontage* MontageToPlay);
	void Set_Mesh(class USkeletalMesh* NewMesh, ECharacterName CharacterName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PreviewPawn_C">();
	}
	static class ABP_PreviewPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PreviewPawn_C>();
	}
};
static_assert(alignof(ABP_PreviewPawn_C) == 0x000008, "Wrong alignment on ABP_PreviewPawn_C");
static_assert(sizeof(ABP_PreviewPawn_C) == 0x000338, "Wrong size on ABP_PreviewPawn_C");
static_assert(offsetof(ABP_PreviewPawn_C, UberGraphFrame) == 0x000318, "Member 'ABP_PreviewPawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PreviewPawn_C, Arrow) == 0x000320, "Member 'ABP_PreviewPawn_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_PreviewPawn_C, SkeletalMesh) == 0x000328, "Member 'ABP_PreviewPawn_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_PreviewPawn_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_PreviewPawn_C::DefaultSceneRoot' has a wrong offset!");

}

