#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_YarnBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_YarnBall.BP_Projectile_YarnBall_C.ExecuteUbergraph_BP_Projectile_YarnBall
// 0x0090 (0x0090 - 0x0000)
struct BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_CustomEvent_TargetActor;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_YarnTangle_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall) == 0x000010, "Wrong alignment on BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall");
static_assert(sizeof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall) == 0x000090, "Wrong size on BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall");
static_assert(offsetof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall, EntryPoint) == 0x000000, "Member 'BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall, K2Node_CustomEvent_Transform) == 0x000010, "Member 'BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall, K2Node_CustomEvent_TargetActor) == 0x000070, "Member 'BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_Projectile_YarnBall_C_ExecuteUbergraph_BP_Projectile_YarnBall::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_Projectile_YarnBall.BP_Projectile_YarnBall_C.Server_SpawnTangle
// 0x0070 (0x0070 - 0x0000)
struct BP_Projectile_YarnBall_C_Server_SpawnTangle final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                TargetActor;                                       // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_YarnBall_C_Server_SpawnTangle) == 0x000010, "Wrong alignment on BP_Projectile_YarnBall_C_Server_SpawnTangle");
static_assert(sizeof(BP_Projectile_YarnBall_C_Server_SpawnTangle) == 0x000070, "Wrong size on BP_Projectile_YarnBall_C_Server_SpawnTangle");
static_assert(offsetof(BP_Projectile_YarnBall_C_Server_SpawnTangle, Transform) == 0x000000, "Member 'BP_Projectile_YarnBall_C_Server_SpawnTangle::Transform' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Server_SpawnTangle, TargetActor) == 0x000060, "Member 'BP_Projectile_YarnBall_C_Server_SpawnTangle::TargetActor' has a wrong offset!");

// Function BP_Projectile_YarnBall.BP_Projectile_YarnBall_C.Apply Hit Effects On Valid Entity
// 0x02A0 (0x02A0 - 0x0000)
struct BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity final
{
public:
	struct FHitResult                             Hit_Result;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                Instigator_ASC;                                    // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                HitTarget_ASC;                                     // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0108(0x0010)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x01F0(0x0010)()
	bool                                          CallFunc_IsSameTeam_Return;                        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0208(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0294(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDuration_Duration_ImplicitCast;        // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity) == 0x000010, "Wrong alignment on BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity");
static_assert(sizeof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity) == 0x0002A0, "Wrong size on BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, Hit_Result) == 0x000000, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::Hit_Result' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, Instigator_ASC) == 0x0000F8, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::Instigator_ASC' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, HitTarget_ASC) == 0x000100, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::HitTarget_ASC' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000108, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_BoneName) == 0x0001A8, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0001F0, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_IsSameTeam_Return) == 0x000200, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_IsSameTeam_Return' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_SetDuration_ReturnValue) == 0x000208, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_SetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_Not_PreBool_ReturnValue) == 0x000218, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000220, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000230, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_HasAuthority_ReturnValue) == 0x000290, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000294, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity, CallFunc_SetDuration_Duration_ImplicitCast) == 0x00029C, "Member 'BP_Projectile_YarnBall_C_Apply_Hit_Effects_On_Valid_Entity::CallFunc_SetDuration_Duration_ImplicitCast' has a wrong offset!");

}

