#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PingControllerComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PingControllerComponent.BP_PingControllerComponent_C.GetGloballyPingableObjects
// 0x0088 (0x0088 - 0x0000)
struct BP_PingControllerComponent_C_GetGloballyPingableObjects final
{
public:
	TArray<class UPingableComponent*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UPingableComponent*>             Result;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ResourcePile_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class ABP_ResourcePile_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HouseIdentifier_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseIdentifier_C*                  CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PingControllerComponent_C_GetGloballyPingableObjects) == 0x000008, "Wrong alignment on BP_PingControllerComponent_C_GetGloballyPingableObjects");
static_assert(sizeof(BP_PingControllerComponent_C_GetGloballyPingableObjects) == 0x000088, "Wrong size on BP_PingControllerComponent_C_GetGloballyPingableObjects");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, ReturnValue) == 0x000000, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, Result) == 0x000010, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::Result' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000060, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PingControllerComponent_C_GetGloballyPingableObjects, CallFunc_Array_Add_ReturnValue_1) == 0x000084, "Member 'BP_PingControllerComponent_C_GetGloballyPingableObjects::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

}

