#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerkManagerComponent

#include "Basic.hpp"

#include "S_PerkSelectionChangedMessage_structs.hpp"


namespace SDK::Params
{

// Function BP_PerkManagerComponent.BP_PerkManagerComponent_C.ExecuteUbergraph_BP_PerkManagerComponent
// 0x0030 (0x0030 - 0x0000)
struct BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PerkSelectionChangedMessage         K2Node_MakeStruct_S_PerkSelectionChangedMessage;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent) == 0x000008, "Wrong alignment on BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent");
static_assert(sizeof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent) == 0x000030, "Wrong size on BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, EntryPoint) == 0x000000, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000010, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, K2Node_MakeStruct_S_PerkSelectionChangedMessage) == 0x000020, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::K2Node_MakeStruct_S_PerkSelectionChangedMessage' has a wrong offset!");
static_assert(offsetof(BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'BP_PerkManagerComponent_C_ExecuteUbergraph_BP_PerkManagerComponent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

