#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PopGun_Equipable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Equipable_classes.hpp"
#include "GASIW_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PopGun_Equipable.BP_PopGun_Equipable_C
// 0x0020 (0x02E0 - 0x02C0)
class ABP_PopGun_Equipable_C final : public ABP_Equipable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PopGun_Equipable_C;              // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        MuzzlePoint;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableTrail(bool Enable, double Duration);
	void ExecuteUbergraph_BP_PopGun_Equipable(int32 EntryPoint);
	void GetMuzzleSceneComponent(class USceneComponent** Return);
	void OnHandleViewMode(EEquipmentViewMode ViewMode);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PopGun_Equipable_C">();
	}
	static class ABP_PopGun_Equipable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PopGun_Equipable_C>();
	}
};
static_assert(alignof(ABP_PopGun_Equipable_C) == 0x000008, "Wrong alignment on ABP_PopGun_Equipable_C");
static_assert(sizeof(ABP_PopGun_Equipable_C) == 0x0002E0, "Wrong size on ABP_PopGun_Equipable_C");
static_assert(offsetof(ABP_PopGun_Equipable_C, UberGraphFrame_BP_PopGun_Equipable_C) == 0x0002C0, "Member 'ABP_PopGun_Equipable_C::UberGraphFrame_BP_PopGun_Equipable_C' has a wrong offset!");
static_assert(offsetof(ABP_PopGun_Equipable_C, MuzzlePoint) == 0x0002C8, "Member 'ABP_PopGun_Equipable_C::MuzzlePoint' has a wrong offset!");
static_assert(offsetof(ABP_PopGun_Equipable_C, SkeletalMesh) == 0x0002D0, "Member 'ABP_PopGun_Equipable_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_PopGun_Equipable_C, NewVar) == 0x0002D8, "Member 'ABP_PopGun_Equipable_C::NewVar' has a wrong offset!");

}

