#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoomManager

#include "Basic.hpp"

#include "S_EventMessageParams_structs.hpp"
#include "S_ImportantNotificationReceivedMessage_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ShopUpgradePayload_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_RoomManager.BP_RoomManager_C.AddRoomToGroundskeeper
// 0x0058 (0x0058 - 0x0000)
struct BP_RoomManager_C_AddRoomToGroundskeeper final
{
public:
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGroundsKeeperAtPoint_bFoundTeam;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATeamVolume*>                    CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes; // 0x0028(0x0010)(ReferenceParm)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeperAtPoint_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_AddRoomToGroundskeeper) == 0x000008, "Wrong alignment on BP_RoomManager_C_AddRoomToGroundskeeper");
static_assert(sizeof(BP_RoomManager_C_AddRoomToGroundskeeper) == 0x000058, "Wrong size on BP_RoomManager_C_AddRoomToGroundskeeper");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_GetLocalRole_ReturnValue) == 0x000000, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_bFoundTeam) == 0x000020, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes) == 0x000028, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_GetGroundsKeeperAtPoint_ReturnValue) == 0x000038, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_GetGroundsKeeperAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000040, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_AddRoomToGroundskeeper, CallFunc_Array_Contains_ReturnValue) == 0x000050, "Member 'BP_RoomManager_C_AddRoomToGroundskeeper::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.ApplyCost
// 0x0050 (0x0050 - 0x0000)
struct BP_RoomManager_C_ApplyCost final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	class UEconomyDefinition*                     CallFunc_GetNextLevelEconomyCost_EconomyCost;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomy_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_ApplyCost) == 0x000008, "Wrong alignment on BP_RoomManager_C_ApplyCost");
static_assert(sizeof(BP_RoomManager_C_ApplyCost) == 0x000050, "Wrong size on BP_RoomManager_C_ApplyCost");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_RoomManager_C_ApplyCost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_RoomManager_C_ApplyCost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_GetTeamID_ReturnValue) == 0x00000C, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000018, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_GetNextLevelEconomyCost_EconomyCost) == 0x000028, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_GetNextLevelEconomyCost_EconomyCost' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_WithdrawEconomy_ReturnValue) == 0x00003C, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_WithdrawEconomy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ApplyCost, CallFunc_Get_ClassLog_Name_name) == 0x000040, "Member 'BP_RoomManager_C_ApplyCost::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.ExecuteUbergraph_BP_RoomManager
// 0x00B8 (0x00B8 - 0x0000)
struct BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetUpgradeTime_Shop_Upgrade_Duration;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FRoomData                              K2Node_MakeStruct_RoomData;                        // 0x0060(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_Event_InstigatingPlayer;                    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ShopUpgradePayload                  K2Node_MakeStruct_S_ShopUpgradePayload;            // 0x0098(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager) == 0x000008, "Wrong alignment on BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager");
static_assert(sizeof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager) == 0x0000B8, "Wrong size on BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, EntryPoint) == 0x000000, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_Clamp_ReturnValue) == 0x000024, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000028, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000030, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_HasAuthority_ReturnValue) == 0x000039, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_GetUpgradeTime_Shop_Upgrade_Duration) == 0x000050, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_GetUpgradeTime_Shop_Upgrade_Duration' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_MakeStruct_RoomData) == 0x000060, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_MakeStruct_RoomData' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_SwitchInteger_CmpSuccess) == 0x000078, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_Event_InstigatingPlayer) == 0x000090, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_Event_InstigatingPlayer' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, K2Node_MakeStruct_S_ShopUpgradePayload) == 0x000098, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::K2Node_MakeStruct_S_ShopUpgradePayload' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000B0, "Member 'BP_RoomManager_C_ExecuteUbergraph_BP_RoomManager::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.GetNextLevelHouseLevelRequirement
// 0x001C (0x001C - 0x0000)
struct BP_RoomManager_C_GetNextLevelHouseLevelRequirement final
{
public:
	int32                                         RoomTypeAndLevel;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement) == 0x000004, "Wrong alignment on BP_RoomManager_C_GetNextLevelHouseLevelRequirement");
static_assert(sizeof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement) == 0x00001C, "Wrong size on BP_RoomManager_C_GetNextLevelHouseLevelRequirement");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, RoomTypeAndLevel) == 0x000000, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::RoomTypeAndLevel' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, Temp_int_Variable) == 0x000004, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, Temp_int_Variable_1) == 0x000008, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, Temp_int_Variable_2) == 0x00000C, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelHouseLevelRequirement, K2Node_Select_Default) == 0x000018, "Member 'BP_RoomManager_C_GetNextLevelHouseLevelRequirement::K2Node_Select_Default' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.GetNextLevelMoneyCost
// 0x0018 (0x0018 - 0x0000)
struct BP_RoomManager_C_GetNextLevelMoneyCost final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_GetNextLevelMoneyCost) == 0x000004, "Wrong alignment on BP_RoomManager_C_GetNextLevelMoneyCost");
static_assert(sizeof(BP_RoomManager_C_GetNextLevelMoneyCost) == 0x000018, "Wrong size on BP_RoomManager_C_GetNextLevelMoneyCost");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, ReturnValue) == 0x000000, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, Temp_int_Variable) == 0x000004, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, Temp_int_Variable_1) == 0x000008, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, Temp_int_Variable_2) == 0x00000C, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelMoneyCost, K2Node_Select_Default) == 0x000014, "Member 'BP_RoomManager_C_GetNextLevelMoneyCost::K2Node_Select_Default' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.GetNextLevelRequiredRooms
// 0x0150 (0x0150 - 0x0000)
struct BP_RoomManager_C_GetNextLevelRequiredRooms final
{
public:
	TMap<ERooms, int32>                           RoomTypeAndLevel;                                  // 0x0000(0x0050)(Parm, OutParm)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ERooms, int32>                           Temp_byte_Variable;                                // 0x0058(0x0050)()
	TMap<ERooms, int32>                           Temp_byte_Variable_1;                              // 0x00A8(0x0050)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ERooms, int32>                           K2Node_Select_Default;                             // 0x0100(0x0050)()
};
static_assert(alignof(BP_RoomManager_C_GetNextLevelRequiredRooms) == 0x000008, "Wrong alignment on BP_RoomManager_C_GetNextLevelRequiredRooms");
static_assert(sizeof(BP_RoomManager_C_GetNextLevelRequiredRooms) == 0x000150, "Wrong size on BP_RoomManager_C_GetNextLevelRequiredRooms");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, RoomTypeAndLevel) == 0x000000, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::RoomTypeAndLevel' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, Temp_int_Variable) == 0x000050, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, Temp_byte_Variable) == 0x000058, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, Temp_byte_Variable_1) == 0x0000A8, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetNextLevelRequiredRooms, K2Node_Select_Default) == 0x000100, "Member 'BP_RoomManager_C_GetNextLevelRequiredRooms::K2Node_Select_Default' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.GetUpgradeTime
// 0x0018 (0x0018 - 0x0000)
struct BP_RoomManager_C_GetUpgradeTime final
{
public:
	double                                        Shop_Upgrade_Duration;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_GetUpgradeTime) == 0x000008, "Wrong alignment on BP_RoomManager_C_GetUpgradeTime");
static_assert(sizeof(BP_RoomManager_C_GetUpgradeTime) == 0x000018, "Wrong size on BP_RoomManager_C_GetUpgradeTime");
static_assert(offsetof(BP_RoomManager_C_GetUpgradeTime, Shop_Upgrade_Duration) == 0x000000, "Member 'BP_RoomManager_C_GetUpgradeTime::Shop_Upgrade_Duration' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetUpgradeTime, CallFunc_GetIsPie_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_GetUpgradeTime::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_GetUpgradeTime, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000010, "Member 'BP_RoomManager_C_GetUpgradeTime::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.K2_RoomUpgradeApproved
// 0x0008 (0x0008 - 0x0000)
struct BP_RoomManager_C_K2_RoomUpgradeApproved final
{
public:
	class APlayerState*                           InstigatingPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_K2_RoomUpgradeApproved) == 0x000008, "Wrong alignment on BP_RoomManager_C_K2_RoomUpgradeApproved");
static_assert(sizeof(BP_RoomManager_C_K2_RoomUpgradeApproved) == 0x000008, "Wrong size on BP_RoomManager_C_K2_RoomUpgradeApproved");
static_assert(offsetof(BP_RoomManager_C_K2_RoomUpgradeApproved, InstigatingPlayer) == 0x000000, "Member 'BP_RoomManager_C_K2_RoomUpgradeApproved::InstigatingPlayer' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.On_RoomUpgradeStarted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature final
{
public:
	uint8                                         NewLevel;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature) == 0x000001, "Wrong alignment on BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature");
static_assert(sizeof(BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature) == 0x000001, "Wrong size on BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature");
static_assert(offsetof(BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature, NewLevel) == 0x000000, "Member 'BP_RoomManager_C_On_RoomUpgradeStarted__DelegateSignature::NewLevel' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.OnRep_RoomData
// 0x0058 (0x0058 - 0x0000)
struct BP_RoomManager_C_OnRep_RoomData final
{
public:
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_OnRep_RoomData) == 0x000008, "Wrong alignment on BP_RoomManager_C_OnRep_RoomData");
static_assert(sizeof(BP_RoomManager_C_OnRep_RoomData) == 0x000058, "Wrong size on BP_RoomManager_C_OnRep_RoomData");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, K2Node_SwitchInteger_CmpSuccess) == 0x000000, "Member 'BP_RoomManager_C_OnRep_RoomData::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_OnRep_RoomData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'BP_RoomManager_C_OnRep_RoomData::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_RoomManager_C_OnRep_RoomData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BP_RoomManager_C_OnRep_RoomData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_RoomData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'BP_RoomManager_C_OnRep_RoomData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.OnRep_Upgrading
// 0x0030 (0x0030 - 0x0000)
struct BP_RoomManager_C_OnRep_Upgrading final
{
public:
	double                                        CallFunc_GetUpgradeTime_Shop_Upgrade_Duration;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Start_Upgrading_Cosmetics_Time_ImplicitCast; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_OnRep_Upgrading) == 0x000008, "Wrong alignment on BP_RoomManager_C_OnRep_Upgrading");
static_assert(sizeof(BP_RoomManager_C_OnRep_Upgrading) == 0x000030, "Wrong size on BP_RoomManager_C_OnRep_Upgrading");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_GetUpgradeTime_Shop_Upgrade_Duration) == 0x000000, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_GetUpgradeTime_Shop_Upgrade_Duration' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_RoomManager_C_OnRep_Upgrading::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000028, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_OnRep_Upgrading, CallFunc_Start_Upgrading_Cosmetics_Time_ImplicitCast) == 0x00002C, "Member 'BP_RoomManager_C_OnRep_Upgrading::CallFunc_Start_Upgrading_Cosmetics_Time_ImplicitCast' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.ReloadAfterHousesLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_RoomManager_C_ReloadAfterHousesLoaded final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_ReloadAfterHousesLoaded) == 0x000001, "Wrong alignment on BP_RoomManager_C_ReloadAfterHousesLoaded");
static_assert(sizeof(BP_RoomManager_C_ReloadAfterHousesLoaded) == 0x000001, "Wrong size on BP_RoomManager_C_ReloadAfterHousesLoaded");
static_assert(offsetof(BP_RoomManager_C_ReloadAfterHousesLoaded, Return) == 0x000000, "Member 'BP_RoomManager_C_ReloadAfterHousesLoaded::Return' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.SendEventlogMessage
// 0x0130 (0x0130 - 0x0000)
struct BP_RoomManager_C_SendEventlogMessage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0070(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EventMessageParams                  K2Node_MakeStruct_S_EventMessageParams;            // 0x0100(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_SendEventlogMessage) == 0x000008, "Wrong alignment on BP_RoomManager_C_SendEventlogMessage");
static_assert(sizeof(BP_RoomManager_C_SendEventlogMessage) == 0x000130, "Wrong size on BP_RoomManager_C_SendEventlogMessage");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_RoomManager_C_SendEventlogMessage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_RoomManager_C_SendEventlogMessage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000010, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_RoomManager_C_SendEventlogMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_GetTeamID_ReturnValue) == 0x000060, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000070, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_RoomManager_C_SendEventlogMessage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_RoomManager_C_SendEventlogMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_GetPlayerController_ReturnValue) == 0x0000E0, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, K2Node_MakeStruct_S_EventMessageParams) == 0x000100, "Member 'BP_RoomManager_C_SendEventlogMessage::K2Node_MakeStruct_S_EventMessageParams' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendEventlogMessage, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'BP_RoomManager_C_SendEventlogMessage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.SendShopUpgradedImportantNotification
// 0x0258 (0x0258 - 0x0000)
struct BP_RoomManager_C_SendShopUpgradedImportantNotification final
{
public:
	int32                                         ToLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerStateWhoUpgraded;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 LocalPlayerName;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0010)()
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetLocalPlayerTeamId_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00E0(0x0010)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0160(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B8(0x0010)()
	struct FS_ImportantNotificationReceivedMessage K2Node_MakeStruct_S_ImportantNotificationReceivedMessage; // 0x01C8(0x0090)(HasGetValueTypeHash)
};
static_assert(alignof(BP_RoomManager_C_SendShopUpgradedImportantNotification) == 0x000008, "Wrong alignment on BP_RoomManager_C_SendShopUpgradedImportantNotification");
static_assert(sizeof(BP_RoomManager_C_SendShopUpgradedImportantNotification) == 0x000258, "Wrong size on BP_RoomManager_C_SendShopUpgradedImportantNotification");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, ToLevel) == 0x000000, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::ToLevel' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, PlayerStateWhoUpgraded) == 0x000008, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::PlayerStateWhoUpgraded' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, LocalPlayerName) == 0x000010, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::LocalPlayerName' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_IsDedicatedServer_ReturnValue) == 0x000020, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000028, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x000048, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_GetLocalPlayerTeamId_ReturnValue) == 0x0000A0, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_GetLocalPlayerTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_GetTeamID_ReturnValue) == 0x0000A1, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x0000D8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000E0, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000F8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_MakeStruct_FormatArgumentData_2) == 0x000160, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_MakeArray_Array) == 0x0001A8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, CallFunc_Format_ReturnValue) == 0x0001B8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoomManager_C_SendShopUpgradedImportantNotification, K2Node_MakeStruct_S_ImportantNotificationReceivedMessage) == 0x0001C8, "Member 'BP_RoomManager_C_SendShopUpgradedImportantNotification::K2Node_MakeStruct_S_ImportantNotificationReceivedMessage' has a wrong offset!");

// Function BP_RoomManager.BP_RoomManager_C.SetLevelActorVisibility
// 0x0048 (0x0048 - 0x0000)
struct BP_RoomManager_C_SetLevelActorVisibility final
{
public:
	TArray<class AActor*>                         LevelActors;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Hidden;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
