#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourceCrane

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ResourceCrane.BP_ResourceCrane_C.ExecuteUbergraph_BP_ResourceCrane
// 0x0048 (0x0048 - 0x0000)
struct BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane) == 0x000008, "Wrong alignment on BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane");
static_assert(sizeof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane) == 0x000048, "Wrong size on BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, EntryPoint) == 0x000000, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000030, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000038, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000040, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000044, "Member 'BP_ResourceCrane_C_ExecuteUbergraph_BP_ResourceCrane::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_ResourceCrane.BP_ResourceCrane_C.LightConeAnimation
// 0x0001 (0x0001 - 0x0000)
struct BP_ResourceCrane_C_LightConeAnimation final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrane_C_LightConeAnimation) == 0x000001, "Wrong alignment on BP_ResourceCrane_C_LightConeAnimation");
static_assert(sizeof(BP_ResourceCrane_C_LightConeAnimation) == 0x000001, "Wrong size on BP_ResourceCrane_C_LightConeAnimation");
static_assert(offsetof(BP_ResourceCrane_C_LightConeAnimation, On) == 0x000000, "Member 'BP_ResourceCrane_C_LightConeAnimation::On' has a wrong offset!");

}

