#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReceptacleFurnitureBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ActivateFirstAvaliableReceptacle
// 0x0030 (0x0030 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle) == 0x000030, "Wrong size on BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000025, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ReceptacleFurnitureBase_C_ActivateFirstAvaliableReceptacle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ActivateNextReceptacle
// 0x0028 (0x0028 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle) == 0x000028, "Wrong size on BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_Array_Contains_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_Array_Find_ReturnValue) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'BP_ReceptacleFurnitureBase_C_ActivateNextReceptacle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.DeactivateFirstAvaliableReceptacle
// 0x0038 (0x0038 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Claimed_Is_Claimed;                       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle) == 0x000038, "Wrong size on BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000024, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Claimed_Is_Claimed) == 0x000026, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Claimed_Is_Claimed' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_BooleanAND_ReturnValue) == 0x000027, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_BooleanAND_ReturnValue_1) == 0x000029, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle, CallFunc_BooleanAND_ReturnValue_2) == 0x000030, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateFirstAvaliableReceptacle::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.DeactivateNextReceptacle
// 0x0028 (0x0028 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle) == 0x000028, "Wrong size on BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_Array_Contains_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_Array_Find_ReturnValue) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'BP_ReceptacleFurnitureBase_C_DeactivateNextReceptacle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ExecuteUbergraph_BP_ReceptacleFurnitureBase
// 0x0100 (0x0100 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_MessReceptacleComponent_C* Caller)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_MessReceptacleComponent_C* Caller)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x00C8(0x0038)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase) == 0x000100, "Wrong size on BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, EntryPoint) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_ListenToInitializationStateEnded_ReturnValue_1) == 0x000028, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_ListenToInitializationStateEnded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_HasAuthority_ReturnValue) == 0x000038, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_Get_ClassLog_Name_name) == 0x0000A8, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x0000B8, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x0000BC, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase, CallFunc_GetTeamAtPoint_ReturnValue) == 0x0000C8, "Member 'BP_ReceptacleFurnitureBase_C_ExecuteUbergraph_BP_ReceptacleFurnitureBase::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.Has ClutterItems
// 0x0018 (0x0018 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_Has_ClutterItems final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClutterComponent_C*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_Has_ClutterItems) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_Has_ClutterItems");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_Has_ClutterItems) == 0x000018, "Wrong size on BP_ReceptacleFurnitureBase_C_Has_ClutterItems");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_Has_ClutterItems, ReturnValue) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_Has_ClutterItems::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_Has_ClutterItems, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_Has_ClutterItems::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_Has_ClutterItems, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_Has_ClutterItems::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.Play Show Clutter Sound
// 0x0020 (0x0020 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound final
{
public:
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound) == 0x000020, "Wrong size on BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound, CallFunc_GetCenterOfMass_ReturnValue) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_Play_Show_Clutter_Sound::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ReceptacleEmptied
// 0x0018 (0x0018 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ReceptacleEmptied final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ReceptacleEmptied");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied) == 0x000018, "Wrong size on BP_ReceptacleFurnitureBase_C_ReceptacleEmptied");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleEmptied::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied, CallFunc_Set_Remove_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleEmptied::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleEmptied::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied, CallFunc_Set_Length_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleEmptied::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleEmptied, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleEmptied::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ReceptacleFilled
// 0x0018 (0x0018 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ReceptacleFilled final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ReceptacleFilled");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled) == 0x000018, "Wrong size on BP_ReceptacleFurnitureBase_C_ReceptacleFilled");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled, Caller) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleFilled::Caller' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleFilled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled, CallFunc_Set_Length_ReturnValue) == 0x00000C, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleFilled::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReceptacleFilled, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_ReceptacleFilled::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.ReloadAfterHousesLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded) == 0x000001, "Wrong alignment on BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded) == 0x000001, "Wrong size on BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded, Return) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_ReloadAfterHousesLoaded::Return' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.SetMissingReceptacleCategories
// 0x0038 (0x0038 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<EReceptacleType>                       CallFunc_Set_ToArray_Result;                       // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories) == 0x000038, "Wrong size on BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Set_ToArray_Result) == 0x000018, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_Set_Length_ReturnValue) == 0x000030, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingReceptacleCategories::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.SetMissingScoreZoneCategories
// 0x0018 (0x0018 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories final
{
public:
	TArray<EReceptacleType>                       CallFunc_Set_ToArray_Result;                       // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories) == 0x000018, "Wrong size on BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories, CallFunc_Set_ToArray_Result) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories, CallFunc_Set_Length_ReturnValue) == 0x000010, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_ReceptacleFurnitureBase_C_SetMissingScoreZoneCategories::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ReceptacleFurnitureBase.BP_ReceptacleFurnitureBase_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_ReceptacleFurnitureBase_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_MessReceptacleComponent_C*>  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReceptacleFurnitureBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ReceptacleFurnitureBase_C_UserConstructionScript");
static_assert(sizeof(BP_ReceptacleFurnitureBase_C_UserConstructionScript) == 0x000030, "Wrong size on BP_ReceptacleFurnitureBase_C_UserConstructionScript");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ReceptacleFurnitureBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReceptacleFurnitureBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ReceptacleFurnitureBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
