#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Resource_Receptacle

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Resource_Receptacle_C_BndEvt__BP_Resource_Receptacle_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.ExecuteUbergraph_BP_Resource_Receptacle
// 0x0370 (0x0370 - 0x0000)
struct BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_ResourceCrate_C*                    K2Node_DynamicCast_AsBP_Resource_Crate;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue_1;                // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_167[0x1];                                      // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetLocalPlayerTeamId_ReturnValue;         // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x02BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x02C8(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x2];                                      // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_ImportantNotifications_C*>   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0308(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ImportantNotifications_C*           CallFunc_Array_Get_Item_1;                         // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 K2Node_CustomEvent_PlayerStatesOfOwningTeam;       // 0x0330(0x0010)(ConstParm, ReferenceParm)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0358(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle");
static_assert(sizeof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle) == 0x000370, "Wrong size on BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, EntryPoint) == 0x000000, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000006, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000007, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000008, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000020, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000028, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000030, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000038, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_DynamicCast_AsBP_Resource_Crate) == 0x000138, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_DynamicCast_AsBP_Resource_Crate' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsBeingHeld_ReturnValue) == 0x000141, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, Temp_bool_Has_Been_Initd_Variable) == 0x000164, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000165, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsBeingHeld_ReturnValue_1) == 0x000166, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsBeingHeld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_CreateDelegate_OutputDelegate_1) == 0x000168, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_Not_PreBool_ReturnValue) == 0x000178, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000188, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001A0, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, Temp_int_Variable) == 0x000298, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetLocalPlayerTeamId_ReturnValue) == 0x00029C, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetLocalPlayerTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002A0, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x0002B8, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x0002BC, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetTeamAtPoint_ReturnValue) == 0x0002C8, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000300, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_Array_Get_Item) == 0x000301, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_Add_IntInt_ReturnValue) == 0x000304, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000308, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000318, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_Array_Get_Item_1) == 0x000320, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_IsValid_ReturnValue) == 0x000328, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_CustomEvent_PlayerStatesOfOwningTeam) == 0x000330, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_CustomEvent_PlayerStatesOfOwningTeam' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetPlayerState_ReturnValue) == 0x000340, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000348, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, K2Node_DynamicCast_bSuccess_1) == 0x000350, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000358, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle, CallFunc_Array_Contains_ReturnValue) == 0x000368, "Member 'BP_Resource_Receptacle_C_ExecuteUbergraph_BP_Resource_Receptacle::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.IsSameTeamAsPlayer0
// 0x0048 (0x0048 - 0x0000)
struct BP_Resource_Receptacle_C_IsSameTeamAsPlayer0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_IsSameTeamAsPlayer0");
static_assert(sizeof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0) == 0x000048, "Wrong size on BP_Resource_Receptacle_C_IsSameTeamAsPlayer0");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, ReturnValue) == 0x000000, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, Temp_byte_Variable) == 0x000001, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000008, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_GetTeamID_ReturnValue) == 0x000018, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, K2Node_DynamicCast_AsTeamable_Interface) == 0x000030, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_IsSameTeamAsPlayer0, CallFunc_GetTeamID_ReturnValue_1) == 0x000041, "Member 'BP_Resource_Receptacle_C_IsSameTeamAsPlayer0::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.Multi_Show New Unlocks
// 0x0010 (0x0010 - 0x0000)
struct BP_Resource_Receptacle_C_Multi_Show_New_Unlocks final
{
public:
	TArray<class APlayerStateJP*>                 PlayerStatesOfOwningTeam;                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Resource_Receptacle_C_Multi_Show_New_Unlocks) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_Multi_Show_New_Unlocks");
static_assert(sizeof(BP_Resource_Receptacle_C_Multi_Show_New_Unlocks) == 0x000010, "Wrong size on BP_Resource_Receptacle_C_Multi_Show_New_Unlocks");
static_assert(offsetof(BP_Resource_Receptacle_C_Multi_Show_New_Unlocks, PlayerStatesOfOwningTeam) == 0x000000, "Member 'BP_Resource_Receptacle_C_Multi_Show_New_Unlocks::PlayerStatesOfOwningTeam' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.ResourceDelivered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature final
{
public:
	class ACharacter*                             DeliveringCharacter;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature");
static_assert(sizeof(BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature) == 0x000008, "Wrong size on BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature");
static_assert(offsetof(BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature, DeliveringCharacter) == 0x000000, "Member 'BP_Resource_Receptacle_C_ResourceDelivered__DelegateSignature::DeliveringCharacter' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.SetMaterialBasedOnTeam
// 0x0028 (0x0028 - 0x0000)
struct BP_Resource_Receptacle_C_SetMaterialBasedOnTeam final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSameTeamAsPlayer0_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_SetMaterialBasedOnTeam");
static_assert(sizeof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam) == 0x000028, "Wrong size on BP_Resource_Receptacle_C_SetMaterialBasedOnTeam");
static_assert(offsetof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam, Temp_bool_Variable) == 0x000000, "Member 'BP_Resource_Receptacle_C_SetMaterialBasedOnTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam, Temp_object_Variable) == 0x000008, "Member 'BP_Resource_Receptacle_C_SetMaterialBasedOnTeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam, Temp_object_Variable_1) == 0x000010, "Member 'BP_Resource_Receptacle_C_SetMaterialBasedOnTeam::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam, CallFunc_IsSameTeamAsPlayer0_ReturnValue) == 0x000018, "Member 'BP_Resource_Receptacle_C_SetMaterialBasedOnTeam::CallFunc_IsSameTeamAsPlayer0_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Resource_Receptacle_C_SetMaterialBasedOnTeam, K2Node_Select_Default) == 0x000020, "Member 'BP_Resource_Receptacle_C_SetMaterialBasedOnTeam::K2Node_Select_Default' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.ToggleReceptacleVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_Resource_Receptacle_C_ToggleReceptacleVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_ToggleReceptacleVisibility) == 0x000001, "Wrong alignment on BP_Resource_Receptacle_C_ToggleReceptacleVisibility");
static_assert(sizeof(BP_Resource_Receptacle_C_ToggleReceptacleVisibility) == 0x000001, "Wrong size on BP_Resource_Receptacle_C_ToggleReceptacleVisibility");
static_assert(offsetof(BP_Resource_Receptacle_C_ToggleReceptacleVisibility, Visible) == 0x000000, "Member 'BP_Resource_Receptacle_C_ToggleReceptacleVisibility::Visible' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.GetTeam
// 0x0038 (0x0038 - 0x0000)
struct BP_Resource_Receptacle_C_GetTeam final
{
public:
	struct FTeam                                  ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(BP_Resource_Receptacle_C_GetTeam) == 0x000008, "Wrong alignment on BP_Resource_Receptacle_C_GetTeam");
static_assert(sizeof(BP_Resource_Receptacle_C_GetTeam) == 0x000038, "Wrong size on BP_Resource_Receptacle_C_GetTeam");
static_assert(offsetof(BP_Resource_Receptacle_C_GetTeam, ReturnValue) == 0x000000, "Member 'BP_Resource_Receptacle_C_GetTeam::ReturnValue' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.GetTeamID
// 0x0001 (0x0001 - 0x0000)
struct BP_Resource_Receptacle_C_GetTeamID final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_GetTeamID) == 0x000001, "Wrong alignment on BP_Resource_Receptacle_C_GetTeamID");
static_assert(sizeof(BP_Resource_Receptacle_C_GetTeamID) == 0x000001, "Wrong size on BP_Resource_Receptacle_C_GetTeamID");
static_assert(offsetof(BP_Resource_Receptacle_C_GetTeamID, ReturnValue) == 0x000000, "Member 'BP_Resource_Receptacle_C_GetTeamID::ReturnValue' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.HasTeam
// 0x0001 (0x0001 - 0x0000)
struct BP_Resource_Receptacle_C_HasTeam final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_HasTeam) == 0x000001, "Wrong alignment on BP_Resource_Receptacle_C_HasTeam");
static_assert(sizeof(BP_Resource_Receptacle_C_HasTeam) == 0x000001, "Wrong size on BP_Resource_Receptacle_C_HasTeam");
static_assert(offsetof(BP_Resource_Receptacle_C_HasTeam, ReturnValue) == 0x000000, "Member 'BP_Resource_Receptacle_C_HasTeam::ReturnValue' has a wrong offset!");

// Function BP_Resource_Receptacle.BP_Resource_Receptacle_C.TakeDamageFromAllTeams
// 0x0001 (0x0001 - 0x0000)
struct BP_Resource_Receptacle_C_TakeDamageFromAllTeams final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Resource_Receptacle_C_TakeDamageFromAllTeams) == 0x000001, "Wrong alignment on BP_Resource_Receptacle_C_TakeDamageFromAllTeams");
static_assert(sizeof(BP_Resource_Receptacle_C_TakeDamageFromAllTeams) == 0x000001, "Wrong size on BP_Resource_Receptacle_C_TakeDamageFromAllTeams");
static_assert(offsetof(BP_Resource_Receptacle_C_TakeDamageFromAllTeams, ReturnValue) == 0x000000, "Member 'BP_Resource_Receptacle_C_TakeDamageFromAllTeams::ReturnValue' has a wrong offset!");

}

