#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourcePileManager

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "S_ImportantNotificationReceivedMessage_structs.hpp"
#include "E_TimeOfDay_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.AddResourceCratesToDeliveryService
// 0x0078 (0x0078 - 0x0000)
struct BP_ResourcePileManager_C_AddResourceCratesToDeliveryService final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DeliveryService_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTeam>                          CallFunc_GetTeams_ReturnValue;                     // 0x0018(0x0010)(ReferenceParm)
	struct FTeam                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0038)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyPlayers_ReturnValue;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetFirstPlayerControllerFromTeam_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_AddResourceCratesToDeliveryService");
static_assert(sizeof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService) == 0x000078, "Wrong size on BP_ResourcePileManager_C_AddResourceCratesToDeliveryService");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_GetTeams_ReturnValue) == 0x000018, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_HasAnyPlayers_ReturnValue) == 0x000064, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_HasAnyPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_GetFirstPlayerControllerFromTeam_ReturnValue) == 0x000068, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_GetFirstPlayerControllerFromTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_AddResourceCratesToDeliveryService, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_ResourcePileManager_C_AddResourceCratesToDeliveryService::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.CreateResourceTooltipTutorial
// 0x0038 (0x0038 - 0x0000)
struct BP_ResourcePileManager_C_CreateResourceTooltipTutorial final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveGameplayMessage              K2Node_MakeStruct_ObjectiveGameplayMessage;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP_MatchBP_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class APlayerStateJP_MatchBP_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_CreateResourceTooltipTutorial");
static_assert(sizeof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial) == 0x000038, "Wrong size on BP_ResourcePileManager_C_CreateResourceTooltipTutorial");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, K2Node_MakeStruct_ObjectiveGameplayMessage) == 0x00000C, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::K2Node_MakeStruct_ObjectiveGameplayMessage' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_CreateResourceTooltipTutorial, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_ResourcePileManager_C_CreateResourceTooltipTutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.ExecuteUbergraph_BP_ResourcePileManager
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   K2Node_CustomEvent_TimeOfDay;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSpawn_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0068(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_TimeOfDay TimeOfDay)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ResourceListener_C> K2Node_DynamicCast_AsI_Resource_Listener;          // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WarmupBlockerManager_C*             CallFunc_GetActorOfClass_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager");
static_assert(sizeof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager) == 0x0000C0, "Wrong size on BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, EntryPoint) == 0x000000, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, Temp_int_Variable) == 0x000014, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000030, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, Temp_bool_Variable) == 0x000038, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, Temp_bool_IsClosed_Variable) == 0x00003A, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_GetActorOfClass_ReturnValue) == 0x000040, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_CustomEvent_TimeOfDay) == 0x000048, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_CustomEvent_TimeOfDay' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_IsServer_ReturnValue) == 0x000049, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_ShouldSpawn_ReturnValue) == 0x00004B, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_ShouldSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_GetIsPie_ReturnValue) == 0x00004C, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, Temp_bool_Has_Been_Initd_Variable) == 0x00004D, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000050, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_Select_Default) == 0x000058, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000068, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_DynamicCast_AsI_Resource_Listener) == 0x000090, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_DynamicCast_AsI_Resource_Listener' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0000B0, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000B8, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000BC, "Member 'BP_ResourcePileManager_C_ExecuteUbergraph_BP_ResourcePileManager::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.GetFirstPlayerControllerFromTeam
// 0x0060 (0x0060 - 0x0000)
struct BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam final
{
public:
	struct FTeam                                  Team;                                              // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class APlayerController*                      ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0040(0x0010)(ReferenceParm)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam");
static_assert(sizeof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam) == 0x000060, "Wrong size on BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam");
static_assert(offsetof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam, Team) == 0x000000, "Member 'BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam::Team' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam, ReturnValue) == 0x000038, "Member 'BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000040, "Member 'BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'BP_ResourcePileManager_C_GetFirstPlayerControllerFromTeam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.MessagePlayersDelivered
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ResourcePileManager_C_MessagePlayersDelivered final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerControllerJP_Match*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	struct FS_ImportantNotificationReceivedMessage K2Node_MakeStruct_S_ImportantNotificationReceivedMessage; // 0x0020(0x0090)(HasGetValueTypeHash)
	class APlayerControllerJP_Match*              CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerControllerJP_MatchBPComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_MessagePlayersDelivered) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_MessagePlayersDelivered");
static_assert(sizeof(BP_ResourcePileManager_C_MessagePlayersDelivered) == 0x0000D0, "Wrong size on BP_ResourcePileManager_C_MessagePlayersDelivered");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, K2Node_MakeStruct_S_ImportantNotificationReceivedMessage) == 0x000020, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::K2Node_MakeStruct_S_ImportantNotificationReceivedMessage' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersDelivered, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_ResourcePileManager_C_MessagePlayersDelivered::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.MessagePlayersPreDelivery
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ResourcePileManager_C_MessagePlayersPreDelivery final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerControllerJP_Match*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	struct FS_ImportantNotificationReceivedMessage K2Node_MakeStruct_S_ImportantNotificationReceivedMessage; // 0x0020(0x0090)(HasGetValueTypeHash)
	class APlayerControllerJP_Match*              CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerControllerJP_MatchBPComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_MessagePlayersPreDelivery) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_MessagePlayersPreDelivery");
static_assert(sizeof(BP_ResourcePileManager_C_MessagePlayersPreDelivery) == 0x0000D0, "Wrong size on BP_ResourcePileManager_C_MessagePlayersPreDelivery");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, K2Node_MakeStruct_S_ImportantNotificationReceivedMessage) == 0x000020, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::K2Node_MakeStruct_S_ImportantNotificationReceivedMessage' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_MessagePlayersPreDelivery, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_ResourcePileManager_C_MessagePlayersPreDelivery::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.On_TimeOfDayChange
// 0x0001 (0x0001 - 0x0000)
struct BP_ResourcePileManager_C_On_TimeOfDayChange final
{
public:
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_On_TimeOfDayChange) == 0x000001, "Wrong alignment on BP_ResourcePileManager_C_On_TimeOfDayChange");
static_assert(sizeof(BP_ResourcePileManager_C_On_TimeOfDayChange) == 0x000001, "Wrong size on BP_ResourcePileManager_C_On_TimeOfDayChange");
static_assert(offsetof(BP_ResourcePileManager_C_On_TimeOfDayChange, TimeOfDay) == 0x000000, "Member 'BP_ResourcePileManager_C_On_TimeOfDayChange::TimeOfDay' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.Respawn Resource Piles at Spawns if Depleted
// 0x0038 (0x0038 - 0x0000)
struct BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Count;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourcePile_Spawner_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted");
static_assert(sizeof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted) == 0x000038, "Wrong size on BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, Amount) == 0x000000, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::Amount' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, L_Count) == 0x000004, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::L_Count' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, Temp_int_Variable) == 0x000010, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_ResourcePileManager_C_Respawn_Resource_Piles_at_Spawns_if_Depleted::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.Restock Non Depleted Resource Piles
// 0x0020 (0x0020 - 0x0000)
struct BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourcePile_Spawner_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles");
static_assert(sizeof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles) == 0x000020, "Wrong size on BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_ResourcePileManager_C_Restock_Non_Depleted_Resource_Piles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.ShouldSpawn
// 0x0010 (0x0010 - 0x0000)
struct BP_ResourcePileManager_C_ShouldSpawn final
{
public:
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_ShouldSpawn) == 0x000004, "Wrong alignment on BP_ResourcePileManager_C_ShouldSpawn");
static_assert(sizeof(BP_ResourcePileManager_C_ShouldSpawn) == 0x000010, "Wrong size on BP_ResourcePileManager_C_ShouldSpawn");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, TimeOfDay) == 0x000000, "Member 'BP_ResourcePileManager_C_ShouldSpawn::TimeOfDay' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, ReturnValue) == 0x000001, "Member 'BP_ResourcePileManager_C_ShouldSpawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_ResourcePileManager_C_ShouldSpawn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_ResourcePileManager_C_ShouldSpawn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, Temp_int_Variable) == 0x000004, "Member 'BP_ResourcePileManager_C_ShouldSpawn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResourcePileManager_C_ShouldSpawn::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'BP_ResourcePileManager_C_ShouldSpawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_ShouldSpawn, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ResourcePileManager_C_ShouldSpawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.StoreReferences
// 0x0010 (0x0010 - 0x0000)
struct BP_ResourcePileManager_C_StoreReferences final
{
public:
	TArray<class ABP_ResourcePile_Spawner_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ResourcePileManager_C_StoreReferences) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_StoreReferences");
static_assert(sizeof(BP_ResourcePileManager_C_StoreReferences) == 0x000010, "Wrong size on BP_ResourcePileManager_C_StoreReferences");
static_assert(offsetof(BP_ResourcePileManager_C_StoreReferences, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BP_ResourcePileManager_C_StoreReferences::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

// Function BP_ResourcePileManager.BP_ResourcePileManager_C.HasAnyPlayers
// 0x0058 (0x0058 - 0x0000)
struct BP_ResourcePileManager_C_HasAnyPlayers final
{
public:
	struct FTeam                                  Team;                                              // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePileManager_C_HasAnyPlayers) == 0x000008, "Wrong alignment on BP_ResourcePileManager_C_HasAnyPlayers");
static_assert(sizeof(BP_ResourcePileManager_C_HasAnyPlayers) == 0x000058, "Wrong size on BP_ResourcePileManager_C_HasAnyPlayers");
static_assert(offsetof(BP_ResourcePileManager_C_HasAnyPlayers, Team) == 0x000000, "Member 'BP_ResourcePileManager_C_HasAnyPlayers::Team' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_HasAnyPlayers, ReturnValue) == 0x000038, "Member 'BP_ResourcePileManager_C_HasAnyPlayers::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePileManager_C_HasAnyPlayers, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000040, "Member 'BP_ResourcePileManager_C_HasAnyPlayers::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
