#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourceCrate

#include "Basic.hpp"

#include "BP_HeldMessItem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResourceCrate.BP_ResourceCrate_C
// 0x0040 (0x0650 - 0x0610)
class ABP_ResourceCrate_C : public ABP_HeldMessItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ResourceCrate_C;                 // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PingableComponent_C*                BP_PingableComponent;                              // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_Indicator_C*                        AC_Indicator;                                      // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DoNotLaunch;                                       // 0x0630(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             LastHolder;                                        // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PreSpawned;                                        // 0x0640(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Destroy_Incoming_Resource_Crate();
	void DisableCollisionAndHide();
	void EnableCollisionAndShow();
	void EnableTrail();
	void ExecuteUbergraph_BP_ResourceCrate(int32 EntryPoint);
	void ForceOffscreenIndicatorOn();
	void LaunchCrate();
	void Multi_Spawn_Hand_In_Cosmetics();
	void Multi_Throw(const struct FVector& Velocity);
	void OnDropped();
	void OnGrabbed();
	void ReceiveBeginPlay();
	void StopTrailParticle();
	void ToggleReceptacleVisual(bool Visible, class ACharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResourceCrate_C">();
	}
	static class ABP_ResourceCrate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResourceCrate_C>();
	}
};
static_assert(alignof(ABP_ResourceCrate_C) == 0x000010, "Wrong alignment on ABP_ResourceCrate_C");
static_assert(sizeof(ABP_ResourceCrate_C) == 0x000650, "Wrong size on ABP_ResourceCrate_C");
static_assert(offsetof(ABP_ResourceCrate_C, UberGraphFrame_BP_ResourceCrate_C) == 0x000610, "Member 'ABP_ResourceCrate_C::UberGraphFrame_BP_ResourceCrate_C' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, BP_PingableComponent) == 0x000618, "Member 'ABP_ResourceCrate_C::BP_PingableComponent' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, AC_Indicator) == 0x000620, "Member 'ABP_ResourceCrate_C::AC_Indicator' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, SpringArm) == 0x000628, "Member 'ABP_ResourceCrate_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, DoNotLaunch) == 0x000630, "Member 'ABP_ResourceCrate_C::DoNotLaunch' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, LastHolder) == 0x000638, "Member 'ABP_ResourceCrate_C::LastHolder' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrate_C, PreSpawned) == 0x000640, "Member 'ABP_ResourceCrate_C::PreSpawned' has a wrong offset!");

}

