#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RangedWeaponBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RangedWeaponBase.BP_RangedWeaponBase_C.GetProjectileSpawnTransform
// 0x0140 (0x0140 - 0x0000)
struct BP_RangedWeaponBase_C_GetProjectileSpawnTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform) == 0x000010, "Wrong alignment on BP_RangedWeaponBase_C_GetProjectileSpawnTransform");
static_assert(sizeof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform) == 0x000140, "Wrong size on BP_RangedWeaponBase_C_GetProjectileSpawnTransform");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, ReturnValue) == 0x000000, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000068, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000078, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_GetForwardVector_ReturnValue) == 0x000090, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RangedWeaponBase_C_GetProjectileSpawnTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_RangedWeaponBase_C_GetProjectileSpawnTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

