#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoreBase

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StoreBase.BP_StoreBase_C.BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_StoreBase_C_BndEvt__BP_StoreBase_HandInCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.Cosmetic Collect
// 0x0008 (0x0008 - 0x0000)
struct BP_StoreBase_C_Cosmetic_Collect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StoreBase_C_Cosmetic_Collect) == 0x000008, "Wrong alignment on BP_StoreBase_C_Cosmetic_Collect");
static_assert(sizeof(BP_StoreBase_C_Cosmetic_Collect) == 0x000008, "Wrong size on BP_StoreBase_C_Cosmetic_Collect");
static_assert(offsetof(BP_StoreBase_C_Cosmetic_Collect, Target) == 0x000000, "Member 'BP_StoreBase_C_Cosmetic_Collect::Target' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.DoesTeamAtPointHavePlayers
// 0x0080 (0x0080 - 0x0000)
struct BP_StoreBase_C_DoesTeamAtPointHavePlayers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0030(0x0038)(ConstParm, NoDestructor)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StoreBase_C_DoesTeamAtPointHavePlayers) == 0x000008, "Wrong alignment on BP_StoreBase_C_DoesTeamAtPointHavePlayers");
static_assert(sizeof(BP_StoreBase_C_DoesTeamAtPointHavePlayers) == 0x000080, "Wrong size on BP_StoreBase_C_DoesTeamAtPointHavePlayers");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, ReturnValue) == 0x000000, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000020, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x000024, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000030, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000068, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_Array_IsEmpty_ReturnValue) == 0x000078, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_DoesTeamAtPointHavePlayers, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_StoreBase_C_DoesTeamAtPointHavePlayers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.ExecuteUbergraph_BP_StoreBase
// 0x04B0 (0x04B0 - 0x0000)
struct BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RoomManager_C*                      CallFunc_GetRoomManagerToUpgrade_RoomManager;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAC_POI_ItemMarker_C*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAC_POI_ItemMarker_C*                   CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0xB];                                      // 0x0135(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ShopInteraction_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0280(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_ResourceCrate_C*                    K2Node_DynamicCast_AsBP_Resource_Crate;            // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0390(0x0010)(ReferenceParm)
	TArray<class UWI_ImportantNotifications_C*>   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x03A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_ImportantNotifications_C*           CallFunc_Array_Get_Item_1;                         // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfResourcesForTeam_ReturnValue;  // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_2;                         // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRange_ReturnValue;                    // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRange_ReturnValue_1;                  // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF[0x1];                                      // 0x03BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 K2Node_CustomEvent_PlayerStatesOfOwningTeam;       // 0x03C0(0x0010)(ConstParm, ReferenceParm)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTeamAtPointHavePlayers_ReturnValue;   // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB[0x5];                                      // 0x03EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x040C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0418(0x0038)(ConstParm, NoDestructor)
	class UObject*                                Temp_object_Variable_1;                            // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStartingResources_StartingResources;   // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStartingResources_StartingResources_1; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ClosetStore_C*                      K2Node_DynamicCast_AsBP_Closet_Store;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ClosetStore_C*                      K2Node_DynamicCast_AsBP_Closet_Store_1;            // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase) == 0x000010, "Wrong alignment on BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase");
static_assert(sizeof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase) == 0x0004B0, "Wrong size on BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, EntryPoint) == 0x000000, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000008, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000050, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000058, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_object_Variable) == 0x000068, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000070, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_Loaded_1) == 0x000090, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x00009C, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A4, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000B4, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_HasAuthority_ReturnValue) == 0x0000B5, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetRoomManagerToUpgrade_RoomManager) == 0x0000C8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetRoomManagerToUpgrade_RoomManager' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_ListenToInitializationStateEnded_ReturnValue_1) == 0x0000D8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_ListenToInitializationStateEnded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsValid_ReturnValue_2) == 0x0000E1, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_bool_Has_Been_Initd_Variable) == 0x0000E2, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_Time) == 0x0000E4, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_NewLevel) == 0x0000E8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_Level) == 0x0000F8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_SwitchInteger_CmpSuccess) == 0x0000FC, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000100, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Array_Get_Item) == 0x000110, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000118, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_bool_IsClosed_Variable) == 0x000121, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x000124, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000134, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000140, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_BreakTransform_Location) == 0x0001A0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_BreakTransform_Rotation) == 0x0001B8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_BreakTransform_Scale) == 0x0001D0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_MakeTransform_ReturnValue) == 0x0001F0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000250, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000258, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000260, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_OtherActor) == 0x000268, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_OtherComp) == 0x000270, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000278, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_bFromSweep) == 0x00027C, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_ComponentBoundEvent_SweepResult) == 0x000280, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsBP_Resource_Crate) == 0x000378, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsBP_Resource_Crate' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess_1) == 0x000380, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsBeingHeld_ReturnValue) == 0x000381, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_Target) == 0x000388, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000390, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0003A0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Array_Get_Item_1) == 0x0003B0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetAmountOfResourcesForTeam_ReturnValue) == 0x0003B8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetAmountOfResourcesForTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Array_Get_Item_2) == 0x0003BC, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsInRange_ReturnValue) == 0x0003BD, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_IsInRange_ReturnValue_1) == 0x0003BE, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_IsInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_PlayerStatesOfOwningTeam) == 0x0003C0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_PlayerStatesOfOwningTeam' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetPlayerState_ReturnValue) == 0x0003D0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_HasAuthority_ReturnValue_1) == 0x0003D8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsPlayer_State_JP) == 0x0003E0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess_2) == 0x0003E8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Array_Contains_ReturnValue) == 0x0003E9, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_DoesTeamAtPointHavePlayers_ReturnValue) == 0x0003EA, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_DoesTeamAtPointHavePlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003F0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000408, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x00040C, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000418, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, Temp_object_Variable_1) == 0x000450, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000458, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess_3) == 0x000460, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetStartingResources_StartingResources) == 0x000464, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetStartingResources_StartingResources' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000468, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_CustomEvent_Loaded) == 0x000470, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GetStartingResources_StartingResources_1) == 0x000478, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GetStartingResources_StartingResources_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsBP_Closet_Store) == 0x000480, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsBP_Closet_Store' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess_4) == 0x000488, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000489, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_AsBP_Closet_Store_1) == 0x000490, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_AsBP_Closet_Store_1' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, K2Node_DynamicCast_bSuccess_5) == 0x000498, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0004A0, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x0004A8, "Member 'BP_StoreBase_C_ExecuteUbergraph_BP_StoreBase::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.GetAmountOfResourcesForTeam
// 0x0078 (0x0078 - 0x0000)
struct BP_StoreBase_C_GetAmountOfResourcesForTeam final
{
public:
	TArray<class APlayerStateJP*>                 PlayerStatesForTeam;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResourceData                          CallFunc_GetPlayerEconomy_Money;                   // 0x0048(0x0008)(NoDestructor)
	struct FResourceData                          CallFunc_GetPlayerEconomy_Wood;                    // 0x0050(0x0008)(NoDestructor)
	struct FResourceData                          CallFunc_GetPlayerEconomy_Perfectness;             // 0x0058(0x0008)(NoDestructor)
	struct FResourceData                          CallFunc_GetPlayerEconomy_PassiveIncome;           // 0x0060(0x0008)(NoDestructor)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FFloor_A_ImplicitCast;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StoreBase_C_GetAmountOfResourcesForTeam) == 0x000008, "Wrong alignment on BP_StoreBase_C_GetAmountOfResourcesForTeam");
static_assert(sizeof(BP_StoreBase_C_GetAmountOfResourcesForTeam) == 0x000078, "Wrong size on BP_StoreBase_C_GetAmountOfResourcesForTeam");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, PlayerStatesForTeam) == 0x000000, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::PlayerStatesForTeam' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, ReturnValue) == 0x000010, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_Get_ClassLog_Name_name) == 0x000020, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000040, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetPlayerEconomy_Money) == 0x000048, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetPlayerEconomy_Money' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetPlayerEconomy_Wood) == 0x000050, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetPlayerEconomy_Wood' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetPlayerEconomy_Perfectness) == 0x000058, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetPlayerEconomy_Perfectness' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_GetPlayerEconomy_PassiveIncome) == 0x000060, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_GetPlayerEconomy_PassiveIncome' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_FFloor_ReturnValue) == 0x000068, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StoreBase_C_GetAmountOfResourcesForTeam, CallFunc_FFloor_A_ImplicitCast) == 0x000070, "Member 'BP_StoreBase_C_GetAmountOfResourcesForTeam::CallFunc_FFloor_A_ImplicitCast' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.GetMaterialType
// 0x0001 (0x0001 - 0x0000)
struct BP_StoreBase_C_GetMaterialType final
{
public:
	E_MaterialTypes                               MaterialType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StoreBase_C_GetMaterialType) == 0x000001, "Wrong alignment on BP_StoreBase_C_GetMaterialType");
static_assert(sizeof(BP_StoreBase_C_GetMaterialType) == 0x000001, "Wrong size on BP_StoreBase_C_GetMaterialType");
static_assert(offsetof(BP_StoreBase_C_GetMaterialType, MaterialType) == 0x000000, "Member 'BP_StoreBase_C_GetMaterialType::MaterialType' has a wrong offset!");

// Function BP_StoreBase.BP_StoreBase_C.GetRoomManagerToUpgrade
// 0x0070 (0x0070 - 0x0000)
struct BP_StoreBase_C_GetRoomManagerToUpgrade final
{
public:
	class ABP_RoomManager_C*                      RoomManager;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGroundsKeeperAtPoint_bFoundTeam;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
