#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SlingProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SlingProjectile.BP_SlingProjectile_C.ExecuteUbergraph_BP_SlingProjectile
// 0x0020 (0x0020 - 0x0000)
struct BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile) == 0x000008, "Wrong alignment on BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile");
static_assert(sizeof(BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile) == 0x000020, "Wrong size on BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile");
static_assert(offsetof(BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile, EntryPoint) == 0x000000, "Member 'BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_SlingProjectile_C_ExecuteUbergraph_BP_SlingProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_SlingProjectile.BP_SlingProjectile_C.HandleBounce
// 0x0118 (0x0118 - 0x0000)
struct BP_SlingProjectile_C_HandleBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact_Velocity;                                   // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SlingProjectile_C_HandleBounce) == 0x000008, "Wrong alignment on BP_SlingProjectile_C_HandleBounce");
static_assert(sizeof(BP_SlingProjectile_C_HandleBounce) == 0x000118, "Wrong size on BP_SlingProjectile_C_HandleBounce");
static_assert(offsetof(BP_SlingProjectile_C_HandleBounce, Hit) == 0x000000, "Member 'BP_SlingProjectile_C_HandleBounce::Hit' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_C_HandleBounce, Impact_Velocity) == 0x0000F8, "Member 'BP_SlingProjectile_C_HandleBounce::Impact_Velocity' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_C_HandleBounce, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'BP_SlingProjectile_C_HandleBounce::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_C_HandleBounce, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'BP_SlingProjectile_C_HandleBounce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

