#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleDestroyFracture

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SimpleDestroyFracture.BP_SimpleDestroyFracture_C
// 0x0060 (0x02F0 - 0x0290)
class ABP_SimpleDestroyFracture_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         UniformVector;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CullingField;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloff;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFieldSystemComponent*                  FieldSystem;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           GeometryCollection;                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         LinearVelocity;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SimpleDestroyFracture(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SimpleDestroyFracture_C">();
	}
	static class ABP_SimpleDestroyFracture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SimpleDestroyFracture_C>();
	}
};
static_assert(alignof(ABP_SimpleDestroyFracture_C) == 0x000008, "Wrong alignment on ABP_SimpleDestroyFracture_C");
static_assert(sizeof(ABP_SimpleDestroyFracture_C) == 0x0002F0, "Wrong size on ABP_SimpleDestroyFracture_C");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, UberGraphFrame) == 0x000290, "Member 'ABP_SimpleDestroyFracture_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, Scene) == 0x000298, "Member 'ABP_SimpleDestroyFracture_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, Niagara) == 0x0002A0, "Member 'ABP_SimpleDestroyFracture_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, UniformVector) == 0x0002A8, "Member 'ABP_SimpleDestroyFracture_C::UniformVector' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, CullingField) == 0x0002B0, "Member 'ABP_SimpleDestroyFracture_C::CullingField' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, RadialVector) == 0x0002B8, "Member 'ABP_SimpleDestroyFracture_C::RadialVector' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, RadialFalloff) == 0x0002C0, "Member 'ABP_SimpleDestroyFracture_C::RadialFalloff' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, FieldSystem) == 0x0002C8, "Member 'ABP_SimpleDestroyFracture_C::FieldSystem' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, GeometryCollection) == 0x0002D0, "Member 'ABP_SimpleDestroyFracture_C::GeometryCollection' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_SimpleDestroyFracture_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, SpawnSound) == 0x0002E0, "Member 'ABP_SimpleDestroyFracture_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(ABP_SimpleDestroyFracture_C, LinearVelocity) == 0x0002E8, "Member 'ABP_SimpleDestroyFracture_C::LinearVelocity' has a wrong offset!");

}

