#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleDestroyFracture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SimpleDestroyFracture.BP_SimpleDestroyFracture_C.ExecuteUbergraph_BP_SimpleDestroyFracture
// 0x0088 (0x0088 - 0x0000)
struct BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         CallFunc_SetRadialFalloff_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_SetCullingField_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture) == 0x000008, "Wrong alignment on BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture");
static_assert(sizeof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture) == 0x000088, "Wrong size on BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, EntryPoint) == 0x000000, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000020, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_SetRadialVector_ReturnValue) == 0x000038, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_SetRadialFalloff_ReturnValue) == 0x000040, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_SetRadialFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_SetCullingField_ReturnValue) == 0x000048, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_SetCullingField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_GetUpVector_ReturnValue) == 0x000050, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture, CallFunc_SetUniformVector_ReturnValue) == 0x000080, "Member 'BP_SimpleDestroyFracture_C_ExecuteUbergraph_BP_SimpleDestroyFracture::CallFunc_SetUniformVector_ReturnValue' has a wrong offset!");

}

