#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_TelephonePoles_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_TelephonePoles_Base.Bp_TelephonePoles_Base_C.Construct Rope Spline
// 0x0150 (0x0150 - 0x0000)
struct Bp_TelephonePoles_Base_C_Construct_Rope_Spline final
{
public:
	struct FVector                                InStartLocation;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InEndLocation;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue; // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline) == 0x000008, "Wrong alignment on Bp_TelephonePoles_Base_C_Construct_Rope_Spline");
static_assert(sizeof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline) == 0x000150, "Wrong size on Bp_TelephonePoles_Base_C_Construct_Rope_Spline");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, InStartLocation) == 0x000000, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::InStartLocation' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, InEndLocation) == 0x000018, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::InEndLocation' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_GetSplineLength_ReturnValue) == 0x000038, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000040, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000060, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue) == 0x000078, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_VSize_ReturnValue) == 0x0000A8, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B0, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000D8, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000E0, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000F8, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x000110, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000128, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_Construct_Rope_Spline, CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000148, "Member 'Bp_TelephonePoles_Base_C_Construct_Rope_Spline::CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function Bp_TelephonePoles_Base.Bp_TelephonePoles_Base_C.ConstructRopeMesh
// 0x0220 (0x0220 - 0x0000)
struct Bp_TelephonePoles_Base_C_ConstructRopeMesh final
{
public:
	double                                        InternalLength;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SegmentSpacing;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TelephonePoles_Base_C_ConstructRopeMesh) == 0x000010, "Wrong alignment on Bp_TelephonePoles_Base_C_ConstructRopeMesh");
static_assert(sizeof(Bp_TelephonePoles_Base_C_ConstructRopeMesh) == 0x000220, "Wrong size on Bp_TelephonePoles_Base_C_ConstructRopeMesh");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, InternalLength) == 0x000000, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::InternalLength' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, SegmentSpacing) == 0x000008, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::SegmentSpacing' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, Segments) == 0x000010, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::Segments' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, Temp_int_Variable) == 0x000014, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000038, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000048, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000070, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_AddComponent_ReturnValue) == 0x0000F0, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x0000F9, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_IsValid_ReturnValue_1) == 0x0000FA, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000100, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Normal_ReturnValue) == 0x000118, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000130, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000148, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000160, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000178, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Normal_ReturnValue_1) == 0x000190, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001A8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetSplineLength_ReturnValue) == 0x0001C0, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_FMax_ReturnValue) == 0x0001C8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001D0, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_FTrunc_ReturnValue) == 0x0001D8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0001E0, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001F0, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001F8, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001FC, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000200, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000204, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000208, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_ConstructRopeMesh, CallFunc_FMax_A_ImplicitCast) == 0x000210, "Member 'Bp_TelephonePoles_Base_C_ConstructRopeMesh::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

// Function Bp_TelephonePoles_Base.Bp_TelephonePoles_Base_C.UserConstructionScript
// 0x0090 (0x0090 - 0x0000)
struct Bp_TelephonePoles_Base_C_UserConstructionScript final
{
public:
	struct FRotator                               NewLocalVar_0;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TelephonePoles_Base_C_UserConstructionScript) == 0x000010, "Wrong alignment on Bp_TelephonePoles_Base_C_UserConstructionScript");
static_assert(sizeof(Bp_TelephonePoles_Base_C_UserConstructionScript) == 0x000090, "Wrong size on Bp_TelephonePoles_Base_C_UserConstructionScript");
static_assert(offsetof(Bp_TelephonePoles_Base_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'Bp_TelephonePoles_Base_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_UserConstructionScript, Temp_struct_Variable) == 0x000020, "Member 'Bp_TelephonePoles_Base_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_Base_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'Bp_TelephonePoles_Base_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

