#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trashbag_Equipable

#include "Basic.hpp"

#include "S_HighlightParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_Trashbag_Equipable.BP_Trashbag_Equipable_C.ExecuteUbergraph_BP_Trashbag_Equipable
// 0x0038 (0x0038 - 0x0000)
struct BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HighlightParameters                 K2Node_MakeStruct_S_HighlightParameters;           // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HighlightParameters                 K2Node_MakeStruct_S_HighlightParameters_1;         // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable) == 0x000008, "Wrong alignment on BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable");
static_assert(sizeof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable) == 0x000038, "Wrong size on BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable");
static_assert(offsetof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable, EntryPoint) == 0x000000, "Member 'BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable, K2Node_MakeStruct_S_HighlightParameters) == 0x000018, "Member 'BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable::K2Node_MakeStruct_S_HighlightParameters' has a wrong offset!");
static_assert(offsetof(BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable, K2Node_MakeStruct_S_HighlightParameters_1) == 0x000028, "Member 'BP_Trashbag_Equipable_C_ExecuteUbergraph_BP_Trashbag_Equipable::K2Node_MakeStruct_S_HighlightParameters_1' has a wrong offset!");

}

