#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamSurrenderEndCondition

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TeamSurrenderEndCondition.BP_TeamSurrenderEndCondition_C.AreAllPlayersSurrendering
// 0x0040 (0x0040 - 0x0000)
struct BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllPlayersSurrendering;                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering) == 0x000008, "Wrong alignment on BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering");
static_assert(sizeof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering) == 0x000040, "Wrong size on BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, TeamId) == 0x000000, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, AllPlayersSurrendering) == 0x000001, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::AllPlayersSurrendering' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000008, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP) == 0x000028, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_Array_IsEmpty_ReturnValue) == 0x000031, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_TeamSurrenderEndCondition_C_AreAllPlayersSurrendering::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamSurrenderEndCondition.BP_TeamSurrenderEndCondition_C.CreateObjective
// 0x0020 (0x0020 - 0x0000)
struct BP_TeamSurrenderEndCondition_C_CreateObjective final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DestructionObjective_C*             CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObjectiveBase*>                 CallFunc_CreateObjective_ReturnValue;              // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_TeamSurrenderEndCondition_C_CreateObjective) == 0x000008, "Wrong alignment on BP_TeamSurrenderEndCondition_C_CreateObjective");
static_assert(sizeof(BP_TeamSurrenderEndCondition_C_CreateObjective) == 0x000020, "Wrong size on BP_TeamSurrenderEndCondition_C_CreateObjective");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_CreateObjective, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_TeamSurrenderEndCondition_C_CreateObjective::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_CreateObjective, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_TeamSurrenderEndCondition_C_CreateObjective::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_CreateObjective, CallFunc_CreateObjective_ReturnValue) == 0x000010, "Member 'BP_TeamSurrenderEndCondition_C_CreateObjective::CallFunc_CreateObjective_ReturnValue' has a wrong offset!");

// Function BP_TeamSurrenderEndCondition.BP_TeamSurrenderEndCondition_C.Does Team Have Valid Player
// 0x0040 (0x0040 - 0x0000)
struct BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ID;                                                // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player) == 0x000008, "Wrong alignment on BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player");
static_assert(sizeof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player) == 0x000040, "Wrong size on BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, TeamId) == 0x000000, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, Return) == 0x000001, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::Return' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, ID) == 0x000002, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::ID' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000008, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_GetPawn_ReturnValue) == 0x000028, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_TeamSurrenderEndCondition_C_Does_Team_Have_Valid_Player::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamSurrenderEndCondition.BP_TeamSurrenderEndCondition_C.ExecuteUbergraph_BP_TeamSurrenderEndCondition
// 0x0088 (0x0088 - 0x0000)
struct BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering_1; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition) == 0x000008, "Wrong alignment on BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition");
static_assert(sizeof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition) == 0x000088, "Wrong size on BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, EntryPoint) == 0x000000, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Conv_ByteToString_ReturnValue) == 0x000008, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Conv_ByteToString_ReturnValue_1) == 0x000040, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Conv_ByteToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Get_ClassLog_Name_name) == 0x000050, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering) == 0x000070, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering_1) == 0x000071, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_AreAllPlayersSurrendering_AllPlayersSurrendering_1' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition, CallFunc_Get_ClassLog_Name_name_1) == 0x000078, "Member 'BP_TeamSurrenderEndCondition_C_ExecuteUbergraph_BP_TeamSurrenderEndCondition::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");

// Function BP_TeamSurrenderEndCondition.BP_TeamSurrenderEndCondition_C.HasTeamAlreadyBeenEliminated
// 0x0048 (0x0048 - 0x0000)
struct BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eliminated;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0008(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated) == 0x000008, "Wrong alignment on BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated");
static_assert(sizeof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated) == 0x000048, "Wrong size on BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated, TeamId) == 0x000000, "Member 'BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated::TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated, Eliminated) == 0x000001, "Member 'BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated::Eliminated' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated, CallFunc_GetTeam_ReturnValue) == 0x000008, "Member 'BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_TeamSurrenderEndCondition_C_HasTeamAlreadyBeenEliminated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

