#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TeamCamera.BP_TeamCamera_C.ExecuteUbergraph_BP_TeamCamera
// 0x0290 (0x0290 - 0x0000)
struct BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BlendTime;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0180(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera) == 0x000010, "Wrong alignment on BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera");
static_assert(sizeof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera) == 0x000290, "Wrong size on BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, EntryPoint) == 0x000000, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, K2Node_CustomEvent_BlendTime) == 0x000014, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::K2Node_CustomEvent_BlendTime' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, K2Node_CustomEvent_Duration) == 0x000018, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_GetRelativeTransform_ReturnValue) == 0x000040, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakVector_Y) == 0x0000F0, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_BreakVector_Z) == 0x0000F8, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000180, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_MakeVector_Y_ImplicitCast) == 0x000278, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000280, "Member 'BP_TeamCamera_C_ExecuteUbergraph_BP_TeamCamera::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_TeamCamera.BP_TeamCamera_C.SwitchToTeamCamera
// 0x0010 (0x0010 - 0x0000)
struct BP_TeamCamera_C_SwitchToTeamCamera final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamCamera_C_SwitchToTeamCamera) == 0x000008, "Wrong alignment on BP_TeamCamera_C_SwitchToTeamCamera");
static_assert(sizeof(BP_TeamCamera_C_SwitchToTeamCamera) == 0x000010, "Wrong size on BP_TeamCamera_C_SwitchToTeamCamera");
static_assert(offsetof(BP_TeamCamera_C_SwitchToTeamCamera, BlendTime) == 0x000000, "Member 'BP_TeamCamera_C_SwitchToTeamCamera::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_TeamCamera_C_SwitchToTeamCamera, Duration) == 0x000008, "Member 'BP_TeamCamera_C_SwitchToTeamCamera::Duration' has a wrong offset!");

}

