#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialManager

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "S_TutorialTaskCompletedPayload_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_TutorialEndedPayload_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_TutorialTaskStartedPayload_structs.hpp"


namespace SDK::Params
{

// Function BP_TutorialManager.BP_TutorialManager_C.ApplyIncreasedStaminaRegenGE
// 0x0020 (0x0020 - 0x0000)
struct BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE) == 0x000008, "Wrong alignment on BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE");
static_assert(sizeof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE) == 0x000020, "Wrong size on BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE");
static_assert(offsetof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000018, "Member 'BP_TutorialManager_C_ApplyIncreasedStaminaRegenGE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_TutorialManager.BP_TutorialManager_C.ExecuteUbergraph_BP_TutorialManager
// 0x03F8 (0x03F8 - 0x0000)
struct BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResourcePayload                       Temp_struct_Variable;                              // 0x0008(0x0028)(NoDestructor)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResourcePayload                       Temp_struct_Variable_1;                            // 0x0050(0x0028)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectiveManagerTutorialComponent*     K2Node_DynamicCast_AsObjective_Manager_Tutorial_Component; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_TaskToValidate;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerControllerJP*>            CallFunc_GetPlayerControllersOfTeam_ReturnValue;   // 0x00E8(0x0010)(ReferenceParm)
	class APlayerControllerJP*                    CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_TaskToStart;                    // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_TaskInfoToOpen;                 // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObjectiveDefinition*>           CallFunc_GetObjectives_ReturnValue;                // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObjectiveDefinition*                   CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubObjectiveDefinition*                CallFunc_Array_Get_Item_2;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialTaskCompletedPayload        Temp_struct_Variable_4;                            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UObjectiveDefinition*>           CallFunc_GetObjectives_ReturnValue_1;              // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObjectiveDefinition*                   CallFunc_Array_Get_Item_3;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USubObjectiveDefinition*                CallFunc_Array_Get_Item_4;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObjectiveDefinition*>           CallFunc_GetObjectives_ReturnValue_2;              // 0x01D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObjectiveDefinition*                   CallFunc_Array_Get_Item_5;                         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USOD_TutorialTask_C*                    K2Node_DynamicCast_AsSOD_Tutorial_Task;            // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubObjectiveDefinition*                CallFunc_Array_Get_Item_6;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObjectiveDefinition*>           CallFunc_GetObjectives_ReturnValue_3;              // 0x0218(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetNextObjectiveDefinition_FoundNext;     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveDefinition*                   CallFunc_GetNextObjectiveDefinition_NextObjectiveDefinition; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetNextObjectiveDefinition_NextSODClass;  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObjectiveDefinition*                   K2Node_CustomEvent_ObjectiveDefinition;            // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_TargetSOD;                      // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialTaskStartedPayload          K2Node_MakeStruct_S_TutorialTaskStartedPayload;    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USubObjectiveDefinition*                CallFunc_Array_Get_Item_7;                         // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USOD_TutorialTask_C*                    K2Node_DynamicCast_AsSOD_Tutorial_Task_1;          // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialEndedPayload                K2Node_MakeStruct_S_TutorialEndedPayload;          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ADowntimeManager_Tutorial_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0288(0x0010)(ReferenceParm)
	class ADowntimeManager_Tutorial_C*            CallFunc_Array_Get_Item_8;                         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsSOD_Tutorial_Task;       // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialTaskCompletedPayload        K2Node_MakeStruct_S_TutorialTaskCompletedPayload;  // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewMinimum;                     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP*                           K2Node_DynamicCast_AsGame_State_JP;                // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Current_Money;                  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASubObjective*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASOA_TutorialTask_C*                    K2Node_DynamicCast_AsSOA_Tutorial_Task;            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character_1;                    // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character)>  K2Node_CreateDelegate_OutputDelegate_5;            // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialTaskCompletedPayload        Temp_struct_Variable_5;                            // 0x0398(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TutorialSequencer_C*                CallFunc_GetActorOfClass_ReturnValue_1;            // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Money_Changed_Current_Money_ImplicitCast; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_3;            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_4;            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_5;            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager) == 0x000008, "Wrong alignment on BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager");
static_assert(sizeof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager) == 0x0003F8, "Wrong size on BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, EntryPoint) == 0x000000, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable) == 0x000008, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_ProxyObject) == 0x000030, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_ActualChannel) == 0x000038, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable_1) == 0x000050, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable_2) == 0x000078, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_object_Variable) == 0x000080, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPayload_ReturnValue) == 0x000088, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000090, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_int_Array_Index_Variable) == 0x0000BC, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsObjective_Manager_Tutorial_Component) == 0x0000C0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsObjective_Manager_Tutorial_Component' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D4, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_int_Array_Index_Variable_1) == 0x0000D8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000DC, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_TaskToValidate) == 0x0000E0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_TaskToValidate' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPlayerControllersOfTeam_ReturnValue) == 0x0000E8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPlayerControllersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000100, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_TaskToStart) == 0x000110, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_TaskToStart' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000118, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000128, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000130, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000138, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000140, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_TaskInfoToOpen) == 0x000148, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_TaskInfoToOpen' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectives_ReturnValue) == 0x000150, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectives_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000160, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_2) == 0x000178, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectClass_ReturnValue) == 0x000180, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x00018C, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_object_Variable_1) == 0x000190, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable_3) == 0x000198, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable_4) == 0x0001A0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectives_ReturnValue_1) == 0x0001A8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectives_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_3) == 0x0001B8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Less_IntInt_ReturnValue) == 0x0001C4, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_BooleanAND_ReturnValue) == 0x0001C5, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_4) == 0x0001C8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectives_ReturnValue_2) == 0x0001D0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectives_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_5) == 0x0001E0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsSOD_Tutorial_Task) == 0x0001E8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsSOD_Tutorial_Task' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_2) == 0x0001F0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_6) == 0x0001F8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectClass_ReturnValue_1) == 0x000200, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectClass_ReturnValue_2) == 0x000208, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000210, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetObjectives_ReturnValue_3) == 0x000218, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetObjectives_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetNextObjectiveDefinition_FoundNext) == 0x000228, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetNextObjectiveDefinition_FoundNext' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetNextObjectiveDefinition_NextObjectiveDefinition) == 0x000230, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetNextObjectiveDefinition_NextObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetNextObjectiveDefinition_NextSODClass) == 0x000238, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetNextObjectiveDefinition_NextSODClass' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_ObjectiveDefinition) == 0x000240, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_ObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_TargetSOD) == 0x000248, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_TargetSOD' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_Delay) == 0x000250, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_MakeStruct_S_TutorialTaskStartedPayload) == 0x000258, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_MakeStruct_S_TutorialTaskStartedPayload' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_7) == 0x000260, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsSOD_Tutorial_Task_1) == 0x000268, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsSOD_Tutorial_Task_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_3) == 0x000270, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_MakeStruct_S_TutorialEndedPayload) == 0x000274, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_MakeStruct_S_TutorialEndedPayload' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_ProxyObject_1) == 0x000278, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_ActualChannel_1) == 0x000280, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000288, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Array_Get_Item_8) == 0x000298, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002A0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0002B0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_ClassDynamicCast_AsSOD_Tutorial_Task) == 0x0002B8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_ClassDynamicCast_AsSOD_Tutorial_Task' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_ClassDynamicCast_bSuccess) == 0x0002C0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_MakeStruct_S_TutorialTaskCompletedPayload) == 0x0002C8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_MakeStruct_S_TutorialTaskCompletedPayload' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002D0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_NewMinimum) == 0x0002D8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_NewMinimum' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetGameState_ReturnValue) == 0x0002E0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsGame_State_JP) == 0x0002E8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsGame_State_JP' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_4) == 0x0002F0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_Current_Money) == 0x0002F8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_Current_Money' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000300, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPlayerPawn_ReturnValue) == 0x000308, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetIsPie_ReturnValue) == 0x000310, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetActorOfClass_ReturnValue) == 0x000318, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_BooleanAND_ReturnValue_1) == 0x000320, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsSOA_Tutorial_Task) == 0x000328, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsSOA_Tutorial_Task' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_5) == 0x000330, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000338, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPlayerController_ReturnValue) == 0x000340, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_Character_1) == 0x000348, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_Character) == 0x000350, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPlayerController_ReturnValue_1) == 0x000358, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x000360, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_K2_GetPawn_ReturnValue) == 0x000370, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000378, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_6) == 0x000380, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_int_Loop_Counter_Variable_1) == 0x000384, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000388, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x00038C, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_BooleanAND_ReturnValue_2) == 0x000390, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, Temp_struct_Variable_5) == 0x000398, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPayload_ReturnValue_1) == 0x0003A0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0003A8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_GetPlayerController_ReturnValue_2) == 0x0003B0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_OldPawn) == 0x0003B8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_CustomEvent_NewPawn) == 0x0003C0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x0003C8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, K2Node_DynamicCast_bSuccess_7) == 0x0003D0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Money_Changed_Current_Money_ImplicitCast) == 0x0003D8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Money_Changed_Current_Money_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast) == 0x0003E0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0003E4, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast_2) == 0x0003E8, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast_3) == 0x0003EC, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast_4) == 0x0003F0, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager, CallFunc_Delay_Duration_ImplicitCast_5) == 0x0003F4, "Member 'BP_TutorialManager_C_ExecuteUbergraph_BP_TutorialManager::CallFunc_Delay_Duration_ImplicitCast_5' has a wrong offset!");

// Function BP_TutorialManager.BP_TutorialManager_C.Get SODClass
// 0x0028 (0x0028 - 0x0000)
struct BP_TutorialManager_C_Get_SODClass final
{
public:
	class UObjectiveDefinition*                   Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
