#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_ThrowableProp_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.AddImpulseOwner
// 0x0018 (0x0018 - 0x0000)
struct Bp_ThrowableProp_Base_C_AddImpulseOwner final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_AddImpulseOwner) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_AddImpulseOwner");
static_assert(sizeof(Bp_ThrowableProp_Base_C_AddImpulseOwner) == 0x000018, "Wrong size on Bp_ThrowableProp_Base_C_AddImpulseOwner");
static_assert(offsetof(Bp_ThrowableProp_Base_C_AddImpulseOwner, Impulse) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_AddImpulseOwner::Impulse' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.AddImpulseServer
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Base_C_AddImpulseServer final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_AddImpulseServer) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_AddImpulseServer");
static_assert(sizeof(Bp_ThrowableProp_Base_C_AddImpulseServer) == 0x000020, "Wrong size on Bp_ThrowableProp_Base_C_AddImpulseServer");
static_assert(offsetof(Bp_ThrowableProp_Base_C_AddImpulseServer, Impulse) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_AddImpulseServer::Impulse' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_AddImpulseServer, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'Bp_ThrowableProp_Base_C_AddImpulseServer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.CancelInteraction
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_CancelInteraction final
{
public:
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_CancelInteraction) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_CancelInteraction");
static_assert(sizeof(Bp_ThrowableProp_Base_C_CancelInteraction) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_CancelInteraction");
static_assert(offsetof(Bp_ThrowableProp_Base_C_CancelInteraction, InteractionComponent) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_CancelInteraction::InteractionComponent' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.ExecuteUbergraph_Bp_ThrowableProp_Base
// 0x0580 (0x0580 - 0x0000)
struct Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_5;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_4;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_5;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_2;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_4;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_3;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_2;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_1;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Interactable;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Focusing_Actor;                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_ReleasingCharacter;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_GrippingCharacter;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGrabThrowableWI_C*                     K2Node_DynamicCast_AsGrab_Throwable_WI;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0160(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0260(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0xF];                                      // 0x02C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x02D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x03C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Impulse;                        // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent;                 // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewVelocity;                    // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0518(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnabled;                      // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraSettingsLocal*                     K2Node_DynamicCast_AsLyra_Settings_Local;          // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_AddItemDefinition_ReturnValue;            // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base) == 0x000010, "Wrong alignment on Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base");
static_assert(sizeof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base) == 0x000580, "Wrong size on Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, EntryPoint) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable_1) == 0x00001A, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable_1) == 0x00001B, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable_2) == 0x000031, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_HasAuthority_ReturnValue_1) == 0x000032, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent_5) == 0x000038, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent_5' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent_4) == 0x000040, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent_4' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor_5) == 0x000048, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor_5' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent_3) == 0x000050, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent_2) == 0x000058, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor_4) == 0x000060, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor_4' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent_1) == 0x000068, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor_3) == 0x000070, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_AttackingActor) == 0x000078, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_AttackingActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_Direction) == 0x000080, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor_2) == 0x000098, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor_1) == 0x0000A0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_Interactable) == 0x0000A8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_Interactable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_Focusing_Actor) == 0x0000B0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_Focusing_Actor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable_2) == 0x0000B8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable_3) == 0x0000B9, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_ReleasingCharacter) == 0x0000C0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_ReleasingCharacter' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_AsBP_Resident_Character) == 0x0000C8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0000D8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_GrippingCharacter) == 0x0000E0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_GrippingCharacter' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_AsGrab_Throwable_WI) == 0x0000E8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_AsGrab_Throwable_WI' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F1, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_MyComp) == 0x0000F8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_Other) == 0x000100, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_OtherComp) == 0x000108, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_bSelfMoved) == 0x000110, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_HitLocation) == 0x000118, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_HitNormal) == 0x000130, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_NormalImpulse) == 0x000148, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_Hit) == 0x000160, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_IsValid_ReturnValue) == 0x000258, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetTransform_ReturnValue) == 0x000260, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_Show) == 0x0002C0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_ComposeTransforms_ReturnValue) == 0x0002D0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_BreakTransform_Location) == 0x000330, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_BreakTransform_Rotation) == 0x000348, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_BreakTransform_Scale) == 0x000360, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000378, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable_4) == 0x000390, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_Has_Been_Initd_Variable_5) == 0x000391, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_MakeVector_ReturnValue) == 0x000398, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x0003B0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0003C8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0004C0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_Impulse) == 0x0004C8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_Impulse' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractingActor) == 0x0004E0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_Event_InteractionComponent) == 0x0004E8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_Event_InteractionComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x0004F0, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_bSuccess_2) == 0x0004F8, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_NewVelocity) == 0x000500, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_NewVelocity' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000518, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000528, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000529, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000530, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetInstigator_ReturnValue) == 0x000538, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_AsItem_Instance) == 0x000540, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_bSuccess_3) == 0x000548, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable_3) == 0x000549, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_GetGameUserSettings_ReturnValue) == 0x000550, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_CustomEvent_IsEnabled) == 0x000558, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_CustomEvent_IsEnabled' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_AsLyra_Settings_Local) == 0x000560, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_AsLyra_Settings_Local' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, K2Node_DynamicCast_bSuccess_4) == 0x000568, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000569, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_AddItemDefinition_ReturnValue) == 0x000570, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_AddItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000578, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable_4) == 0x000579, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base, Temp_bool_IsClosed_Variable_5) == 0x00057A, "Member 'Bp_ThrowableProp_Base_C_ExecuteUbergraph_Bp_ThrowableProp_Base::Temp_bool_IsClosed_Variable_5' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetDurabilityCostWhenHit
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit, Amount) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetDurabilityCostWhenHit::Amount' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetMaterialType
// 0x0001 (0x0001 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetMaterialType final
{
public:
	E_MaterialTypes                               MaterialType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetMaterialType) == 0x000001, "Wrong alignment on Bp_ThrowableProp_Base_C_GetMaterialType");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetMaterialType) == 0x000001, "Wrong size on Bp_ThrowableProp_Base_C_GetMaterialType");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetMaterialType, MaterialType) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetMaterialType::MaterialType' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetNewWidgetColor
// 0x0014 (0x0014 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetNewWidgetColor final
{
public:
	struct FSlateColor                            NewColor;                                          // 0x0000(0x0014)(Parm, OutParm)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetNewWidgetColor) == 0x000004, "Wrong alignment on Bp_ThrowableProp_Base_C_GetNewWidgetColor");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetNewWidgetColor) == 0x000014, "Wrong size on Bp_ThrowableProp_Base_C_GetNewWidgetColor");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetNewWidgetColor, NewColor) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetNewWidgetColor::NewColor' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetOptionalText
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetOptionalText final
{
public:
	class FText                                   Return;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   Optional_Second_Line;                              // 0x0010(0x0010)(Parm, OutParm)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetOptionalText) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_GetOptionalText");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetOptionalText) == 0x000020, "Wrong size on Bp_ThrowableProp_Base_C_GetOptionalText");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetOptionalText, Return) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetOptionalText::Return' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetOptionalText, Optional_Second_Line) == 0x000010, "Member 'Bp_ThrowableProp_Base_C_GetOptionalText::Optional_Second_Line' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetPriority
// 0x0004 (0x0004 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetPriority final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetPriority) == 0x000004, "Wrong alignment on Bp_ThrowableProp_Base_C_GetPriority");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetPriority) == 0x000004, "Wrong size on Bp_ThrowableProp_Base_C_GetPriority");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetPriority, Priority) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetPriority::Priority' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GetWidgetLocation
// 0x0048 (0x0048 - 0x0000)
struct Bp_ThrowableProp_Base_C_GetWidgetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GetWidgetLocation) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_GetWidgetLocation");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GetWidgetLocation) == 0x000048, "Wrong size on Bp_ThrowableProp_Base_C_GetWidgetLocation");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetWidgetLocation, Location) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GetWidgetLocation::Location' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetWidgetLocation, CallFunc_GetActorBounds_Origin) == 0x000018, "Member 'Bp_ThrowableProp_Base_C_GetWidgetLocation::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GetWidgetLocation, CallFunc_GetActorBounds_BoxExtent) == 0x000030, "Member 'Bp_ThrowableProp_Base_C_GetWidgetLocation::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GrippedLocal
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Base_C_GrippedLocal final
{
public:
	class ACharacter*                             GrippingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GrippedLocal) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_GrippedLocal");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GrippedLocal) == 0x000020, "Wrong size on Bp_ThrowableProp_Base_C_GrippedLocal");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GrippedLocal, GrippingCharacter) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GrippedLocal::GrippingCharacter' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GrippedLocal, CallFunc_IsLocallyControlled_ReturnValue) == 0x000008, "Member 'Bp_ThrowableProp_Base_C_GrippedLocal::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GrippedLocal, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'Bp_ThrowableProp_Base_C_GrippedLocal::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GrippedLocal, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Bp_ThrowableProp_Base_C_GrippedLocal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.GrippedServer
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_GrippedServer final
{
public:
	class ACharacter*                             GrippingCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_GrippedServer) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_GrippedServer");
static_assert(sizeof(Bp_ThrowableProp_Base_C_GrippedServer) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_GrippedServer");
static_assert(offsetof(Bp_ThrowableProp_Base_C_GrippedServer, GrippingCharacter) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_GrippedServer::GrippingCharacter' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.HideInteractionWidget
// 0x0001 (0x0001 - 0x0000)
struct Bp_ThrowableProp_Base_C_HideInteractionWidget final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_HideInteractionWidget) == 0x000001, "Wrong alignment on Bp_ThrowableProp_Base_C_HideInteractionWidget");
static_assert(sizeof(Bp_ThrowableProp_Base_C_HideInteractionWidget) == 0x000001, "Wrong size on Bp_ThrowableProp_Base_C_HideInteractionWidget");
static_assert(offsetof(Bp_ThrowableProp_Base_C_HideInteractionWidget, Return) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_HideInteractionWidget::Return' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.HighConstrastModeChanged
// 0x0001 (0x0001 - 0x0000)
struct Bp_ThrowableProp_Base_C_HighConstrastModeChanged final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_HighConstrastModeChanged) == 0x000001, "Wrong alignment on Bp_ThrowableProp_Base_C_HighConstrastModeChanged");
static_assert(sizeof(Bp_ThrowableProp_Base_C_HighConstrastModeChanged) == 0x000001, "Wrong size on Bp_ThrowableProp_Base_C_HighConstrastModeChanged");
static_assert(offsetof(Bp_ThrowableProp_Base_C_HighConstrastModeChanged, IsEnabled) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_HighConstrastModeChanged::IsEnabled' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.HitInterface
// 0x0018 (0x0018 - 0x0000)
struct Bp_ThrowableProp_Base_C_HitInterface final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_HitInterface) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_HitInterface");
static_assert(sizeof(Bp_ThrowableProp_Base_C_HitInterface) == 0x000018, "Wrong size on Bp_ThrowableProp_Base_C_HitInterface");
static_assert(offsetof(Bp_ThrowableProp_Base_C_HitInterface, Direction) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_HitInterface::Direction' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.ImpactCosmetics
// 0x0048 (0x0048 - 0x0000)
struct Bp_ThrowableProp_Base_C_ImpactCosmetics final
{
public:
	class APawn*                                  ImpactCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                ImpactEffect;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x003C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedAttributes;                                 // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_ImpactCosmetics) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_ImpactCosmetics");
static_assert(sizeof(Bp_ThrowableProp_Base_C_ImpactCosmetics) == 0x000048, "Wrong size on Bp_ThrowableProp_Base_C_ImpactCosmetics");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, ImpactCauser) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::ImpactCauser' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, Location) == 0x000008, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::Location' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, HitImpulse) == 0x000020, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::HitImpulse' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, ImpactEffect) == 0x000038, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::ImpactEffect' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, BoneName) == 0x00003C, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::BoneName' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Base_C_ImpactCosmetics, ChangedAttributes) == 0x000044, "Member 'Bp_ThrowableProp_Base_C_ImpactCosmetics::ChangedAttributes' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.InteractableCancelInteraction
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_InteractableCancelInteraction final
{
public:
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_InteractableCancelInteraction) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_InteractableCancelInteraction");
static_assert(sizeof(Bp_ThrowableProp_Base_C_InteractableCancelInteraction) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_InteractableCancelInteraction");
static_assert(offsetof(Bp_ThrowableProp_Base_C_InteractableCancelInteraction, InteractionComponent) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_InteractableCancelInteraction::InteractionComponent' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.InteractPressed
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_InteractPressed final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_InteractPressed) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_InteractPressed");
static_assert(sizeof(Bp_ThrowableProp_Base_C_InteractPressed) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_InteractPressed");
static_assert(offsetof(Bp_ThrowableProp_Base_C_InteractPressed, InteractingActor) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_InteractPressed::InteractingActor' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.InteractReleased
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Base_C_InteractReleased final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Base_C_InteractReleased) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Base_C_InteractReleased");
static_assert(sizeof(Bp_ThrowableProp_Base_C_InteractReleased) == 0x000008, "Wrong size on Bp_ThrowableProp_Base_C_InteractReleased");
static_assert(offsetof(Bp_ThrowableProp_Base_C_InteractReleased, InteractingActor) == 0x000000, "Member 'Bp_ThrowableProp_Base_C_InteractReleased::InteractingActor' has a wrong offset!");

// Function Bp_ThrowableProp_Base.Bp_ThrowableProp_Base_C.IsBeingHeld
// 0x0002 (0x0002 - 0x0000)
struct Bp_ThrowableProp_Base_C_IsBeingHeld final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
