#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_TelephonePoles

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_TelephonePoles.Bp_TelephonePoles_C.UserConstructionScript
// 0x0590 (0x0590 - 0x0000)
struct Bp_TelephonePoles_C_UserConstructionScript final
{
public:
	struct FRotator                               NewLocalVar_0;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue_1;  // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0228(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0xF];                                      // 0x0281(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0290(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_2;          // 0x02F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0350(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_3;          // 0x0400(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue_2;  // 0x04B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_4;          // 0x0510(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TelephonePoles_C_UserConstructionScript) == 0x000010, "Wrong alignment on Bp_TelephonePoles_C_UserConstructionScript");
static_assert(sizeof(Bp_TelephonePoles_C_UserConstructionScript) == 0x000590, "Wrong size on Bp_TelephonePoles_C_UserConstructionScript");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'Bp_TelephonePoles_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Bp_TelephonePoles_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, Temp_int_Variable) == 0x000020, "Member 'Bp_TelephonePoles_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000030, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000090, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_ComposeTransforms_ReturnValue) == 0x0000F0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetTransformAtSplinePoint_ReturnValue_1) == 0x000150, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetTransformAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x0001B0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_ComposeTransforms_ReturnValue_1) == 0x0001C0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_ComposeTransforms_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000220, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetAllSocketNames_ReturnValue) == 0x000228, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000238, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x00023C, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetSocketLocation_ReturnValue) == 0x000248, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000260, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_InverseTransformLocation_ReturnValue) == 0x000268, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000280, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000290, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_ComposeTransforms_ReturnValue_2) == 0x0002F0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_ComposeTransforms_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x000350, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x0003B0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x0003C8, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x0003E0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_ComposeTransforms_ReturnValue_3) == 0x000400, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_ComposeTransforms_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Location_1) == 0x000460, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Rotation_1) == 0x000478, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_BreakTransform_Scale_1) == 0x000490, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetTransformAtSplinePoint_ReturnValue_2) == 0x0004B0, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetTransformAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_ComposeTransforms_ReturnValue_4) == 0x000510, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_ComposeTransforms_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x000570, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000574, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000578, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x00057C, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TelephonePoles_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000580, "Member 'Bp_TelephonePoles_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

