#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tut_Trigger_ObjectDisappear

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Tut_Trigger_ObjectDisappear.BP_Tut_Trigger_ObjectDisappear_C.Activate
// 0x0002 (0x0002 - 0x0000)
struct BP_Tut_Trigger_ObjectDisappear_C_Activate final
{
public:
	bool                                          CallFunc_CanActivate_Return;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tut_Trigger_ObjectDisappear_C_Activate) == 0x000001, "Wrong alignment on BP_Tut_Trigger_ObjectDisappear_C_Activate");
static_assert(sizeof(BP_Tut_Trigger_ObjectDisappear_C_Activate) == 0x000002, "Wrong size on BP_Tut_Trigger_ObjectDisappear_C_Activate");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_Activate, CallFunc_CanActivate_Return) == 0x000000, "Member 'BP_Tut_Trigger_ObjectDisappear_C_Activate::CallFunc_CanActivate_Return' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_Activate, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'BP_Tut_Trigger_ObjectDisappear_C_Activate::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Tut_Trigger_ObjectDisappear.BP_Tut_Trigger_ObjectDisappear_C.ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear
// 0x0028 (0x0028 - 0x0000)
struct BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IncreaseProgressCounter_ReachedTotal;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncreaseProgressCounter_CurrentAmount;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivate_Return;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear) == 0x000008, "Wrong alignment on BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear");
static_assert(sizeof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear) == 0x000028, "Wrong size on BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, EntryPoint) == 0x000000, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, CallFunc_IncreaseProgressCounter_ReachedTotal) == 0x000018, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::CallFunc_IncreaseProgressCounter_ReachedTotal' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, CallFunc_IncreaseProgressCounter_CurrentAmount) == 0x00001C, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::CallFunc_IncreaseProgressCounter_CurrentAmount' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000020, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear, CallFunc_CanActivate_Return) == 0x000021, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ExecuteUbergraph_BP_Tut_Trigger_ObjectDisappear::CallFunc_CanActivate_Return' has a wrong offset!");

// Function BP_Tut_Trigger_ObjectDisappear.BP_Tut_Trigger_ObjectDisappear_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_Tut_Trigger_ObjectDisappear_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

}

