#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TomatoDecal

#include "Basic.hpp"

#include "BP_SlowingDecal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TomatoDecal.BP_TomatoDecal_C
// 0x0028 (0x03A0 - 0x0378)
class ABP_TomatoDecal_C final : public ABP_SlowingDecal_C
{
public:
	class UBillboardComponent*                    Billboard1;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard_0;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1_0;                                          // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1_0;                                          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TomatoDecal_C">();
	}
	static class ABP_TomatoDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TomatoDecal_C>();
	}
};
static_assert(alignof(ABP_TomatoDecal_C) == 0x000008, "Wrong alignment on ABP_TomatoDecal_C");
static_assert(sizeof(ABP_TomatoDecal_C) == 0x0003A0, "Wrong size on ABP_TomatoDecal_C");
static_assert(offsetof(ABP_TomatoDecal_C, Billboard1) == 0x000378, "Member 'ABP_TomatoDecal_C::Billboard1' has a wrong offset!");
static_assert(offsetof(ABP_TomatoDecal_C, Arrow2) == 0x000380, "Member 'ABP_TomatoDecal_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_TomatoDecal_C, Billboard_0) == 0x000388, "Member 'ABP_TomatoDecal_C::Billboard_0' has a wrong offset!");
static_assert(offsetof(ABP_TomatoDecal_C, Arrow1_0) == 0x000390, "Member 'ABP_TomatoDecal_C::Arrow1_0' has a wrong offset!");
static_assert(offsetof(ABP_TomatoDecal_C, Decal1_0) == 0x000398, "Member 'ABP_TomatoDecal_C::Decal1_0' has a wrong offset!");

}

