#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Valuable_Receptacle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_Valuable_Receptacle.BP_Valuable_Receptacle_C.ReceptacleEmptied
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Valuable_Receptacle_C_ReceptacleEmptied final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerControllerJP*>            CallFunc_GetPlayerControllersOfTeam_ReturnValue;   // 0x0018(0x0010)(ReferenceParm)
	class APlayerControllerJP*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0050(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0070(0x0058)()
};
static_assert(alignof(BP_Valuable_Receptacle_C_ReceptacleEmptied) == 0x000008, "Wrong alignment on BP_Valuable_Receptacle_C_ReceptacleEmptied");
static_assert(sizeof(BP_Valuable_Receptacle_C_ReceptacleEmptied) == 0x0000C8, "Wrong size on BP_Valuable_Receptacle_C_ReceptacleEmptied");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, Caller) == 0x000000, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::Caller' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_GetPlayerControllersOfTeam_ReturnValue) == 0x000018, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_GetPlayerControllersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Format_ReturnValue) == 0x000050, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleEmptied, K2Node_MakeStruct_PlayerMessage) == 0x000070, "Member 'BP_Valuable_Receptacle_C_ReceptacleEmptied::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");

// Function BP_Valuable_Receptacle.BP_Valuable_Receptacle_C.TogglePhyicsOnCurrentItem
// 0x0008 (0x0008 - 0x0000)
struct BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem final
{
public:
	class ABP_ValuableItem_C*                     Valuable;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem) == 0x000008, "Wrong alignment on BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem");
static_assert(sizeof(BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem) == 0x000008, "Wrong size on BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem");
static_assert(offsetof(BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem, Valuable) == 0x000000, "Member 'BP_Valuable_Receptacle_C_TogglePhyicsOnCurrentItem::Valuable' has a wrong offset!");

// Function BP_Valuable_Receptacle.BP_Valuable_Receptacle_C.ReceptacleFilled
// 0x0248 (0x0248 - 0x0000)
struct BP_Valuable_Receptacle_C_ReceptacleFilled final
{
public:
	class UBP_MessReceptacleComponent_C*          Caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ValuableItem_C*                     Valuable;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ValuableItem_C*                     K2Node_DynamicCast_AsBP_Valuable_Item;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerControllerJP*>            CallFunc_GetPlayerControllersOfTeam_ReturnValue;   // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	class APlayerControllerJP*                    CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerControllerJP*>            CallFunc_GetPlayerControllersOfTeam_ReturnValue_1; // 0x0128(0x0010)(ReferenceParm)
	class APlayerControllerJP*                    CallFunc_Array_Get_Item_1;                         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0140(0x0058)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01C8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage_1;                 // 0x01E8(0x0058)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valuable_Receptacle_C_ReceptacleFilled) == 0x000008, "Wrong alignment on BP_Valuable_Receptacle_C_ReceptacleFilled");
static_assert(sizeof(BP_Valuable_Receptacle_C_ReceptacleFilled) == 0x000248, "Wrong size on BP_Valuable_Receptacle_C_ReceptacleFilled");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Caller) == 0x000000, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Caller' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Valuable) == 0x000008, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Valuable' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_DynamicCast_AsBP_Valuable_Item) == 0x000020, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_DynamicCast_AsBP_Valuable_Item' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_HasAuthority_ReturnValue_1) == 0x00003D, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000040, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000048, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000058, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x000068, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetPlayerControllersOfTeam_ReturnValue) == 0x000078, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetPlayerControllersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Format_ReturnValue) == 0x000108, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetPlayerControllersOfTeam_ReturnValue_1) == 0x000128, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetPlayerControllersOfTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_MakeStruct_PlayerMessage) == 0x000140, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Array_Length_ReturnValue_1) == 0x000198, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Less_IntInt_ReturnValue_1) == 0x00019C, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_GetActorOfClass_ReturnValue) == 0x0001A0, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001A8, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001AC, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0001C0, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Format_ReturnValue_1) == 0x0001C8, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001D8, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, K2Node_MakeStruct_PlayerMessage_1) == 0x0001E8, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::K2Node_MakeStruct_PlayerMessage_1' has a wrong offset!");
static_assert(offsetof(BP_Valuable_Receptacle_C_ReceptacleFilled, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000240, "Member 'BP_Valuable_Receptacle_C_ReceptacleFilled::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

}

