#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VacuumProj

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VacuumProj.BP_VacuumProj_C
// 0x0018 (0x0540 - 0x0528)
class ABP_VacuumProj_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VacuumProj_C;                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           ParticleTimer;                                     // 0x0530(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ProjectileTimeoutHandle;                           // 0x0538(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VacuumProj(int32 EntryPoint);
	void ProjectileTimeout();
	void TempSpawnParticleTrail();
	void DeactivatePooledActor();
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VacuumProj_C">();
	}
	static class ABP_VacuumProj_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VacuumProj_C>();
	}
};
static_assert(alignof(ABP_VacuumProj_C) == 0x000008, "Wrong alignment on ABP_VacuumProj_C");
static_assert(sizeof(ABP_VacuumProj_C) == 0x000540, "Wrong size on ABP_VacuumProj_C");
static_assert(offsetof(ABP_VacuumProj_C, UberGraphFrame_BP_VacuumProj_C) == 0x000528, "Member 'ABP_VacuumProj_C::UberGraphFrame_BP_VacuumProj_C' has a wrong offset!");
static_assert(offsetof(ABP_VacuumProj_C, ParticleTimer) == 0x000530, "Member 'ABP_VacuumProj_C::ParticleTimer' has a wrong offset!");
static_assert(offsetof(ABP_VacuumProj_C, ProjectileTimeoutHandle) == 0x000538, "Member 'ABP_VacuumProj_C::ProjectileTimeoutHandle' has a wrong offset!");

}

