#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VacuumProj

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VacuumProj.BP_VacuumProj_C.ExecuteUbergraph_BP_VacuumProj
// 0x0110 (0x0110 - 0x0000)
struct BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj) == 0x000010, "Wrong alignment on BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj");
static_assert(sizeof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj) == 0x000110, "Wrong size on BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, EntryPoint) == 0x000000, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000E8, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000108, "Member 'BP_VacuumProj_C_ExecuteUbergraph_BP_VacuumProj::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

}

