#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValuableItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_IndicatorData_structs.hpp"
#include "BP_MessItem_classes.hpp"
#include "JP_structs.hpp"
#include "E_ValuableType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ValuableItem.BP_ValuableItem_C
// 0x0130 (0x0730 - 0x0600)
class ABP_ValuableItem_C final : public ABP_MessItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ValuableItem_C;                  // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CameraRotator;                                     // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_Indicator_C*                        AC_IndicatorEnemyTeam;                             // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PingableComponent_C*                BP_PingableComponent;                              // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_Indicator_C*                        AC_Indicator;                                      // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotation_03A669104FA697F12CC021A82A6E8EAB; // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_03A669104FA697F12CC021A82A6E8EAB; // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         OriginalTeamOwner;                                 // 0x0640(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stolen;                                            // 0x0641(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHomeSlot;                                        // 0x0642(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643[0x5];                                      // 0x0643(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomyDefinition*                     EconomyDefinitionStolen;                           // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEconomyDefinition*                     EconomyDefinitionReturned;                         // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_IndicatorData                       Valuables_DataBackup;                              // 0x0658(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	bool CanActivateTrap();
	void ExecuteUbergraph_BP_ValuableItem(int32 EntryPoint);
	void OnEnded_65CD2C62425455685449238B4BA9C2E1();
	void OnEnded_94BAD75142C0FEC3A5E948BF7E3A784F();
	void OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void RemoveSimulatePhysics();
	void SetFreezeTimer(double Time);
	void SetupPings();
	void SwitchToObjectCamera();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void ValuablesIndicators(class APlayerState* PlayerState);
	void OnGrabbed();
	void ReceiveBeginPlay();
	void SetVisibleReceptacles(TArray<class ABP_ReceptacleFurnitureBase_C*>& Array, class AActor* User);
	void SetVisibleScoreZones(TArray<class ABP_ReceptacleFurnitureBase_C*>& Array, class AActor* User);

	bool IsAvailableForInteraction(class AActor* InteractingActor, class UPrimitiveComponent* InteractionComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ValuableItem_C">();
	}
	static class ABP_ValuableItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ValuableItem_C>();
	}
};
static_assert(alignof(ABP_ValuableItem_C) == 0x000010, "Wrong alignment on ABP_ValuableItem_C");
static_assert(sizeof(ABP_ValuableItem_C) == 0x000730, "Wrong size on ABP_ValuableItem_C");
static_assert(offsetof(ABP_ValuableItem_C, UberGraphFrame_BP_ValuableItem_C) == 0x000600, "Member 'ABP_ValuableItem_C::UberGraphFrame_BP_ValuableItem_C' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Camera) == 0x000608, "Member 'ABP_ValuableItem_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, CameraRotator) == 0x000610, "Member 'ABP_ValuableItem_C::CameraRotator' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, AC_IndicatorEnemyTeam) == 0x000618, "Member 'ABP_ValuableItem_C::AC_IndicatorEnemyTeam' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, BP_PingableComponent) == 0x000620, "Member 'ABP_ValuableItem_C::BP_PingableComponent' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, AC_Indicator) == 0x000628, "Member 'ABP_ValuableItem_C::AC_Indicator' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Timeline_Rotation_03A669104FA697F12CC021A82A6E8EAB) == 0x000630, "Member 'ABP_ValuableItem_C::Timeline_Rotation_03A669104FA697F12CC021A82A6E8EAB' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Timeline__Direction_03A669104FA697F12CC021A82A6E8EAB) == 0x000634, "Member 'ABP_ValuableItem_C::Timeline__Direction_03A669104FA697F12CC021A82A6E8EAB' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Timeline) == 0x000638, "Member 'ABP_ValuableItem_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, OriginalTeamOwner) == 0x000640, "Member 'ABP_ValuableItem_C::OriginalTeamOwner' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Stolen) == 0x000641, "Member 'ABP_ValuableItem_C::Stolen' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, InHomeSlot) == 0x000642, "Member 'ABP_ValuableItem_C::InHomeSlot' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, EconomyDefinitionStolen) == 0x000648, "Member 'ABP_ValuableItem_C::EconomyDefinitionStolen' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, EconomyDefinitionReturned) == 0x000650, "Member 'ABP_ValuableItem_C::EconomyDefinitionReturned' has a wrong offset!");
static_assert(offsetof(ABP_ValuableItem_C, Valuables_DataBackup) == 0x000658, "Member 'ABP_ValuableItem_C::Valuables_DataBackup' has a wrong offset!");

}

