#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValuableItem

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ValuableType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ValuableItem.BP_ValuableItem_C.CanActivateTrap
// 0x0001 (0x0001 - 0x0000)
struct BP_ValuableItem_C_CanActivateTrap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_CanActivateTrap) == 0x000001, "Wrong alignment on BP_ValuableItem_C_CanActivateTrap");
static_assert(sizeof(BP_ValuableItem_C_CanActivateTrap) == 0x000001, "Wrong size on BP_ValuableItem_C_CanActivateTrap");
static_assert(offsetof(BP_ValuableItem_C_CanActivateTrap, ReturnValue) == 0x000000, "Member 'BP_ValuableItem_C_CanActivateTrap::ReturnValue' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.ExecuteUbergraph_BP_ValuableItem
// 0x0240 (0x0240 - 0x0000)
struct BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable;                              // 0x0040(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable_1;                            // 0x0070(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x01D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x01E0(0x0038)(ConstParm, NoDestructor)
	class APlayerState*                           K2Node_CustomEvent_PlayerState;                    // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem) == 0x000008, "Wrong alignment on BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem");
static_assert(sizeof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem) == 0x000240, "Wrong size on BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, EntryPoint) == 0x000000, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000018, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_ListenToInitializationStateEnded_ReturnValue_1) == 0x000038, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_ListenToInitializationStateEnded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_struct_Variable) == 0x000040, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CustomEvent_ProxyObject) == 0x000060, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CustomEvent_ActualChannel) == 0x000068, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_struct_Variable_1) == 0x000070, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_struct_Variable_2) == 0x000078, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_object_Variable) == 0x000080, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000088, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetPayload_ReturnValue) == 0x000090, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_IsValid_ReturnValue_2) == 0x000091, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_MakeRotator_ReturnValue) == 0x000098, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_bool_Has_Been_Initd_Variable) == 0x0000B0, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000B8, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, Temp_bool_IsClosed_Variable) == 0x0001B0, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_HasAuthority_ReturnValue) == 0x0001B1, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x0001D0, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x0001D4, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetTeamAtPoint_ReturnValue) == 0x0001E0, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, K2Node_CustomEvent_PlayerState) == 0x000218, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetPawn_ReturnValue) == 0x000220, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_IsLocallyControlled_ReturnValue) == 0x000228, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetPlayerController_ReturnValue) == 0x000230, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem, CallFunc_GetOwner_ReturnValue) == 0x000238, "Member 'BP_ValuableItem_C_ExecuteUbergraph_BP_ValuableItem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2
// 0x0010 (0x0010 - 0x0000)
struct BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2) == 0x000008, "Wrong alignment on BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2");
static_assert(sizeof(BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2) == 0x000010, "Wrong size on BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2");
static_assert(offsetof(BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2, ProxyObject) == 0x000000, "Member 'BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2, ActualChannel) == 0x000008, "Member 'BP_ValuableItem_C_OnMessageReceived_C2A8115A4820329653CE6FA640BA59A2::ActualChannel' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.SetFreezeTimer
// 0x0028 (0x0028 - 0x0000)
struct BP_ValuableItem_C_SetFreezeTimer final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_SetFreezeTimer) == 0x000008, "Wrong alignment on BP_ValuableItem_C_SetFreezeTimer");
static_assert(sizeof(BP_ValuableItem_C_SetFreezeTimer) == 0x000028, "Wrong size on BP_ValuableItem_C_SetFreezeTimer");
static_assert(offsetof(BP_ValuableItem_C_SetFreezeTimer, Time) == 0x000000, "Member 'BP_ValuableItem_C_SetFreezeTimer::Time' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetFreezeTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ValuableItem_C_SetFreezeTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetFreezeTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ValuableItem_C_SetFreezeTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetFreezeTimer, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000020, "Member 'BP_ValuableItem_C_SetFreezeTimer::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.SetupPings
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ValuableItem_C_SetupPings final
{
public:
	ETeamType                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_1;                         // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_2;                         // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_3;                         // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Select_Default;                             // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_SetupPings) == 0x000008, "Wrong alignment on BP_ValuableItem_C_SetupPings");
static_assert(sizeof(BP_ValuableItem_C_SetupPings) == 0x0000D8, "Wrong size on BP_ValuableItem_C_SetupPings");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, Temp_byte_Variable) == 0x000000, "Member 'BP_ValuableItem_C_SetupPings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, Temp_softclass_Variable) == 0x000008, "Member 'BP_ValuableItem_C_SetupPings::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, Temp_softclass_Variable_1) == 0x000030, "Member 'BP_ValuableItem_C_SetupPings::Temp_softclass_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, Temp_softclass_Variable_2) == 0x000058, "Member 'BP_ValuableItem_C_SetupPings::Temp_softclass_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, Temp_softclass_Variable_3) == 0x000080, "Member 'BP_ValuableItem_C_SetupPings::Temp_softclass_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, CallFunc_GetTeamTypeFromTeamId_ReturnValue) == 0x0000A8, "Member 'BP_ValuableItem_C_SetupPings::CallFunc_GetTeamTypeFromTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetupPings, K2Node_Select_Default) == 0x0000B0, "Member 'BP_ValuableItem_C_SetupPings::K2Node_Select_Default' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.ValuablesIndicators
// 0x0008 (0x0008 - 0x0000)
struct BP_ValuableItem_C_ValuablesIndicators final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_ValuablesIndicators) == 0x000008, "Wrong alignment on BP_ValuableItem_C_ValuablesIndicators");
static_assert(sizeof(BP_ValuableItem_C_ValuablesIndicators) == 0x000008, "Wrong size on BP_ValuableItem_C_ValuablesIndicators");
static_assert(offsetof(BP_ValuableItem_C_ValuablesIndicators, PlayerState) == 0x000000, "Member 'BP_ValuableItem_C_ValuablesIndicators::PlayerState' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.SetVisibleReceptacles
// 0x00E0 (0x00E0 - 0x0000)
struct BP_ValuableItem_C_SetVisibleReceptacles final
{
public:
	TArray<class ABP_ReceptacleFurnitureBase_C*>  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 User;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         HolderTeamID;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ReceptacleFurnitureBase_C*          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Valuable_Receptacle_C*              K2Node_DynamicCast_AsBP_Valuable_Receptacle;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_MessReceptacleComponent_C*>  CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Claimed_Is_Claimed;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                Temp_byte_Variable_2;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MessReceptacleComponent_C*          CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                K2Node_Select_Default;                             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_SetVisibleReceptacles) == 0x000008, "Wrong alignment on BP_ValuableItem_C_SetVisibleReceptacles");
static_assert(sizeof(BP_ValuableItem_C_SetVisibleReceptacles) == 0x0000E0, "Wrong size on BP_ValuableItem_C_SetVisibleReceptacles");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Array) == 0x000000, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Array' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, User) == 0x000010, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::User' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, HolderTeamID) == 0x000018, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::HolderTeamID' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_byte_Variable) == 0x000024, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, K2Node_DynamicCast_AsBP_Valuable_Receptacle) == 0x000040, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::K2Node_DynamicCast_AsBP_Valuable_Receptacle' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000050, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Claimed_Is_Claimed) == 0x00006C, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Claimed_Is_Claimed' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Not_PreBool_ReturnValue) == 0x00006D, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006F, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_byte_Variable_1) == 0x000070, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_byte_Variable_2) == 0x000071, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_AddUnique_ReturnValue) == 0x000074, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000080, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_GetObjectClass_ReturnValue) == 0x000088, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000090, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Array_Contains_ReturnValue) == 0x0000B9, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, Temp_bool_Variable) == 0x0000C0, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C1, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, K2Node_Select_Default) == 0x0000C2, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C3, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, K2Node_DynamicCast_AsTeamable_Interface) == 0x0000C8, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleReceptacles, CallFunc_GetTeamID_ReturnValue) == 0x0000D9, "Member 'BP_ValuableItem_C_SetVisibleReceptacles::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.SetVisibleScoreZones
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ValuableItem_C_SetVisibleScoreZones final
{
public:
	TArray<class ABP_ReceptacleFurnitureBase_C*>  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 User;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         HolderTeamID;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ReceptacleFurnitureBase_C*          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Valuable_Receptacle_C*              K2Node_DynamicCast_AsBP_Valuable_Receptacle;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_MessScoreZoneComponent_C*>   CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_MessScoreZoneComponent_C*           CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                Temp_byte_Variable_1;                              // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MessScoreZoneComponent_C*           CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceptacleSetComparison_Match;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                Temp_byte_Variable_2;                              // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ValuableType                                K2Node_Select_Default;                             // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_SetVisibleScoreZones) == 0x000008, "Wrong alignment on BP_ValuableItem_C_SetVisibleScoreZones");
static_assert(sizeof(BP_ValuableItem_C_SetVisibleScoreZones) == 0x0000B0, "Wrong size on BP_ValuableItem_C_SetVisibleScoreZones");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Array) == 0x000000, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Array' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, User) == 0x000010, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::User' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, HolderTeamID) == 0x000018, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::HolderTeamID' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, K2Node_DynamicCast_AsBP_Valuable_Receptacle) == 0x000040, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::K2Node_DynamicCast_AsBP_Valuable_Receptacle' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000050, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Not_PreBool_ReturnValue) == 0x00006C, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_byte_Variable) == 0x00006D, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006E, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_byte_Variable_1) == 0x00006F, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_AddUnique_ReturnValue) == 0x000070, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_ReceptacleSetComparison_Match) == 0x000080, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_ReceptacleSetComparison_Match' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000081, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000082, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_byte_Variable_2) == 0x000083, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_BooleanAND_ReturnValue) == 0x000084, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, Temp_bool_Variable) == 0x00008C, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008D, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, K2Node_Select_Default) == 0x00008E, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00008F, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, K2Node_DynamicCast_AsTeamable_Interface) == 0x000098, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_SetVisibleScoreZones, CallFunc_GetTeamID_ReturnValue) == 0x0000A9, "Member 'BP_ValuableItem_C_SetVisibleScoreZones::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");

// Function BP_ValuableItem.BP_ValuableItem_C.IsAvailableForInteraction
// 0x0030 (0x0030 - 0x0000)
struct BP_ValuableItem_C_IsAvailableForInteraction final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValuableItem_C_IsAvailableForInteraction) == 0x000008, "Wrong alignment on BP_ValuableItem_C_IsAvailableForInteraction");
static_assert(sizeof(BP_ValuableItem_C_IsAvailableForInteraction) == 0x000030, "Wrong size on BP_ValuableItem_C_IsAvailableForInteraction");
static_assert(offsetof(BP_ValuableItem_C_IsAvailableForInteraction, InteractingActor) == 0x000000, "Member 'BP_ValuableItem_C_IsAvailableForInteraction::InteractingActor' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_IsAvailableForInteraction, InteractionComponent) == 0x000008, "Member 'BP_ValuableItem_C_IsAvailableForInteraction::InteractionComponent' has a wrong offset!");
static_assert(offsetof(BP_ValuableItem_C_IsAvailableForInteraction, ReturnValue) == 0x000010, "Member 'BP_ValuableItem_C_IsAvailableForInteraction::ReturnValue' has a wrong offset!");
