#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterTap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "E_ImpactEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterTap.BP_WaterTap_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_WaterTap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SeeThrough;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              AbilitySystemComponentIW;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_POI_C*                              AC_POI;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Activated;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TempTimer;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_Start_Spilling();
	void Audio_Stop_Spilling();
	void ExecuteUbergraph_BP_WaterTap(int32 EntryPoint);
	void GetDurabilityCostWhenHit(double* Amount);
	void GetMaterialType(E_MaterialTypes* MaterialType);
	void HitInterface(const struct FVector& Direction);
	void ImpactCosmetics(class APawn* ImpactCauser, const struct FVector& Location, const struct FVector& HitImpulse, E_ImpactEffect ImpactEffect, class FName BoneName, bool* ChangedAttributes);
	void MeleeHit(const class AActor*& AttackingActor);
	void OnRep_Activated();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void Set_Seethrough_Params();
	void TakeDamage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterTap_C">();
	}
	static class ABP_WaterTap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterTap_C>();
	}
};
static_assert(alignof(ABP_WaterTap_C) == 0x000008, "Wrong alignment on ABP_WaterTap_C");
static_assert(sizeof(ABP_WaterTap_C) == 0x0002E8, "Wrong size on ABP_WaterTap_C");
static_assert(offsetof(ABP_WaterTap_C, UberGraphFrame) == 0x000290, "Member 'ABP_WaterTap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, SeeThrough) == 0x000298, "Member 'ABP_WaterTap_C::SeeThrough' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, Audio) == 0x0002A0, "Member 'ABP_WaterTap_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, Box) == 0x0002A8, "Member 'ABP_WaterTap_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, AbilitySystemComponentIW) == 0x0002B0, "Member 'ABP_WaterTap_C::AbilitySystemComponentIW' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, AC_POI) == 0x0002B8, "Member 'ABP_WaterTap_C::AC_POI' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, Niagara) == 0x0002C0, "Member 'ABP_WaterTap_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, StaticMesh) == 0x0002C8, "Member 'ABP_WaterTap_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, Pole) == 0x0002D0, "Member 'ABP_WaterTap_C::Pole' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, Activated) == 0x0002D8, "Member 'ABP_WaterTap_C::Activated' has a wrong offset!");
static_assert(offsetof(ABP_WaterTap_C, TempTimer) == 0x0002E0, "Member 'ABP_WaterTap_C::TempTimer' has a wrong offset!");

}

