#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_YarnTangle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_YarnTangle.BP_YarnTangle_C
// 0x0048 (0x02D8 - 0x0290)
class ABP_YarnTangle_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AudioLoop;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                TargetActor;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TagsNeeded;                                        // 0x02B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_YarnTangle(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_YarnTangle_C">();
	}
	static class ABP_YarnTangle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_YarnTangle_C>();
	}
};
static_assert(alignof(ABP_YarnTangle_C) == 0x000008, "Wrong alignment on ABP_YarnTangle_C");
static_assert(sizeof(ABP_YarnTangle_C) == 0x0002D8, "Wrong size on ABP_YarnTangle_C");
static_assert(offsetof(ABP_YarnTangle_C, UberGraphFrame) == 0x000290, "Member 'ABP_YarnTangle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_YarnTangle_C, AudioLoop) == 0x000298, "Member 'ABP_YarnTangle_C::AudioLoop' has a wrong offset!");
static_assert(offsetof(ABP_YarnTangle_C, Niagara) == 0x0002A0, "Member 'ABP_YarnTangle_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_YarnTangle_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_YarnTangle_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_YarnTangle_C, TargetActor) == 0x0002B0, "Member 'ABP_YarnTangle_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABP_YarnTangle_C, TagsNeeded) == 0x0002B8, "Member 'ABP_YarnTangle_C::TagsNeeded' has a wrong offset!");

}

