#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_OpenDoorsInVicinity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_OpenDoorsInVicinity.BTS_OpenDoorsInVicinity_C.ExecuteUbergraph_BTS_OpenDoorsInVicinity
// 0x0090 (0x0090 - 0x0000)
struct BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_LeloiInteractable_C> K2Node_DynamicCast_AsI_Leloi_Interactable;         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity) == 0x000008, "Wrong alignment on BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity");
static_assert(sizeof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity) == 0x000090, "Wrong size on BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, EntryPoint) == 0x000000, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_MakeArray_Array) == 0x000008, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_Event_OwnerController) == 0x000018, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_SphereOverlapActors_OutActors) == 0x000058, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_SphereOverlapActors_ReturnValue) == 0x000068, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000069, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_Array_Get_Item) == 0x000070, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_DynamicCast_AsI_Leloi_Interactable) == 0x000078, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_DynamicCast_AsI_Leloi_Interactable' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BTS_OpenDoorsInVicinity_C_ExecuteUbergraph_BTS_OpenDoorsInVicinity::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTS_OpenDoorsInVicinity.BTS_OpenDoorsInVicinity_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_OpenDoorsInVicinity_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_OpenDoorsInVicinity_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_OpenDoorsInVicinity_C_ReceiveTickAI");
static_assert(sizeof(BTS_OpenDoorsInVicinity_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_OpenDoorsInVicinity_C_ReceiveTickAI");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_OpenDoorsInVicinity_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_OpenDoorsInVicinity_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_OpenDoorsInVicinity_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_OpenDoorsInVicinity_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

