#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_MoveToTarget

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.ExecuteUbergraph_BTT_MoveToTarget
// 0x00C0 (0x00C0 - 0x0000)
struct BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDead_Dead;                           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget) == 0x000008, "Wrong alignment on BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget");
static_assert(sizeof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget) == 0x0000C0, "Wrong size on BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, EntryPoint) == 0x000000, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_CustomEvent_MovementResult) == 0x000014, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, Temp_byte_Variable) == 0x000015, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000028, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_MakeLiteralName_ReturnValue) == 0x000040, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_CustomEvent_MovementResult_1) == 0x000048, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000050, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_GetValueAsObject_ReturnValue) == 0x000058, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_Event_OwnerController_1) == 0x000060, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_Event_ControlledPawn_1) == 0x000068, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_DynamicCast_AsActor) == 0x000070, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000080, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_DynamicCast_AsI_Character) == 0x000088, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_DynamicCast_AsI_Character' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_GetIsDead_Dead) == 0x000099, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_GetIsDead_Dead' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, CallFunc_IsValid_ReturnValue) == 0x00009A, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_Event_OwnerController) == 0x0000A0, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_Event_ControlledPawn) == 0x0000A8, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BTT_MoveToTarget_C_ExecuteUbergraph_BTT_MoveToTarget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.IsLeloiFalling
// 0x0020 (0x0020 - 0x0000)
struct BTT_MoveToTarget_C_IsLeloiFalling final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_IsLeloiFalling) == 0x000008, "Wrong alignment on BTT_MoveToTarget_C_IsLeloiFalling");
static_assert(sizeof(BTT_MoveToTarget_C_IsLeloiFalling) == 0x000020, "Wrong size on BTT_MoveToTarget_C_IsLeloiFalling");
static_assert(offsetof(BTT_MoveToTarget_C_IsLeloiFalling, Object) == 0x000000, "Member 'BTT_MoveToTarget_C_IsLeloiFalling::Object' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_IsLeloiFalling, ReturnValue) == 0x000008, "Member 'BTT_MoveToTarget_C_IsLeloiFalling::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_IsLeloiFalling, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BTT_MoveToTarget_C_IsLeloiFalling::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_IsLeloiFalling, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_MoveToTarget_C_IsLeloiFalling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_IsLeloiFalling, CallFunc_IsFalling_ReturnValue) == 0x000019, "Member 'BTT_MoveToTarget_C_IsLeloiFalling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.OnFail_8E5537444F061F0EF03BBA8F55E117E7
// 0x0001 (0x0001 - 0x0000)
struct BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7) == 0x000001, "Wrong alignment on BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7");
static_assert(sizeof(BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7) == 0x000001, "Wrong size on BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7");
static_assert(offsetof(BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7, MovementResult) == 0x000000, "Member 'BTT_MoveToTarget_C_OnFail_8E5537444F061F0EF03BBA8F55E117E7::MovementResult' has a wrong offset!");

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.OnSuccess_8E5537444F061F0EF03BBA8F55E117E7
// 0x0001 (0x0001 - 0x0000)
struct BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7) == 0x000001, "Wrong alignment on BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7");
static_assert(sizeof(BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7) == 0x000001, "Wrong size on BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7");
static_assert(offsetof(BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7, MovementResult) == 0x000000, "Member 'BTT_MoveToTarget_C_OnSuccess_8E5537444F061F0EF03BBA8F55E117E7::MovementResult' has a wrong offset!");

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_MoveToTarget_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_MoveToTarget_C_ReceiveAbortAI");
static_assert(sizeof(BTT_MoveToTarget_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_MoveToTarget_C_ReceiveAbortAI");
static_assert(offsetof(BTT_MoveToTarget_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_MoveToTarget_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_MoveToTarget_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_MoveToTarget.BTT_MoveToTarget_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_MoveToTarget_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToTarget_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_MoveToTarget_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_MoveToTarget_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_MoveToTarget_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_MoveToTarget_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_MoveToTarget_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToTarget_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_MoveToTarget_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

