#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_MoveToLocation

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_MoveToLocation.BTT_MoveToLocation_C.ExecuteUbergraph_BTT_MoveToLocation
// 0x00C0 (0x00C0 - 0x0000)
struct BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Leloi_C*                            K2Node_DynamicCast_AsBP_Leloi;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation) == 0x000008, "Wrong alignment on BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation");
static_assert(sizeof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation) == 0x0000C0, "Wrong size on BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, EntryPoint) == 0x000000, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_CustomEvent_Result) == 0x000004, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_CustomEvent_AIController) == 0x000008, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_Event_OwnerController) == 0x000030, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000040, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_DynamicCast_AsBP_Leloi) == 0x000048, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_DynamicCast_AsBP_Leloi' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000054, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000078, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000090, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x0000A8, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_AIMoveTo_ReturnValue) == 0x0000B0, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_AIMoveTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BTT_MoveToLocation_C_ExecuteUbergraph_BTT_MoveToLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTT_MoveToLocation.BTT_MoveToLocation_C.IsLeloiFalling
// 0x0020 (0x0020 - 0x0000)
struct BTT_MoveToLocation_C_IsLeloiFalling final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToLocation_C_IsLeloiFalling) == 0x000008, "Wrong alignment on BTT_MoveToLocation_C_IsLeloiFalling");
static_assert(sizeof(BTT_MoveToLocation_C_IsLeloiFalling) == 0x000020, "Wrong size on BTT_MoveToLocation_C_IsLeloiFalling");
static_assert(offsetof(BTT_MoveToLocation_C_IsLeloiFalling, Object) == 0x000000, "Member 'BTT_MoveToLocation_C_IsLeloiFalling::Object' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_IsLeloiFalling, ReturnValue) == 0x000008, "Member 'BTT_MoveToLocation_C_IsLeloiFalling::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_IsLeloiFalling, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BTT_MoveToLocation_C_IsLeloiFalling::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_IsLeloiFalling, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_MoveToLocation_C_IsLeloiFalling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_IsLeloiFalling, CallFunc_IsFalling_ReturnValue) == 0x000019, "Member 'BTT_MoveToLocation_C_IsLeloiFalling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");

// Function BTT_MoveToLocation.BTT_MoveToLocation_C.OnMoveFinished_801EC92F4917F91055F7FB867F4F971C
// 0x0010 (0x0010 - 0x0000)
struct BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C) == 0x000008, "Wrong alignment on BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C");
static_assert(sizeof(BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C) == 0x000010, "Wrong size on BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C");
static_assert(offsetof(BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C, Result) == 0x000000, "Member 'BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C::Result' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C, AIController) == 0x000008, "Member 'BTT_MoveToLocation_C_OnMoveFinished_801EC92F4917F91055F7FB867F4F971C::AIController' has a wrong offset!");

// Function BTT_MoveToLocation.BTT_MoveToLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_MoveToLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_MoveToLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_MoveToLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_MoveToLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_MoveToLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_MoveToLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_MoveToLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_MoveToLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

