#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaptureTheFlagEndCondition

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CaptureTheFlagEndCondition.CaptureTheFlagEndCondition_C.CreateWidget
// 0x0010 (0x0010 - 0x0000)
struct CaptureTheFlagEndCondition_C_CreateWidget final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCaptureTheFlagEndConditionWI_C*        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CaptureTheFlagEndCondition_C_CreateWidget) == 0x000008, "Wrong alignment on CaptureTheFlagEndCondition_C_CreateWidget");
static_assert(sizeof(CaptureTheFlagEndCondition_C_CreateWidget) == 0x000010, "Wrong size on CaptureTheFlagEndCondition_C_CreateWidget");
static_assert(offsetof(CaptureTheFlagEndCondition_C_CreateWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'CaptureTheFlagEndCondition_C_CreateWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'CaptureTheFlagEndCondition_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function CaptureTheFlagEndCondition.CaptureTheFlagEndCondition_C.ExecuteUbergraph_CaptureTheFlagEndCondition
// 0x0058 (0x0058 - 0x0000)
struct CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CaptureTheFlagObjective_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObjectiveBase*>                 CallFunc_CreateObjective_ReturnValue;              // 0x0038(0x0010)(ReferenceParm)
	class ALevelInstanceManager_C*                CallFunc_GetActorOfClass_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition) == 0x000008, "Wrong alignment on CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition");
static_assert(sizeof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition) == 0x000058, "Wrong size on CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, EntryPoint) == 0x000000, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_Get_ClassLog_Name_name) == 0x000008, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_CreateObjective_ReturnValue) == 0x000038, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_CreateObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_GetActorOfClass_ReturnValue) == 0x000048, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CaptureTheFlagEndCondition_C_ExecuteUbergraph_CaptureTheFlagEndCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CaptureTheFlagEndCondition.CaptureTheFlagEndCondition_C.Has Team Already Been Eliminated
// 0x0048 (0x0048 - 0x0000)
struct CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eliminated;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0008(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated) == 0x000008, "Wrong alignment on CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated");
static_assert(sizeof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated) == 0x000048, "Wrong size on CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated");
static_assert(offsetof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated, TeamId) == 0x000000, "Member 'CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated::TeamId' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated, Eliminated) == 0x000001, "Member 'CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated::Eliminated' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated, CallFunc_GetTeam_ReturnValue) == 0x000008, "Member 'CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'CaptureTheFlagEndCondition_C_Has_Team_Already_Been_Eliminated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CaptureTheFlagEndCondition.CaptureTheFlagEndCondition_C.TeamHandedInDeed
// 0x0148 (0x0148 - 0x0000)
struct CaptureTheFlagEndCondition_C_TeamHandedInDeed final
{
public:
	uint8                                         TeamWhoHandedInID;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         DeedTeamID;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	bool                                          CallFunc_Has_Team_Already_Been_Eliminated_Eliminated; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x00B0(0x0058)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CaptureTheFlagEndCondition_C_TeamHandedInDeed) == 0x000008, "Wrong alignment on CaptureTheFlagEndCondition_C_TeamHandedInDeed");
static_assert(sizeof(CaptureTheFlagEndCondition_C_TeamHandedInDeed) == 0x000148, "Wrong size on CaptureTheFlagEndCondition_C_TeamHandedInDeed");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, TeamWhoHandedInID) == 0x000000, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::TeamWhoHandedInID' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, DeedTeamID) == 0x000001, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::DeedTeamID' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000008, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, K2Node_MakeArray_Array) == 0x000060, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Format_ReturnValue) == 0x000070, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Has_Team_Already_Been_Eliminated_Eliminated) == 0x000080, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Has_Team_Already_Been_Eliminated_Eliminated' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000098, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_GetMatchConfiguration_ReturnValue) == 0x0000B0, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_GetPlayerController_ReturnValue) == 0x000110, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, Temp_int_Array_Index_Variable) == 0x000118, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_Array_Get_Item) == 0x000120, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_GetPlayerController_ReturnValue_1) == 0x000128, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, CallFunc_K2_GetPawn_ReturnValue) == 0x000130, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000138, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(CaptureTheFlagEndCondition_C_TeamHandedInDeed, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'CaptureTheFlagEndCondition_C_TeamHandedInDeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

