#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargableEquipmentInstance

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function ChargableEquipmentInstance.ChargableEquipmentInstance_C.ExecuteUbergraph_ChargableEquipmentInstance
// 0x0004 (0x0004 - 0x0000)
struct ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance) == 0x000004, "Wrong alignment on ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance");
static_assert(sizeof(ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance) == 0x000004, "Wrong size on ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance");
static_assert(offsetof(ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance, EntryPoint) == 0x000000, "Member 'ChargableEquipmentInstance_C_ExecuteUbergraph_ChargableEquipmentInstance::EntryPoint' has a wrong offset!");

// Function ChargableEquipmentInstance.ChargableEquipmentInstance_C.GetPercentageCharged
// 0x0080 (0x0080 - 0x0000)
struct ChargableEquipmentInstance_C_GetPercentageCharged final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_2;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_3;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChargableEquipmentInstance_C_GetPercentageCharged) == 0x000008, "Wrong alignment on ChargableEquipmentInstance_C_GetPercentageCharged");
static_assert(sizeof(ChargableEquipmentInstance_C_GetPercentageCharged) == 0x000080, "Wrong size on ChargableEquipmentInstance_C_GetPercentageCharged");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, Tag) == 0x000000, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::Tag' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, ReturnValue) == 0x000008, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, K2Node_DynamicCast_AsItem_Instance) == 0x000018, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetInstigator_ReturnValue_1) == 0x000028, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetTagStackCount_ReturnValue) == 0x000030, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, K2Node_DynamicCast_AsItem_Instance_1) == 0x000038, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::K2Node_DynamicCast_AsItem_Instance_1' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000044, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetTagStackCount_ReturnValue_2) == 0x000048, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetTagStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_GetTagStackCount_ReturnValue_3) == 0x000060, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_GetTagStackCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000068, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInstance_C_GetPercentageCharged, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'ChargableEquipmentInstance_C_GetPercentageCharged::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

}

