#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterItemWheelComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.EquipItem
// 0x0008 (0x0008 - 0x0000)
struct CharacterItemWheelComponent_C_EquipItem final
{
public:
	class UItemInstance*                          Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_EquipItem) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_EquipItem");
static_assert(sizeof(CharacterItemWheelComponent_C_EquipItem) == 0x000008, "Wrong size on CharacterItemWheelComponent_C_EquipItem");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipItem, Item) == 0x000000, "Member 'CharacterItemWheelComponent_C_EquipItem::Item' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.EquipNextItem
// 0x0090 (0x0090 - 0x0000)
struct CharacterItemWheelComponent_C_EquipNextItem final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_EquipNextItem) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_EquipNextItem");
static_assert(sizeof(CharacterItemWheelComponent_C_EquipNextItem) == 0x000090, "Wrong size on CharacterItemWheelComponent_C_EquipNextItem");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'CharacterItemWheelComponent_C_EquipNextItem::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CharacterItemWheelComponent_C_EquipNextItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'CharacterItemWheelComponent_C_EquipNextItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetEquipmentManager_ReturnValue) == 0x000018, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetEquipmentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000020, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000028, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetInstigator_ReturnValue) == 0x000038, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000050, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Array_Get_Item) == 0x000068, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipNextItem, CallFunc_BooleanAND_ReturnValue) == 0x00008D, "Member 'CharacterItemWheelComponent_C_EquipNextItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.EquipPreviousItemIndex
// 0x0090 (0x0090 - 0x0000)
struct CharacterItemWheelComponent_C_EquipPreviousItemIndex final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_EquipPreviousItemIndex) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_EquipPreviousItemIndex");
static_assert(sizeof(CharacterItemWheelComponent_C_EquipPreviousItemIndex) == 0x000090, "Wrong size on CharacterItemWheelComponent_C_EquipPreviousItemIndex");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetEquipmentManager_ReturnValue) == 0x000018, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetEquipmentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000020, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000028, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetInstigator_ReturnValue) == 0x000038, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000050, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Array_Get_Item) == 0x000068, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000074, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipPreviousItemIndex, CallFunc_BooleanAND_ReturnValue) == 0x00008D, "Member 'CharacterItemWheelComponent_C_EquipPreviousItemIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.EquipSomething
// 0x0090 (0x0090 - 0x0000)
struct CharacterItemWheelComponent_C_EquipSomething final
{
public:
	class UEquipmentInstance*                     OldEquipmentInstance;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                ResidentCharacter;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     NewEquippedInstance;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_AddItemDefinition_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemCanBeEquipped_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue_1;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue_2;                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_EquipSomething) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_EquipSomething");
static_assert(sizeof(CharacterItemWheelComponent_C_EquipSomething) == 0x000090, "Wrong size on CharacterItemWheelComponent_C_EquipSomething");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, OldEquipmentInstance) == 0x000000, "Member 'CharacterItemWheelComponent_C_EquipSomething::OldEquipmentInstance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, ResidentCharacter) == 0x000008, "Member 'CharacterItemWheelComponent_C_EquipSomething::ResidentCharacter' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, NewEquippedInstance) == 0x000010, "Member 'CharacterItemWheelComponent_C_EquipSomething::NewEquippedInstance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_GetEquipmentManager_ReturnValue) == 0x000018, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_GetEquipmentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000028, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_AddItemDefinition_ReturnValue) == 0x000038, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_AddItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_GetFirstItemOfType_ReturnValue_1) == 0x000040, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_GetFirstItemOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_GetInstigator_ReturnValue) == 0x000048, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, K2Node_DynamicCast_AsItem_Instance) == 0x000050, "Member 'CharacterItemWheelComponent_C_EquipSomething::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CharacterItemWheelComponent_C_EquipSomething::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_GetEquipmentManager_ReturnValue_1) == 0x000060, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_GetEquipmentManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_ItemCanBeEquipped_ReturnValue) == 0x000068, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_ItemCanBeEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_EquipItem_ReturnValue) == 0x000070, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_EquipItem_ReturnValue_1) == 0x000078, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_EquipItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_EquipItem_ReturnValue_2) == 0x000080, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_EquipItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_EquipSomething, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'CharacterItemWheelComponent_C_EquipSomething::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.ExecuteUbergraph_CharacterItemWheelComponent
// 0x0110 (0x0110 - 0x0000)
struct CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearSlot_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_CustomEvent_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemCanBeEquipped_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid_1;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_2;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_EquipSomething_NewEquippedInstance;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearSlot_ReturnValue_1;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AutoEquipHandsComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent");
static_assert(sizeof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent) == 0x000110, "Wrong size on CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, EntryPoint) == 0x000000, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetEquipmentManager_ReturnValue) == 0x000008, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetEquipmentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_ClearSlot_ReturnValue) == 0x000010, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_ClearSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000011, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000018, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_CustomEvent_Item) == 0x000020, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_EquipItem_ReturnValue) == 0x000028, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetInstigator_ReturnValue) == 0x000038, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_AsItem_Instance) == 0x000040, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_ItemCanBeEquipped_ReturnValue) == 0x000049, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_ItemCanBeEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetEquipmentManager_ReturnValue_1) == 0x000050, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetEquipmentManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetInstanceFromSlot_IsInstanceValid_1) == 0x000060, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetInstanceFromSlot_IsInstanceValid_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetInstanceFromSlot_ReturnValue_1) == 0x000068, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetInstanceFromSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000070, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue_3) == 0x000079, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000080, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000088, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000090, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000098, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x0000A0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_AsBP_Resident_Character_2) == 0x0000B0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_AsBP_Resident_Character_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_EquipSomething_NewEquippedInstance) == 0x0000C0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_EquipSomething_NewEquippedInstance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000C8, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000D0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000E0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0000E4, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_IsValid_ReturnValue_5) == 0x0000EC, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetEquipmentManager_ReturnValue_2) == 0x0000F0, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetEquipmentManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_ClearSlot_ReturnValue_1) == 0x0000F8, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_ClearSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000100, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000108, "Member 'CharacterItemWheelComponent_C_ExecuteUbergraph_CharacterItemWheelComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.ItemCanBeEquipped
// 0x0010 (0x0010 - 0x0000)
struct CharacterItemWheelComponent_C_ItemCanBeEquipped final
{
public:
	class UItemInstance*                          ItemInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_ItemCanBeEquipped) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_ItemCanBeEquipped");
static_assert(sizeof(CharacterItemWheelComponent_C_ItemCanBeEquipped) == 0x000010, "Wrong size on CharacterItemWheelComponent_C_ItemCanBeEquipped");
static_assert(offsetof(CharacterItemWheelComponent_C_ItemCanBeEquipped, ItemInstance) == 0x000000, "Member 'CharacterItemWheelComponent_C_ItemCanBeEquipped::ItemInstance' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ItemCanBeEquipped, ReturnValue) == 0x000008, "Member 'CharacterItemWheelComponent_C_ItemCanBeEquipped::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_ItemCanBeEquipped, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000009, "Member 'CharacterItemWheelComponent_C_ItemCanBeEquipped::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.Server_EquipItem
// 0x0008 (0x0008 - 0x0000)
struct CharacterItemWheelComponent_C_Server_EquipItem final
{
public:
	class UItemInstance*                          Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_Server_EquipItem) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_Server_EquipItem");
static_assert(sizeof(CharacterItemWheelComponent_C_Server_EquipItem) == 0x000008, "Wrong size on CharacterItemWheelComponent_C_Server_EquipItem");
static_assert(offsetof(CharacterItemWheelComponent_C_Server_EquipItem, Item) == 0x000000, "Member 'CharacterItemWheelComponent_C_Server_EquipItem::Item' has a wrong offset!");

// Function CharacterItemWheelComponent.CharacterItemWheelComponent_C.GetEquipmentManager
// 0x0018 (0x0018 - 0x0000)
struct CharacterItemWheelComponent_C_GetEquipmentManager final
{
public:
	class UEquipmentManagerComponent*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterItemWheelComponent_C_GetEquipmentManager) == 0x000008, "Wrong alignment on CharacterItemWheelComponent_C_GetEquipmentManager");
static_assert(sizeof(CharacterItemWheelComponent_C_GetEquipmentManager) == 0x000018, "Wrong size on CharacterItemWheelComponent_C_GetEquipmentManager");
static_assert(offsetof(CharacterItemWheelComponent_C_GetEquipmentManager, ReturnValue) == 0x000000, "Member 'CharacterItemWheelComponent_C_GetEquipmentManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterItemWheelComponent_C_GetEquipmentManager, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'CharacterItemWheelComponent_C_GetEquipmentManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
