#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargableEquipmentInstance

#include "Basic.hpp"

#include "BP_EquipmentInstance_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChargableEquipmentInstance.ChargableEquipmentInstance_C
// 0x00A0 (0x01E0 - 0x0140)
class UChargableEquipmentInstance_C : public UBP_EquipmentInstance_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ChargableEquipmentInstance_C;       // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRuntimeFloatCurve                     ForceFromStacks;                                   // 0x0148(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnUnequipped;                                      // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_ChargableEquipmentInstance(int32 EntryPoint);
	void K2_OnRemoved();
	void K2_OnUnequipped();
	void OnUnequipped__DelegateSignature();

	double GetPercentageCharged(const struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChargableEquipmentInstance_C">();
	}
	static class UChargableEquipmentInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChargableEquipmentInstance_C>();
	}
};
static_assert(alignof(UChargableEquipmentInstance_C) == 0x000008, "Wrong alignment on UChargableEquipmentInstance_C");
static_assert(sizeof(UChargableEquipmentInstance_C) == 0x0001E0, "Wrong size on UChargableEquipmentInstance_C");
static_assert(offsetof(UChargableEquipmentInstance_C, UberGraphFrame_ChargableEquipmentInstance_C) == 0x000140, "Member 'UChargableEquipmentInstance_C::UberGraphFrame_ChargableEquipmentInstance_C' has a wrong offset!");
static_assert(offsetof(UChargableEquipmentInstance_C, ForceFromStacks) == 0x000148, "Member 'UChargableEquipmentInstance_C::ForceFromStacks' has a wrong offset!");
static_assert(offsetof(UChargableEquipmentInstance_C, OnUnequipped) == 0x0001D0, "Member 'UChargableEquipmentInstance_C::OnUnequipped' has a wrong offset!");

}

