#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargableEquipmentInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChargableEquipmentInterface.ChargableEquipmentInterface_C.ChargesChanged
// 0x0004 (0x0004 - 0x0000)
struct ChargableEquipmentInterface_C_ChargesChanged final
{
public:
	int32                                         Charges;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChargableEquipmentInterface_C_ChargesChanged) == 0x000004, "Wrong alignment on ChargableEquipmentInterface_C_ChargesChanged");
static_assert(sizeof(ChargableEquipmentInterface_C_ChargesChanged) == 0x000004, "Wrong size on ChargableEquipmentInterface_C_ChargesChanged");
static_assert(offsetof(ChargableEquipmentInterface_C_ChargesChanged, Charges) == 0x000000, "Member 'ChargableEquipmentInterface_C_ChargesChanged::Charges' has a wrong offset!");

// Function ChargableEquipmentInterface.ChargableEquipmentInterface_C.FireCharge
// 0x0010 (0x0010 - 0x0000)
struct ChargableEquipmentInterface_C_FireCharge final
{
public:
	int32                                         Charges;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PercentCharged;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChargableEquipmentInterface_C_FireCharge) == 0x000008, "Wrong alignment on ChargableEquipmentInterface_C_FireCharge");
static_assert(sizeof(ChargableEquipmentInterface_C_FireCharge) == 0x000010, "Wrong size on ChargableEquipmentInterface_C_FireCharge");
static_assert(offsetof(ChargableEquipmentInterface_C_FireCharge, Charges) == 0x000000, "Member 'ChargableEquipmentInterface_C_FireCharge::Charges' has a wrong offset!");
static_assert(offsetof(ChargableEquipmentInterface_C_FireCharge, PercentCharged) == 0x000008, "Member 'ChargableEquipmentInterface_C_FireCharge::PercentCharged' has a wrong offset!");

}

