#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrosshairWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrosshairWI.CrosshairWI_C
// 0x0070 (0x0350 - 0x02E0)
class UCrosshairWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Movable;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_128;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dot;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dot_1;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_212;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Amount;                                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     Equipped_Equipment;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          Equipped_Item;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              OwnerASC;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CrosshairWI(int32 EntryPoint);
	ESlateVisibility GetCrosshairVisibility();
	void OnEquippedItem(class UEquipmentInstance* Instance);
	void Reconstruct(class APawn* OldPawn, class APawn* NewPawn);
	void Set_Deviation(double Amount_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrosshairWI_C">();
	}
	static class UCrosshairWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrosshairWI_C>();
	}
};
static_assert(alignof(UCrosshairWI_C) == 0x000008, "Wrong alignment on UCrosshairWI_C");
static_assert(sizeof(UCrosshairWI_C) == 0x000350, "Wrong size on UCrosshairWI_C");
static_assert(offsetof(UCrosshairWI_C, UberGraphFrame) == 0x0002E0, "Member 'UCrosshairWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, CanvasPanel_0) == 0x0002E8, "Member 'UCrosshairWI_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, CanvasPanel_Movable) == 0x0002F0, "Member 'UCrosshairWI_C::CanvasPanel_Movable' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image) == 0x0002F8, "Member 'UCrosshairWI_C::Image' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image_1) == 0x000300, "Member 'UCrosshairWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image_2) == 0x000308, "Member 'UCrosshairWI_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image_128) == 0x000310, "Member 'UCrosshairWI_C::Image_128' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image_Dot) == 0x000318, "Member 'UCrosshairWI_C::Image_Dot' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Image_Dot_1) == 0x000320, "Member 'UCrosshairWI_C::Image_Dot_1' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, SizeBox_212) == 0x000328, "Member 'UCrosshairWI_C::SizeBox_212' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Amount) == 0x000330, "Member 'UCrosshairWI_C::Amount' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Equipped_Equipment) == 0x000338, "Member 'UCrosshairWI_C::Equipped_Equipment' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, Equipped_Item) == 0x000340, "Member 'UCrosshairWI_C::Equipped_Item' has a wrong offset!");
static_assert(offsetof(UCrosshairWI_C, OwnerASC) == 0x000348, "Member 'UCrosshairWI_C::OwnerASC' has a wrong offset!");

}

