#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_AnimSizeSelector

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_AnimSizeSelector.DA_AnimSizeSelector_C
// 0x00C8 (0x00F8 - 0x0030)
class UDA_AnimSizeSelector_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UDA_CharItemAnimDef_Small_C> Small;                                             // 0x0030(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDA_CharItemAnimDef_Medium_C> Medium;                                            // 0x0058(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDA_CharItemAnimDef_MediumLarge_C> MediumLarge;                                       // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDA_CharItemAnimDef_Large_C> Large;                                             // 0x00A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDA_CharItemAnimDef_FPP_C> FirstPerson;                                       // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_AnimSizeSelector_C">();
	}
	static class UDA_AnimSizeSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_AnimSizeSelector_C>();
	}
};
static_assert(alignof(UDA_AnimSizeSelector_C) == 0x000008, "Wrong alignment on UDA_AnimSizeSelector_C");
static_assert(sizeof(UDA_AnimSizeSelector_C) == 0x0000F8, "Wrong size on UDA_AnimSizeSelector_C");
static_assert(offsetof(UDA_AnimSizeSelector_C, Small) == 0x000030, "Member 'UDA_AnimSizeSelector_C::Small' has a wrong offset!");
static_assert(offsetof(UDA_AnimSizeSelector_C, Medium) == 0x000058, "Member 'UDA_AnimSizeSelector_C::Medium' has a wrong offset!");
static_assert(offsetof(UDA_AnimSizeSelector_C, MediumLarge) == 0x000080, "Member 'UDA_AnimSizeSelector_C::MediumLarge' has a wrong offset!");
static_assert(offsetof(UDA_AnimSizeSelector_C, Large) == 0x0000A8, "Member 'UDA_AnimSizeSelector_C::Large' has a wrong offset!");
static_assert(offsetof(UDA_AnimSizeSelector_C, FirstPerson) == 0x0000D0, "Member 'UDA_AnimSizeSelector_C::FirstPerson' has a wrong offset!");

}

