#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeliveryVan_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DeliveryVan_AnimBP.DeliveryVan_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DeliveryVan_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DeliveryVan_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on DeliveryVan_AnimBP_C_AnimGraph");
static_assert(sizeof(DeliveryVan_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on DeliveryVan_AnimBP_C_AnimGraph");
static_assert(offsetof(DeliveryVan_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'DeliveryVan_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function DeliveryVan_AnimBP.DeliveryVan_AnimBP_C.DoorsState
// 0x0001 (0x0001 - 0x0000)
struct DeliveryVan_AnimBP_C_DoorsState final
{
public:
	bool                                          Open;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeliveryVan_AnimBP_C_DoorsState) == 0x000001, "Wrong alignment on DeliveryVan_AnimBP_C_DoorsState");
static_assert(sizeof(DeliveryVan_AnimBP_C_DoorsState) == 0x000001, "Wrong size on DeliveryVan_AnimBP_C_DoorsState");
static_assert(offsetof(DeliveryVan_AnimBP_C_DoorsState, Open) == 0x000000, "Member 'DeliveryVan_AnimBP_C_DoorsState::Open' has a wrong offset!");

// Function DeliveryVan_AnimBP.DeliveryVan_AnimBP_C.ExecuteUbergraph_DeliveryVan_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Open;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP) == 0x000004, "Wrong alignment on DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP");
static_assert(sizeof(DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP) == 0x000008, "Wrong size on DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP");
static_assert(offsetof(DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP, EntryPoint) == 0x000000, "Member 'DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP, K2Node_Event_Open) == 0x000004, "Member 'DeliveryVan_AnimBP_C_ExecuteUbergraph_DeliveryVan_AnimBP::K2Node_Event_Open' has a wrong offset!");

}

