#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EI_Hands

#include "Basic.hpp"

#include "GASIW_structs.hpp"


namespace SDK::Params
{

// Function EI_Hands.EI_Hands_C.ExecuteUbergraph_EI_Hands
// 0x0150 (0x0150 - 0x0000)
struct EI_Hands_C_ExecuteUbergraph_EI_Hands final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0020(0x0100)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EI_Hands_C_ExecuteUbergraph_EI_Hands) == 0x000010, "Wrong alignment on EI_Hands_C_ExecuteUbergraph_EI_Hands");
static_assert(sizeof(EI_Hands_C_ExecuteUbergraph_EI_Hands) == 0x000150, "Wrong size on EI_Hands_C_ExecuteUbergraph_EI_Hands");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, EntryPoint) == 0x000000, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::EntryPoint' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_GetSpawnedActors_ReturnValue) == 0x000008, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_Array_Get_Item) == 0x000020, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_GetOwner_ReturnValue) == 0x000120, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000130, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000138, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(EI_Hands_C_ExecuteUbergraph_EI_Hands, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'EI_Hands_C_ExecuteUbergraph_EI_Hands::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

