#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmoteWheelWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmoteWheelWI.EmoteWheelWI_C
// 0x0078 (0x0358 - 0x02E0)
class UEmoteWheelWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGDark;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BuffList;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_269;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RadialMenu_C*                      RadialMenu;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_RadialInputPlayerController_C*      Controller;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                OwningCharacter;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   OwnerInventory;                                    // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUEmoteWheelEntryData>          Entries;                                           // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInventoryComponent*                    Inventory;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CharacterWheelComponent;                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddBuffIcon(class UClass* Class_0);
	void BndEvt__RadialMenu_K2Node_ComponentBoundEvent_0_ExitedDeadzone__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_EmoteWheelWI(int32 EntryPoint);
	void Get_Selected_Option(int32* OutIndex, struct FUEmoteWheelEntryData* Info, bool* Valid);
	void GetDamageMultiplierValues(class UItemInstance* ItemInstance, bool* HasMultiplier, float* Damage_Multiplier);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmoteWheelWI_C">();
	}
	static class UEmoteWheelWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteWheelWI_C>();
	}
};
static_assert(alignof(UEmoteWheelWI_C) == 0x000008, "Wrong alignment on UEmoteWheelWI_C");
static_assert(sizeof(UEmoteWheelWI_C) == 0x000358, "Wrong size on UEmoteWheelWI_C");
static_assert(offsetof(UEmoteWheelWI_C, UberGraphFrame) == 0x0002E0, "Member 'UEmoteWheelWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, BG) == 0x0002E8, "Member 'UEmoteWheelWI_C::BG' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, BGDark) == 0x0002F0, "Member 'UEmoteWheelWI_C::BGDark' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, BuffList) == 0x0002F8, "Member 'UEmoteWheelWI_C::BuffList' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Image_269) == 0x000300, "Member 'UEmoteWheelWI_C::Image_269' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, RadialMenu) == 0x000308, "Member 'UEmoteWheelWI_C::RadialMenu' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Text_Description) == 0x000310, "Member 'UEmoteWheelWI_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Text_Name) == 0x000318, "Member 'UEmoteWheelWI_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Controller) == 0x000320, "Member 'UEmoteWheelWI_C::Controller' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, OwningCharacter) == 0x000328, "Member 'UEmoteWheelWI_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, OwnerInventory) == 0x000330, "Member 'UEmoteWheelWI_C::OwnerInventory' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Entries) == 0x000338, "Member 'UEmoteWheelWI_C::Entries' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, Inventory) == 0x000348, "Member 'UEmoteWheelWI_C::Inventory' has a wrong offset!");
static_assert(offsetof(UEmoteWheelWI_C, CharacterWheelComponent) == 0x000350, "Member 'UEmoteWheelWI_C::CharacterWheelComponent' has a wrong offset!");

}

