#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ActivatePickUpThrowable

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.ClearEquippedItem
// 0x0028 (0x0028 - 0x0000)
struct GA_ActivatePickUpThrowable_C_ClearEquippedItem final
{
public:
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInstanceFromSlot_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_ClearEquippedItem) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_ClearEquippedItem");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_ClearEquippedItem) == 0x000028, "Wrong size on GA_ActivatePickUpThrowable_C_ClearEquippedItem");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ClearEquippedItem, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_ClearEquippedItem::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ClearEquippedItem, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_ClearEquippedItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ClearEquippedItem, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_ClearEquippedItem::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ClearEquippedItem, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000018, "Member 'GA_ActivatePickUpThrowable_C_ClearEquippedItem::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ClearEquippedItem, CallFunc_RemoveInstanceFromSlot_ReturnValue) == 0x000020, "Member 'GA_ActivatePickUpThrowable_C_ClearEquippedItem::CallFunc_RemoveInstanceFromSlot_ReturnValue' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.EquipHands
// 0x0030 (0x0030 - 0x0000)
struct GA_ActivatePickUpThrowable_C_EquipHands final
{
public:
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_EquipHands) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_EquipHands");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_EquipHands) == 0x000030, "Wrong size on GA_ActivatePickUpThrowable_C_EquipHands");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000018, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000020, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_EquipHands, CallFunc_EquipItem_ReturnValue) == 0x000028, "Member 'GA_ActivatePickUpThrowable_C_EquipHands::CallFunc_EquipItem_ReturnValue' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.ExecuteUbergraph_GA_ActivatePickUpThrowable
// 0x0148 (0x0148 - 0x0000)
struct GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetThrowableHandsInstance_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetEquipmentManager_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_EquipItem_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetThrowableHandsInstance_ReturnValue_1;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0098(0x00B0)(ConstParm)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable) == 0x000148, "Wrong size on GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, EntryPoint) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetEquipmentManager_ReturnValue) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetEquipmentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_Get_ClassLog_Name_name) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000020, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000028, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetInstigator_ReturnValue) == 0x000030, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetInstigator_ReturnValue_1) == 0x000038, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, K2Node_DynamicCast_AsItem_Instance) == 0x000040, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetThrowableHandsInstance_ReturnValue) == 0x000050, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetThrowableHandsInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetEquipmentManager_ReturnValue_1) == 0x000058, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetEquipmentManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_EquipItem_ReturnValue) == 0x000060, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_K2_HasAuthority_ReturnValue) == 0x000068, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetThrowableHandsInstance_ReturnValue_1) == 0x000070, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetThrowableHandsInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000080, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000088, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, CallFunc_K2_CommitAbility_ReturnValue) == 0x000091, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable, K2Node_Event_EventData) == 0x000098, "Member 'GA_ActivatePickUpThrowable_C_ExecuteUbergraph_GA_ActivatePickUpThrowable::K2Node_Event_EventData' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.GetEquipmentManager
// 0x0018 (0x0018 - 0x0000)
struct GA_ActivatePickUpThrowable_C_GetEquipmentManager final
{
public:
	class UEquipmentManagerComponent*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_GetEquipmentManager) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_GetEquipmentManager");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_GetEquipmentManager) == 0x000018, "Wrong size on GA_ActivatePickUpThrowable_C_GetEquipmentManager");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetEquipmentManager, ReturnValue) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_GetEquipmentManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetEquipmentManager, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_GetEquipmentManager::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetEquipmentManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_GetEquipmentManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.GetInventoryComponent
// 0x0018 (0x0018 - 0x0000)
struct GA_ActivatePickUpThrowable_C_GetInventoryComponent final
{
public:
	class UInventoryComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_GetInventoryComponent) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_GetInventoryComponent");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_GetInventoryComponent) == 0x000018, "Wrong size on GA_ActivatePickUpThrowable_C_GetInventoryComponent");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetInventoryComponent, ReturnValue) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_GetInventoryComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetInventoryComponent, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_GetInventoryComponent::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetInventoryComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_GetInventoryComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_ActivatePickUpThrowable.GA_ActivatePickUpThrowable_C.GetThrowableHandsInstance
// 0x0018 (0x0018 - 0x0000)
struct GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance final
{
public:
	class UItemInstance*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetInventoryComponent_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance) == 0x000008, "Wrong alignment on GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance");
static_assert(sizeof(GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance) == 0x000018, "Wrong size on GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance, ReturnValue) == 0x000000, "Member 'GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance, CallFunc_GetInventoryComponent_ReturnValue) == 0x000008, "Member 'GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000010, "Member 'GA_ActivatePickUpThrowable_C_GetThrowableHandsInstance::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");

}

