#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AimWeaponStop

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GASIW_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function GA_AimWeaponStop.GA_AimWeaponStop_C.ExecuteUbergraph_GA_AimWeaponStop
// 0x0100 (0x0100 - 0x0000)
struct GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetAssociatedItem_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop) == 0x000008, "Wrong alignment on GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop");
static_assert(sizeof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop) == 0x000100, "Wrong size on GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, EntryPoint) == 0x000000, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, K2Node_Event_EventData) == 0x000008, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, CallFunc_GetAssociatedItem_ReturnValue) == 0x0000C0, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::CallFunc_GetAssociatedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, K2Node_DynamicCast_AsBP_Resident_Character) == 0x0000D8, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, K2Node_DynamicCast_AsI_Character_Animation) == 0x0000E8, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'GA_AimWeaponStop_C_ExecuteUbergraph_GA_AimWeaponStop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GA_AimWeaponStop.GA_AimWeaponStop_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_AimWeaponStop_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_AimWeaponStop.GA_AimWeaponStop_C.RemoveAimGameplayEffects
// 0x0040 (0x0040 - 0x0000)
struct GA_AimWeaponStop_C_RemoveAimGameplayEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AimWeaponStop_C_RemoveAimGameplayEffects) == 0x000008, "Wrong alignment on GA_AimWeaponStop_C_RemoveAimGameplayEffects");
static_assert(sizeof(GA_AimWeaponStop_C_RemoveAimGameplayEffects) == 0x000040, "Wrong size on GA_AimWeaponStop_C_RemoveAimGameplayEffects");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000018, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000020, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_Array_Get_Item) == 0x000034, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimGameplayEffects, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00003D, "Member 'GA_AimWeaponStop_C_RemoveAimGameplayEffects::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function GA_AimWeaponStop.GA_AimWeaponStop_C.RemoveAimSensitivityOverride
// 0x0030 (0x0030 - 0x0000)
struct GA_AimWeaponStop_C_RemoveAimSensitivityOverride final
{
public:
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0000(0x0001)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_RemoveMappingContext_self_CastInput;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride) == 0x000008, "Wrong alignment on GA_AimWeaponStop_C_RemoveAimSensitivityOverride");
static_assert(sizeof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride) == 0x000030, "Wrong size on GA_AimWeaponStop_C_RemoveAimSensitivityOverride");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, Temp_struct_Variable) == 0x000000, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, CallFunc_IsLocallyControlled_ReturnValue) == 0x000001, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, CallFunc_RemoveMappingContext_self_CastInput) == 0x000018, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::CallFunc_RemoveMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_RemoveAimSensitivityOverride, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_AimWeaponStop_C_RemoveAimSensitivityOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_AimWeaponStop.GA_AimWeaponStop_C.ShowCannonMesh
// 0x0030 (0x0030 - 0x0000)
struct GA_AimWeaponStop_C_ShowCannonMesh final
{
public:
	class UEquipmentInstance*                     CallFunc_GetAssociatedEquipment_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OrangeCannonEquipable_C*            K2Node_DynamicCast_AsBP_Orange_Cannon_Equipable;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AimWeaponStop_C_ShowCannonMesh) == 0x000008, "Wrong alignment on GA_AimWeaponStop_C_ShowCannonMesh");
static_assert(sizeof(GA_AimWeaponStop_C_ShowCannonMesh) == 0x000030, "Wrong size on GA_AimWeaponStop_C_ShowCannonMesh");
static_assert(offsetof(GA_AimWeaponStop_C_ShowCannonMesh, CallFunc_GetAssociatedEquipment_ReturnValue) == 0x000000, "Member 'GA_AimWeaponStop_C_ShowCannonMesh::CallFunc_GetAssociatedEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ShowCannonMesh, CallFunc_GetSpawnedActors_ReturnValue) == 0x000008, "Member 'GA_AimWeaponStop_C_ShowCannonMesh::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ShowCannonMesh, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_AimWeaponStop_C_ShowCannonMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ShowCannonMesh, K2Node_DynamicCast_AsBP_Orange_Cannon_Equipable) == 0x000020, "Member 'GA_AimWeaponStop_C_ShowCannonMesh::K2Node_DynamicCast_AsBP_Orange_Cannon_Equipable' has a wrong offset!");
static_assert(offsetof(GA_AimWeaponStop_C_ShowCannonMesh, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_AimWeaponStop_C_ShowCannonMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

