#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bash

#include "Basic.hpp"

#include "E_ImpactEffect_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GASIW_structs.hpp"
#include "JP_structs.hpp"
#include "S_ChargeBarEndGameplayMessage_structs.hpp"


namespace SDK::Params
{

// Function GA_Bash.GA_Bash_C.AddAffectedCue
// 0x03B0 (0x03B0 - 0x0000)
struct GA_Bash_C_AddAffectedCue final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                L_OwnerForward;                                    // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_TraceFrom;                                       // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0128(0x0020)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0220(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0268(0x0020)()
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSpawnedActor_Return;                   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCosmeticLocationAndNormal_Location;    // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCosmeticLocationAndNormal_Normal;      // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x02D8(0x00D8)(ContainsInstancedReference)
};
static_assert(alignof(GA_Bash_C_AddAffectedCue) == 0x000008, "Wrong alignment on GA_Bash_C_AddAffectedCue");
static_assert(sizeof(GA_Bash_C_AddAffectedCue) == 0x0003B0, "Wrong size on GA_Bash_C_AddAffectedCue");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, Hit) == 0x000000, "Member 'GA_Bash_C_AddAffectedCue::Hit' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, L_OwnerForward) == 0x0000F8, "Member 'GA_Bash_C_AddAffectedCue::L_OwnerForward' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, L_TraceFrom) == 0x000110, "Member 'GA_Bash_C_AddAffectedCue::L_TraceFrom' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, Temp_struct_Variable) == 0x000128, "Member 'GA_Bash_C_AddAffectedCue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, Temp_struct_Variable_1) == 0x000220, "Member 'GA_Bash_C_AddAffectedCue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, Temp_bool_Variable) == 0x000240, "Member 'GA_Bash_C_AddAffectedCue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_K2_HasAuthority_ReturnValue) == 0x000241, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000248, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_HasAuthority_ReturnValue) == 0x000250, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000258, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000260, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, K2Node_Select_Default) == 0x000268, "Member 'GA_Bash_C_AddAffectedCue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000288, "Member 'GA_Bash_C_AddAffectedCue::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, K2Node_DynamicCast_bSuccess) == 0x000290, "Member 'GA_Bash_C_AddAffectedCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetSpawnedActor_Return) == 0x000298, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetSpawnedActor_Return' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0002A0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetCosmeticLocationAndNormal_Location) == 0x0002A8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetCosmeticLocationAndNormal_Location' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_GetCosmeticLocationAndNormal_Normal) == 0x0002C0, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_GetCosmeticLocationAndNormal_Normal' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_AddAffectedCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0002D8, "Member 'GA_Bash_C_AddAffectedCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.ApplyGameplayEffectToHitActorASC
// 0x01A8 (0x01A8 - 0x0000)
struct GA_Bash_C_ApplyGameplayEffectToHitActorASC final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           DataTag;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	double                                        Magnitude;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0020(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           StructureDamageTag;                                // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Structure_Damage_Multiplier_Damage_Multiplier; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Structure_Damage_Multiplier_MultiplierFound; // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetOwnerAbilitySystemComponent_Return;    // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetOwnerAbilitySystemComponent_Return_1;  // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0148(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0158(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0168(0x0010)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0178(0x0018)()
	bool                                          CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed; // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue; // 0x0194(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_ApplyGameplayEffectToHitActorASC) == 0x000008, "Wrong alignment on GA_Bash_C_ApplyGameplayEffectToHitActorASC");
static_assert(sizeof(GA_Bash_C_ApplyGameplayEffectToHitActorASC) == 0x0001A8, "Wrong size on GA_Bash_C_ApplyGameplayEffectToHitActorASC");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, Target) == 0x000000, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::Target' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, GameplayEffectClass) == 0x000008, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, DataTag) == 0x000010, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::DataTag' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, Magnitude) == 0x000018, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::Magnitude' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, HitResult) == 0x000020, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::HitResult' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, StructureDamageTag) == 0x000118, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::StructureDamageTag' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_Get_Structure_Damage_Multiplier_Damage_Multiplier) == 0x000120, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_Get_Structure_Damage_Multiplier_Damage_Multiplier' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_Get_Structure_Damage_Multiplier_MultiplierFound) == 0x000124, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_Get_Structure_Damage_Multiplier_MultiplierFound' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_GetOwnerAbilitySystemComponent_Return) == 0x000128, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_GetOwnerAbilitySystemComponent_Return' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000130, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_GetOwnerAbilitySystemComponent_Return_1) == 0x000140, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_GetOwnerAbilitySystemComponent_Return_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000148, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000158, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000168, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_GetEffectContext_ReturnValue) == 0x000178, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed) == 0x000190, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue) == 0x000194, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_BooleanOR_ReturnValue) == 0x00019C, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyGameplayEffectToHitActorASC, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0001A0, "Member 'GA_Bash_C_ApplyGameplayEffectToHitActorASC::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.ApplyKillAssistedEffect
// 0x00F8 (0x00F8 - 0x0000)
struct GA_Bash_C_ApplyKillAssistedEffect final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              AssistGESpecHandle;                                // 0x0008(0x0010)(Edit, BlueprintVisible)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0020(0x0018)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0088(0x0010)()
	struct FCombatParticipant                     CallFunc_CreateCombatParticipantFromPlayer_ReturnValue; // 0x0098(0x0060)()
};
static_assert(alignof(GA_Bash_C_ApplyKillAssistedEffect) == 0x000008, "Wrong alignment on GA_Bash_C_ApplyKillAssistedEffect");
static_assert(sizeof(GA_Bash_C_ApplyKillAssistedEffect) == 0x0000F8, "Wrong size on GA_Bash_C_ApplyKillAssistedEffect");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, TargetASC) == 0x000000, "Member 'GA_Bash_C_ApplyKillAssistedEffect::TargetASC' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, AssistGESpecHandle) == 0x000008, "Member 'GA_Bash_C_ApplyKillAssistedEffect::AssistGESpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_GetEffectContext_ReturnValue) == 0x000020, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000038, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000040, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000048, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_AsPawn) == 0x000058, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000064, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000070, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000078, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GA_Bash_C_ApplyKillAssistedEffect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000088, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_ApplyKillAssistedEffect, CallFunc_CreateCombatParticipantFromPlayer_ReturnValue) == 0x000098, "Member 'GA_Bash_C_ApplyKillAssistedEffect::CallFunc_CreateCombatParticipantFromPlayer_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.CalculateChargeUsingTime
// 0x0050 (0x0050 - 0x0000)
struct GA_Bash_C_CalculateChargeUsingTime final
{
public:
	double                                        TimeHeld;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Charge;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_2;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_CalculateChargeUsingTime) == 0x000008, "Wrong alignment on GA_Bash_C_CalculateChargeUsingTime");
static_assert(sizeof(GA_Bash_C_CalculateChargeUsingTime) == 0x000050, "Wrong size on GA_Bash_C_CalculateChargeUsingTime");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, TimeHeld) == 0x000000, "Member 'GA_Bash_C_CalculateChargeUsingTime::TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, Charge) == 0x000008, "Member 'GA_Bash_C_CalculateChargeUsingTime::Charge' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_GetTagStackCount_ReturnValue) == 0x000010, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000014, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_GetTagStackCount_ReturnValue_2) == 0x000028, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_GetTagStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000030, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CalculateChargeUsingTime, CallFunc_FMin_ReturnValue) == 0x000048, "Member 'GA_Bash_C_CalculateChargeUsingTime::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.CanAffectTeam
// 0x0048 (0x0048 - 0x0000)
struct GA_Bash_C_CanAffectTeam final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TakeDamageFromAllTeams_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamFromActor_ReturnValue;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamFromActor_TeamFound;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface_1;         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_CanAffectTeam) == 0x000008, "Wrong alignment on GA_Bash_C_CanAffectTeam");
static_assert(sizeof(GA_Bash_C_CanAffectTeam) == 0x000048, "Wrong size on GA_Bash_C_CanAffectTeam");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, Target) == 0x000000, "Member 'GA_Bash_C_CanAffectTeam::Target' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, Return) == 0x000008, "Member 'GA_Bash_C_CanAffectTeam::Return' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, Temp_byte_Variable) == 0x000009, "Member 'GA_Bash_C_CanAffectTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, K2Node_DynamicCast_AsTeamable_Interface) == 0x000010, "Member 'GA_Bash_C_CanAffectTeam::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Bash_C_CanAffectTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_TakeDamageFromAllTeams_ReturnValue) == 0x000021, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_TakeDamageFromAllTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_GetTeamFromActor_ReturnValue) == 0x000022, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_GetTeamFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_GetTeamFromActor_TeamFound) == 0x000023, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_GetTeamFromActor_TeamFound' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000024, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, Temp_bool_Variable) == 0x000026, "Member 'GA_Bash_C_CanAffectTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, K2Node_SwitchEnum_CmpSuccess) == 0x000027, "Member 'GA_Bash_C_CanAffectTeam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, K2Node_DynamicCast_AsTeamable_Interface_1) == 0x000030, "Member 'GA_Bash_C_CanAffectTeam::K2Node_DynamicCast_AsTeamable_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'GA_Bash_C_CanAffectTeam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanAffectTeam, CallFunc_GetTeamID_ReturnValue) == 0x000041, "Member 'GA_Bash_C_CanAffectTeam::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.CanApplyHit
// 0x01D0 (0x01D0 - 0x0000)
struct GA_Bash_C_CanApplyHit final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponentIW*              HitActorASC;                                       // 0x0100(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffectTeam_Return;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffectTeam_Return_1;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW_1; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlockingVolume_C*                   K2Node_DynamicCast_AsBP_Blocking_Volume;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0160(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0198(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_CanApplyHit) == 0x000008, "Wrong alignment on GA_Bash_C_CanApplyHit");
static_assert(sizeof(GA_Bash_C_CanApplyHit) == 0x0001D0, "Wrong size on GA_Bash_C_CanApplyHit");
static_assert(offsetof(GA_Bash_C_CanApplyHit, Actor) == 0x000000, "Member 'GA_Bash_C_CanApplyHit::Actor' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, Hit) == 0x000008, "Member 'GA_Bash_C_CanApplyHit::Hit' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, HitActorASC) == 0x000100, "Member 'GA_Bash_C_CanApplyHit::HitActorASC' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, ReturnValue) == 0x000108, "Member 'GA_Bash_C_CanApplyHit::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_CanAffectTeam_Return) == 0x000109, "Member 'GA_Bash_C_CanApplyHit::CallFunc_CanAffectTeam_Return' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_CanAffectTeam_Return_1) == 0x00010A, "Member 'GA_Bash_C_CanApplyHit::CallFunc_CanAffectTeam_Return_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000110, "Member 'GA_Bash_C_CanApplyHit::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GA_Bash_C_CanApplyHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000120, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000130, "Member 'GA_Bash_C_CanApplyHit::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'GA_Bash_C_CanApplyHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_IsValid_ReturnValue_2) == 0x000139, "Member 'GA_Bash_C_CanApplyHit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_AsAbility_System_Component_IW_1) == 0x000140, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_AsAbility_System_Component_IW_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_AsBP_Blocking_Volume) == 0x000150, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_AsBP_Blocking_Volume' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'GA_Bash_C_CanApplyHit::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000160, "Member 'GA_Bash_C_CanApplyHit::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000180, "Member 'GA_Bash_C_CanApplyHit::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000190, "Member 'GA_Bash_C_CanApplyHit::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_BooleanAND_ReturnValue) == 0x000191, "Member 'GA_Bash_C_CanApplyHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000198, "Member 'GA_Bash_C_CanApplyHit::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x0001B8, "Member 'GA_Bash_C_CanApplyHit::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanApplyHit, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0001C8, "Member 'GA_Bash_C_CanApplyHit::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.CanUseStamina
// 0x0058 (0x0058 - 0x0000)
struct GA_Bash_C_CanUseStamina final
{
public:
	bool                                          HasBlockingTag;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CheckAbilityCost_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_CanUseStamina) == 0x000008, "Wrong alignment on GA_Bash_C_CanUseStamina");
static_assert(sizeof(GA_Bash_C_CanUseStamina) == 0x000058, "Wrong size on GA_Bash_C_CanUseStamina");
static_assert(offsetof(GA_Bash_C_CanUseStamina, HasBlockingTag) == 0x000000, "Member 'GA_Bash_C_CanUseStamina::HasBlockingTag' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_K2_CheckAbilityCost_ReturnValue) == 0x000001, "Member 'GA_Bash_C_CanUseStamina::CallFunc_K2_CheckAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'GA_Bash_C_CanUseStamina::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'GA_Bash_C_CanUseStamina::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Bash_C_CanUseStamina::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000038, "Member 'GA_Bash_C_CanUseStamina::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000040, "Member 'GA_Bash_C_CanUseStamina::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000050, "Member 'GA_Bash_C_CanUseStamina::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bash_C_CanUseStamina, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'GA_Bash_C_CanUseStamina::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.ClearTimers
// 0x0001 (0x0001 - 0x0000)
struct GA_Bash_C_ClearTimers final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bash_C_ClearTimers) == 0x000001, "Wrong alignment on GA_Bash_C_ClearTimers");
static_assert(sizeof(GA_Bash_C_ClearTimers) == 0x000001, "Wrong size on GA_Bash_C_ClearTimers");
static_assert(offsetof(GA_Bash_C_ClearTimers, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'GA_Bash_C_ClearTimers::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function GA_Bash.GA_Bash_C.CommitStaminaCost
// 0x0028 (0x0028 - 0x0000)
struct GA_Bash_C_CommitStaminaCost final
{
public:
	bool                                          CallFunc_CanUseStamina_HasBlockingTag;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNoAbilityCost_ReturnValue;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StaminaCost_C>      K2Node_DynamicCast_AsI_Stamina_Cost;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
