#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ChangeTrackedObjective

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_ChangeTrackedObjective.GA_ChangeTrackedObjective_C.ExecuteUbergraph_GA_ChangeTrackedObjective
// 0x0050 (0x0050 - 0x0000)
struct GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveTrackingManager*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective) == 0x000008, "Wrong alignment on GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective");
static_assert(sizeof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective) == 0x000050, "Wrong size on GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, EntryPoint) == 0x000000, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_AsGame_State_JP_Match_BP) == 0x000018, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_AsGame_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_AsPawn) == 0x000028, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000040, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'GA_ChangeTrackedObjective_C_ExecuteUbergraph_GA_ChangeTrackedObjective::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

