#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DropUnequipped

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_DropUnequipped.GA_DropUnequipped_C.ExecuteUbergraph_GA_DropUnequipped
// 0x0320 (0x0320 - 0x0000)
struct GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSpawnEquipment_ShouldSpawn;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     K2Node_CustomEvent_Instance;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDroppableEquipmentInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsOfType_ReturnValue;            // 0x0048(0x0010)(ReferenceParm)
	class UItemInstance*                          CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_Droppable*            CallFunc_FindActionByType_ReturnValue;             // 0x0068(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Deed;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0188(0x0010)(ReferenceParm)
	class ABP_Deed_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsOfType_ReturnValue_1;          // 0x01A8(0x0010)(ReferenceParm)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsOfType_ReturnValue_2;          // 0x01B8(0x0010)(ReferenceParm)
	class UItemInstance*                          CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_Droppable*            CallFunc_FindActionByType_ReturnValue_1;           // 0x01D8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_2;           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_3; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentInstance* Instance)> K2Node_CreateDelegate_OutputDelegate;              // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0290(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Deed_C*                             CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSpawnEquipment_ShouldSpawn_1;       // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped) == 0x000010, "Wrong alignment on GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped");
static_assert(sizeof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped) == 0x000320, "Wrong size on GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, EntryPoint) == 0x000000, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_ShouldSpawnEquipment_ShouldSpawn) == 0x000004, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_ShouldSpawnEquipment_ShouldSpawn' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_CustomEvent_Instance) == 0x000010, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_CustomEvent_Instance' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000018, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetDroppableEquipmentInstance_ReturnValue) == 0x000028, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetDroppableEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_AsItem_Instance) == 0x000038, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetAllItemsOfType_ReturnValue) == 0x000048, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetAllItemsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_Get_Item) == 0x000058, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000060, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetTagStackCount_ReturnValue) == 0x000064, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FindActionByType_ReturnValue) == 0x000068, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Conv_IntToByte_ReturnValue) == 0x000070, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000078, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_ClassDynamicCast_AsBP_Deed) == 0x000080, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_ClassDynamicCast_AsBP_Deed' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_ClassDynamicCast_bSuccess) == 0x000088, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0000A8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x000110, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_MakeTransform_ReturnValue_1) == 0x000120, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000188, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FinishSpawningActor_ReturnValue) == 0x000198, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_IsEmpty_ReturnValue) == 0x0001A0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetAllItemsOfType_ReturnValue_1) == 0x0001A8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetAllItemsOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetAllItemsOfType_ReturnValue_2) == 0x0001B8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetAllItemsOfType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FindActionByType_ReturnValue_1) == 0x0001D8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FindActionByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetTagStackCount_ReturnValue_1) == 0x0001E0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0001E4, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001E8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001F0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x0001F8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_Array_IsNotEmpty_ReturnValue_2) == 0x0001F9, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_Array_IsNotEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_GetOwningActorFromActorInfo_ReturnValue_3) == 0x000200, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_GetOwningActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, K2Node_CreateDelegate_OutputDelegate) == 0x000208, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000218, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_MakeTransform_ReturnValue_2) == 0x000230, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_MakeTransform_ReturnValue_3) == 0x000290, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0002F0, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0002F8, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000300, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000308, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_IsServer_ReturnValue) == 0x000310, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped, CallFunc_ShouldSpawnEquipment_ShouldSpawn_1) == 0x000311, "Member 'GA_DropUnequipped_C_ExecuteUbergraph_GA_DropUnequipped::CallFunc_ShouldSpawnEquipment_ShouldSpawn_1' has a wrong offset!");

// Function GA_DropUnequipped.GA_DropUnequipped_C.GetDroppableEquipmentInstance
// 0x0058 (0x0058 - 0x0000)
struct GA_DropUnequipped_C_GetDroppableEquipmentInstance final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UEI_Deed_C*                             K2Node_DynamicCast_AsEI_Deed;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEI_Firewood_C*                         K2Node_DynamicCast_AsEI_Firewood;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEI_Resource_C*                         K2Node_DynamicCast_AsEI_Resource;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue_2;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DropUnequipped_C_GetDroppableEquipmentInstance) == 0x000008, "Wrong alignment on GA_DropUnequipped_C_GetDroppableEquipmentInstance");
static_assert(sizeof(GA_DropUnequipped_C_GetDroppableEquipmentInstance) == 0x000058, "Wrong size on GA_DropUnequipped_C_GetDroppableEquipmentInstance");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, Object) == 0x000000, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::Object' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, ReturnValue) == 0x000008, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_AsEI_Deed) == 0x000010, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_AsEI_Deed' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_AsEI_Firewood) == 0x000020, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_AsEI_Firewood' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, CallFunc_GetInstigator_ReturnValue) == 0x000030, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, CallFunc_GetInstigator_ReturnValue_1) == 0x000038, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_AsEI_Resource) == 0x000040, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_AsEI_Resource' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_GetDroppableEquipmentInstance, CallFunc_GetInstigator_ReturnValue_2) == 0x000050, "Member 'GA_DropUnequipped_C_GetDroppableEquipmentInstance::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");

// Function GA_DropUnequipped.GA_DropUnequipped_C.OnUnequipped
// 0x0008 (0x0008 - 0x0000)
struct GA_DropUnequipped_C_OnUnequipped final
{
public:
	class UEquipmentInstance*                     Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DropUnequipped_C_OnUnequipped) == 0x000008, "Wrong alignment on GA_DropUnequipped_C_OnUnequipped");
static_assert(sizeof(GA_DropUnequipped_C_OnUnequipped) == 0x000008, "Wrong size on GA_DropUnequipped_C_OnUnequipped");
static_assert(offsetof(GA_DropUnequipped_C_OnUnequipped, Instance) == 0x000000, "Member 'GA_DropUnequipped_C_OnUnequipped::Instance' has a wrong offset!");

// Function GA_DropUnequipped.GA_DropUnequipped_C.ShouldSpawnEquipment
// 0x0028 (0x0028 - 0x0000)
struct GA_DropUnequipped_C_ShouldSpawnEquipment final
{
public:
	bool                                          ShouldSpawn;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DropUnequipped_C_ShouldSpawnEquipment) == 0x000008, "Wrong alignment on GA_DropUnequipped_C_ShouldSpawnEquipment");
static_assert(sizeof(GA_DropUnequipped_C_ShouldSpawnEquipment) == 0x000028, "Wrong size on GA_DropUnequipped_C_ShouldSpawnEquipment");
static_assert(offsetof(GA_DropUnequipped_C_ShouldSpawnEquipment, ShouldSpawn) == 0x000000, "Member 'GA_DropUnequipped_C_ShouldSpawnEquipment::ShouldSpawn' has a wrong offset!");
static_assert(offsetof(GA_DropUnequipped_C_ShouldSpawnEquipment, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_DropUnequipped_C_ShouldSpawnEquipment::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
