#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GASIW_structs.hpp"
#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Equipment.GA_Equipment_C.Check on Cooldown Cue
// 0x0048 (0x0048 - 0x0000)
struct GA_Equipment_C_Check_on_Cooldown_Cue final
{
public:
	struct FGameplayTagContainer                  Gameplay_Tags;                                     // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0020(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0028(0x0010)(ReferenceParm)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0038(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_Check_on_Cooldown_Cue) == 0x000008, "Wrong alignment on GA_Equipment_C_Check_on_Cooldown_Cue");
static_assert(sizeof(GA_Equipment_C_Check_on_Cooldown_Cue) == 0x000048, "Wrong size on GA_Equipment_C_Check_on_Cooldown_Cue");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, Gameplay_Tags) == 0x000000, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::Gameplay_Tags' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, Temp_struct_Variable) == 0x000020, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000028, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, Temp_struct_Variable_1) == 0x000038, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, CallFunc_Array_Contains_ReturnValue) == 0x000040, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, CallFunc_Array_Contains_ReturnValue_1) == 0x000041, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Check_on_Cooldown_Cue, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'GA_Equipment_C_Check_on_Cooldown_Cue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.CheckItemBroken
// 0x0120 (0x0120 - 0x0000)
struct GA_Equipment_C_CheckItemBroken final
{
public:
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetAssociatedItem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0040(0x00D8)(ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_CheckItemBroken) == 0x000008, "Wrong alignment on GA_Equipment_C_CheckItemBroken");
static_assert(sizeof(GA_Equipment_C_CheckItemBroken) == 0x000120, "Wrong size on GA_Equipment_C_CheckItemBroken");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_GetAssociatedItem_ReturnValue) == 0x000008, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_GetAssociatedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_ContainsTag_ReturnValue) == 0x000018, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x000019, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_GetTagStackCount_ReturnValue) == 0x00001C, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000040, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckItemBroken, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'GA_Equipment_C_CheckItemBroken::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.CheckNoAmmoCue
// 0x0040 (0x0040 - 0x0000)
struct GA_Equipment_C_CheckNoAmmoCue final
{
public:
	struct FGameplayTagContainer                  GameplayTagContainer;                              // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0020(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_CheckNoAmmoCue) == 0x000008, "Wrong alignment on GA_Equipment_C_CheckNoAmmoCue");
static_assert(sizeof(GA_Equipment_C_CheckNoAmmoCue) == 0x000040, "Wrong size on GA_Equipment_C_CheckNoAmmoCue");
static_assert(offsetof(GA_Equipment_C_CheckNoAmmoCue, GameplayTagContainer) == 0x000000, "Member 'GA_Equipment_C_CheckNoAmmoCue::GameplayTagContainer' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckNoAmmoCue, Temp_struct_Variable) == 0x000020, "Member 'GA_Equipment_C_CheckNoAmmoCue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckNoAmmoCue, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000028, "Member 'GA_Equipment_C_CheckNoAmmoCue::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_CheckNoAmmoCue, CallFunc_Array_Contains_ReturnValue) == 0x000038, "Member 'GA_Equipment_C_CheckNoAmmoCue::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.Event PlayOneShotMontages
// 0x0020 (0x0020 - 0x0000)
struct GA_Equipment_C_Event_PlayOneShotMontages final
{
public:
	class UAnimMontage*                           MontageFPP;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageTPP;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartingPosition;                                  // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartingSection;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_Event_PlayOneShotMontages) == 0x000008, "Wrong alignment on GA_Equipment_C_Event_PlayOneShotMontages");
static_assert(sizeof(GA_Equipment_C_Event_PlayOneShotMontages) == 0x000020, "Wrong size on GA_Equipment_C_Event_PlayOneShotMontages");
static_assert(offsetof(GA_Equipment_C_Event_PlayOneShotMontages, MontageFPP) == 0x000000, "Member 'GA_Equipment_C_Event_PlayOneShotMontages::MontageFPP' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Event_PlayOneShotMontages, MontageTPP) == 0x000008, "Member 'GA_Equipment_C_Event_PlayOneShotMontages::MontageTPP' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Event_PlayOneShotMontages, PlayRate) == 0x000010, "Member 'GA_Equipment_C_Event_PlayOneShotMontages::PlayRate' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Event_PlayOneShotMontages, StartingPosition) == 0x000014, "Member 'GA_Equipment_C_Event_PlayOneShotMontages::StartingPosition' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_Event_PlayOneShotMontages, StartingSection) == 0x000018, "Member 'GA_Equipment_C_Event_PlayOneShotMontages::StartingSection' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18) == 0x000008, "Wrong alignment on GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18");
static_assert(sizeof(GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18) == 0x0000B8, "Wrong size on GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18");
static_assert(offsetof(GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18, EventTag) == 0x000000, "Member 'GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18, EventData) == 0x000008, "Member 'GA_Equipment_C_EventReceived_9559A0914F3EAD112E6C8E98F7AA5D18::EventData' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D) == 0x000008, "Wrong alignment on GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D");
static_assert(sizeof(GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D) == 0x0000B8, "Wrong size on GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D");
static_assert(offsetof(GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D, EventTag) == 0x000000, "Member 'GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D, EventData) == 0x000008, "Member 'GA_Equipment_C_EventReceived_AFDE5EE746339BC47D92C5BBC5E7265D::EventData' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.ExecuteNoAmmoCue
// 0x0018 (0x0018 - 0x0000)
struct GA_Equipment_C_ExecuteNoAmmoCue final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_ExecuteNoAmmoCue) == 0x000008, "Wrong alignment on GA_Equipment_C_ExecuteNoAmmoCue");
static_assert(sizeof(GA_Equipment_C_ExecuteNoAmmoCue) == 0x000018, "Wrong size on GA_Equipment_C_ExecuteNoAmmoCue");
static_assert(offsetof(GA_Equipment_C_ExecuteNoAmmoCue, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Equipment_C_ExecuteNoAmmoCue::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteNoAmmoCue, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'GA_Equipment_C_ExecuteNoAmmoCue::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteNoAmmoCue, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'GA_Equipment_C_ExecuteNoAmmoCue::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function GA_Equipment.GA_Equipment_C.ExecuteUbergraph_GA_Equipment
// 0x0E50 (0x0E50 - 0x0000)
struct GA_Equipment_C_ExecuteUbergraph_GA_Equipment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x00C0(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x0178(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x0240(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x0308(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x03D0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0480(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0490(0x00B0)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0540(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x0548(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x0550(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0600(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0610(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0618(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x06C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x06D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x06E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0790(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x07A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x07A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0858(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0868(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0870(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0920(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0930(0x00B0)()
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x09E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x09F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character;        // 0x09F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x0A10(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_1;      // 0x0A20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0A29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2A[0x2];                                      // 0x0A2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x0A2C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0A3C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x0A44(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0A54(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x0A5C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6C[0x4];                                      // 0x0A6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x0A70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0A78(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_2;      // 0x0A88(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0A91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A92[0x6];                                      // 0x0A92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0A98(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0AA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0AA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_3; // 0x0AB0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB9[0x7];                                      // 0x0AB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_3;      // 0x0AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0AC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACA[0x2];                                      // 0x0ACA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0ACC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0AD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_4; // 0x0AE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0AE8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_4;      // 0x0AF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B01[0x3];                                      // 0x0B01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0B04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0B08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B09[0x3];                                      // 0x0B09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0B0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0B10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0B18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0B21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B22[0x2];                                      // 0x0B22(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0B30(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0B48(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_MontageFPP;                     // 0x0B60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_MontageTPP;                     // 0x0B68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlayRate;                       // 0x0B70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartingPosition;               // 0x0B74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StartingSection;                // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0B80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0B89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8A[0x6];                                      // 0x0B8A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_5; // 0x0B90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_5;      // 0x0B98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0BA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA2[0x6];                                      // 0x0BA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_6; // 0x0BA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_6;      // 0x0BB0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB9[0x3];                                      // 0x0BB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0BBC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC4[0x4];                                      // 0x0BC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_FailureReason;                        // 0x0BC8(0x0020)(ConstParm)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x0BE8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C01[0x7];                                      // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0C08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x7];                                      // 0x0C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontageFromCount_MontageOutputFPP;     // 0x0C18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontageFromCount_MontageOutputTPP;     // 0x0C20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_1;                         // 0x0C28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_2;                         // 0x0C30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_3;                         // 0x0C38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetChargedPlayRate_ReturnValue;           // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_7; // 0x0C48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0C58(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UEquipmentInstance*>             CallFunc_GetEquipmentInstancesOfType_ReturnValue;  // 0x0C60(0x0010)(ReferenceParm)
	class FName                                   Temp_name_Variable_2;                              // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_Array_Get_Item_4;                         // 0x0C78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0C80(0x0010)(ReferenceParm)
	struct FSpawnedActorData                      CallFunc_Array_Get_Item_5;                         // 0x0C90(0x0100)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0D90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0D94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0D95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D96[0x2];                                      // 0x0D96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0D98(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0DA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA4[0x4];                                      // 0x0DA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0DA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x3];                                      // 0x0DB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0DB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0DBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0DBD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Blocked;                              // 0x0DBE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DBF[0x1];                                      // 0x0DBF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_8; // 0x0DC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0DC8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0DD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0DD4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0DDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DDD[0x3];                                      // 0x0DDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Find_Count_Count;                         // 0x0DE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Find_Count_Count_1;                       // 0x0DE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_9; // 0x0DE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0DF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0DF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF9[0x3];                                      // 0x0DF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_25;           // 0x0DFC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0E0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E0D[0x3];                                      // 0x0E0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_6;                         // 0x0E18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0E20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0E28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E29[0x7];                                      // 0x0E29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageForMeshAndWaitForEvent*     CallFunc_PlayMontageForMeshAndWaitForEvent_ReturnValue; // 0x0E30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageForMeshAndWaitForEvent*     CallFunc_PlayMontageForMeshAndWaitForEvent_ReturnValue_1; // 0x0E38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0E40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0E41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E42[0x2];                                      // 0x0E42(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Event_PlayOneShotMontages_PlayRate_ImplicitCast; // 0x0E44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment) == 0x000010, "Wrong alignment on GA_Equipment_C_ExecuteUbergraph_GA_Equipment");
static_assert(sizeof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment) == 0x000E50, "Wrong size on GA_Equipment_C_ExecuteUbergraph_GA_Equipment");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, EntryPoint) == 0x000000, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_6) == 0x000014, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, Temp_name_Variable) == 0x00001C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_5) == 0x000034, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_4) == 0x00003C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_3) == 0x000054, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_2) == 0x00006C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_NotifyName_1) == 0x000084, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_5) == 0x00008C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, Temp_name_Variable_1) == 0x00009C, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A4, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_9) == 0x0000B4, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_9) == 0x0000C0, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_8) == 0x000170, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_8) == 0x000178, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_7) == 0x000228, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_7) == 0x000238, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_7) == 0x000240, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002F0, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_6) == 0x000300, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_6) == 0x000308, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003B8, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_5) == 0x0003C8, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_5) == 0x0003D0, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_10) == 0x000480, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, Temp_struct_Variable) == 0x000490, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, Temp_struct_Variable_1) == 0x000540, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_4) == 0x000548, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_4) == 0x000550, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_11) == 0x000600, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_3) == 0x000610, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_3) == 0x000618, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_12) == 0x0006C8, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_2) == 0x0006D8, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_2) == 0x0006E0, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_13) == 0x000790, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventTag_1) == 0x0007A0, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CustomEvent_EventData_1) == 0x0007A8, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_Equipment_C_ExecuteUbergraph_GA_Equipment, K2Node_CreateDelegate_OutputDelegate_14) == 0x000858, "Member 'GA_Equipment_C_ExecuteUbergraph_GA_Equipment::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
