#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Jump

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Jump.GA_Jump_C.ExecuteUbergraph_GA_Jump
// 0x0288 (0x0288 - 0x0000)
struct GA_Jump_C_ExecuteUbergraph_GA_Jump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ActionNumber_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionNumber;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_RepeatContinuous*          CallFunc_RepeatContinuousAction_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo_1;    // 0x0080(0x0028)(ConstParm)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x00A8(0x0028)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x00E0(0x0028)()
	struct FGameplayCueParameters                 Temp_struct_Variable_1;                            // 0x0108(0x00D8)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_4;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCost_ReturnValue;         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_FailureReason;                        // 0x0220(0x0020)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_StaminaCost_C>      K2Node_DynamicCast_AsI_Stamina_Cost;               // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character;        // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_ExecuteUbergraph_GA_Jump) == 0x000008, "Wrong alignment on GA_Jump_C_ExecuteUbergraph_GA_Jump");
static_assert(sizeof(GA_Jump_C_ExecuteUbergraph_GA_Jump) == 0x000288, "Wrong size on GA_Jump_C_ExecuteUbergraph_GA_Jump");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, EntryPoint) == 0x000000, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, Temp_real_Variable) == 0x000010, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x000028, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CustomEvent_ActionNumber_1) == 0x000034, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CustomEvent_ActionNumber_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CustomEvent_ActionNumber) == 0x000048, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CustomEvent_ActionNumber' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, Temp_int_Variable) == 0x00005C, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_RepeatContinuousAction_ReturnValue) == 0x000060, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_RepeatContinuousAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CustomEvent_GameplayEffectRemovalInfo_1) == 0x000080, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CustomEvent_GameplayEffectRemovalInfo_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x0000A8, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, Temp_struct_Variable) == 0x0000E0, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, Temp_struct_Variable_1) == 0x000108, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CustomEvent_TimeHeld) == 0x0001E0, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001E4, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_Event_bWasCancelled) == 0x0001E5, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0001E8, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_AsCharacter) == 0x0001F0, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001FC, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsValid_ReturnValue_3) == 0x000204, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_CreateDelegate_OutputDelegate_4) == 0x000208, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsFalling_ReturnValue) == 0x000218, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_K2_CommitAbilityCost_ReturnValue) == 0x000219, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_K2_CommitAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_Event_FailureReason) == 0x000220, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_Event_FailureReason' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000240, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_HasTag_ReturnValue) == 0x000248, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_AsI_Stamina_Cost) == 0x000250, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_AsI_Stamina_Cost' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_bSuccess_2) == 0x000260, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000268, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x000270, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_AsBP_Movement_Character) == 0x000278, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_AsBP_Movement_Character' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, K2Node_DynamicCast_bSuccess_3) == 0x000280, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ExecuteUbergraph_GA_Jump, CallFunc_IsValid_ReturnValue_4) == 0x000281, "Member 'GA_Jump_C_ExecuteUbergraph_GA_Jump::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC
// 0x0028 (0x0028 - 0x0000)
struct GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC) == 0x000008, "Wrong alignment on GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC");
static_assert(sizeof(GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC) == 0x000028, "Wrong size on GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC");
static_assert(offsetof(GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Jump_C_InvalidHandle_0876B68B48C1169D5C8AD0940CE60BAC::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.K2_OnAbilityFailed
// 0x0020 (0x0020 - 0x0000)
struct GA_Jump_C_K2_OnAbilityFailed final
{
public:
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Jump_C_K2_OnAbilityFailed) == 0x000008, "Wrong alignment on GA_Jump_C_K2_OnAbilityFailed");
static_assert(sizeof(GA_Jump_C_K2_OnAbilityFailed) == 0x000020, "Wrong size on GA_Jump_C_K2_OnAbilityFailed");
static_assert(offsetof(GA_Jump_C_K2_OnAbilityFailed, FailureReason) == 0x000000, "Member 'GA_Jump_C_K2_OnAbilityFailed::FailureReason' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Jump_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Jump_C_K2_OnEndAbility");
static_assert(sizeof(GA_Jump_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Jump_C_K2_OnEndAbility");
static_assert(offsetof(GA_Jump_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Jump_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.OnFinished_5375BC104575A2FD8B96DB8064DBB2ED
// 0x0004 (0x0004 - 0x0000)
struct GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED) == 0x000004, "Wrong alignment on GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED");
static_assert(sizeof(GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED) == 0x000004, "Wrong size on GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED");
static_assert(offsetof(GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED, ActionNumber) == 0x000000, "Member 'GA_Jump_C_OnFinished_5375BC104575A2FD8B96DB8064DBB2ED::ActionNumber' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED
// 0x0004 (0x0004 - 0x0000)
struct GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED) == 0x000004, "Wrong alignment on GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED");
static_assert(sizeof(GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED) == 0x000004, "Wrong size on GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED");
static_assert(offsetof(GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED, ActionNumber) == 0x000000, "Member 'GA_Jump_C_OnPerformAction_5375BC104575A2FD8B96DB8064DBB2ED::ActionNumber' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.OnRelease_B13E73C1477753C838499FBA4B115F16
// 0x0004 (0x0004 - 0x0000)
struct GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16) == 0x000004, "Wrong alignment on GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16");
static_assert(sizeof(GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16) == 0x000004, "Wrong size on GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16");
static_assert(offsetof(GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16, TimeHeld) == 0x000000, "Member 'GA_Jump_C_OnRelease_B13E73C1477753C838499FBA4B115F16::TimeHeld' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC
// 0x0028 (0x0028 - 0x0000)
struct GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC) == 0x000008, "Wrong alignment on GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC");
static_assert(sizeof(GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC) == 0x000028, "Wrong size on GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC");
static_assert(offsetof(GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Jump_C_OnRemoved_0876B68B48C1169D5C8AD0940CE60BAC::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Jump.GA_Jump_C.ToggleJumpOnCharacter
// 0x0020 (0x0020 - 0x0000)
struct GA_Jump_C_ToggleJumpOnCharacter final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Jump_C_ToggleJumpOnCharacter) == 0x000008, "Wrong alignment on GA_Jump_C_ToggleJumpOnCharacter");
static_assert(sizeof(GA_Jump_C_ToggleJumpOnCharacter) == 0x000020, "Wrong size on GA_Jump_C_ToggleJumpOnCharacter");
static_assert(offsetof(GA_Jump_C_ToggleJumpOnCharacter, Enabled) == 0x000000, "Member 'GA_Jump_C_ToggleJumpOnCharacter::Enabled' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ToggleJumpOnCharacter, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Jump_C_ToggleJumpOnCharacter::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ToggleJumpOnCharacter, K2Node_DynamicCast_AsBP_Movement_Character) == 0x000010, "Member 'GA_Jump_C_ToggleJumpOnCharacter::K2Node_DynamicCast_AsBP_Movement_Character' has a wrong offset!");
static_assert(offsetof(GA_Jump_C_ToggleJumpOnCharacter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Jump_C_ToggleJumpOnCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

