#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_OrangeCannonCharge

#include "Basic.hpp"

#include "GASIW_structs.hpp"
#include "S_ChargeBarStartGameplayMessage_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_ChargeBarEndGameplayMessage_structs.hpp"


namespace SDK::Params
{

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.Changed_EC5DC5A94F3C55A845B066AFADB8C513
// 0x0040 (0x0040 - 0x0000)
struct GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513) == 0x000008, "Wrong alignment on GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513");
static_assert(sizeof(GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513) == 0x000040, "Wrong size on GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513");
static_assert(offsetof(GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513, Attribute) == 0x000000, "Member 'GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513::Attribute' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513, NewValue) == 0x000038, "Member 'GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513::NewValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513, OldValue) == 0x00003C, "Member 'GA_OrangeCannonCharge_C_Changed_EC5DC5A94F3C55A845B066AFADB8C513::OldValue' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.ExecuteUbergraph_GA_OrangeCannonCharge
// 0x0130 (0x0130 - 0x0000)
struct GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0008(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0058(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ChargeBarEndGameplayMessage         K2Node_MakeStruct_S_ChargeBarEndGameplayMessage;   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFullChargeTime_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_TaskWaitDelay_TaskOwner_CastInput;        // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitDelay*                CallFunc_TaskWaitDelay_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ChargeBarStartGameplayMessage       K2Node_MakeStruct_S_ChargeBarStartGameplayMessage; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TaskWaitDelay_Time_ImplicitCast;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge) == 0x000008, "Wrong alignment on GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge");
static_assert(sizeof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge) == 0x000130, "Wrong size on GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, EntryPoint) == 0x000000, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_CustomEvent_Attribute) == 0x000008, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_CustomEvent_NewValue) == 0x000040, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_CustomEvent_OldValue) == 0x000044, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, Temp_real_Variable) == 0x000048, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, Temp_real_Variable_1) == 0x00004C, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, Temp_struct_Variable) == 0x000058, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsValid_ReturnValue_1) == 0x0000A4, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsValid_ReturnValue_2) == 0x0000A5, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_Event_bWasCancelled) == 0x0000A6, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000A7, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A8, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0000B8, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_MakeStruct_S_ChargeBarEndGameplayMessage) == 0x0000B9, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_MakeStruct_S_ChargeBarEndGameplayMessage' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000C8, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D8, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E0, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_GetFullChargeTime_ReturnValue) == 0x0000E8, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_GetFullChargeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_TaskWaitDelay_TaskOwner_CastInput) == 0x0000F0, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_TaskWaitDelay_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_TaskWaitDelay_ReturnValue) == 0x000100, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_TaskWaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, K2Node_MakeStruct_S_ChargeBarStartGameplayMessage) == 0x000108, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::K2Node_MakeStruct_S_ChargeBarStartGameplayMessage' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_IsValid_ReturnValue_4) == 0x000110, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000118, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge, CallFunc_TaskWaitDelay_Time_ImplicitCast) == 0x000128, "Member 'GA_OrangeCannonCharge_C_ExecuteUbergraph_GA_OrangeCannonCharge::CallFunc_TaskWaitDelay_Time_ImplicitCast' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.GetChargableEquipment
// 0x0020 (0x0020 - 0x0000)
struct GA_OrangeCannonCharge_C_GetChargableEquipment final
{
public:
	class UChargableEquipmentInstance_C*          AsChargable_Equipment_Instance;                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_GetAssociatedEquipment_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChargableEquipmentInstance_C*          K2Node_DynamicCast_AsChargable_Equipment_Instance; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_GetChargableEquipment) == 0x000008, "Wrong alignment on GA_OrangeCannonCharge_C_GetChargableEquipment");
static_assert(sizeof(GA_OrangeCannonCharge_C_GetChargableEquipment) == 0x000020, "Wrong size on GA_OrangeCannonCharge_C_GetChargableEquipment");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetChargableEquipment, AsChargable_Equipment_Instance) == 0x000000, "Member 'GA_OrangeCannonCharge_C_GetChargableEquipment::AsChargable_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetChargableEquipment, CallFunc_GetAssociatedEquipment_ReturnValue) == 0x000008, "Member 'GA_OrangeCannonCharge_C_GetChargableEquipment::CallFunc_GetAssociatedEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetChargableEquipment, K2Node_DynamicCast_AsChargable_Equipment_Instance) == 0x000010, "Member 'GA_OrangeCannonCharge_C_GetChargableEquipment::K2Node_DynamicCast_AsChargable_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetChargableEquipment, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_OrangeCannonCharge_C_GetChargableEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.GetFullChargeTime
// 0x0048 (0x0048 - 0x0000)
struct GA_OrangeCannonCharge_C_GetFullChargeTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetAssociatedItem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_2;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_GetFullChargeTime) == 0x000008, "Wrong alignment on GA_OrangeCannonCharge_C_GetFullChargeTime");
static_assert(sizeof(GA_OrangeCannonCharge_C_GetFullChargeTime) == 0x000048, "Wrong size on GA_OrangeCannonCharge_C_GetFullChargeTime");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, ReturnValue) == 0x000000, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_GetAssociatedItem_ReturnValue) == 0x000008, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_GetAssociatedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_GetTagStackCount_ReturnValue) == 0x000010, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000014, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_GetTagStackCount_ReturnValue_2) == 0x000028, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_GetTagStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000030, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_GetFullChargeTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'GA_OrangeCannonCharge_C_GetFullChargeTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_OrangeCannonCharge_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_OrangeCannonCharge_C_K2_OnEndAbility");
static_assert(sizeof(GA_OrangeCannonCharge_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_OrangeCannonCharge_C_K2_OnEndAbility");
static_assert(offsetof(GA_OrangeCannonCharge_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_OrangeCannonCharge_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.PlaySoundFromEquipable
// 0x0028 (0x0028 - 0x0000)
struct GA_OrangeCannonCharge_C_PlaySoundFromEquipable final
{
public:
	class USoundCue*                              Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Soundable_C>        K2Node_DynamicCast_AsI_Soundable;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable) == 0x000008, "Wrong alignment on GA_OrangeCannonCharge_C_PlaySoundFromEquipable");
static_assert(sizeof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable) == 0x000028, "Wrong size on GA_OrangeCannonCharge_C_PlaySoundFromEquipable");
static_assert(offsetof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable, Sound) == 0x000000, "Member 'GA_OrangeCannonCharge_C_PlaySoundFromEquipable::Sound' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GA_OrangeCannonCharge_C_PlaySoundFromEquipable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable, K2Node_DynamicCast_AsI_Soundable) == 0x000010, "Member 'GA_OrangeCannonCharge_C_PlaySoundFromEquipable::K2Node_DynamicCast_AsI_Soundable' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_PlaySoundFromEquipable, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_OrangeCannonCharge_C_PlaySoundFromEquipable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.SetEquipable
// 0x0130 (0x0130 - 0x0000)
struct GA_OrangeCannonCharge_C_SetEquipable final
{
public:
	class UEquipmentInstance*                     CallFunc_GetAssociatedEquipment_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_EquipmentInstance_C*                K2Node_DynamicCast_AsBP_Equipment_Instance;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0030(0x0100)(NoDestructor)
};
static_assert(alignof(GA_OrangeCannonCharge_C_SetEquipable) == 0x000010, "Wrong alignment on GA_OrangeCannonCharge_C_SetEquipable");
static_assert(sizeof(GA_OrangeCannonCharge_C_SetEquipable) == 0x000130, "Wrong size on GA_OrangeCannonCharge_C_SetEquipable");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetEquipable, CallFunc_GetAssociatedEquipment_ReturnValue) == 0x000000, "Member 'GA_OrangeCannonCharge_C_SetEquipable::CallFunc_GetAssociatedEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetEquipable, K2Node_DynamicCast_AsBP_Equipment_Instance) == 0x000008, "Member 'GA_OrangeCannonCharge_C_SetEquipable::K2Node_DynamicCast_AsBP_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetEquipable, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_OrangeCannonCharge_C_SetEquipable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetEquipable, CallFunc_GetSpawnedActors_ReturnValue) == 0x000018, "Member 'GA_OrangeCannonCharge_C_SetEquipable::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetEquipable, CallFunc_Array_Get_Item) == 0x000030, "Member 'GA_OrangeCannonCharge_C_SetEquipable::CallFunc_Array_Get_Item' has a wrong offset!");

// Function GA_OrangeCannonCharge.GA_OrangeCannonCharge_C.SetLastChargeTime
// 0x0160 (0x0160 - 0x0000)
struct GA_OrangeCannonCharge_C_SetLastChargeTime final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSafe_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     CallFunc_GetAssociatedEquipment_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0040(0x0100)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OrangeCannonEquipable_C*            K2Node_DynamicCast_AsBP_Orange_Cannon_Equipable;   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OrangeCannonCharge_C_SetLastChargeTime) == 0x000010, "Wrong alignment on GA_OrangeCannonCharge_C_SetLastChargeTime");
static_assert(sizeof(GA_OrangeCannonCharge_C_SetLastChargeTime) == 0x000160, "Wrong size on GA_OrangeCannonCharge_C_SetLastChargeTime");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetLastChargeTime, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_OrangeCannonCharge_C_SetLastChargeTime::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_OrangeCannonCharge_C_SetLastChargeTime, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_OrangeCannonCharge_C_SetLastChargeTime::Temp_int_Loop_Counter_Variable' has a wrong offset!");
