#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PickUpObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GASIW_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PickUpObject.GA_PickUpObject_C
// 0x0020 (0x0480 - 0x0460)
class UGA_PickUpObject_C final : public UGameplayAbilityIW
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitGameplayEffectRemoved* Async_Task;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityActivate*       Async_Task_Equip;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_PickUpObject(int32 EntryPoint);
	void InvalidHandle_DAD848B741E37648AC8B80A9CA4025F7(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnRemoved_DAD848B741E37648AC8B80A9CA4025F7(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void OnUnequippedItem_Event(class UEquipmentInstance* Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_PickUpObject_C">();
	}
	static class UGA_PickUpObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PickUpObject_C>();
	}
};
static_assert(alignof(UGA_PickUpObject_C) == 0x000010, "Wrong alignment on UGA_PickUpObject_C");
static_assert(sizeof(UGA_PickUpObject_C) == 0x000480, "Wrong size on UGA_PickUpObject_C");
static_assert(offsetof(UGA_PickUpObject_C, UberGraphFrame) == 0x000460, "Member 'UGA_PickUpObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_PickUpObject_C, Async_Task) == 0x000468, "Member 'UGA_PickUpObject_C::Async_Task' has a wrong offset!");
static_assert(offsetof(UGA_PickUpObject_C, Async_Task_Equip) == 0x000470, "Member 'UGA_PickUpObject_C::Async_Task_Equip' has a wrong offset!");

}

