#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlantEssentialBomba

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_PlantEssentialBomba.GA_PlantEssentialBomba_C.ExecuteUbergraph_GA_PlantEssentialBomba
// 0x0260 (0x0260 - 0x0000)
struct GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_EssentialBombaReceiver_C> K2Node_DynamicCast_AsI_Essential_Bomba_Receiver;   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetBombSpawnTransform_Return;             // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_EssentialBombaReceiver_C> K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_1; // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_EssentialBombaReceiver_C> K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_2; // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EssentialBomba_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveBombPlanted_Return;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba) == 0x000010, "Wrong alignment on GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba");
static_assert(sizeof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba) == 0x000260, "Wrong size on GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, EntryPoint) == 0x000000, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_Event_EventData) == 0x000008, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_K2_HasAuthority_ReturnValue) == 0x0000B8, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_AsI_Essential_Bomba_Receiver) == 0x0000C0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_AsI_Essential_Bomba_Receiver' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_AsTeamable_Interface) == 0x0000D8, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_GetBombSpawnTransform_Return) == 0x0000F0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_GetBombSpawnTransform_Return' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_GetTeamID_ReturnValue) == 0x000150, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_BreakTransform_Location) == 0x000158, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_BreakTransform_Rotation) == 0x000170, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_BreakTransform_Scale) == 0x000188, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_1) == 0x0001A0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_1' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000220, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_2) == 0x000228, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_AsI_Essential_Bomba_Receiver_2' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_bSuccess_3) == 0x000238, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_FinishSpawningActor_ReturnValue) == 0x000240, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_HasActiveBombPlanted_Return) == 0x000248, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_HasActiveBombPlanted_Return' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_AsPawn) == 0x000250, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, K2Node_DynamicCast_bSuccess_4) == 0x000258, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, CallFunc_K2_CommitAbility_ReturnValue) == 0x000259, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba, Temp_byte_Variable) == 0x00025A, "Member 'GA_PlantEssentialBomba_C_ExecuteUbergraph_GA_PlantEssentialBomba::Temp_byte_Variable' has a wrong offset!");

// Function GA_PlantEssentialBomba.GA_PlantEssentialBomba_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_PlantEssentialBomba_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

