#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ping

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Ping.GA_Ping_C.ExecuteUbergraph_GA_Ping
// 0x0050 (0x0050 - 0x0000)
struct GA_Ping_C_ExecuteUbergraph_GA_Ping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerJP_Match*              CallFunc_GetFirstPlayerControllerJP_Match_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPingControllerComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ping_C_ExecuteUbergraph_GA_Ping) == 0x000008, "Wrong alignment on GA_Ping_C_ExecuteUbergraph_GA_Ping");
static_assert(sizeof(GA_Ping_C_ExecuteUbergraph_GA_Ping) == 0x000050, "Wrong size on GA_Ping_C_ExecuteUbergraph_GA_Ping");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, EntryPoint) == 0x000000, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, Temp_real_Variable) == 0x000018, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_GetFirstPlayerControllerJP_Match_ReturnValue) == 0x000030, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_GetFirstPlayerControllerJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_K2_CommitAbility_ReturnValue) == 0x000038, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_ExecuteUbergraph_GA_Ping, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'GA_Ping_C_ExecuteUbergraph_GA_Ping::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_Ping.GA_Ping_C.Get Highlight Manager
// 0x0028 (0x0028 - 0x0000)
struct GA_Ping_C_Get_Highlight_Manager final
{
public:
	class ABP_HighlightManager_C*                 Manager;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HighlightManager_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class ABP_HighlightManager_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ping_C_Get_Highlight_Manager) == 0x000008, "Wrong alignment on GA_Ping_C_Get_Highlight_Manager");
static_assert(sizeof(GA_Ping_C_Get_Highlight_Manager) == 0x000028, "Wrong size on GA_Ping_C_Get_Highlight_Manager");
static_assert(offsetof(GA_Ping_C_Get_Highlight_Manager, Manager) == 0x000000, "Member 'GA_Ping_C_Get_Highlight_Manager::Manager' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_Get_Highlight_Manager, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GA_Ping_C_Get_Highlight_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_Get_Highlight_Manager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'GA_Ping_C_Get_Highlight_Manager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_Get_Highlight_Manager, CallFunc_Array_Get_Item) == 0x000020, "Member 'GA_Ping_C_Get_Highlight_Manager::CallFunc_Array_Get_Item' has a wrong offset!");

// Function GA_Ping.GA_Ping_C.OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB
// 0x0004 (0x0004 - 0x0000)
struct GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB) == 0x000004, "Wrong alignment on GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB");
static_assert(sizeof(GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB) == 0x000004, "Wrong size on GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB");
static_assert(offsetof(GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB, TimeHeld) == 0x000000, "Member 'GA_Ping_C_OnRelease_ACA2671F4016CD09C520CCA8F50FAFFB::TimeHeld' has a wrong offset!");

// Function GA_Ping.GA_Ping_C.TraceHit
// 0x02A0 (0x02A0 - 0x0000)
struct GA_Ping_C_TraceHit final
{
public:
	struct FHitResult                             Results;                                           // 0x0000(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          HitFound;                                          // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0100(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ping_C_TraceHit) == 0x000008, "Wrong alignment on GA_Ping_C_TraceHit");
static_assert(sizeof(GA_Ping_C_TraceHit) == 0x0002A0, "Wrong size on GA_Ping_C_TraceHit");
static_assert(offsetof(GA_Ping_C_TraceHit, Results) == 0x000000, "Member 'GA_Ping_C_TraceHit::Results' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, HitFound) == 0x0000F8, "Member 'GA_Ping_C_TraceHit::HitFound' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, Temp_object_Variable) == 0x000100, "Member 'GA_Ping_C_TraceHit::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000110, "Member 'GA_Ping_C_TraceHit::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000118, "Member 'GA_Ping_C_TraceHit::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000130, "Member 'GA_Ping_C_TraceHit::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'GA_Ping_C_TraceHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_GetForwardVector_ReturnValue) == 0x000140, "Member 'GA_Ping_C_TraceHit::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000158, "Member 'GA_Ping_C_TraceHit::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000170, "Member 'GA_Ping_C_TraceHit::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_Add_VectorVector_ReturnValue) == 0x000188, "Member 'GA_Ping_C_TraceHit::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_LineTraceSingle_OutHit) == 0x0001A0, "Member 'GA_Ping_C_TraceHit::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GA_Ping_C_TraceHit, CallFunc_LineTraceSingle_ReturnValue) == 0x000298, "Member 'GA_Ping_C_TraceHit::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

}

