#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameStateJP_MatchBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "S_PlayerSummary_structs.hpp"
#include "S_MatchSummary_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.Auth_Notify Players About Travel
// 0x0010 (0x0010 - 0x0000)
struct GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel");
static_assert(sizeof(GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel) == 0x000010, "Wrong size on GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel");
static_assert(offsetof(GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel, Message) == 0x000000, "Member 'GameStateJP_MatchBP_C_Auth_Notify_Players_About_Travel::Message' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.DisplayMessageToLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer final
{
public:
	class FName                                   Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer) == 0x000004, "Wrong alignment on GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer");
static_assert(sizeof(GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer) == 0x000008, "Wrong size on GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer");
static_assert(offsetof(GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer, Message) == 0x000000, "Member 'GameStateJP_MatchBP_C_DisplayMessageToLocalPlayer::Message' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.EndMatchBP
// 0x0010 (0x0010 - 0x0000)
struct GameStateJP_MatchBP_C_EndMatchBP final
{
public:
	uint8                                         WinningTeam;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCondition*                          EndCodition;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_EndMatchBP) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_EndMatchBP");
static_assert(sizeof(GameStateJP_MatchBP_C_EndMatchBP) == 0x000010, "Wrong size on GameStateJP_MatchBP_C_EndMatchBP");
static_assert(offsetof(GameStateJP_MatchBP_C_EndMatchBP, WinningTeam) == 0x000000, "Member 'GameStateJP_MatchBP_C_EndMatchBP::WinningTeam' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_EndMatchBP, EndCodition) == 0x000008, "Member 'GameStateJP_MatchBP_C_EndMatchBP::EndCodition' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.Enqueue Telemetry Summary
// 0x0238 (0x0238 - 0x0000)
struct GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1;     // 0x0020(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2;     // 0x0030(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTeam>                          CallFunc_GetTeams_ReturnValue;                     // 0x0048(0x0010)(ReferenceParm)
	class UAE_PlayerSummary_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  CallFunc_Array_Get_Item;                           // 0x0060(0x0038)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x00A8(0x0010)(ReferenceParm)
	class APlayerStateJP*                         CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAssists_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerJP_Match*              K2Node_DynamicCast_AsPlayer_Controller_JP_Match;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDeaths_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKills_ReturnValue;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerSummary                       K2Node_MakeStruct_S_PlayerSummary;                 // 0x00F8(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetWinningTeam_ReturnValue;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_TryGetFinalEndConditionName_ReturnValue;  // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_MatchSummary                        K2Node_MakeStruct_S_MatchSummary;                  // 0x01D0(0x0060)(HasGetValueTypeHash)
	class UAE_MatchSummary_C*                     CallFunc_SpawnObject_ReturnValue_1;                // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary");
static_assert(sizeof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary) == 0x000238, "Wrong size on GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1) == 0x000020, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2) == 0x000030, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetTeams_ReturnValue) == 0x000048, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_SpawnObject_ReturnValue) == 0x000058, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Array_Get_Item) == 0x000060, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00009C, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x0000A8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C5, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetPlayerController_ReturnValue) == 0x0000C8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetAssists_ReturnValue) == 0x0000D0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetAssists_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, K2Node_DynamicCast_AsPlayer_Controller_JP_Match) == 0x0000D8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::K2Node_DynamicCast_AsPlayer_Controller_JP_Match' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetDeaths_ReturnValue) == 0x0000E4, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetDeaths_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetKills_ReturnValue) == 0x0000E8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetKills_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000F0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, K2Node_MakeStruct_S_PlayerSummary) == 0x0000F8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::K2Node_MakeStruct_S_PlayerSummary' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_FTrunc_ReturnValue) == 0x0001A8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetWinningTeam_ReturnValue) == 0x0001AC, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetWinningTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_TryGetFinalEndConditionName_ReturnValue) == 0x0001B0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_TryGetFinalEndConditionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0001C0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_GetGameInstance_ReturnValue_1) == 0x0001C8, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, K2Node_MakeStruct_S_MatchSummary) == 0x0001D0, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::K2Node_MakeStruct_S_MatchSummary' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary, CallFunc_SpawnObject_ReturnValue_1) == 0x000230, "Member 'GameStateJP_MatchBP_C_Enqueue_Telemetry_Summary::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.ExecuteUbergraph_GameStateJP_MatchBP
// 0x0198 (0x0198 - 0x0000)
struct GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1;     // 0x0008(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2;     // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Message;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UExperienceWorldSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x00A0(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ResidentCharacter_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x00A8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_CustomEvent_Target;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00D8(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_MessageLayout_C*                    CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationWorldSubsystem*          CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WinScreenStage_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP");
static_assert(sizeof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP) == 0x000198, "Wrong size on GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, EntryPoint) == 0x000000, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1) == 0x000008, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2) == 0x000018, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetAllPlayerMasterIds_PlayerIdsTeam2' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, Temp_int_Array_Index_Variable) == 0x000030, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_HasAuthority_ReturnValue) == 0x000044, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000045, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000046, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_HasAuthority_ReturnValue_1) == 0x000060, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_HasAuthority_ReturnValue_2) == 0x000061, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_CustomEvent_Message) == 0x000068, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_Event_Message) == 0x000080, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Conv_NameToString_ReturnValue) == 0x000088, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000098, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, Temp_struct_Variable) == 0x0000A0, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000A8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, Temp_int_Array_Index_Variable_1) == 0x0000B8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_CustomEvent_Target) == 0x0000D0, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000D8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_HasAuthority_ReturnValue_3) == 0x000100, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000108, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000110, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000128, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetPlayerController_ReturnValue_2) == 0x000130, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_AddMappingContext_self_CastInput) == 0x000138, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_AddMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetActorOfClass_ReturnValue) == 0x000148, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000150, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, K2Node_Event_EndPlayReason) == 0x000168, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetPlayerController_ReturnValue_3) == 0x000170, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000178, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_IsValid_ReturnValue_1) == 0x000179, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000180, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP, CallFunc_Get_ClassLog_Name_name) == 0x000188, "Member 'GameStateJP_MatchBP_C_ExecuteUbergraph_GameStateJP_MatchBP::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.GetFirstEndCamera
// 0x0038 (0x0038 - 0x0000)
struct GameStateJP_MatchBP_C_GetFirstEndCamera final
{
public:
	class ABP_EndOfGameCamera_C*                  Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EndOfGameCamera_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_EndOfGameCamera_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_GetFirstEndCamera) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_GetFirstEndCamera");
static_assert(sizeof(GameStateJP_MatchBP_C_GetFirstEndCamera) == 0x000038, "Wrong size on GameStateJP_MatchBP_C_GetFirstEndCamera");
static_assert(offsetof(GameStateJP_MatchBP_C_GetFirstEndCamera, Output) == 0x000000, "Member 'GameStateJP_MatchBP_C_GetFirstEndCamera::Output' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_GetFirstEndCamera, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'GameStateJP_MatchBP_C_GetFirstEndCamera::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_GetFirstEndCamera, CallFunc_Get_ClassLog_Name_name) == 0x000018, "Member 'GameStateJP_MatchBP_C_GetFirstEndCamera::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_GetFirstEndCamera, CallFunc_Array_Get_Item) == 0x000028, "Member 'GameStateJP_MatchBP_C_GetFirstEndCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_GetFirstEndCamera, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GameStateJP_MatchBP_C_GetFirstEndCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.PlaceAllPlayerControllersAtEndCamera
// 0x0040 (0x0040 - 0x0000)
struct GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EndOfGameCamera_C*                  CallFunc_GetFirstEndCamera_Output;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerControllerJP_MatchBP_C*>  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerJP_MatchBP_C*          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera");
static_assert(sizeof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera) == 0x000040, "Wrong size on GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_GetFirstEndCamera_Output) == 0x000010, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_GetFirstEndCamera_Output' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_Array_Get_Item) == 0x000030, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'GameStateJP_MatchBP_C_PlaceAllPlayerControllersAtEndCamera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct GameStateJP_MatchBP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on GameStateJP_MatchBP_C_ReceiveEndPlay");
static_assert(sizeof(GameStateJP_MatchBP_C_ReceiveEndPlay) == 0x000001, "Wrong size on GameStateJP_MatchBP_C_ReceiveEndPlay");
static_assert(offsetof(GameStateJP_MatchBP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'GameStateJP_MatchBP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.RPCDestroyNameplateForAll
// 0x0008 (0x0008 - 0x0000)
struct GameStateJP_MatchBP_C_RPCDestroyNameplateForAll final
{
public:
	class ABP_ResidentCharacter_C*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_RPCDestroyNameplateForAll) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_RPCDestroyNameplateForAll");
static_assert(sizeof(GameStateJP_MatchBP_C_RPCDestroyNameplateForAll) == 0x000008, "Wrong size on GameStateJP_MatchBP_C_RPCDestroyNameplateForAll");
static_assert(offsetof(GameStateJP_MatchBP_C_RPCDestroyNameplateForAll, Target) == 0x000000, "Member 'GameStateJP_MatchBP_C_RPCDestroyNameplateForAll::Target' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.SetVoiceActorLocation
// 0x0150 (0x0150 - 0x0000)
struct GameStateJP_MatchBP_C_SetVoiceActorLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PlayerVoiceChatActorJP_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_SetVoiceActorLocation) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_SetVoiceActorLocation");
static_assert(sizeof(GameStateJP_MatchBP_C_SetVoiceActorLocation) == 0x000150, "Wrong size on GameStateJP_MatchBP_C_SetVoiceActorLocation");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, NewLocation) == 0x000000, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::NewLocation' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, Temp_int_Array_Index_Variable) == 0x000018, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_Array_Get_Item) == 0x000040, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000050, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_SetVoiceActorLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000148, "Member 'GameStateJP_MatchBP_C_SetVoiceActorLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.SetWinScreenAudio
// 0x0008 (0x0008 - 0x0000)
struct GameStateJP_MatchBP_C_SetWinScreenAudio final
{
public:
	class ABP_WinScreenStage_C*                   WinScreenStage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_SetWinScreenAudio) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_SetWinScreenAudio");
static_assert(sizeof(GameStateJP_MatchBP_C_SetWinScreenAudio) == 0x000008, "Wrong size on GameStateJP_MatchBP_C_SetWinScreenAudio");
static_assert(offsetof(GameStateJP_MatchBP_C_SetWinScreenAudio, WinScreenStage) == 0x000000, "Member 'GameStateJP_MatchBP_C_SetWinScreenAudio::WinScreenStage' has a wrong offset!");

// Function GameStateJP_MatchBP.GameStateJP_MatchBP_C.ShouldMatchEnd
// 0x0058 (0x0058 - 0x0000)
struct GameStateJP_MatchBP_C_ShouldMatchEnd final
{
public:
	bool                                          OneTeamAlive;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         WinningTeam;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetWinningTeam_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetAliveTeams_ReturnValue;                // 0x0008(0x0010)(ReferenceParm)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0018(0x0038)(ConstParm, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameStateJP_MatchBP_C_ShouldMatchEnd) == 0x000008, "Wrong alignment on GameStateJP_MatchBP_C_ShouldMatchEnd");
static_assert(sizeof(GameStateJP_MatchBP_C_ShouldMatchEnd) == 0x000058, "Wrong size on GameStateJP_MatchBP_C_ShouldMatchEnd");
static_assert(offsetof(GameStateJP_MatchBP_C_ShouldMatchEnd, OneTeamAlive) == 0x000000, "Member 'GameStateJP_MatchBP_C_ShouldMatchEnd::OneTeamAlive' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ShouldMatchEnd, WinningTeam) == 0x000001, "Member 'GameStateJP_MatchBP_C_ShouldMatchEnd::WinningTeam' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ShouldMatchEnd, CallFunc_GetWinningTeam_ReturnValue) == 0x000002, "Member 'GameStateJP_MatchBP_C_ShouldMatchEnd::CallFunc_GetWinningTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameStateJP_MatchBP_C_ShouldMatchEnd, CallFunc_GetAliveTeams_ReturnValue) == 0x000008, "Member 'GameStateJP_MatchBP_C_ShouldMatchEnd::CallFunc_GetAliveTeams_ReturnValue' has a wrong offset!");
