#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_PlungerGunCable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_PlungerGunCable.GCN_PlungerGunCable_C
// 0x0138 (0x07A0 - 0x0668)
class AGCN_PlungerGunCable_C final : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                ImpactPoint;                                       // 0x0670(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0688(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UObject*                                LeashAttachPoint;                                  // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalCue;                                          // 0x0770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlungerGun_Equipable_C*             AssociatedPlungerEquipable;                        // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NonActorAttachPoint;                               // 0x0780(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Target;                                         // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Cue();
	void DoPlungerThings();
	void ExecuteUbergraph_GCN_PlungerGunCable(int32 EntryPoint);
	void MakeMissEndLocation(struct FVector* Return, struct FRotator* Rotation);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	void PlaySoundAttached(class USoundBase* Sound, class UAudioComponent** AudioComponent);
	void Remove_Cue();
	bool ShouldAttach(const class UObject* HitActor_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_PlungerGunCable_C">();
	}
	static class AGCN_PlungerGunCable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_PlungerGunCable_C>();
	}
};
static_assert(alignof(AGCN_PlungerGunCable_C) == 0x000008, "Wrong alignment on AGCN_PlungerGunCable_C");
static_assert(sizeof(AGCN_PlungerGunCable_C) == 0x0007A0, "Wrong size on AGCN_PlungerGunCable_C");
static_assert(offsetof(AGCN_PlungerGunCable_C, UberGraphFrame) == 0x000668, "Member 'AGCN_PlungerGunCable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, ImpactPoint) == 0x000670, "Member 'AGCN_PlungerGunCable_C::ImpactPoint' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, Parameters) == 0x000688, "Member 'AGCN_PlungerGunCable_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, LeashAttachPoint) == 0x000760, "Member 'AGCN_PlungerGunCable_C::LeashAttachPoint' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, HitActor) == 0x000768, "Member 'AGCN_PlungerGunCable_C::HitActor' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, LocalCue) == 0x000770, "Member 'AGCN_PlungerGunCable_C::LocalCue' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, AssociatedPlungerEquipable) == 0x000778, "Member 'AGCN_PlungerGunCable_C::AssociatedPlungerEquipable' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, NonActorAttachPoint) == 0x000780, "Member 'AGCN_PlungerGunCable_C::NonActorAttachPoint' has a wrong offset!");
static_assert(offsetof(AGCN_PlungerGunCable_C, My_Target) == 0x000798, "Member 'AGCN_PlungerGunCable_C::My_Target' has a wrong offset!");

}

