#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_DeedSlowDown

#include "Basic.hpp"


namespace SDK::Params
{

// Function GCN_DeedSlowDown.GCN_DeedSlowDown_C.ExecuteUbergraph_GCN_DeedSlowDown
// 0x0050 (0x0050 - 0x0000)
struct GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_BuffDebuffMessage_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)(ConstParm)
	TArray<class UWI_BuffDebuffMessage_C*>        CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_BuffDebuffMessage_C*                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown) == 0x000008, "Wrong alignment on GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown");
static_assert(sizeof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown) == 0x000050, "Wrong size on GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, EntryPoint) == 0x000000, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_Create_ReturnValue) == 0x000008, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, Temp_int_Variable) == 0x000010, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, Temp_text_Variable) == 0x000020, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000030, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_Array_Get_Item) == 0x000040, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'GCN_DeedSlowDown_C_ExecuteUbergraph_GCN_DeedSlowDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

