#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_AbilityBurstBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_AbilityBurstBase.GCN_AbilityBurstBase_C
// 0x00E8 (0x0750 - 0x0668)
class AGCN_AbilityBurstBase_C : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0670(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 My_Target;                                         // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void All_Add();
	void All_Remove();
	void ExecuteUbergraph_GCN_AbilityBurstBase(int32 EntryPoint);
	void GetInstigatorFromParams(class AActor** Instigator_0);
	void Local_Add();
	void Local_Remove();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	void Other_Add();
	void Other_Remove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_AbilityBurstBase_C">();
	}
	static class AGCN_AbilityBurstBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_AbilityBurstBase_C>();
	}
};
static_assert(alignof(AGCN_AbilityBurstBase_C) == 0x000008, "Wrong alignment on AGCN_AbilityBurstBase_C");
static_assert(sizeof(AGCN_AbilityBurstBase_C) == 0x000750, "Wrong size on AGCN_AbilityBurstBase_C");
static_assert(offsetof(AGCN_AbilityBurstBase_C, UberGraphFrame) == 0x000668, "Member 'AGCN_AbilityBurstBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_AbilityBurstBase_C, Parameters) == 0x000670, "Member 'AGCN_AbilityBurstBase_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_AbilityBurstBase_C, My_Target) == 0x000748, "Member 'AGCN_AbilityBurstBase_C::My_Target' has a wrong offset!");

}

