#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_PassiveHealNotify

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_PassiveHealNotify.GCN_PassiveHealNotify_C.ExecuteUbergraph_GCN_PassiveHealNotify
// 0x02C8 (0x02C8 - 0x0000)
struct GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0148(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0220(0x0058)(ConstParm, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ScreenSplat_HealthRegenStart_C*     CallFunc_Create_ReturnValue;                       // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateRadius_Intensity_ImplicitCast;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify) == 0x000008, "Wrong alignment on GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify");
static_assert(sizeof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify) == 0x0002C8, "Wrong size on GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, EntryPoint) == 0x000000, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_Target_1) == 0x000008, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_SpawnResults_1) == 0x0000E8, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_Target) == 0x000140, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_Parameters) == 0x000148, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, K2Node_Event_SpawnResults) == 0x000220, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000278, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetPlayerPawn_ReturnValue) == 0x000280, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000288, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00028C, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000290, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000291, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000294, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000298, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_GetPlayerController_ReturnValue) == 0x0002A0, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_Create_ReturnValue) == 0x0002A8, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_UpdateRadius_Intensity_ImplicitCast) == 0x0002B0, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_UpdateRadius_Intensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0002B8, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002C0, "Member 'GCN_PassiveHealNotify_C_ExecuteUbergraph_GCN_PassiveHealNotify::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GCN_PassiveHealNotify.GCN_PassiveHealNotify_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_PassiveHealNotify_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_PassiveHealNotify_C_OnApplication) == 0x000008, "Wrong alignment on GCN_PassiveHealNotify_C_OnApplication");
static_assert(sizeof(GCN_PassiveHealNotify_C_OnApplication) == 0x000138, "Wrong size on GCN_PassiveHealNotify_C_OnApplication");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnApplication, Target) == 0x000000, "Member 'GCN_PassiveHealNotify_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_PassiveHealNotify_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_PassiveHealNotify_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_PassiveHealNotify.GCN_PassiveHealNotify_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_PassiveHealNotify_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_PassiveHealNotify_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_PassiveHealNotify_C_OnRemoval");
static_assert(sizeof(GCN_PassiveHealNotify_C_OnRemoval) == 0x000138, "Wrong size on GCN_PassiveHealNotify_C_OnRemoval");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnRemoval, Target) == 0x000000, "Member 'GCN_PassiveHealNotify_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_PassiveHealNotify_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_PassiveHealNotify_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_PassiveHealNotify_C_OnRemoval::SpawnResults' has a wrong offset!");

}

