#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Sprint_LineTrail

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Sprint_LineTrail.GCN_Sprint_LineTrail_C.ExecuteUbergraph_GCN_Sprint_LineTrail
// 0x02F0 (0x02F0 - 0x0000)
struct GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0028(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0160(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0238(0x0058)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail) == 0x000008, "Wrong alignment on GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail");
static_assert(sizeof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail) == 0x0002F0, "Wrong size on GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, EntryPoint) == 0x000000, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_Target_1) == 0x000020, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_Parameters_1) == 0x000028, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_Target) == 0x000158, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_Parameters) == 0x000160, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, K2Node_Event_SpawnResults) == 0x000238, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_GetVelocity_ReturnValue) == 0x000290, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_GetComponentByClass_ReturnValue) == 0x0002A8, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_VSize_ReturnValue) == 0x0002B0, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0002B8, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_MapRangeClamped_ReturnValue) == 0x0002C0, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_SetFloatParameter_self_CastInput) == 0x0002C8, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0002D8, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0002E0, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x0002E8, "Member 'GCN_Sprint_LineTrail_C_ExecuteUbergraph_GCN_Sprint_LineTrail::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");

// Function GCN_Sprint_LineTrail.GCN_Sprint_LineTrail_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_Sprint_LineTrail_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Sprint_LineTrail_C_OnApplication) == 0x000008, "Wrong alignment on GCN_Sprint_LineTrail_C_OnApplication");
static_assert(sizeof(GCN_Sprint_LineTrail_C_OnApplication) == 0x000138, "Wrong size on GCN_Sprint_LineTrail_C_OnApplication");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnApplication, Target) == 0x000000, "Member 'GCN_Sprint_LineTrail_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_Sprint_LineTrail_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_Sprint_LineTrail_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_Sprint_LineTrail.GCN_Sprint_LineTrail_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_Sprint_LineTrail_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Sprint_LineTrail_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Sprint_LineTrail_C_OnRemoval");
static_assert(sizeof(GCN_Sprint_LineTrail_C_OnRemoval) == 0x000138, "Wrong size on GCN_Sprint_LineTrail_C_OnRemoval");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnRemoval, Target) == 0x000000, "Member 'GCN_Sprint_LineTrail_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Sprint_LineTrail_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Sprint_LineTrail_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_Sprint_LineTrail_C_OnRemoval::SpawnResults' has a wrong offset!");

}

