#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_FanOfNeedlesFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GCN_AbilityBurstBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_FanOfNeedlesFire.GCN_FanOfNeedlesFire_C
// 0x0038 (0x0788 - 0x0750)
class AGCN_FanOfNeedlesFire_C final : public AGCN_AbilityBurstBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GCN_FanOfNeedlesFire_C;             // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       OwningCameraComponent;                             // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Firing_Directions;                                 // 0x0760(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        SpreadInDegrees;                                   // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProjectileAmount;                                  // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        YawDev;                                            // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void All_Add();
	void ExecuteUbergraph_GCN_FanOfNeedlesFire(int32 EntryPoint);
	void Fire_Cosmetic_Needle();
	void PlaySmokeBomb();
	void SetStealth(bool StealthActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_FanOfNeedlesFire_C">();
	}
	static class AGCN_FanOfNeedlesFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_FanOfNeedlesFire_C>();
	}
};
static_assert(alignof(AGCN_FanOfNeedlesFire_C) == 0x000008, "Wrong alignment on AGCN_FanOfNeedlesFire_C");
static_assert(sizeof(AGCN_FanOfNeedlesFire_C) == 0x000788, "Wrong size on AGCN_FanOfNeedlesFire_C");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, UberGraphFrame_GCN_FanOfNeedlesFire_C) == 0x000750, "Member 'AGCN_FanOfNeedlesFire_C::UberGraphFrame_GCN_FanOfNeedlesFire_C' has a wrong offset!");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, OwningCameraComponent) == 0x000758, "Member 'AGCN_FanOfNeedlesFire_C::OwningCameraComponent' has a wrong offset!");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, Firing_Directions) == 0x000760, "Member 'AGCN_FanOfNeedlesFire_C::Firing_Directions' has a wrong offset!");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, SpreadInDegrees) == 0x000770, "Member 'AGCN_FanOfNeedlesFire_C::SpreadInDegrees' has a wrong offset!");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, ProjectileAmount) == 0x000778, "Member 'AGCN_FanOfNeedlesFire_C::ProjectileAmount' has a wrong offset!");
static_assert(offsetof(AGCN_FanOfNeedlesFire_C, YawDev) == 0x000780, "Member 'AGCN_FanOfNeedlesFire_C::YawDev' has a wrong offset!");

}

