#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Jump.GCN_Jump_C
// 0x0020 (0x0EB8 - 0x0E98)
class AGCN_Jump_C : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACharacter*                             OwningCharacter;                                   // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LandSound;                                         // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FHitResult& Hit);
	void ExecuteUbergraph_GCN_Jump(int32 EntryPoint);
	void Jump();
	void Land(const struct FHitResult& HitResult);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427(const struct FGameplayTag& EffectGameplayTag, const struct FActiveGameplayEffectHandle& Handle, int32 NewStackCount, int32 OldStackCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Jump_C">();
	}
	static class AGCN_Jump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Jump_C>();
	}
};
static_assert(alignof(AGCN_Jump_C) == 0x000008, "Wrong alignment on AGCN_Jump_C");
static_assert(sizeof(AGCN_Jump_C) == 0x000EB8, "Wrong size on AGCN_Jump_C");
static_assert(offsetof(AGCN_Jump_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_Jump_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Jump_C, OwningCharacter) == 0x000EA0, "Member 'AGCN_Jump_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(AGCN_Jump_C, AudioComponent) == 0x000EA8, "Member 'AGCN_Jump_C::AudioComponent' has a wrong offset!");
static_assert(offsetof(AGCN_Jump_C, LandSound) == 0x000EB0, "Member 'AGCN_Jump_C::LandSound' has a wrong offset!");

}

