#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_BashCharge

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_BashCharge.GCN_BashCharge_C.ExecuteUbergraph_GCN_BashCharge
// 0x0378 (0x0378 - 0x0000)
struct GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0028(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0160(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0238(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0298(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x02C0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x02E0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge) == 0x000008, "Wrong alignment on GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge");
static_assert(sizeof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge) == 0x000378, "Wrong size on GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, EntryPoint) == 0x000000, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_Target_1) == 0x000020, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_Parameters_1) == 0x000028, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_Target) == 0x000158, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_Parameters) == 0x000160, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_SpawnResults) == 0x000238, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000290, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000294, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000298, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0002B0, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0002B8, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0002C0, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0002E0, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_Location) == 0x000300, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_Normal) == 0x000318, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000330, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000338, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000340, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000348, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000350, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000354, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000358, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000360, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000368, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_DynamicCast_bSuccess) == 0x000370, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge, K2Node_Event_DeltaSeconds) == 0x000374, "Member 'GCN_BashCharge_C_ExecuteUbergraph_GCN_BashCharge::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_BashCharge_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BashCharge_C_OnApplication) == 0x000008, "Wrong alignment on GCN_BashCharge_C_OnApplication");
static_assert(sizeof(GCN_BashCharge_C_OnApplication) == 0x000138, "Wrong size on GCN_BashCharge_C_OnApplication");
static_assert(offsetof(GCN_BashCharge_C_OnApplication, Target) == 0x000000, "Member 'GCN_BashCharge_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_BashCharge_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_BashCharge_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_BashCharge_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BashCharge_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_BashCharge_C_OnRemoval");
static_assert(sizeof(GCN_BashCharge_C_OnRemoval) == 0x000138, "Wrong size on GCN_BashCharge_C_OnRemoval");
static_assert(offsetof(GCN_BashCharge_C_OnRemoval, Target) == 0x000000, "Member 'GCN_BashCharge_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_BashCharge_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_BashCharge_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.PlayChargeSound
// 0x0038 (0x0038 - 0x0000)
struct GCN_BashCharge_C_PlayChargeSound final
{
public:
	TScriptInterface<class II_Soundable_C>        K2Node_DynamicCast_AsI_Soundable;                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioComponent*>                CallFunc_GetAudioComponent_AudioComponents;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BashCharge_C_PlayChargeSound) == 0x000008, "Wrong alignment on GCN_BashCharge_C_PlayChargeSound");
static_assert(sizeof(GCN_BashCharge_C_PlayChargeSound) == 0x000038, "Wrong size on GCN_BashCharge_C_PlayChargeSound");
static_assert(offsetof(GCN_BashCharge_C_PlayChargeSound, K2Node_DynamicCast_AsI_Soundable) == 0x000000, "Member 'GCN_BashCharge_C_PlayChargeSound::K2Node_DynamicCast_AsI_Soundable' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_PlayChargeSound, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GCN_BashCharge_C_PlayChargeSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_PlayChargeSound, CallFunc_GetAudioComponent_AudioComponents) == 0x000018, "Member 'GCN_BashCharge_C_PlayChargeSound::CallFunc_GetAudioComponent_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_PlayChargeSound, CallFunc_Array_Get_Item) == 0x000028, "Member 'GCN_BashCharge_C_PlayChargeSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_PlayChargeSound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000030, "Member 'GCN_BashCharge_C_PlayChargeSound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_BashCharge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BashCharge_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_BashCharge_C_ReceiveTick");
static_assert(sizeof(GCN_BashCharge_C_ReceiveTick) == 0x000004, "Wrong size on GCN_BashCharge_C_ReceiveTick");
static_assert(offsetof(GCN_BashCharge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_BashCharge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.SetStartFOV
// 0x0008 (0x0008 - 0x0000)
struct GCN_BashCharge_C_SetStartFOV final
{
public:
	double                                        K2Node_VariableSet_StartFOV_ImplicitCast;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BashCharge_C_SetStartFOV) == 0x000008, "Wrong alignment on GCN_BashCharge_C_SetStartFOV");
static_assert(sizeof(GCN_BashCharge_C_SetStartFOV) == 0x000008, "Wrong size on GCN_BashCharge_C_SetStartFOV");
static_assert(offsetof(GCN_BashCharge_C_SetStartFOV, K2Node_VariableSet_StartFOV_ImplicitCast) == 0x000000, "Member 'GCN_BashCharge_C_SetStartFOV::K2Node_VariableSet_StartFOV_ImplicitCast' has a wrong offset!");

// Function GCN_BashCharge.GCN_BashCharge_C.UpdateZoomEffect
// 0x0038 (0x0038 - 0x0000)
struct GCN_BashCharge_C_UpdateZoomEffect final
{
public:
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BashCharge_C_UpdateZoomEffect) == 0x000008, "Wrong alignment on GCN_BashCharge_C_UpdateZoomEffect");
static_assert(sizeof(GCN_BashCharge_C_UpdateZoomEffect) == 0x000038, "Wrong size on GCN_BashCharge_C_UpdateZoomEffect");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000000, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_BashCharge_C_UpdateZoomEffect, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x000030, "Member 'GCN_BashCharge_C_UpdateZoomEffect::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");

}

