#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_FuryRush_Charge

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_SpecialAbility_FuryRush_Charge.GCN_SpecialAbility_FuryRush_Charge_C.All_Execute
// 0x0008 (0x0008 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Charge_C_All_Execute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Charge_C_All_Execute) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Charge_C_All_Execute");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Charge_C_All_Execute) == 0x000008, "Wrong size on GCN_SpecialAbility_FuryRush_Charge_C_All_Execute");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_All_Execute, MyTarget) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_All_Execute::MyTarget' has a wrong offset!");

// Function GCN_SpecialAbility_FuryRush_Charge.GCN_SpecialAbility_FuryRush_Charge_C.ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge
// 0x0048 (0x0048 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Progressbar_SpecialAbility_C*       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ChargeTime_C>       K2Node_DynamicCast_AsI_Charge_Time;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_MyTarget;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge) == 0x000048, "Wrong size on GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, EntryPoint) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, CallFunc_Create_ReturnValue) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, K2Node_DynamicCast_AsI_Charge_Time) == 0x000010, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::K2Node_DynamicCast_AsI_Charge_Time' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, K2Node_CustomEvent_MyTarget) == 0x000028, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::K2Node_CustomEvent_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000038, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000040, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GCN_SpecialAbility_FuryRush_Charge.GCN_SpecialAbility_FuryRush_Charge_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Charge_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Charge_C_OnActive");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive) == 0x0000F8, "Wrong size on GCN_SpecialAbility_FuryRush_Charge_C_OnActive");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, MyTarget) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, Parameters) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000E1, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnActive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnActive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GCN_SpecialAbility_FuryRush_Charge.GCN_SpecialAbility_FuryRush_Charge_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Charge_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Charge_C_OnRemove) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Charge_C_OnRemove");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Charge_C_OnRemove) == 0x0000E8, "Wrong size on GCN_SpecialAbility_FuryRush_Charge_C_OnRemove");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnRemove, MyTarget) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnRemove, Parameters) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Charge_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCN_SpecialAbility_FuryRush_Charge_C_OnRemove::ReturnValue' has a wrong offset!");

}

