#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SlingshotCharge

#include "Basic.hpp"

#include "GASIW_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_SlingshotCharge.GCN_SlingshotCharge_C.ExecuteUbergraph_GCN_SlingshotCharge
// 0x0260 (0x0260 - 0x0000)
struct GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0028(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0160(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0188(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01A8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChargableEquipmentInstance_C*          K2Node_DynamicCast_AsChargable_Equipment_Instance; // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateZoomEffect_Time_ImplicitCast;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_StartFOV_ImplicitCast;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge) == 0x000008, "Wrong alignment on GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge");
static_assert(sizeof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge) == 0x000260, "Wrong size on GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, EntryPoint) == 0x000000, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_Event_Target) == 0x000020, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_Event_Parameters) == 0x000028, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_Event_SpawnResults) == 0x000100, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000158, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00015C, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000160, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000178, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000180, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000188, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001A8, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_Location) == 0x0001C8, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001E0, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001F8, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000200, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000208, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000210, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000218, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00021C, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000220, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000228, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000230, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_DynamicCast_AsChargable_Equipment_Instance) == 0x000240, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_DynamicCast_AsChargable_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, CallFunc_UpdateZoomEffect_Time_ImplicitCast) == 0x000250, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::CallFunc_UpdateZoomEffect_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge, K2Node_VariableSet_StartFOV_ImplicitCast) == 0x000258, "Member 'GCN_SlingshotCharge_C_ExecuteUbergraph_GCN_SlingshotCharge::K2Node_VariableSet_StartFOV_ImplicitCast' has a wrong offset!");

// Function GCN_SlingshotCharge.GCN_SlingshotCharge_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_SlingshotCharge_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_SlingshotCharge_C_OnApplication) == 0x000008, "Wrong alignment on GCN_SlingshotCharge_C_OnApplication");
static_assert(sizeof(GCN_SlingshotCharge_C_OnApplication) == 0x000138, "Wrong size on GCN_SlingshotCharge_C_OnApplication");
static_assert(offsetof(GCN_SlingshotCharge_C_OnApplication, Target) == 0x000000, "Member 'GCN_SlingshotCharge_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_SlingshotCharge_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_SlingshotCharge_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_SlingshotCharge.GCN_SlingshotCharge_C.PlayChargeSound
// 0x0140 (0x0140 - 0x0000)
struct GCN_SlingshotCharge_C_PlayChargeSound final
{
public:
	class UEquipmentInstance*                     EquipmentInstance;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0020(0x0100)(NoDestructor)
	TScriptInterface<class II_Soundable_C>        K2Node_DynamicCast_AsI_Soundable;                  // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SlingshotCharge_C_PlayChargeSound) == 0x000010, "Wrong alignment on GCN_SlingshotCharge_C_PlayChargeSound");
static_assert(sizeof(GCN_SlingshotCharge_C_PlayChargeSound) == 0x000140, "Wrong size on GCN_SlingshotCharge_C_PlayChargeSound");
static_assert(offsetof(GCN_SlingshotCharge_C_PlayChargeSound, EquipmentInstance) == 0x000000, "Member 'GCN_SlingshotCharge_C_PlayChargeSound::EquipmentInstance' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_PlayChargeSound, CallFunc_GetSpawnedActors_ReturnValue) == 0x000008, "Member 'GCN_SlingshotCharge_C_PlayChargeSound::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_PlayChargeSound, CallFunc_Array_Get_Item) == 0x000020, "Member 'GCN_SlingshotCharge_C_PlayChargeSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_PlayChargeSound, K2Node_DynamicCast_AsI_Soundable) == 0x000120, "Member 'GCN_SlingshotCharge_C_PlayChargeSound::K2Node_DynamicCast_AsI_Soundable' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_PlayChargeSound, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GCN_SlingshotCharge_C_PlayChargeSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GCN_SlingshotCharge.GCN_SlingshotCharge_C.UpdateZoomEffect
// 0x0018 (0x0018 - 0x0000)
struct GCN_SlingshotCharge_C_UpdateZoomEffect final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SlingshotCharge_C_UpdateZoomEffect) == 0x000008, "Wrong alignment on GCN_SlingshotCharge_C_UpdateZoomEffect");
static_assert(sizeof(GCN_SlingshotCharge_C_UpdateZoomEffect) == 0x000018, "Wrong size on GCN_SlingshotCharge_C_UpdateZoomEffect");
static_assert(offsetof(GCN_SlingshotCharge_C_UpdateZoomEffect, Time) == 0x000000, "Member 'GCN_SlingshotCharge_C_UpdateZoomEffect::Time' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_UpdateZoomEffect, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'GCN_SlingshotCharge_C_UpdateZoomEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SlingshotCharge_C_UpdateZoomEffect, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x000010, "Member 'GCN_SlingshotCharge_C_UpdateZoomEffect::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");

}

