#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_BashCharge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_BashCharge.GCN_BashCharge_C
// 0x00D8 (0x0F70 - 0x0E98)
class AGCN_BashCharge_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ResidentCharacter_C*                As_BP_Resident_Character;                          // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaxZoom;                                           // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartFOV;                                          // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRun;                                         // 0x0EB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB9[0x7];                                      // 0x0EB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedActor;                                      // 0x0EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InterpolatedValue;                                 // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0ED0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           HackTimer;                                         // 0x0F58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeSpeedMultiplier;                             // 0x0F60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F64[0x4];                                      // 0x0F64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ChargeSound;                                       // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_BashCharge(int32 EntryPoint);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void PlayChargeSound();
	void ReceiveTick(float DeltaSeconds);
	void SetStartFOV();
	void Timer_Elapsed();
	void UpdateZoomEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_BashCharge_C">();
	}
	static class AGCN_BashCharge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_BashCharge_C>();
	}
};
static_assert(alignof(AGCN_BashCharge_C) == 0x000008, "Wrong alignment on AGCN_BashCharge_C");
static_assert(sizeof(AGCN_BashCharge_C) == 0x000F70, "Wrong size on AGCN_BashCharge_C");
static_assert(offsetof(AGCN_BashCharge_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_BashCharge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, As_BP_Resident_Character) == 0x000EA0, "Member 'AGCN_BashCharge_C::As_BP_Resident_Character' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, MaxZoom) == 0x000EA8, "Member 'AGCN_BashCharge_C::MaxZoom' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, StartFOV) == 0x000EB0, "Member 'AGCN_BashCharge_C::StartFOV' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, ShouldRun) == 0x000EB8, "Member 'AGCN_BashCharge_C::ShouldRun' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, SpawnedActor) == 0x000EC0, "Member 'AGCN_BashCharge_C::SpawnedActor' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, InterpolatedValue) == 0x000EC8, "Member 'AGCN_BashCharge_C::InterpolatedValue' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, Curve) == 0x000ED0, "Member 'AGCN_BashCharge_C::Curve' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, HackTimer) == 0x000F58, "Member 'AGCN_BashCharge_C::HackTimer' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, ChargeSpeedMultiplier) == 0x000F60, "Member 'AGCN_BashCharge_C::ChargeSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(AGCN_BashCharge_C, ChargeSound) == 0x000F68, "Member 'AGCN_BashCharge_C::ChargeSound' has a wrong offset!");

}

