#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_BarbedWireShake

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.ExecuteUbergraph_GCN_BarbedWireShake
// 0x0718 (0x0718 - 0x0000)
struct GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_3;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_4;                         // 0x0038(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_3;                       // 0x0110(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_3;                         // 0x0170(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_2;                       // 0x0248(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x02A8(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x0380(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x03E0(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x04B8(0x0058)(ConstParm, ContainsInstancedReference)
	class UMeshBounceComponent_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0510(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0530(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0550(0x00D8)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0658(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0660(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake");
static_assert(sizeof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake) == 0x000718, "Wrong size on GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, EntryPoint) == 0x000000, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Target_3) == 0x000030, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Target_3' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Parameters_4) == 0x000038, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Parameters_4' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_SpawnResults_3) == 0x000110, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_SpawnResults_3' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Target_2) == 0x000168, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Parameters_3) == 0x000170, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Parameters_3' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_SpawnResults_2) == 0x000248, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Target_1) == 0x0002A0, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Parameters_2) == 0x0002A8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_SpawnResults_1) == 0x000380, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Target) == 0x0003D8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Parameters_1) == 0x0003E0, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_SpawnResults) == 0x0004B8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_GetComponentByClass_ReturnValue) == 0x000510, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000518, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000530, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_MyTarget) == 0x000540, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_EventType) == 0x000548, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, K2Node_Event_Parameters) == 0x000550, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Array_Length_ReturnValue) == 0x000628, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, Temp_int_Loop_Counter_Variable_1) == 0x00062C, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Less_IntInt_ReturnValue) == 0x000630, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Add_IntInt_ReturnValue_1) == 0x000634, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_MapRangeClamped_ReturnValue) == 0x000638, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, Temp_int_Array_Index_Variable_1) == 0x000640, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_SetFloatParameter_self_CastInput) == 0x000648, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Array_Get_Item) == 0x000658, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000660, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Array_Get_Item_1) == 0x000670, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Array_Length_ReturnValue_1) == 0x000678, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_GetVelocity_ReturnValue) == 0x000680, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Less_IntInt_ReturnValue_1) == 0x000698, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_VSize_ReturnValue) == 0x0006A0, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0006A8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0006B0, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0006C8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Normal_ReturnValue) == 0x0006E0, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0006F8, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000710, "Member 'GCN_BarbedWireShake_C_ExecuteUbergraph_GCN_BarbedWireShake::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_BarbedWireShake_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BarbedWireShake_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_K2_HandleGameplayCue");
static_assert(sizeof(GCN_BarbedWireShake_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCN_BarbedWireShake_C_K2_HandleGameplayCue");
static_assert(offsetof(GCN_BarbedWireShake_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCN_BarbedWireShake_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCN_BarbedWireShake_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCN_BarbedWireShake_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_BarbedWireShake_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BarbedWireShake_C_OnApplication) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_OnApplication");
static_assert(sizeof(GCN_BarbedWireShake_C_OnApplication) == 0x000138, "Wrong size on GCN_BarbedWireShake_C_OnApplication");
static_assert(offsetof(GCN_BarbedWireShake_C_OnApplication, Target) == 0x000000, "Member 'GCN_BarbedWireShake_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_BarbedWireShake_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_BarbedWireShake_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.OnLoopingStart
// 0x0138 (0x0138 - 0x0000)
struct GCN_BarbedWireShake_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BarbedWireShake_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_OnLoopingStart");
static_assert(sizeof(GCN_BarbedWireShake_C_OnLoopingStart) == 0x000138, "Wrong size on GCN_BarbedWireShake_C_OnLoopingStart");
static_assert(offsetof(GCN_BarbedWireShake_C_OnLoopingStart, Target) == 0x000000, "Member 'GCN_BarbedWireShake_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCN_BarbedWireShake_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnLoopingStart, SpawnResults) == 0x0000E0, "Member 'GCN_BarbedWireShake_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.OnRecurring
// 0x0138 (0x0138 - 0x0000)
struct GCN_BarbedWireShake_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BarbedWireShake_C_OnRecurring) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_OnRecurring");
static_assert(sizeof(GCN_BarbedWireShake_C_OnRecurring) == 0x000138, "Wrong size on GCN_BarbedWireShake_C_OnRecurring");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRecurring, Target) == 0x000000, "Member 'GCN_BarbedWireShake_C_OnRecurring::Target' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRecurring, Parameters) == 0x000008, "Member 'GCN_BarbedWireShake_C_OnRecurring::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRecurring, SpawnResults) == 0x0000E0, "Member 'GCN_BarbedWireShake_C_OnRecurring::SpawnResults' has a wrong offset!");

// Function GCN_BarbedWireShake.GCN_BarbedWireShake_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_BarbedWireShake_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_BarbedWireShake_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_BarbedWireShake_C_OnRemoval");
static_assert(sizeof(GCN_BarbedWireShake_C_OnRemoval) == 0x000138, "Wrong size on GCN_BarbedWireShake_C_OnRemoval");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRemoval, Target) == 0x000000, "Member 'GCN_BarbedWireShake_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_BarbedWireShake_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BarbedWireShake_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_BarbedWireShake_C_OnRemoval::SpawnResults' has a wrong offset!");

}

