#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_SuctionPump_Charge

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_SpecialAbility_SuctionPump_Charge.GCN_SpecialAbility_SuctionPump_Charge_C.ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge
// 0x0270 (0x0270 - 0x0000)
struct GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0010(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0038(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0058(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_MuzzleComponent_C>  K2Node_DynamicCast_AsI_Muzzle_Component;           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetMuzzleSceneComponent_Return;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x0128(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x0150(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x0170(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_TraceFrom_C>        K2Node_DynamicCast_AsI_Trace_From;                 // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTraceFrom_Location;                    // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTraceFrom_Rotation;                    // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge) == 0x000008, "Wrong alignment on GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge");
static_assert(sizeof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge) == 0x000270, "Wrong size on GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, EntryPoint) == 0x000000, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000004, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000008, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000010, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000028, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000030, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000038, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000058, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Location) == 0x000078, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Normal) == 0x000090, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0000A8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0000B0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0000B8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0000C0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0000C8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0000CC, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0000D0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0000D8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_AsI_Muzzle_Component) == 0x0000E0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_AsI_Muzzle_Component' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_GetMuzzleSceneComponent_Return) == 0x0000F8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_GetMuzzleSceneComponent_Return' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000100, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000118, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x000120, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x000124, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x000128, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x000140, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x000148, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x000150, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x000170, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Location_1) == 0x000190, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x0001A8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x0001C0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x0001C8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x0001D0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x0001D8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x0001E0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x0001E4, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x0001E8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1) == 0x0001F0, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_AsCharacter) == 0x0001F8, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_GetController_ReturnValue) == 0x000208, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_AsI_Trace_From) == 0x000210, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_AsI_Trace_From' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_bSuccess_2) == 0x000220, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_AsPlayer_Controller) == 0x000228, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, K2Node_DynamicCast_bSuccess_3) == 0x000230, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_GetTraceFrom_Location) == 0x000238, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_GetTraceFrom_Location' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_GetTraceFrom_Rotation) == 0x000250, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_GetTraceFrom_Rotation' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge, CallFunc_StartCameraShake_ReturnValue) == 0x000268, "Member 'GCN_SpecialAbility_SuctionPump_Charge_C_ExecuteUbergraph_GCN_SpecialAbility_SuctionPump_Charge::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");

}

