#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_PassiveHealNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_PassiveHealNotify.GCN_PassiveHealNotify_C
// 0x0020 (0x0EB8 - 0x0E98)
class AGCN_PassiveHealNotify_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RadiusHeal_NewTrack_0_C0BD418C4FED38F8BEE4BEBB5B4C52FD; // 0x0EA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RadiusHeal__Direction_C0BD418C4FED38F8BEE4BEBB5B4C52FD; // 0x0EA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA5[0x3];                                      // 0x0EA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RadiusHeal;                                        // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ScreenSplat_HealthRegenStart_C*     Widget;                                            // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_PassiveHealNotify(int32 EntryPoint);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void RadiusHeal__FinishedFunc();
	void RadiusHeal__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_PassiveHealNotify_C">();
	}
	static class AGCN_PassiveHealNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_PassiveHealNotify_C>();
	}
};
static_assert(alignof(AGCN_PassiveHealNotify_C) == 0x000008, "Wrong alignment on AGCN_PassiveHealNotify_C");
static_assert(sizeof(AGCN_PassiveHealNotify_C) == 0x000EB8, "Wrong size on AGCN_PassiveHealNotify_C");
static_assert(offsetof(AGCN_PassiveHealNotify_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_PassiveHealNotify_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_PassiveHealNotify_C, RadiusHeal_NewTrack_0_C0BD418C4FED38F8BEE4BEBB5B4C52FD) == 0x000EA0, "Member 'AGCN_PassiveHealNotify_C::RadiusHeal_NewTrack_0_C0BD418C4FED38F8BEE4BEBB5B4C52FD' has a wrong offset!");
static_assert(offsetof(AGCN_PassiveHealNotify_C, RadiusHeal__Direction_C0BD418C4FED38F8BEE4BEBB5B4C52FD) == 0x000EA4, "Member 'AGCN_PassiveHealNotify_C::RadiusHeal__Direction_C0BD418C4FED38F8BEE4BEBB5B4C52FD' has a wrong offset!");
static_assert(offsetof(AGCN_PassiveHealNotify_C, RadiusHeal) == 0x000EA8, "Member 'AGCN_PassiveHealNotify_C::RadiusHeal' has a wrong offset!");
static_assert(offsetof(AGCN_PassiveHealNotify_C, Widget) == 0x000EB0, "Member 'AGCN_PassiveHealNotify_C::Widget' has a wrong offset!");

}

