#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_CosmeticProjectile_Vacuum

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_CosmeticProjectile_Vacuum.GCN_CosmeticProjectile_Vacuum_C.CreateKillData
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_CosmeticProjectile_Vacuum_C_CreateKillData final
{
public:
	class AActor*                                 Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     ReturnValue;                                       // 0x0008(0x0060)(Parm, OutParm, ReturnParm)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombatParticipant                     CallFunc_CreateCombatParticipantFromPlayer_ReturnValue; // 0x0088(0x0060)()
};
static_assert(alignof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData) == 0x000008, "Wrong alignment on GCN_CosmeticProjectile_Vacuum_C_CreateKillData");
static_assert(sizeof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData) == 0x0000E8, "Wrong size on GCN_CosmeticProjectile_Vacuum_C_CreateKillData");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, Owner_0) == 0x000000, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::Owner_0' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, ReturnValue) == 0x000008, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, K2Node_DynamicCast_AsPawn) == 0x000068, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000078, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_CreateKillData, CallFunc_CreateCombatParticipantFromPlayer_ReturnValue) == 0x000088, "Member 'GCN_CosmeticProjectile_Vacuum_C_CreateKillData::CallFunc_CreateCombatParticipantFromPlayer_ReturnValue' has a wrong offset!");

// Function GCN_CosmeticProjectile_Vacuum.GCN_CosmeticProjectile_Vacuum_C.ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum
// 0x0310 (0x0310 - 0x0000)
struct GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0150(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0178(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0198(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectPoolingSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterJP*                           K2Node_DynamicCast_AsCharacter_JP;                 // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombatParticipant                     CallFunc_CreateKillData_ReturnValue;               // 0x0250(0x0060)()
	class APooledActor*                           CallFunc_GetInactiveObjectOfClass_ReturnValue;     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileBase_C*                   K2Node_DynamicCast_AsBP_Projectile_Base;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_VariableSet_ProjectileSpeed_ImplicitCast;   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_GravityScale_ImplicitCast;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum) == 0x000008, "Wrong alignment on GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum");
static_assert(sizeof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum) == 0x000310, "Wrong size on GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, EntryPoint) == 0x000000, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_Event_Target) == 0x000008, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_Event_Parameters) == 0x000010, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_Event_SpawnResults) == 0x0000E8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, Temp_bool_Variable) == 0x000140, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000144, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000148, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000150, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000168, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000170, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000178, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000198, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_Location) == 0x0001B8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001D0, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001E8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001F0, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001F8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000200, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000208, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00020C, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000210, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000218, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000220, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000238, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_DynamicCast_AsCharacter_JP) == 0x000240, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_DynamicCast_AsCharacter_JP' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_DynamicCast_bSuccess) == 0x000248, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_CreateKillData_ReturnValue) == 0x000250, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_CreateKillData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_GetInactiveObjectOfClass_ReturnValue) == 0x0002B0, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_GetInactiveObjectOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_DynamicCast_AsBP_Projectile_Base) == 0x0002B8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_DynamicCast_AsBP_Projectile_Base' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_DynamicCast_bSuccess_1) == 0x0002C0, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0002C8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0002E0, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_Select_Default) == 0x0002E8, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_VariableSet_ProjectileSpeed_ImplicitCast) == 0x000300, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_VariableSet_ProjectileSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum, K2Node_VariableSet_GravityScale_ImplicitCast) == 0x000308, "Member 'GCN_CosmeticProjectile_Vacuum_C_ExecuteUbergraph_GCN_CosmeticProjectile_Vacuum::K2Node_VariableSet_GravityScale_ImplicitCast' has a wrong offset!");

// Function GCN_CosmeticProjectile_Vacuum.GCN_CosmeticProjectile_Vacuum_C.OnBurst
// 0x0138 (0x0138 - 0x0000)
struct GCN_CosmeticProjectile_Vacuum_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_CosmeticProjectile_Vacuum_C_OnBurst) == 0x000008, "Wrong alignment on GCN_CosmeticProjectile_Vacuum_C_OnBurst");
static_assert(sizeof(GCN_CosmeticProjectile_Vacuum_C_OnBurst) == 0x000138, "Wrong size on GCN_CosmeticProjectile_Vacuum_C_OnBurst");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_OnBurst, Target) == 0x000000, "Member 'GCN_CosmeticProjectile_Vacuum_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_CosmeticProjectile_Vacuum_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_CosmeticProjectile_Vacuum_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GCN_CosmeticProjectile_Vacuum_C_OnBurst::SpawnResults' has a wrong offset!");

}

