#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_ParryEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GCN_AbilityBurstBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_ParryEffect.GCN_ParryEffect_C
// 0x0030 (0x0780 - 0x0750)
class AGCN_ParryEffect_C final : public AGCN_AbilityBurstBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GCN_ParryEffect_C;                  // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TL_VignetteIntensity_Alpha_004A7FB14DBC55A5B1E867BB5F3E3C21; // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_VignetteIntensity__Direction_004A7FB14DBC55A5B1E867BB5F3E3C21; // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_VignetteIntensity;                              // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_OOStamina;                                      // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       OwningCameraComponent;                             // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          PrimaryOSSSoundCooldown;                           // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void All_Add();
	void EnableParryEffect(bool Enable);
	void ExecuteUbergraph_GCN_ParryEffect(int32 EntryPoint);
	void Local_Add();
	void Local_Remove();
	void Other_Add();
	void TL_VignetteIntensity__FinishedFunc();
	void TL_VignetteIntensity__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_ParryEffect_C">();
	}
	static class AGCN_ParryEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_ParryEffect_C>();
	}
};
static_assert(alignof(AGCN_ParryEffect_C) == 0x000008, "Wrong alignment on AGCN_ParryEffect_C");
static_assert(sizeof(AGCN_ParryEffect_C) == 0x000780, "Wrong size on AGCN_ParryEffect_C");
static_assert(offsetof(AGCN_ParryEffect_C, UberGraphFrame_GCN_ParryEffect_C) == 0x000750, "Member 'AGCN_ParryEffect_C::UberGraphFrame_GCN_ParryEffect_C' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, TL_VignetteIntensity_Alpha_004A7FB14DBC55A5B1E867BB5F3E3C21) == 0x000758, "Member 'AGCN_ParryEffect_C::TL_VignetteIntensity_Alpha_004A7FB14DBC55A5B1E867BB5F3E3C21' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, TL_VignetteIntensity__Direction_004A7FB14DBC55A5B1E867BB5F3E3C21) == 0x00075C, "Member 'AGCN_ParryEffect_C::TL_VignetteIntensity__Direction_004A7FB14DBC55A5B1E867BB5F3E3C21' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, TL_VignetteIntensity) == 0x000760, "Member 'AGCN_ParryEffect_C::TL_VignetteIntensity' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, MI_OOStamina) == 0x000768, "Member 'AGCN_ParryEffect_C::MI_OOStamina' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, OwningCameraComponent) == 0x000770, "Member 'AGCN_ParryEffect_C::OwningCameraComponent' has a wrong offset!");
static_assert(offsetof(AGCN_ParryEffect_C, PrimaryOSSSoundCooldown) == 0x000778, "Member 'AGCN_ParryEffect_C::PrimaryOSSSoundCooldown' has a wrong offset!");

}

