#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_SuctionPump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GCN_AbilityActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_SpecialAbility_SuctionPump.GCN_SpecialAbility_SuctionPump_C
// 0x0028 (0x0410 - 0x03E8)
class AGCN_SpecialAbility_SuctionPump_C final : public AGCN_AbilityActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GCN_SpecialAbility_SuctionPump_C;   // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TL_Scale_Alpha_6FF9481B4BDD89C39CC95D881DE48672;   // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Scale__Direction_6FF9481B4BDD89C39CC95D881DE48672; // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Scale;                                          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TornadoParticle;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioActive;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void All_Add();
	void All_Remove();
	void ExecuteUbergraph_GCN_SpecialAbility_SuctionPump(int32 EntryPoint);
	void GetInstigatorFromParams(class AActor** Instigator_0);
	void TL_Scale__FinishedFunc();
	void TL_Scale__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_SpecialAbility_SuctionPump_C">();
	}
	static class AGCN_SpecialAbility_SuctionPump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_SpecialAbility_SuctionPump_C>();
	}
};
static_assert(alignof(AGCN_SpecialAbility_SuctionPump_C) == 0x000008, "Wrong alignment on AGCN_SpecialAbility_SuctionPump_C");
static_assert(sizeof(AGCN_SpecialAbility_SuctionPump_C) == 0x000410, "Wrong size on AGCN_SpecialAbility_SuctionPump_C");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, UberGraphFrame_GCN_SpecialAbility_SuctionPump_C) == 0x0003E8, "Member 'AGCN_SpecialAbility_SuctionPump_C::UberGraphFrame_GCN_SpecialAbility_SuctionPump_C' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, TL_Scale_Alpha_6FF9481B4BDD89C39CC95D881DE48672) == 0x0003F0, "Member 'AGCN_SpecialAbility_SuctionPump_C::TL_Scale_Alpha_6FF9481B4BDD89C39CC95D881DE48672' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, TL_Scale__Direction_6FF9481B4BDD89C39CC95D881DE48672) == 0x0003F4, "Member 'AGCN_SpecialAbility_SuctionPump_C::TL_Scale__Direction_6FF9481B4BDD89C39CC95D881DE48672' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, TL_Scale) == 0x0003F8, "Member 'AGCN_SpecialAbility_SuctionPump_C::TL_Scale' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, TornadoParticle) == 0x000400, "Member 'AGCN_SpecialAbility_SuctionPump_C::TornadoParticle' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_SuctionPump_C, AudioActive) == 0x000408, "Member 'AGCN_SpecialAbility_SuctionPump_C::AudioActive' has a wrong offset!");

}

