#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SlingshotFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_SlingshotFire.GCN_SlingshotFire_C
// 0x0038 (0x0ED0 - 0x0E98)
class AGCN_SlingshotFire_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RecoilTimeline_Time_65287248411A770469427893686F808A; // 0x0EA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RecoilTimeline__Direction_65287248411A770469427893686F808A; // 0x0EA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA5[0x3];                                      // 0x0EA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RecoilTimeline;                                    // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                As_BP_Resident_Character;                          // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StartFOV;                                          // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChargableEquipmentInstance_C*          As_Chargable_Equipment_Instance;                   // 0x0EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        EndFOV;                                            // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_SlingshotFire(int32 EntryPoint);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void PlayRecoil();
	void RecoilTimeline__FinishedFunc();
	void RecoilTimeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_SlingshotFire_C">();
	}
	static class AGCN_SlingshotFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_SlingshotFire_C>();
	}
};
static_assert(alignof(AGCN_SlingshotFire_C) == 0x000008, "Wrong alignment on AGCN_SlingshotFire_C");
static_assert(sizeof(AGCN_SlingshotFire_C) == 0x000ED0, "Wrong size on AGCN_SlingshotFire_C");
static_assert(offsetof(AGCN_SlingshotFire_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_SlingshotFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, RecoilTimeline_Time_65287248411A770469427893686F808A) == 0x000EA0, "Member 'AGCN_SlingshotFire_C::RecoilTimeline_Time_65287248411A770469427893686F808A' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, RecoilTimeline__Direction_65287248411A770469427893686F808A) == 0x000EA4, "Member 'AGCN_SlingshotFire_C::RecoilTimeline__Direction_65287248411A770469427893686F808A' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, RecoilTimeline) == 0x000EA8, "Member 'AGCN_SlingshotFire_C::RecoilTimeline' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, As_BP_Resident_Character) == 0x000EB0, "Member 'AGCN_SlingshotFire_C::As_BP_Resident_Character' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, StartFOV) == 0x000EB8, "Member 'AGCN_SlingshotFire_C::StartFOV' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, As_Chargable_Equipment_Instance) == 0x000EC0, "Member 'AGCN_SlingshotFire_C::As_Chargable_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(AGCN_SlingshotFire_C, EndFOV) == 0x000EC8, "Member 'AGCN_SlingshotFire_C::EndFOV' has a wrong offset!");

}

