#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_JetpackAffected

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_JetpackAffected.GCN_JetpackAffected_C
// 0x0028 (0x0690 - 0x0668)
class AGCN_JetpackAffected_C final : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Smoke2;                                            // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Smoke1;                                            // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_JetpackAffected(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_JetpackAffected_C">();
	}
	static class AGCN_JetpackAffected_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_JetpackAffected_C>();
	}
};
static_assert(alignof(AGCN_JetpackAffected_C) == 0x000008, "Wrong alignment on AGCN_JetpackAffected_C");
static_assert(sizeof(AGCN_JetpackAffected_C) == 0x000690, "Wrong size on AGCN_JetpackAffected_C");
static_assert(offsetof(AGCN_JetpackAffected_C, UberGraphFrame) == 0x000668, "Member 'AGCN_JetpackAffected_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_JetpackAffected_C, Smoke2) == 0x000670, "Member 'AGCN_JetpackAffected_C::Smoke2' has a wrong offset!");
static_assert(offsetof(AGCN_JetpackAffected_C, Smoke1) == 0x000678, "Member 'AGCN_JetpackAffected_C::Smoke1' has a wrong offset!");
static_assert(offsetof(AGCN_JetpackAffected_C, Audio) == 0x000680, "Member 'AGCN_JetpackAffected_C::Audio' has a wrong offset!");
static_assert(offsetof(AGCN_JetpackAffected_C, StaticMesh) == 0x000688, "Member 'AGCN_JetpackAffected_C::StaticMesh' has a wrong offset!");

}

