#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_NightStalkerActive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_NightStalkerActive.GCN_NightStalkerActive_C
// 0x0108 (0x0408 - 0x0300)
class AGCN_NightStalkerActive_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWI_ScreenBorder_FuryRush_C*            WI_ScreenBorder;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0318(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              Particles;                                         // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 MyTarget;                                          // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void All_Add(class AActor* Target);
	void All_Remove(class AActor* Target);
	void ExecuteUbergraph_GCN_NightStalkerActive(int32 EntryPoint);
	void GetInstigatorFromParams(class AActor** Instigator_0);
	void Local_Add();
	void Local_Remove();
	bool OnActive(class AActor* MyTarget_0, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget_0, const struct FGameplayCueParameters& Parameters_0);
	void Other_Add();
	void Other_Remove();
	void SetFaceAnimToAngryForDuration();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_NightStalkerActive_C">();
	}
	static class AGCN_NightStalkerActive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_NightStalkerActive_C>();
	}
};
static_assert(alignof(AGCN_NightStalkerActive_C) == 0x000008, "Wrong alignment on AGCN_NightStalkerActive_C");
static_assert(sizeof(AGCN_NightStalkerActive_C) == 0x000408, "Wrong size on AGCN_NightStalkerActive_C");
static_assert(offsetof(AGCN_NightStalkerActive_C, UberGraphFrame) == 0x000300, "Member 'AGCN_NightStalkerActive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_NightStalkerActive_C, DefaultSceneRoot) == 0x000308, "Member 'AGCN_NightStalkerActive_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCN_NightStalkerActive_C, WI_ScreenBorder) == 0x000310, "Member 'AGCN_NightStalkerActive_C::WI_ScreenBorder' has a wrong offset!");
static_assert(offsetof(AGCN_NightStalkerActive_C, Parameters) == 0x000318, "Member 'AGCN_NightStalkerActive_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_NightStalkerActive_C, Particles) == 0x0003F0, "Member 'AGCN_NightStalkerActive_C::Particles' has a wrong offset!");
static_assert(offsetof(AGCN_NightStalkerActive_C, MyTarget) == 0x000400, "Member 'AGCN_NightStalkerActive_C::MyTarget' has a wrong offset!");

}

