#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_GooseLeash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_GooseLeash.GCN_GooseLeash_C
// 0x0118 (0x0780 - 0x0668)
class AGCN_GooseLeash_C final : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                ImpactPoint;                                       // 0x0670(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0688(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UObject*                                LeashAttachPoint;                                  // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Goose_C*                            AssociatedGoose;                                   // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                As_BP_Resident_Character;                          // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalCue;                                          // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Cue();
	void ExecuteUbergraph_GCN_GooseLeash(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	void PlaySoundAttached(class USoundBase* Sound, class UAudioComponent** AudioComponent);
	void ReceiveTick(float DeltaSeconds);
	void Remove_Cue();
	void SetCableEndLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_GooseLeash_C">();
	}
	static class AGCN_GooseLeash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_GooseLeash_C>();
	}
};
static_assert(alignof(AGCN_GooseLeash_C) == 0x000008, "Wrong alignment on AGCN_GooseLeash_C");
static_assert(sizeof(AGCN_GooseLeash_C) == 0x000780, "Wrong size on AGCN_GooseLeash_C");
static_assert(offsetof(AGCN_GooseLeash_C, UberGraphFrame) == 0x000668, "Member 'AGCN_GooseLeash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, ImpactPoint) == 0x000670, "Member 'AGCN_GooseLeash_C::ImpactPoint' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, Parameters) == 0x000688, "Member 'AGCN_GooseLeash_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, LeashAttachPoint) == 0x000760, "Member 'AGCN_GooseLeash_C::LeashAttachPoint' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, AssociatedGoose) == 0x000768, "Member 'AGCN_GooseLeash_C::AssociatedGoose' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, As_BP_Resident_Character) == 0x000770, "Member 'AGCN_GooseLeash_C::As_BP_Resident_Character' has a wrong offset!");
static_assert(offsetof(AGCN_GooseLeash_C, LocalCue) == 0x000778, "Member 'AGCN_GooseLeash_C::LocalCue' has a wrong offset!");

}

