#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HitmarkerWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HitmarkerWI.HitmarkerWI_C
// 0x0038 (0x0318 - 0x02E0)
class UHitmarkerWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseFade;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_83;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_212;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Amount;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_HitmarkerWI(int32 EntryPoint);
	void Play_Hitmarker();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HitmarkerWI_C">();
	}
	static class UHitmarkerWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitmarkerWI_C>();
	}
};
static_assert(alignof(UHitmarkerWI_C) == 0x000008, "Wrong alignment on UHitmarkerWI_C");
static_assert(sizeof(UHitmarkerWI_C) == 0x000318, "Wrong size on UHitmarkerWI_C");
static_assert(offsetof(UHitmarkerWI_C, UberGraphFrame) == 0x0002E0, "Member 'UHitmarkerWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, PulseFade) == 0x0002E8, "Member 'UHitmarkerWI_C::PulseFade' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, Pulse) == 0x0002F0, "Member 'UHitmarkerWI_C::Pulse' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, CanvasPanel_0) == 0x0002F8, "Member 'UHitmarkerWI_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, Image_83) == 0x000300, "Member 'UHitmarkerWI_C::Image_83' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, SizeBox_212) == 0x000308, "Member 'UHitmarkerWI_C::SizeBox_212' has a wrong offset!");
static_assert(offsetof(UHitmarkerWI_C, Amount) == 0x000310, "Member 'UHitmarkerWI_C::Amount' has a wrong offset!");

}

