#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_InteractionTraceOffset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function I_InteractionTraceOffset.I_InteractionTraceOffset_C.GetInteractionTraceLength
// 0x0008 (0x0008 - 0x0000)
struct I_InteractionTraceOffset_C_GetInteractionTraceLength final
{
public:
	double                                        Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_InteractionTraceOffset_C_GetInteractionTraceLength) == 0x000008, "Wrong alignment on I_InteractionTraceOffset_C_GetInteractionTraceLength");
static_assert(sizeof(I_InteractionTraceOffset_C_GetInteractionTraceLength) == 0x000008, "Wrong size on I_InteractionTraceOffset_C_GetInteractionTraceLength");
static_assert(offsetof(I_InteractionTraceOffset_C_GetInteractionTraceLength, Return) == 0x000000, "Member 'I_InteractionTraceOffset_C_GetInteractionTraceLength::Return' has a wrong offset!");

// Function I_InteractionTraceOffset.I_InteractionTraceOffset_C.GetInteractionTraceOffset
// 0x0018 (0x0018 - 0x0000)
struct I_InteractionTraceOffset_C_GetInteractionTraceOffset final
{
public:
	struct FVector                                Return;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_InteractionTraceOffset_C_GetInteractionTraceOffset) == 0x000008, "Wrong alignment on I_InteractionTraceOffset_C_GetInteractionTraceOffset");
static_assert(sizeof(I_InteractionTraceOffset_C_GetInteractionTraceOffset) == 0x000018, "Wrong size on I_InteractionTraceOffset_C_GetInteractionTraceOffset");
static_assert(offsetof(I_InteractionTraceOffset_C_GetInteractionTraceOffset, Return) == 0x000000, "Member 'I_InteractionTraceOffset_C_GetInteractionTraceOffset::Return' has a wrong offset!");

}

