#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_TurretTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_TurretTarget.I_TurretTarget_C.GetTurretTargetHighPriority
// 0x0001 (0x0001 - 0x0000)
struct I_TurretTarget_C_GetTurretTargetHighPriority final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_TurretTarget_C_GetTurretTargetHighPriority) == 0x000001, "Wrong alignment on I_TurretTarget_C_GetTurretTargetHighPriority");
static_assert(sizeof(I_TurretTarget_C_GetTurretTargetHighPriority) == 0x000001, "Wrong size on I_TurretTarget_C_GetTurretTargetHighPriority");
static_assert(offsetof(I_TurretTarget_C_GetTurretTargetHighPriority, Return) == 0x000000, "Member 'I_TurretTarget_C_GetTurretTargetHighPriority::Return' has a wrong offset!");

// Function I_TurretTarget.I_TurretTarget_C.GetTurretTargetSceneComponent
// 0x0008 (0x0008 - 0x0000)
struct I_TurretTarget_C_GetTurretTargetSceneComponent final
{
public:
	class USceneComponent*                        Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_TurretTarget_C_GetTurretTargetSceneComponent) == 0x000008, "Wrong alignment on I_TurretTarget_C_GetTurretTargetSceneComponent");
static_assert(sizeof(I_TurretTarget_C_GetTurretTargetSceneComponent) == 0x000008, "Wrong size on I_TurretTarget_C_GetTurretTargetSceneComponent");
static_assert(offsetof(I_TurretTarget_C_GetTurretTargetSceneComponent, Return) == 0x000000, "Member 'I_TurretTarget_C_GetTurretTargetSceneComponent::Return' has a wrong offset!");

// Function I_TurretTarget.I_TurretTarget_C.IsValidTurretTarget
// 0x0001 (0x0001 - 0x0000)
struct I_TurretTarget_C_IsValidTurretTarget final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_TurretTarget_C_IsValidTurretTarget) == 0x000001, "Wrong alignment on I_TurretTarget_C_IsValidTurretTarget");
static_assert(sizeof(I_TurretTarget_C_IsValidTurretTarget) == 0x000001, "Wrong size on I_TurretTarget_C_IsValidTurretTarget");
static_assert(offsetof(I_TurretTarget_C_IsValidTurretTarget, IsValid) == 0x000000, "Member 'I_TurretTarget_C_IsValidTurretTarget::IsValid' has a wrong offset!");

// Function I_TurretTarget.I_TurretTarget_C.SetIsValidTurretTarget
// 0x0002 (0x0002 - 0x0000)
struct I_TurretTarget_C_SetIsValidTurretTarget final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_TurretTarget_C_SetIsValidTurretTarget) == 0x000001, "Wrong alignment on I_TurretTarget_C_SetIsValidTurretTarget");
static_assert(sizeof(I_TurretTarget_C_SetIsValidTurretTarget) == 0x000002, "Wrong size on I_TurretTarget_C_SetIsValidTurretTarget");
static_assert(offsetof(I_TurretTarget_C_SetIsValidTurretTarget, Valid) == 0x000000, "Member 'I_TurretTarget_C_SetIsValidTurretTarget::Valid' has a wrong offset!");
static_assert(offsetof(I_TurretTarget_C_SetIsValidTurretTarget, Void) == 0x000001, "Member 'I_TurretTarget_C_SetIsValidTurretTarget::Void' has a wrong offset!");

}

