#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractButtonWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InteractButtonWI.InteractButtonWI_C
// 0x0048 (0x0328 - 0x02E0)
class UInteractButtonWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Activate;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Position;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Description;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_OptionalSecondLine;                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_MiscAbility_C*                      WI_MiscAbility;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 ActorInWorld;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceHidden;                                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  OwningPawn;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Anim_Activate();
	void Construct();
	void ExecuteUbergraph_InteractButtonWI(int32 EntryPoint);
	void OnInitialized();
	void ResetText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ToggleVisibility(ESlateVisibility Visibility_0);
	void UpdateRichTextBlock(class URichTextBlock* RichTextBlock, const class FText& NewText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InteractButtonWI_C">();
	}
	static class UInteractButtonWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractButtonWI_C>();
	}
};
static_assert(alignof(UInteractButtonWI_C) == 0x000008, "Wrong alignment on UInteractButtonWI_C");
static_assert(sizeof(UInteractButtonWI_C) == 0x000328, "Wrong size on UInteractButtonWI_C");
static_assert(offsetof(UInteractButtonWI_C, UberGraphFrame) == 0x0002E0, "Member 'UInteractButtonWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, Activate) == 0x0002E8, "Member 'UInteractButtonWI_C::Activate' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, Canvas_Position) == 0x0002F0, "Member 'UInteractButtonWI_C::Canvas_Position' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, RichTextBlock_Description) == 0x0002F8, "Member 'UInteractButtonWI_C::RichTextBlock_Description' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, RichTextBlock_OptionalSecondLine) == 0x000300, "Member 'UInteractButtonWI_C::RichTextBlock_OptionalSecondLine' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, WI_MiscAbility) == 0x000308, "Member 'UInteractButtonWI_C::WI_MiscAbility' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, ActorInWorld) == 0x000310, "Member 'UInteractButtonWI_C::ActorInWorld' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, ForceHidden) == 0x000318, "Member 'UInteractButtonWI_C::ForceHidden' has a wrong offset!");
static_assert(offsetof(UInteractButtonWI_C, OwningPawn) == 0x000320, "Member 'UInteractButtonWI_C::OwningPawn' has a wrong offset!");

}

