#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InviteFriendEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InviteFriendEntryWI.InviteFriendEntryWI_C
// 0x0028 (0x0308 - 0x02E0)
class UInviteFriendEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Avatar;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        TestButtonWI;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__InviteFriendEntryWI_TestButtonWI_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_InviteFriendEntryWI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InviteFriendEntryWI_C">();
	}
	static class UInviteFriendEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInviteFriendEntryWI_C>();
	}
};
static_assert(alignof(UInviteFriendEntryWI_C) == 0x000008, "Wrong alignment on UInviteFriendEntryWI_C");
static_assert(sizeof(UInviteFriendEntryWI_C) == 0x000308, "Wrong size on UInviteFriendEntryWI_C");
static_assert(offsetof(UInviteFriendEntryWI_C, UberGraphFrame) == 0x0002E0, "Member 'UInviteFriendEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInviteFriendEntryWI_C, Image_Avatar) == 0x0002E8, "Member 'UInviteFriendEntryWI_C::Image_Avatar' has a wrong offset!");
static_assert(offsetof(UInviteFriendEntryWI_C, TestButtonWI) == 0x0002F0, "Member 'UInviteFriendEntryWI_C::TestButtonWI' has a wrong offset!");
static_assert(offsetof(UInviteFriendEntryWI_C, Name_0) == 0x0002F8, "Member 'UInviteFriendEntryWI_C::Name_0' has a wrong offset!");

}

