#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InviteFriendsWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InviteFriendsWI.InviteFriendsWI_C
// 0x0018 (0x02F8 - 0x02E0)
class UInviteFriendsWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox_55;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        TestButtonWI;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InviteFriendsWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InviteFriendsWI_C">();
	}
	static class UInviteFriendsWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInviteFriendsWI_C>();
	}
};
static_assert(alignof(UInviteFriendsWI_C) == 0x000008, "Wrong alignment on UInviteFriendsWI_C");
static_assert(sizeof(UInviteFriendsWI_C) == 0x0002F8, "Wrong size on UInviteFriendsWI_C");
static_assert(offsetof(UInviteFriendsWI_C, UberGraphFrame) == 0x0002E0, "Member 'UInviteFriendsWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInviteFriendsWI_C, ScrollBox_55) == 0x0002E8, "Member 'UInviteFriendsWI_C::ScrollBox_55' has a wrong offset!");
static_assert(offsetof(UInviteFriendsWI_C, TestButtonWI) == 0x0002F0, "Member 'UInviteFriendsWI_C::TestButtonWI' has a wrong offset!");

}

