#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTutorial_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTutorial_Base.ItemTutorial_Base_C
// 0x0058 (0x0338 - 0x02E0)
class UItemTutorial_Base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Description;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Preview;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DescText;                                          // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             ImageTexture;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemTutorial_Base(int32 EntryPoint);
	void Finished_5BC6E70441D27778BFCEED82078B7FA1();
	void Finished_BB7F4E19469B46598FE54EA22AE5F8FB();
	void Initialize(class UTexture2D* Image, const class FText& Title_0, const class FText& Description_0);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Remove_Me();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTutorial_Base_C">();
	}
	static class UItemTutorial_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTutorial_Base_C>();
	}
};
static_assert(alignof(UItemTutorial_Base_C) == 0x000008, "Wrong alignment on UItemTutorial_Base_C");
static_assert(sizeof(UItemTutorial_Base_C) == 0x000338, "Wrong size on UItemTutorial_Base_C");
static_assert(offsetof(UItemTutorial_Base_C, UberGraphFrame) == 0x0002E0, "Member 'UItemTutorial_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, Appear) == 0x0002E8, "Member 'UItemTutorial_Base_C::Appear' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, Background) == 0x0002F0, "Member 'UItemTutorial_Base_C::Background' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, Description) == 0x0002F8, "Member 'UItemTutorial_Base_C::Description' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, Preview) == 0x000300, "Member 'UItemTutorial_Base_C::Preview' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, Title) == 0x000308, "Member 'UItemTutorial_Base_C::Title' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, TitleText) == 0x000310, "Member 'UItemTutorial_Base_C::TitleText' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, DescText) == 0x000320, "Member 'UItemTutorial_Base_C::DescText' has a wrong offset!");
static_assert(offsetof(UItemTutorial_Base_C, ImageTexture) == 0x000330, "Member 'UItemTutorial_Base_C::ImageTexture' has a wrong offset!");

}

