#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWheelWI

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemWheelWI.ItemWheelWI_C
// 0x0088 (0x0368 - 0x02E0)
class UItemWheelWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGDark;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BuffList;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_269;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RadialMenu_C*                      RadialMenu;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_RadialInputPlayerController_C*      Controller;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                OwningCharacter;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   OwnerInventory;                                    // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FItemWheelInfo>                 Entries;                                           // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInventoryComponent*                    Inventory;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CharacterWheelComponent;                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  Items;                                             // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddBuffIcon(class UClass* Class_0);
	void BndEvt__RadialMenu_K2Node_ComponentBoundEvent_0_ExitedDeadzone__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ItemWheelWI(int32 EntryPoint);
	void Get_Selected_Option(int32* OutIndex, struct FItemWheelInfo* Info, bool* Valid);
	void GetDamageMultiplierValues(class UItemInstance* ItemInstance, bool* HasMultiplier, float* Damage_Multiplier);
	void HoveredEntryChanged(class UItemDefinition* HoveredItemDefinition);
	void InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemWheelWI_C">();
	}
	static class UItemWheelWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemWheelWI_C>();
	}
};
static_assert(alignof(UItemWheelWI_C) == 0x000008, "Wrong alignment on UItemWheelWI_C");
static_assert(sizeof(UItemWheelWI_C) == 0x000368, "Wrong size on UItemWheelWI_C");
static_assert(offsetof(UItemWheelWI_C, UberGraphFrame) == 0x0002E0, "Member 'UItemWheelWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, BG) == 0x0002E8, "Member 'UItemWheelWI_C::BG' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, BGDark) == 0x0002F0, "Member 'UItemWheelWI_C::BGDark' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, BuffList) == 0x0002F8, "Member 'UItemWheelWI_C::BuffList' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Image_269) == 0x000300, "Member 'UItemWheelWI_C::Image_269' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, RadialMenu) == 0x000308, "Member 'UItemWheelWI_C::RadialMenu' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Text_Description) == 0x000310, "Member 'UItemWheelWI_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Text_Name) == 0x000318, "Member 'UItemWheelWI_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Controller) == 0x000320, "Member 'UItemWheelWI_C::Controller' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, OwningCharacter) == 0x000328, "Member 'UItemWheelWI_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, OwnerInventory) == 0x000330, "Member 'UItemWheelWI_C::OwnerInventory' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Entries) == 0x000338, "Member 'UItemWheelWI_C::Entries' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Inventory) == 0x000348, "Member 'UItemWheelWI_C::Inventory' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, CharacterWheelComponent) == 0x000350, "Member 'UItemWheelWI_C::CharacterWheelComponent' has a wrong offset!");
static_assert(offsetof(UItemWheelWI_C, Items) == 0x000358, "Member 'UItemWheelWI_C::Items' has a wrong offset!");

}

