#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTutorial_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemTutorial_Base.ItemTutorial_Base_C.ExecuteUbergraph_ItemTutorial_Base
// 0x00D8 (0x00D8 - 0x0000)
struct ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemTutorial_Base_C*>           CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UItemTutorial_Base_C*                   CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base) == 0x000008, "Wrong alignment on ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base");
static_assert(sizeof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base) == 0x0000D8, "Wrong size on ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, EntryPoint) == 0x000000, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, Temp_int_Array_Index_Variable) == 0x000024, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, K2Node_Event_MyGeometry) == 0x000030, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, K2Node_Event_InDeltaTime) == 0x000068, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000078, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_Array_Get_Item) == 0x000088, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0000C0, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000C8, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'ItemTutorial_Base_C_ExecuteUbergraph_ItemTutorial_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ItemTutorial_Base.ItemTutorial_Base_C.Initialize
// 0x0028 (0x0028 - 0x0000)
struct ItemTutorial_Base_C_Initialize final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Title_0;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description_0;                                     // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ItemTutorial_Base_C_Initialize) == 0x000008, "Wrong alignment on ItemTutorial_Base_C_Initialize");
static_assert(sizeof(ItemTutorial_Base_C_Initialize) == 0x000028, "Wrong size on ItemTutorial_Base_C_Initialize");
static_assert(offsetof(ItemTutorial_Base_C_Initialize, Image) == 0x000000, "Member 'ItemTutorial_Base_C_Initialize::Image' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_Initialize, Title_0) == 0x000008, "Member 'ItemTutorial_Base_C_Initialize::Title_0' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_Initialize, Description_0) == 0x000018, "Member 'ItemTutorial_Base_C_Initialize::Description_0' has a wrong offset!");

// Function ItemTutorial_Base.ItemTutorial_Base_C.OnKeyDown
// 0x0208 (0x0208 - 0x0000)
struct ItemTutorial_Base_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTutorial_Base_C_OnKeyDown) == 0x000008, "Wrong alignment on ItemTutorial_Base_C_OnKeyDown");
static_assert(sizeof(ItemTutorial_Base_C_OnKeyDown) == 0x000208, "Wrong size on ItemTutorial_Base_C_OnKeyDown");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'ItemTutorial_Base_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'ItemTutorial_Base_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'ItemTutorial_Base_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'ItemTutorial_Base_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'ItemTutorial_Base_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'ItemTutorial_Base_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000201, "Member 'ItemTutorial_Base_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x000202, "Member 'ItemTutorial_Base_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ItemTutorial_Base.ItemTutorial_Base_C.Tick
// 0x003C (0x003C - 0x0000)
struct ItemTutorial_Base_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTutorial_Base_C_Tick) == 0x000004, "Wrong alignment on ItemTutorial_Base_C_Tick");
static_assert(sizeof(ItemTutorial_Base_C_Tick) == 0x00003C, "Wrong size on ItemTutorial_Base_C_Tick");
static_assert(offsetof(ItemTutorial_Base_C_Tick, MyGeometry) == 0x000000, "Member 'ItemTutorial_Base_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemTutorial_Base_C_Tick, InDeltaTime) == 0x000038, "Member 'ItemTutorial_Base_C_Tick::InDeltaTime' has a wrong offset!");

}

