#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWheelEntryWI

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.AmmoTextForItemWithMaxAmmo
// 0x0278 (0x0278 - 0x0000)
struct ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FGameplayAttribute                     CallFunc_GetAmmoTypeAttribute_Attribute;           // 0x0010(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     CallFunc_GetAmmoTypeAttribute_MaxAttribute;        // 0x0048(0x0038)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0190(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfItem_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0200(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0010)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo");
static_assert(sizeof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo) == 0x000278, "Wrong size on ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, Result) == 0x000000, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::Result' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetAmmoTypeAttribute_Attribute) == 0x000010, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetAmmoTypeAttribute_Attribute' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetAmmoTypeAttribute_MaxAttribute) == 0x000048, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetAmmoTypeAttribute_MaxAttribute' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000080, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_K2_GetPawn_ReturnValue) == 0x000088, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_HasDefinitionTag_ReturnValue) == 0x000090, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x0000A0, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x0000A4, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x0000A8, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x0000AC, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_FTrunc_ReturnValue) == 0x0000B0, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_FTrunc_ReturnValue_1) == 0x0000B4, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000C8, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000120, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeArray_Array) == 0x000168, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetTagStackCount_ReturnValue) == 0x000178, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Format_ReturnValue) == 0x000180, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000190, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A0, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_GetAmountOfItem_ReturnValue) == 0x0001E8, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_GetAmountOfItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0001F0, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000200, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, K2Node_MakeArray_Array_1) == 0x000248, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_Format_ReturnValue_1) == 0x000258, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_FTrunc_A_ImplicitCast) == 0x000268, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000270, "Member 'ItemWheelEntryWI_C_AmmoTextForItemWithMaxAmmo::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.CacheIcon
// 0x0100 (0x0100 - 0x0000)
struct ItemWheelEntryWI_C_CacheIcon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemIconBlocking_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0020(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_CacheIcon) == 0x000010, "Wrong alignment on ItemWheelEntryWI_C_CacheIcon");
static_assert(sizeof(ItemWheelEntryWI_C_CacheIcon) == 0x000100, "Wrong size on ItemWheelEntryWI_C_CacheIcon");
static_assert(offsetof(ItemWheelEntryWI_C_CacheIcon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ItemWheelEntryWI_C_CacheIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_CacheIcon, CallFunc_Get_ClassLog_Name_name) == 0x000008, "Member 'ItemWheelEntryWI_C_CacheIcon::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_CacheIcon, CallFunc_GetItemIconBlocking_ReturnValue) == 0x000018, "Member 'ItemWheelEntryWI_C_CacheIcon::CallFunc_GetItemIconBlocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_CacheIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000020, "Member 'ItemWheelEntryWI_C_CacheIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_CacheIcon, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'ItemWheelEntryWI_C_CacheIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.ExecuteUbergraph_ItemWheelEntryWI
// 0x0108 (0x0108 - 0x0000)
struct ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmountOfItem_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AmmoTextForItemWithMaxAmmo_Result;        // 0x0030(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0010)()
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_ItemWheel_C>        K2Node_DynamicCast_AsI_Item_Wheel;                 // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CallFunc_GetItemWheelComponent_Return;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x00E0(0x0020)()
	bool                                          CallFunc_CancelAbilitiesByTag_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI");
static_assert(sizeof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI) == 0x000108, "Wrong size on ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, EntryPoint) == 0x000000, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000018, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_AsItem_Definition) == 0x000020, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_ContainsTag_ReturnValue) == 0x000029, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_GetAmountOfItem_ReturnValue) == 0x00002C, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_GetAmountOfItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_AmmoTextForItemWithMaxAmmo_Result) == 0x000030, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_AmmoTextForItemWithMaxAmmo_Result' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_HasDefinitionTag_ReturnValue) == 0x000058, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_BooleanOR_ReturnValue) == 0x000059, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_ContainsTag_ReturnValue_1) == 0x00005A, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_GetTagStackCount_ReturnValue) == 0x00005C, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_Event_MyGeometry) == 0x000064, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_Event_InDeltaTime) == 0x00009C, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000A0, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_AsI_Item_Wheel) == 0x0000A8, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_AsI_Item_Wheel' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000C0, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_GetItemWheelComponent_Return) == 0x0000C8, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_GetItemWheelComponent_Return' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x0000D0, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0000E0, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI, CallFunc_CancelAbilitiesByTag_ReturnValue) == 0x000100, "Member 'ItemWheelEntryWI_C_ExecuteUbergraph_ItemWheelEntryWI::CallFunc_CancelAbilitiesByTag_ReturnValue' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.GetAmmoTypeAttribute
// 0x0078 (0x0078 - 0x0000)
struct ItemWheelEntryWI_C_GetAmmoTypeAttribute final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	struct FGameplayAttribute                     MaxAttribute;                                      // 0x0038(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_GetAmmoTypeAttribute) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_GetAmmoTypeAttribute");
static_assert(sizeof(ItemWheelEntryWI_C_GetAmmoTypeAttribute) == 0x000078, "Wrong size on ItemWheelEntryWI_C_GetAmmoTypeAttribute");
static_assert(offsetof(ItemWheelEntryWI_C_GetAmmoTypeAttribute, Attribute) == 0x000000, "Member 'ItemWheelEntryWI_C_GetAmmoTypeAttribute::Attribute' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_GetAmmoTypeAttribute, MaxAttribute) == 0x000038, "Member 'ItemWheelEntryWI_C_GetAmmoTypeAttribute::MaxAttribute' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_GetAmmoTypeAttribute, CallFunc_HasDefinitionTag_ReturnValue) == 0x000070, "Member 'ItemWheelEntryWI_C_GetAmmoTypeAttribute::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.GetColorAndOpacity_0
// 0x0020 (0x0020 - 0x0000)
struct ItemWheelEntryWI_C_GetColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_GetColorAndOpacity_0) == 0x000004, "Wrong alignment on ItemWheelEntryWI_C_GetColorAndOpacity_0");
static_assert(sizeof(ItemWheelEntryWI_C_GetColorAndOpacity_0) == 0x000020, "Wrong size on ItemWheelEntryWI_C_GetColorAndOpacity_0");
static_assert(offsetof(ItemWheelEntryWI_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'ItemWheelEntryWI_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_GetColorAndOpacity_0, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'ItemWheelEntryWI_C_GetColorAndOpacity_0::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.OnEntryHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature final
{
public:
	class UItemDefinition*                        HoveredItemDefinition;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature");
static_assert(sizeof(ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature) == 0x000008, "Wrong size on ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature");
static_assert(offsetof(ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature, HoveredItemDefinition) == 0x000000, "Member 'ItemWheelEntryWI_C_OnEntryHovered__DelegateSignature::HoveredItemDefinition' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.Set Damage Multiplier Visibility and Value
// 0x0038 (0x0038 - 0x0000)
struct ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UItemAction_DamageMultiplierStructures* CallFunc_FindActionByType_ReturnValue;             // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ModifyStructureDamageByPerk_ModifiedMultiplier; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ModifyStructureDamageByPerk_OriginalMultiplier_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value");
static_assert(sizeof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value) == 0x000038, "Wrong size on ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_FindActionByType_ReturnValue) == 0x000018, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_ModifyStructureDamageByPerk_ModifiedMultiplier) == 0x000028, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_ModifyStructureDamageByPerk_ModifiedMultiplier' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value, CallFunc_ModifyStructureDamageByPerk_OriginalMultiplier_ImplicitCast) == 0x000030, "Member 'ItemWheelEntryWI_C_Set_Damage_Multiplier_Visibility_and_Value::CallFunc_ModifyStructureDamageByPerk_OriginalMultiplier_ImplicitCast' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.SetCategoryCosmetics
// 0x0038 (0x0038 - 0x0000)
struct ItemWheelEntryWI_C_SetCategoryCosmetics final
{
public:
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue;             // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             CallFunc_GetShopItemCategoryForItemDefinition_ShopItemCategory; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShopItemCategoryForItemDefinition_Success; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShopItemCategoryForItemDefinition_StencilValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_SetCategoryCosmetics) == 0x000008, "Wrong alignment on ItemWheelEntryWI_C_SetCategoryCosmetics");
static_assert(sizeof(ItemWheelEntryWI_C_SetCategoryCosmetics) == 0x000038, "Wrong size on ItemWheelEntryWI_C_SetCategoryCosmetics");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_GetTweakableData_ReturnValue) == 0x000000, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_GetTweakableData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, K2Node_DynamicCast_AsItem_Definition) == 0x000010, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_GetShopItemCategoryForItemDefinition_ShopItemCategory) == 0x000019, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_GetShopItemCategoryForItemDefinition_ShopItemCategory' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_GetShopItemCategoryForItemDefinition_Success) == 0x00001A, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_GetShopItemCategoryForItemDefinition_Success' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_GetShopItemCategoryForItemDefinition_StencilValue) == 0x00001C, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_GetShopItemCategoryForItemDefinition_StencilValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_Map_Find_Value) == 0x000020, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_SetCategoryCosmetics, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'ItemWheelEntryWI_C_SetCategoryCosmetics::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct ItemWheelEntryWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_Tick) == 0x000004, "Wrong alignment on ItemWheelEntryWI_C_Tick");
static_assert(sizeof(ItemWheelEntryWI_C_Tick) == 0x00003C, "Wrong size on ItemWheelEntryWI_C_Tick");
static_assert(offsetof(ItemWheelEntryWI_C_Tick, MyGeometry) == 0x000000, "Member 'ItemWheelEntryWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_Tick, InDeltaTime) == 0x000038, "Member 'ItemWheelEntryWI_C_Tick::InDeltaTime' has a wrong offset!");

// Function ItemWheelEntryWI.ItemWheelEntryWI_C.GetAmountOfItem
// 0x0008 (0x0008 - 0x0000)
struct ItemWheelEntryWI_C_GetAmountOfItem final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelEntryWI_C_GetAmountOfItem) == 0x000004, "Wrong alignment on ItemWheelEntryWI_C_GetAmountOfItem");
static_assert(sizeof(ItemWheelEntryWI_C_GetAmountOfItem) == 0x000008, "Wrong size on ItemWheelEntryWI_C_GetAmountOfItem");
static_assert(offsetof(ItemWheelEntryWI_C_GetAmountOfItem, ReturnValue) == 0x000000, "Member 'ItemWheelEntryWI_C_GetAmountOfItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelEntryWI_C_GetAmountOfItem, CallFunc_GetTagStackCount_ReturnValue) == 0x000004, "Member 'ItemWheelEntryWI_C_GetAmountOfItem::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");

}

