#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWChat

#include "Basic.hpp"

#include "IWChat_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class IWChat.ChatMessageWidget
// 0x0000 (0x02E0 - 0x02E0)
class UChatMessageWidget : public UUserWidget
{
public:
	void ApplyViewModel(const struct FChatMessageWidgetViewModel& InViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatMessageWidget">();
	}
	static class UChatMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatMessageWidget>();
	}
};
static_assert(alignof(UChatMessageWidget) == 0x000008, "Wrong alignment on UChatMessageWidget");
static_assert(sizeof(UChatMessageWidget) == 0x0002E0, "Wrong size on UChatMessageWidget");

// Class IWChat.ChatPlayerStateInterface
// 0x0000 (0x0028 - 0x0028)
class IChatPlayerStateInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatPlayerStateInterface">();
	}
	static class IChatPlayerStateInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChatPlayerStateInterface>();
	}
};
static_assert(alignof(IChatPlayerStateInterface) == 0x000008, "Wrong alignment on IChatPlayerStateInterface");
static_assert(sizeof(IChatPlayerStateInterface) == 0x000028, "Wrong size on IChatPlayerStateInterface");

// Class IWChat.ChatReplicationComponent
// 0x0000 (0x00A0 - 0x00A0)
class UChatReplicationComponent final : public UActorComponent
{
public:
	void Multicast_Message(const struct FChatMessage& InMessage);
	void Server_Message(const struct FChatMessage& InMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatReplicationComponent">();
	}
	static class UChatReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatReplicationComponent>();
	}
};
static_assert(alignof(UChatReplicationComponent) == 0x000008, "Wrong alignment on UChatReplicationComponent");
static_assert(sizeof(UChatReplicationComponent) == 0x0000A0, "Wrong size on UChatReplicationComponent");

// Class IWChat.ChatSubsystem
// 0x0028 (0x0058 - 0x0030)
class UChatSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSubsystem">();
	}
	static class UChatSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSubsystem>();
	}
};
static_assert(alignof(UChatSubsystem) == 0x000008, "Wrong alignment on UChatSubsystem");
static_assert(sizeof(UChatSubsystem) == 0x000058, "Wrong size on UChatSubsystem");

// Class IWChat.ChatWidget
// 0x0000 (0x02E0 - 0x02E0)
class UChatWidget : public UUserWidget
{
public:
	void Catchup(int32 InCount);
	void ClearChatSubsystem();
	void OnMessageAdded(const struct FChatMessage& InMessage);
	void SendMessage(const class FText& InMessage, EChatMessageType InScope);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatWidget">();
	}
	static class UChatWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWidget>();
	}
};
static_assert(alignof(UChatWidget) == 0x000008, "Wrong alignment on UChatWidget");
static_assert(sizeof(UChatWidget) == 0x0002E0, "Wrong size on UChatWidget");

}

