#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWCommonUI

#include "Basic.hpp"

#include "IWCommonUI_structs.hpp"
#include "IWExperiences_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class IWCommonUI.GameFeatureAction_AddWidgets
// 0x0070 (0x00E8 - 0x0078)
class UGameFeatureAction_AddWidgets final : public UGameFeatureAction_WorldActionBase
{
public:
	TArray<struct FIWHUDLayoutRequest>            Layout;                                            // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FIWHUDElementEntry>             Widgets;                                           // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x50];                                      // 0x0098(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddWidgets">();
	}
	static class UGameFeatureAction_AddWidgets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddWidgets>();
	}
};
static_assert(alignof(UGameFeatureAction_AddWidgets) == 0x000008, "Wrong alignment on UGameFeatureAction_AddWidgets");
static_assert(sizeof(UGameFeatureAction_AddWidgets) == 0x0000E8, "Wrong size on UGameFeatureAction_AddWidgets");
static_assert(offsetof(UGameFeatureAction_AddWidgets, Layout) == 0x000078, "Member 'UGameFeatureAction_AddWidgets::Layout' has a wrong offset!");
static_assert(offsetof(UGameFeatureAction_AddWidgets, Widgets) == 0x000088, "Member 'UGameFeatureAction_AddWidgets::Widgets' has a wrong offset!");

// Class IWCommonUI.IWHUD
// 0x0000 (0x0380 - 0x0380)
class AIWHUD final : public AHUD
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IWHUD">();
	}
	static class AIWHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIWHUD>();
	}
};
static_assert(alignof(AIWHUD) == 0x000008, "Wrong alignment on AIWHUD");
static_assert(sizeof(AIWHUD) == 0x000380, "Wrong size on AIWHUD");

}

