#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWExperiences_IWInput

#include "Basic.hpp"

#include "IWExperiences_IWInput_structs.hpp"
#include "IWExperiences_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class IWExperiences_IWInput.GameFeatureAction_AddInputContextMapping
// 0x0068 (0x00E0 - 0x0078)
class UGameFeatureAction_AddInputContextMapping final : public UGameFeatureAction_WorldActionBase
{
public:
	TArray<struct FInputMappingContextAndPriority> InputMappings;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x58];                                      // 0x0088(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddInputContextMapping">();
	}
	static class UGameFeatureAction_AddInputContextMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddInputContextMapping>();
	}
};
static_assert(alignof(UGameFeatureAction_AddInputContextMapping) == 0x000008, "Wrong alignment on UGameFeatureAction_AddInputContextMapping");
static_assert(sizeof(UGameFeatureAction_AddInputContextMapping) == 0x0000E0, "Wrong size on UGameFeatureAction_AddInputContextMapping");
static_assert(offsetof(UGameFeatureAction_AddInputContextMapping, InputMappings) == 0x000078, "Member 'UGameFeatureAction_AddInputContextMapping::InputMappings' has a wrong offset!");

// Class IWExperiences_IWInput.IWExperiences_IWInputSettings
// 0x0028 (0x0050 - 0x0028)
class UIWExperiences_IWInputSettings final : public UObject
{
public:
	TSoftObjectPtr<class UInputConfig>            InputConfig;                                       // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IWExperiences_IWInputSettings">();
	}
	static class UIWExperiences_IWInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIWExperiences_IWInputSettings>();
	}
};
static_assert(alignof(UIWExperiences_IWInputSettings) == 0x000008, "Wrong alignment on UIWExperiences_IWInputSettings");
static_assert(sizeof(UIWExperiences_IWInputSettings) == 0x000050, "Wrong size on UIWExperiences_IWInputSettings");
static_assert(offsetof(UIWExperiences_IWInputSettings, InputConfig) == 0x000028, "Member 'UIWExperiences_IWInputSettings::InputConfig' has a wrong offset!");

// Class IWExperiences_IWInput.PawnInputExtensionComponent
// 0x0008 (0x00B0 - 0x00A8)
class UPawnInputExtensionComponent final : public UIWPawnComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PawnInputExtensionComponent">();
	}
	static class UPawnInputExtensionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPawnInputExtensionComponent>();
	}
};
static_assert(alignof(UPawnInputExtensionComponent) == 0x000008, "Wrong alignment on UPawnInputExtensionComponent");
static_assert(sizeof(UPawnInputExtensionComponent) == 0x0000B0, "Wrong size on UPawnInputExtensionComponent");

}

