#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWExperiences_IWInput

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct IWExperiences_IWInput.InputMappingContextAndPriority
// 0x0018 (0x0018 - 0x0000)
struct FInputMappingContextAndPriority final
{
public:
	class UInputMappingContext*                   InputMapping;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControllerPlatform;                                // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterWithSettings;                             // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInputMappingContextAndPriority) == 0x000008, "Wrong alignment on FInputMappingContextAndPriority");
static_assert(sizeof(FInputMappingContextAndPriority) == 0x000018, "Wrong size on FInputMappingContextAndPriority");
static_assert(offsetof(FInputMappingContextAndPriority, InputMapping) == 0x000000, "Member 'FInputMappingContextAndPriority::InputMapping' has a wrong offset!");
static_assert(offsetof(FInputMappingContextAndPriority, Priority) == 0x000008, "Member 'FInputMappingContextAndPriority::Priority' has a wrong offset!");
static_assert(offsetof(FInputMappingContextAndPriority, ControllerPlatform) == 0x00000C, "Member 'FInputMappingContextAndPriority::ControllerPlatform' has a wrong offset!");
static_assert(offsetof(FInputMappingContextAndPriority, bRegisterWithSettings) == 0x000014, "Member 'FInputMappingContextAndPriority::bRegisterWithSettings' has a wrong offset!");

}

