#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWOnlineServices

#include "Basic.hpp"

#include "IWOnlineServices_structs.hpp"


namespace SDK::Params
{

// Function IWOnlineServices.ArmadaOnlineServiceHandler.OnGSDKHealthCheck
// 0x0001 (0x0001 - 0x0000)
struct ArmadaOnlineServiceHandler_OnGSDKHealthCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArmadaOnlineServiceHandler_OnGSDKHealthCheck) == 0x000001, "Wrong alignment on ArmadaOnlineServiceHandler_OnGSDKHealthCheck");
static_assert(sizeof(ArmadaOnlineServiceHandler_OnGSDKHealthCheck) == 0x000001, "Wrong size on ArmadaOnlineServiceHandler_OnGSDKHealthCheck");
static_assert(offsetof(ArmadaOnlineServiceHandler_OnGSDKHealthCheck, ReturnValue) == 0x000000, "Member 'ArmadaOnlineServiceHandler_OnGSDKHealthCheck::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.AsyncAction_ResolvePartyState.ResolvePartyState
// 0x0010 (0x0010 - 0x0000)
struct AsyncAction_ResolvePartyState_ResolvePartyState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ResolvePartyState*         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_ResolvePartyState_ResolvePartyState) == 0x000008, "Wrong alignment on AsyncAction_ResolvePartyState_ResolvePartyState");
static_assert(sizeof(AsyncAction_ResolvePartyState_ResolvePartyState) == 0x000010, "Wrong size on AsyncAction_ResolvePartyState_ResolvePartyState");
static_assert(offsetof(AsyncAction_ResolvePartyState_ResolvePartyState, WorldContextObject) == 0x000000, "Member 'AsyncAction_ResolvePartyState_ResolvePartyState::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_ResolvePartyState_ResolvePartyState, ReturnValue) == 0x000008, "Member 'AsyncAction_ResolvePartyState_ResolvePartyState::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.IdentityOnlineServiceHandler.GetClientLoginState
// 0x0010 (0x0010 - 0x0000)
struct IdentityOnlineServiceHandler_GetClientLoginState final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClientIdentityLoginState                     ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IdentityOnlineServiceHandler_GetClientLoginState) == 0x000008, "Wrong alignment on IdentityOnlineServiceHandler_GetClientLoginState");
static_assert(sizeof(IdentityOnlineServiceHandler_GetClientLoginState) == 0x000010, "Wrong size on IdentityOnlineServiceHandler_GetClientLoginState");
static_assert(offsetof(IdentityOnlineServiceHandler_GetClientLoginState, WorldContextObject) == 0x000000, "Member 'IdentityOnlineServiceHandler_GetClientLoginState::WorldContextObject' has a wrong offset!");
static_assert(offsetof(IdentityOnlineServiceHandler_GetClientLoginState, ReturnValue) == 0x000008, "Member 'IdentityOnlineServiceHandler_GetClientLoginState::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.IdentityOnlineServiceHandler.K2_GetMasterAccountId
// 0x0018 (0x0018 - 0x0000)
struct IdentityOnlineServiceHandler_K2_GetMasterAccountId final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IdentityOnlineServiceHandler_K2_GetMasterAccountId) == 0x000008, "Wrong alignment on IdentityOnlineServiceHandler_K2_GetMasterAccountId");
static_assert(sizeof(IdentityOnlineServiceHandler_K2_GetMasterAccountId) == 0x000018, "Wrong size on IdentityOnlineServiceHandler_K2_GetMasterAccountId");
static_assert(offsetof(IdentityOnlineServiceHandler_K2_GetMasterAccountId, WorldContextObject) == 0x000000, "Member 'IdentityOnlineServiceHandler_K2_GetMasterAccountId::WorldContextObject' has a wrong offset!");
static_assert(offsetof(IdentityOnlineServiceHandler_K2_GetMasterAccountId, ReturnValue) == 0x000008, "Member 'IdentityOnlineServiceHandler_K2_GetMasterAccountId::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.IdentityOnlineServiceHandler.K2_IsLoggedIn
// 0x0010 (0x0010 - 0x0000)
struct IdentityOnlineServiceHandler_K2_IsLoggedIn final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IdentityOnlineServiceHandler_K2_IsLoggedIn) == 0x000008, "Wrong alignment on IdentityOnlineServiceHandler_K2_IsLoggedIn");
static_assert(sizeof(IdentityOnlineServiceHandler_K2_IsLoggedIn) == 0x000010, "Wrong size on IdentityOnlineServiceHandler_K2_IsLoggedIn");
static_assert(offsetof(IdentityOnlineServiceHandler_K2_IsLoggedIn, WorldContextObject) == 0x000000, "Member 'IdentityOnlineServiceHandler_K2_IsLoggedIn::WorldContextObject' has a wrong offset!");
static_assert(offsetof(IdentityOnlineServiceHandler_K2_IsLoggedIn, ReturnValue) == 0x000008, "Member 'IdentityOnlineServiceHandler_K2_IsLoggedIn::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.IWOnlineServicesGameInstanceSubsystem.GetLocalUserID
// 0x0010 (0x0010 - 0x0000)
struct IWOnlineServicesGameInstanceSubsystem_GetLocalUserID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IWOnlineServicesGameInstanceSubsystem_GetLocalUserID) == 0x000008, "Wrong alignment on IWOnlineServicesGameInstanceSubsystem_GetLocalUserID");
static_assert(sizeof(IWOnlineServicesGameInstanceSubsystem_GetLocalUserID) == 0x000010, "Wrong size on IWOnlineServicesGameInstanceSubsystem_GetLocalUserID");
static_assert(offsetof(IWOnlineServicesGameInstanceSubsystem_GetLocalUserID, ReturnValue) == 0x000000, "Member 'IWOnlineServicesGameInstanceSubsystem_GetLocalUserID::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.QualityOfServiceOnlineServiceHandler.GetRegionName
// 0x0018 (0x0018 - 0x0000)
struct QualityOfServiceOnlineServiceHandler_GetRegionName final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(QualityOfServiceOnlineServiceHandler_GetRegionName) == 0x000008, "Wrong alignment on QualityOfServiceOnlineServiceHandler_GetRegionName");
static_assert(sizeof(QualityOfServiceOnlineServiceHandler_GetRegionName) == 0x000018, "Wrong size on QualityOfServiceOnlineServiceHandler_GetRegionName");
static_assert(offsetof(QualityOfServiceOnlineServiceHandler_GetRegionName, WorldContextObject) == 0x000000, "Member 'QualityOfServiceOnlineServiceHandler_GetRegionName::WorldContextObject' has a wrong offset!");
static_assert(offsetof(QualityOfServiceOnlineServiceHandler_GetRegionName, ReturnValue) == 0x000008, "Member 'QualityOfServiceOnlineServiceHandler_GetRegionName::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.ServerAuthOnlineServiceHandler.GetServerLoginState
// 0x0010 (0x0010 - 0x0000)
struct ServerAuthOnlineServiceHandler_GetServerLoginState final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EServerAuthLoginState                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ServerAuthOnlineServiceHandler_GetServerLoginState) == 0x000008, "Wrong alignment on ServerAuthOnlineServiceHandler_GetServerLoginState");
static_assert(sizeof(ServerAuthOnlineServiceHandler_GetServerLoginState) == 0x000010, "Wrong size on ServerAuthOnlineServiceHandler_GetServerLoginState");
static_assert(offsetof(ServerAuthOnlineServiceHandler_GetServerLoginState, WorldContextObject) == 0x000000, "Member 'ServerAuthOnlineServiceHandler_GetServerLoginState::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ServerAuthOnlineServiceHandler_GetServerLoginState, ReturnValue) == 0x000008, "Member 'ServerAuthOnlineServiceHandler_GetServerLoginState::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.SessionOnlineServiceHandler.K2_GetMatchmakingState
// 0x0010 (0x0010 - 0x0000)
struct SessionOnlineServiceHandler_K2_GetMatchmakingState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchmakingState                             ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SessionOnlineServiceHandler_K2_GetMatchmakingState) == 0x000008, "Wrong alignment on SessionOnlineServiceHandler_K2_GetMatchmakingState");
static_assert(sizeof(SessionOnlineServiceHandler_K2_GetMatchmakingState) == 0x000010, "Wrong size on SessionOnlineServiceHandler_K2_GetMatchmakingState");
static_assert(offsetof(SessionOnlineServiceHandler_K2_GetMatchmakingState, WorldContextObject) == 0x000000, "Member 'SessionOnlineServiceHandler_K2_GetMatchmakingState::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SessionOnlineServiceHandler_K2_GetMatchmakingState, ReturnValue) == 0x000008, "Member 'SessionOnlineServiceHandler_K2_GetMatchmakingState::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.SessionOnlineServiceHandler.K2_IsMatchmaking
// 0x0010 (0x0010 - 0x0000)
struct SessionOnlineServiceHandler_K2_IsMatchmaking final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SessionOnlineServiceHandler_K2_IsMatchmaking) == 0x000008, "Wrong alignment on SessionOnlineServiceHandler_K2_IsMatchmaking");
static_assert(sizeof(SessionOnlineServiceHandler_K2_IsMatchmaking) == 0x000010, "Wrong size on SessionOnlineServiceHandler_K2_IsMatchmaking");
static_assert(offsetof(SessionOnlineServiceHandler_K2_IsMatchmaking, WorldContextObject) == 0x000000, "Member 'SessionOnlineServiceHandler_K2_IsMatchmaking::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SessionOnlineServiceHandler_K2_IsMatchmaking, ReturnValue) == 0x000008, "Member 'SessionOnlineServiceHandler_K2_IsMatchmaking::ReturnValue' has a wrong offset!");

// Function IWOnlineServices.SessionOnlineServiceHandler.K2_StartMatchmaking
// 0x0048 (0x0048 - 0x0000)
struct SessionOnlineServiceHandler_K2_StartMatchmaking final
{
public:
	struct FMatchmakingSettings                   InSettings;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SessionOnlineServiceHandler_K2_StartMatchmaking) == 0x000008, "Wrong alignment on SessionOnlineServiceHandler_K2_StartMatchmaking");
static_assert(sizeof(SessionOnlineServiceHandler_K2_StartMatchmaking) == 0x000048, "Wrong size on SessionOnlineServiceHandler_K2_StartMatchmaking");
static_assert(offsetof(SessionOnlineServiceHandler_K2_StartMatchmaking, InSettings) == 0x000000, "Member 'SessionOnlineServiceHandler_K2_StartMatchmaking::InSettings' has a wrong offset!");
static_assert(offsetof(SessionOnlineServiceHandler_K2_StartMatchmaking, WorldContextObject) == 0x000040, "Member 'SessionOnlineServiceHandler_K2_StartMatchmaking::WorldContextObject' has a wrong offset!");

}

