#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JP

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "IWAnalytics_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "JP_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GASIW_structs.hpp"
#include "GASIW_classes.hpp"
#include "IWOnlineServices_structs.hpp"
#include "IWOnlineServices_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "IWCore_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "ModularGameplayActors_classes.hpp"
#include "CommonUser_structs.hpp"
#include "CommonUser_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AudioMixer_structs.hpp"
#include "CommonGame_classes.hpp"
#include "NetCore_structs.hpp"
#include "AIModule_classes.hpp"
#include "Inventory_structs.hpp"
#include "Inventory_classes.hpp"
#include "CommonInput_structs.hpp"
#include "GameSettings_classes.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "InputCore_structs.hpp"
#include "IWExperiences_classes.hpp"
#include "TargetingSystem_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class JP.InitializationFlowStepBase
// 0x0058 (0x0080 - 0x0028)
class UInitializationFlowStepBase : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InitializationFlowStepBase">();
	}
	static class UInitializationFlowStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInitializationFlowStepBase>();
	}
};
static_assert(alignof(UInitializationFlowStepBase) == 0x000008, "Wrong alignment on UInitializationFlowStepBase");
static_assert(sizeof(UInitializationFlowStepBase) == 0x000080, "Wrong size on UInitializationFlowStepBase");

// Class JP.LobbyConfigurationSummaryWidget
// 0x0008 (0x02E8 - 0x02E0)
class ULobbyConfigurationSummaryWidget : public UUserWidget
{
public:
	TSubclassOf<class UMatchConfigurationWidget>  MatchConfigurationWidgetClass;                     // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ApplyViewModel(const struct FLobbyConfigurationSummaryViewModel& InModel);
	void HandleConfigurationChanged();
	void InspectConfiguration();

	bool CanUserEditConfiguration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LobbyConfigurationSummaryWidget">();
	}
	static class ULobbyConfigurationSummaryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyConfigurationSummaryWidget>();
	}
};
static_assert(alignof(ULobbyConfigurationSummaryWidget) == 0x000008, "Wrong alignment on ULobbyConfigurationSummaryWidget");
static_assert(sizeof(ULobbyConfigurationSummaryWidget) == 0x0002E8, "Wrong size on ULobbyConfigurationSummaryWidget");
static_assert(offsetof(ULobbyConfigurationSummaryWidget, MatchConfigurationWidgetClass) == 0x0002E0, "Member 'ULobbyConfigurationSummaryWidget::MatchConfigurationWidgetClass' has a wrong offset!");

// Class JP.AuthenticationInitializationStepBase
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStepBase : public UInitializationFlowStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStepBase">();
	}
	static class UAuthenticationInitializationStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStepBase>();
	}
};
static_assert(alignof(UAuthenticationInitializationStepBase) == 0x000008, "Wrong alignment on UAuthenticationInitializationStepBase");
static_assert(sizeof(UAuthenticationInitializationStepBase) == 0x000080, "Wrong size on UAuthenticationInitializationStepBase");

// Class JP.AsyncAction_GetCurrencyAmountWhenReady
// 0x0018 (0x0048 - 0x0030)
class UAsyncAction_GetCurrencyAmountWhenReady final : public UAsyncAction_OnlineServicesBase
{
public:
	FMulticastInlineDelegateProperty_             OnReady;                                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_GetCurrencyAmountWhenReady* GetCurrencyAmountWhenReady(class UObject* WorldContextObject, const struct FGameplayTag& CurrencyTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_GetCurrencyAmountWhenReady">();
	}
	static class UAsyncAction_GetCurrencyAmountWhenReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_GetCurrencyAmountWhenReady>();
	}
};
static_assert(alignof(UAsyncAction_GetCurrencyAmountWhenReady) == 0x000008, "Wrong alignment on UAsyncAction_GetCurrencyAmountWhenReady");
static_assert(sizeof(UAsyncAction_GetCurrencyAmountWhenReady) == 0x000048, "Wrong size on UAsyncAction_GetCurrencyAmountWhenReady");
static_assert(offsetof(UAsyncAction_GetCurrencyAmountWhenReady, OnReady) == 0x000030, "Member 'UAsyncAction_GetCurrencyAmountWhenReady::OnReady' has a wrong offset!");

// Class JP.SeasonPassRewardEntryWidgetBase
// 0x0000 (0x02E0 - 0x02E0)
class USeasonPassRewardEntryWidgetBase : public UUserWidget
{
public:
	void StartLoadGuard();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasonPassRewardEntryWidgetBase">();
	}
	static class USeasonPassRewardEntryWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasonPassRewardEntryWidgetBase>();
	}
};
static_assert(alignof(USeasonPassRewardEntryWidgetBase) == 0x000008, "Wrong alignment on USeasonPassRewardEntryWidgetBase");
static_assert(sizeof(USeasonPassRewardEntryWidgetBase) == 0x0002E0, "Wrong size on USeasonPassRewardEntryWidgetBase");

// Class JP.SeasonPassSingleRewardEntryWidget
// 0x0010 (0x02F0 - 0x02E0)
class USeasonPassSingleRewardEntryWidget : public USeasonPassRewardEntryWidgetBase
{
public:
	class UNamedSlot*                             Content;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class URewardContentFactory>      ContentFactory;                                    // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleRewardContentCreated(class UUserWidget* NewRewardWidget, ESeasonPassRewardType RewardType);
	void K2_HandleEmptyReward();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasonPassSingleRewardEntryWidget">();
	}
	static class USeasonPassSingleRewardEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasonPassSingleRewardEntryWidget>();
	}
};
static_assert(alignof(USeasonPassSingleRewardEntryWidget) == 0x000008, "Wrong alignment on USeasonPassSingleRewardEntryWidget");
static_assert(sizeof(USeasonPassSingleRewardEntryWidget) == 0x0002F0, "Wrong size on USeasonPassSingleRewardEntryWidget");
static_assert(offsetof(USeasonPassSingleRewardEntryWidget, Content) == 0x0002E0, "Member 'USeasonPassSingleRewardEntryWidget::Content' has a wrong offset!");
static_assert(offsetof(USeasonPassSingleRewardEntryWidget, ContentFactory) == 0x0002E8, "Member 'USeasonPassSingleRewardEntryWidget::ContentFactory' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_Login
// 0x0020 (0x00A0 - 0x0080)
class UAuthenticationInitializationStep_Login final : public UAuthenticationInitializationStepBase
{
public:
	uint8                                         Pad_80[0x20];                                      // 0x0080(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_Login">();
	}
	static class UAuthenticationInitializationStep_Login* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_Login>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_Login) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_Login");
static_assert(sizeof(UAuthenticationInitializationStep_Login) == 0x0000A0, "Wrong size on UAuthenticationInitializationStep_Login");

// Class JP.LyraBrightnessEditor
// 0x0050 (0x0480 - 0x0430)
class ULyraBrightnessEditor final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_430[0x20];                                     // 0x0430(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanCancel;                                        // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_451[0xF];                                      // 0x0451(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcher*                        Switcher_SafeZoneMessage;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Default;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Done;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleBackClicked();
	void HandleDoneClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LyraBrightnessEditor">();
	}
	static class ULyraBrightnessEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULyraBrightnessEditor>();
	}
};
static_assert(alignof(ULyraBrightnessEditor) == 0x000008, "Wrong alignment on ULyraBrightnessEditor");
static_assert(sizeof(ULyraBrightnessEditor) == 0x000480, "Wrong size on ULyraBrightnessEditor");
static_assert(offsetof(ULyraBrightnessEditor, bCanCancel) == 0x000450, "Member 'ULyraBrightnessEditor::bCanCancel' has a wrong offset!");
static_assert(offsetof(ULyraBrightnessEditor, Switcher_SafeZoneMessage) == 0x000460, "Member 'ULyraBrightnessEditor::Switcher_SafeZoneMessage' has a wrong offset!");
static_assert(offsetof(ULyraBrightnessEditor, RichText_Default) == 0x000468, "Member 'ULyraBrightnessEditor::RichText_Default' has a wrong offset!");
static_assert(offsetof(ULyraBrightnessEditor, Button_Back) == 0x000470, "Member 'ULyraBrightnessEditor::Button_Back' has a wrong offset!");
static_assert(offsetof(ULyraBrightnessEditor, Button_Done) == 0x000478, "Member 'ULyraBrightnessEditor::Button_Done' has a wrong offset!");

// Class JP.AsyncAction_LocalUserOnlineServicesBase
// 0x0000 (0x0030 - 0x0030)
class UAsyncAction_LocalUserOnlineServicesBase : public UAsyncAction_OnlineServicesBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_LocalUserOnlineServicesBase">();
	}
	static class UAsyncAction_LocalUserOnlineServicesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_LocalUserOnlineServicesBase>();
	}
};
static_assert(alignof(UAsyncAction_LocalUserOnlineServicesBase) == 0x000008, "Wrong alignment on UAsyncAction_LocalUserOnlineServicesBase");
static_assert(sizeof(UAsyncAction_LocalUserOnlineServicesBase) == 0x000030, "Wrong size on UAsyncAction_LocalUserOnlineServicesBase");

// Class JP.AsyncAction_GetProfileXPWhenReady
// 0x0010 (0x0040 - 0x0030)
class UAsyncAction_GetProfileXPWhenReady final : public UAsyncAction_LocalUserOnlineServicesBase
{
public:
	FMulticastInlineDelegateProperty_             OnReady;                                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAsyncAction_GetProfileXPWhenReady* GetProfileXPWhenReady(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_GetProfileXPWhenReady">();
	}
	static class UAsyncAction_GetProfileXPWhenReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_GetProfileXPWhenReady>();
	}
};
static_assert(alignof(UAsyncAction_GetProfileXPWhenReady) == 0x000008, "Wrong alignment on UAsyncAction_GetProfileXPWhenReady");
static_assert(sizeof(UAsyncAction_GetProfileXPWhenReady) == 0x000040, "Wrong size on UAsyncAction_GetProfileXPWhenReady");
static_assert(offsetof(UAsyncAction_GetProfileXPWhenReady, OnReady) == 0x000030, "Member 'UAsyncAction_GetProfileXPWhenReady::OnReady' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_StoreAgreedEulaVersion
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_StoreAgreedEulaVersion final : public UAuthenticationInitializationStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_StoreAgreedEulaVersion">();
	}
	static class UAuthenticationInitializationStep_StoreAgreedEulaVersion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_StoreAgreedEulaVersion>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_StoreAgreedEulaVersion) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_StoreAgreedEulaVersion");
static_assert(sizeof(UAuthenticationInitializationStep_StoreAgreedEulaVersion) == 0x000080, "Wrong size on UAuthenticationInitializationStep_StoreAgreedEulaVersion");

// Class JP.PartyInviteWrapper
// 0x0020 (0x0048 - 0x0028)
class UPartyInviteWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyInviteWrapper">();
	}
	static class UPartyInviteWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyInviteWrapper>();
	}
};
static_assert(alignof(UPartyInviteWrapper) == 0x000008, "Wrong alignment on UPartyInviteWrapper");
static_assert(sizeof(UPartyInviteWrapper) == 0x000048, "Wrong size on UPartyInviteWrapper");

// Class JP.BaseCoordinator
// 0x0018 (0x0040 - 0x0028)
class UBaseCoordinator : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TDelegate<void(class UBaseCoordinator* Coordinator)>> OnceCallbacks;                                     // 0x0030(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCoordinator">();
	}
	static class UBaseCoordinator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCoordinator>();
	}
};
static_assert(alignof(UBaseCoordinator) == 0x000008, "Wrong alignment on UBaseCoordinator");
static_assert(sizeof(UBaseCoordinator) == 0x000040, "Wrong size on UBaseCoordinator");
static_assert(offsetof(UBaseCoordinator, OnceCallbacks) == 0x000030, "Member 'UBaseCoordinator::OnceCallbacks' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_CacheCurrencyData
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_CacheCurrencyData final : public UAuthenticationInitializationStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_CacheCurrencyData">();
	}
	static class UAuthenticationInitializationStep_CacheCurrencyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_CacheCurrencyData>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_CacheCurrencyData) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_CacheCurrencyData");
static_assert(sizeof(UAuthenticationInitializationStep_CacheCurrencyData) == 0x000080, "Wrong size on UAuthenticationInitializationStep_CacheCurrencyData");

// Class JP.LyraSettingsShared
// 0x0078 (0x00D0 - 0x0058)
class ULyraSettingsShared final : public ULocalPlayerSaveGame
{
public:
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	EColorBlindMode                               ColorBlindMode;                                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ColorBlindStrength;                                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bForceFeedbackEnabled;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GamepadMoveStickDeadZone;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GamepadLookStickDeadZone;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTriggerHapticsEnabled;                            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTriggerPullUsesHapticThreshold;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         TriggerHapticStrength;                             // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         TriggerHapticStartPosition;                        // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELyraAllowBackgroundAudioSetting              AllowAudioInBackground;                            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PendingCulture;                                    // 0x0090(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MouseSensitivityX;                                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        MouseSensitivityY;                                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        TargetingMultiplier;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertVerticalAxis;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertHorizontalAxis;                             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELyraGamepadSensitivity                       GamepadLookSensitivityPreset;                      // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELyraGamepadSensitivity                       GamepadTargetingSensitivityPreset;                 // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FieldOfView;                                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAllowAudioInBackgroundSetting(ELyraAllowBackgroundAudioSetting NewValue);
	void SetColorBlindMode(EColorBlindMode InMode);
	void SetColorBlindStrength(int32 InColorBlindStrength);
	void SetForceFeedbackEnabled(const bool NewValue);
	void SetFOV(float NewValue);
	void SetGamepadLookStickDeadZone(const float NewValue);
	void SetGamepadMoveStickDeadZone(const float NewValue);
	void SetGamepadTargetingSensitivityPreset(ELyraGamepadSensitivity NewValue);
	void SetInvertHorizontalAxis(bool NewValue);
	void SetInvertHorizontalAxisMouse(bool NewValue);
	void SetInvertVerticalAxis(bool NewValue);
	void SetInvertVerticalAxisMouse(bool NewValue);
	void SetLookSensitivityPreset(ELyraGamepadSensitivity NewValue);
	void SetMouseSensitivityX(double NewValue);
	void SetMouseSensitivityY(double NewValue);
	void SetTargetingMultiplier(double NewValue);
	void SetTriggerHapticsEnabled(const bool NewValue);
	void SetTriggerHapticStartPosition(const uint8 NewValue);
	void SetTriggerHapticStrength(const uint8 NewValue);
	void SetTriggerPullUsesHapticThreshold(const bool NewValue);

	ELyraAllowBackgroundAudioSetting GetAllowAudioInBackgroundSetting() const;
	EColorBlindMode GetColorBlindMode() const;
	int32 GetColorBlindStrength() const;
	bool GetForceFeedbackEnabled() const;
	float GetFOV() const;
	ELyraGamepadSensitivity GetGamepadLookSensitivityPreset() const;
	float GetGamepadLookStickDeadZone() const;
	float GetGamepadMoveStickDeadZone() const;
	ELyraGamepadSensitivity GetGamepadTargetingSensitivityPreset() const;
	bool GetInvertHorizontalAxis() const;
	bool GetInvertHorizontalAxisMouse() const;
	bool GetInvertVerticalAxis() const;
	bool GetInvertVerticalAxisMouse() const;
	double GetMouseSensitivityX() const;
	double GetMouseSensitivityY() const;
	double GetTargetingMultiplier() const;
	bool GetTriggerHapticsEnabled() const;
	uint8 GetTriggerHapticStartPosition() const;
	uint8 GetTriggerHapticStrength() const;
	bool GetTriggerPullUsesHapticThreshold() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LyraSettingsShared">();
	}
	static class ULyraSettingsShared* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULyraSettingsShared>();
	}
};
static_assert(alignof(ULyraSettingsShared) == 0x000008, "Wrong alignment on ULyraSettingsShared");
static_assert(sizeof(ULyraSettingsShared) == 0x0000D0, "Wrong size on ULyraSettingsShared");
static_assert(offsetof(ULyraSettingsShared, ColorBlindMode) == 0x000070, "Member 'ULyraSettingsShared::ColorBlindMode' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, ColorBlindStrength) == 0x000074, "Member 'ULyraSettingsShared::ColorBlindStrength' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, bForceFeedbackEnabled) == 0x000078, "Member 'ULyraSettingsShared::bForceFeedbackEnabled' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, GamepadMoveStickDeadZone) == 0x00007C, "Member 'ULyraSettingsShared::GamepadMoveStickDeadZone' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, GamepadLookStickDeadZone) == 0x000080, "Member 'ULyraSettingsShared::GamepadLookStickDeadZone' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, bTriggerHapticsEnabled) == 0x000084, "Member 'ULyraSettingsShared::bTriggerHapticsEnabled' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, bTriggerPullUsesHapticThreshold) == 0x000085, "Member 'ULyraSettingsShared::bTriggerPullUsesHapticThreshold' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, TriggerHapticStrength) == 0x000086, "Member 'ULyraSettingsShared::TriggerHapticStrength' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, TriggerHapticStartPosition) == 0x000087, "Member 'ULyraSettingsShared::TriggerHapticStartPosition' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, AllowAudioInBackground) == 0x000088, "Member 'ULyraSettingsShared::AllowAudioInBackground' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, PendingCulture) == 0x000090, "Member 'ULyraSettingsShared::PendingCulture' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, MouseSensitivityX) == 0x0000A8, "Member 'ULyraSettingsShared::MouseSensitivityX' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, MouseSensitivityY) == 0x0000B0, "Member 'ULyraSettingsShared::MouseSensitivityY' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, TargetingMultiplier) == 0x0000B8, "Member 'ULyraSettingsShared::TargetingMultiplier' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, bInvertVerticalAxis) == 0x0000C0, "Member 'ULyraSettingsShared::bInvertVerticalAxis' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, bInvertHorizontalAxis) == 0x0000C1, "Member 'ULyraSettingsShared::bInvertHorizontalAxis' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, GamepadLookSensitivityPreset) == 0x0000C2, "Member 'ULyraSettingsShared::GamepadLookSensitivityPreset' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, GamepadTargetingSensitivityPreset) == 0x0000C3, "Member 'ULyraSettingsShared::GamepadTargetingSensitivityPreset' has a wrong offset!");
static_assert(offsetof(ULyraSettingsShared, FieldOfView) == 0x0000C4, "Member 'ULyraSettingsShared::FieldOfView' has a wrong offset!");

// Class JP.ArmorAttributeSet
// 0x0020 (0x0050 - 0x0030)
class UArmorAttributeSet final : public UAttributeSetIW
{
public:
	struct FGameplayAttributeData                 MeleeArmor;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 ProjectileArmor;                                   // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_MeleeArmor();
	void OnRep_ProjectileArmor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArmorAttributeSet">();
	}
	static class UArmorAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmorAttributeSet>();
	}
};
static_assert(alignof(UArmorAttributeSet) == 0x000008, "Wrong alignment on UArmorAttributeSet");
static_assert(sizeof(UArmorAttributeSet) == 0x000050, "Wrong size on UArmorAttributeSet");
static_assert(offsetof(UArmorAttributeSet, MeleeArmor) == 0x000030, "Member 'UArmorAttributeSet::MeleeArmor' has a wrong offset!");
static_assert(offsetof(UArmorAttributeSet, ProjectileArmor) == 0x000040, "Member 'UArmorAttributeSet::ProjectileArmor' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_CacheStoreData
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_CacheStoreData final : public UAuthenticationInitializationStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_CacheStoreData">();
	}
	static class UAuthenticationInitializationStep_CacheStoreData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_CacheStoreData>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_CacheStoreData) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_CacheStoreData");
static_assert(sizeof(UAuthenticationInitializationStep_CacheStoreData) == 0x000080, "Wrong size on UAuthenticationInitializationStep_CacheStoreData");

// Class JP.AnimNotify_PlaySoundForPerspective
// 0x0018 (0x0070 - 0x0058)
class UAnimNotify_PlaySoundForPerspective final : public UAnimNotify_PlaySound
{
public:
	bool                                          bPlayForFirstPersonPerspective;                    // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenMontageEnds;                              // 0x0059(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0060(0x0008)(ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           BoundMontage;                                      // 0x0068(0x0008)(BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlaySoundForPerspective">();
	}
	static class UAnimNotify_PlaySoundForPerspective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlaySoundForPerspective>();
	}
};
static_assert(alignof(UAnimNotify_PlaySoundForPerspective) == 0x000008, "Wrong alignment on UAnimNotify_PlaySoundForPerspective");
static_assert(sizeof(UAnimNotify_PlaySoundForPerspective) == 0x000070, "Wrong size on UAnimNotify_PlaySoundForPerspective");
static_assert(offsetof(UAnimNotify_PlaySoundForPerspective, bPlayForFirstPersonPerspective) == 0x000058, "Member 'UAnimNotify_PlaySoundForPerspective::bPlayForFirstPersonPerspective' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundForPerspective, bStopWhenMontageEnds) == 0x000059, "Member 'UAnimNotify_PlaySoundForPerspective::bStopWhenMontageEnds' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundForPerspective, AudioComponent) == 0x000060, "Member 'UAnimNotify_PlaySoundForPerspective::AudioComponent' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundForPerspective, BoundMontage) == 0x000068, "Member 'UAnimNotify_PlaySoundForPerspective::BoundMontage' has a wrong offset!");

// Class JP.SeasonPassRewardWidgetCatalogItemInterface
// 0x0000 (0x0028 - 0x0028)
class ISeasonPassRewardWidgetCatalogItemInterface final : public IInterface
{
public:
	void ApplyCatalogItemData(const struct FSeasonPassCatalogItem& Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SeasonPassRewardWidgetCatalogItemInterface">();
	}
	static class ISeasonPassRewardWidgetCatalogItemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISeasonPassRewardWidgetCatalogItemInterface>();
	}
};
static_assert(alignof(ISeasonPassRewardWidgetCatalogItemInterface) == 0x000008, "Wrong alignment on ISeasonPassRewardWidgetCatalogItemInterface");
static_assert(sizeof(ISeasonPassRewardWidgetCatalogItemInterface) == 0x000028, "Wrong size on ISeasonPassRewardWidgetCatalogItemInterface");

// Class JP.AuthenticationInitializationStep_AccountData
// 0x0008 (0x0088 - 0x0080)
class UAuthenticationInitializationStep_AccountData final : public UAuthenticationInitializationStepBase
{
public:
	class UIdentityOnlineServiceHandler*          IdentityHandler;                                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleUserAvatarLoaded(bool bInWasSuccessful, TSoftObjectPtr<class UTexture> InResultTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_AccountData">();
	}
	static class UAuthenticationInitializationStep_AccountData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_AccountData>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_AccountData) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_AccountData");
static_assert(sizeof(UAuthenticationInitializationStep_AccountData) == 0x000088, "Wrong size on UAuthenticationInitializationStep_AccountData");
static_assert(offsetof(UAuthenticationInitializationStep_AccountData, IdentityHandler) == 0x000080, "Member 'UAuthenticationInitializationStep_AccountData::IdentityHandler' has a wrong offset!");

// Class JP.EndCondition
// 0x0018 (0x02A8 - 0x0290)
class AEndCondition : public AInfo
{
public:
	class FText                                   EliminationDescription;                            // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   EndConditionName;                                  // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void EliminateTeam(uint8 TeamId);

	class FName GetEndConditionName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndCondition">();
	}
	static class AEndCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndCondition>();
	}
};
static_assert(alignof(AEndCondition) == 0x000008, "Wrong alignment on AEndCondition");
static_assert(sizeof(AEndCondition) == 0x0002A8, "Wrong size on AEndCondition");
static_assert(offsetof(AEndCondition, EliminationDescription) == 0x000290, "Member 'AEndCondition::EliminationDescription' has a wrong offset!");
static_assert(offsetof(AEndCondition, EndConditionName) == 0x0002A0, "Member 'AEndCondition::EndConditionName' has a wrong offset!");

// Class JP.TeamColorFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTeamColorFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static uint8 GetLocalPlayerTeamId(class UObject* WorldContext);
	static struct FLinearColor GetTeamColorForTeamId(class UObject* WorldContext, uint8 TeamId);
	static struct FLinearColor GetTeamColorForTeamType(ETeamType TeamType);
	static uint8 GetTeamIdFromTeamType(class UObject* WorldContext, ETeamType TeamType);
	static uint8 GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView(class APlayerController* PlayerController, ETeamType TeamTypeToConvert);
	static ETeamType GetTeamTypeFromTeamId(class UObject* WorldContext, uint8 TeamId);
	static ETeamType GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView(class APlayerController* PlayerController, uint8 TeamIdToConvert);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TeamColorFunctionLibrary">();
	}
	static class UTeamColorFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamColorFunctionLibrary>();
	}
};
static_assert(alignof(UTeamColorFunctionLibrary) == 0x000008, "Wrong alignment on UTeamColorFunctionLibrary");
static_assert(sizeof(UTeamColorFunctionLibrary) == 0x000028, "Wrong size on UTeamColorFunctionLibrary");

// Class JP.AuthenticationInitializationStep_GameData
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_GameData final : public UAuthenticationInitializationStepBase
{
public:
	void OnFinishedUpdatingGameData();
	void OnLoggedIn();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_GameData">();
	}
	static class UAuthenticationInitializationStep_GameData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_GameData>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_GameData) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_GameData");
static_assert(sizeof(UAuthenticationInitializationStep_GameData) == 0x000080, "Wrong size on UAuthenticationInitializationStep_GameData");

// Class JP.SocialListWidget
// 0x0048 (0x0328 - 0x02E0)
class USocialListWidget : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UNamedSlot*                             ListSlot;                                          // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Header;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       CollapsedToPartyWidgetAnimation;                   // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       CollapsedToFillWidgetAnimation;                    // 0x0308(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       CollapsedToFullWidgetAnimation;                    // 0x0310(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       FillToFullWidgetAnimation;                         // 0x0318(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlueprintApplyListStateNoAnimation(const ESocialListState InListState);
	void SetHeader(const class FString& StringToAppend);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListWidget">();
	}
	static class USocialListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListWidget>();
	}
};
static_assert(alignof(USocialListWidget) == 0x000008, "Wrong alignment on USocialListWidget");
static_assert(sizeof(USocialListWidget) == 0x000328, "Wrong size on USocialListWidget");
static_assert(offsetof(USocialListWidget, ListSlot) == 0x0002E8, "Member 'USocialListWidget::ListSlot' has a wrong offset!");
static_assert(offsetof(USocialListWidget, Header) == 0x0002F0, "Member 'USocialListWidget::Header' has a wrong offset!");
static_assert(offsetof(USocialListWidget, CollapsedToPartyWidgetAnimation) == 0x000300, "Member 'USocialListWidget::CollapsedToPartyWidgetAnimation' has a wrong offset!");
static_assert(offsetof(USocialListWidget, CollapsedToFillWidgetAnimation) == 0x000308, "Member 'USocialListWidget::CollapsedToFillWidgetAnimation' has a wrong offset!");
static_assert(offsetof(USocialListWidget, CollapsedToFullWidgetAnimation) == 0x000310, "Member 'USocialListWidget::CollapsedToFullWidgetAnimation' has a wrong offset!");
static_assert(offsetof(USocialListWidget, FillToFullWidgetAnimation) == 0x000318, "Member 'USocialListWidget::FillToFullWidgetAnimation' has a wrong offset!");

// Class JP.AssetManagerJP
// 0x0000 (0x04D0 - 0x04D0)
class UAssetManagerJP final : public UAssetManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetManagerJP">();
	}
	static class UAssetManagerJP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetManagerJP>();
	}
};
static_assert(alignof(UAssetManagerJP) == 0x000008, "Wrong alignment on UAssetManagerJP");
static_assert(sizeof(UAssetManagerJP) == 0x0004D0, "Wrong size on UAssetManagerJP");

// Class JP.AuthenticationInitializationStep_ValidateFirstTimeLoginRewards
// 0x00C8 (0x0148 - 0x0080)
class UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards final : public UAuthenticationInitializationStepBase
{
public:
	uint8                                         Pad_80[0xC8];                                      // 0x0080(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_ValidateFirstTimeLoginRewards">();
	}
	static class UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards");
static_assert(sizeof(UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards) == 0x000148, "Wrong size on UAuthenticationInitializationStep_ValidateFirstTimeLoginRewards");

// Class JP.LyraActionWidget
// 0x0000 (0x0490 - 0x0490)
class ULyraActionWidget final : public UCommonActionWidget
{
public:
	class UInputAction*                           AssociatedInputAction;                             // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LyraActionWidget">();
	}
	static class ULyraActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULyraActionWidget>();
	}
};
static_assert(alignof(ULyraActionWidget) == 0x000010, "Wrong alignment on ULyraActionWidget");
static_assert(sizeof(ULyraActionWidget) == 0x000490, "Wrong size on ULyraActionWidget");
static_assert(offsetof(ULyraActionWidget, AssociatedInputAction) == 0x000488, "Member 'ULyraActionWidget::AssociatedInputAction' has a wrong offset!");

// Class JP.AchievementStatMetaData
// 0x0010 (0x0040 - 0x0030)
class UAchievementStatMetaData final : public UPrimaryDataAsset
{
public:
	class FName                                   AchievementStatAPIName;                            // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAchievementStatUpdateMethod                  UpdateMethod;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementStatMetaData">();
	}
	static class UAchievementStatMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementStatMetaData>();
	}
};
static_assert(alignof(UAchievementStatMetaData) == 0x000008, "Wrong alignment on UAchievementStatMetaData");
static_assert(sizeof(UAchievementStatMetaData) == 0x000040, "Wrong size on UAchievementStatMetaData");
static_assert(offsetof(UAchievementStatMetaData, AchievementStatAPIName) == 0x000030, "Member 'UAchievementStatMetaData::AchievementStatAPIName' has a wrong offset!");
static_assert(offsetof(UAchievementStatMetaData, UpdateMethod) == 0x000038, "Member 'UAchievementStatMetaData::UpdateMethod' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_SeasonPass
// 0x0078 (0x00F8 - 0x0080)
class UAuthenticationInitializationStep_SeasonPass final : public UAuthenticationInitializationStepBase
{
public:
	uint8                                         Pad_80[0x78];                                      // 0x0080(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_SeasonPass">();
	}
	static class UAuthenticationInitializationStep_SeasonPass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_SeasonPass>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_SeasonPass) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_SeasonPass");
static_assert(sizeof(UAuthenticationInitializationStep_SeasonPass) == 0x0000F8, "Wrong size on UAuthenticationInitializationStep_SeasonPass");

// Class JP.AchievementsGameInstanceSubsystem
// 0x0008 (0x0038 - 0x0030)
class UAchievementsGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetAchievements();
	void UnlockAchievement(const TSoftObjectPtr<class UAchievementMetaData> AchievementMetaData);
	void UpdateAchievementStatFloat(const TSoftObjectPtr<class UAchievementStatMetaData> AchievementStatMetaData, const float StatValue);
	void UpdateAchievementStatInt(const TSoftObjectPtr<class UAchievementStatMetaData> AchievementStatMetaData, const int32 StatValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementsGameInstanceSubsystem">();
	}
	static class UAchievementsGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementsGameInstanceSubsystem>();
	}
};
static_assert(alignof(UAchievementsGameInstanceSubsystem) == 0x000008, "Wrong alignment on UAchievementsGameInstanceSubsystem");
static_assert(sizeof(UAchievementsGameInstanceSubsystem) == 0x000038, "Wrong size on UAchievementsGameInstanceSubsystem");

// Class JP.TeamableInterface
// 0x0000 (0x0028 - 0x0028)
class ITeamableInterface final : public IInterface
{
public:
	struct FTeam GetTeam() const;
	uint8 GetTeamID() const;
	bool HasTeam() const;
	bool TakeDamageFromAllTeams() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TeamableInterface">();
	}
	static class ITeamableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITeamableInterface>();
	}
};
static_assert(alignof(ITeamableInterface) == 0x000008, "Wrong alignment on ITeamableInterface");
static_assert(sizeof(ITeamableInterface) == 0x000028, "Wrong size on ITeamableInterface");

// Class JP.AuthenticationInitializationStep_PlayerInventory
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_PlayerInventory final : public UAuthenticationInitializationStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_PlayerInventory">();
	}
	static class UAuthenticationInitializationStep_PlayerInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_PlayerInventory>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_PlayerInventory) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_PlayerInventory");
static_assert(sizeof(UAuthenticationInitializationStep_PlayerInventory) == 0x000080, "Wrong size on UAuthenticationInitializationStep_PlayerInventory");

// Class JP.JPCommonActivatableWidgetSwitcher
// 0x0010 (0x0250 - 0x0240)
class UJPCommonActivatableWidgetSwitcher final : public UCommonActivatableWidgetSwitcher
{
public:
	FMulticastInlineDelegateProperty_             BP_OnActiveWidgetIndexChanged;                     // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JPCommonActivatableWidgetSwitcher">();
	}
	static class UJPCommonActivatableWidgetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJPCommonActivatableWidgetSwitcher>();
	}
};
static_assert(alignof(UJPCommonActivatableWidgetSwitcher) == 0x000008, "Wrong alignment on UJPCommonActivatableWidgetSwitcher");
static_assert(sizeof(UJPCommonActivatableWidgetSwitcher) == 0x000250, "Wrong size on UJPCommonActivatableWidgetSwitcher");
static_assert(offsetof(UJPCommonActivatableWidgetSwitcher, BP_OnActiveWidgetIndexChanged) == 0x000240, "Member 'UJPCommonActivatableWidgetSwitcher::BP_OnActiveWidgetIndexChanged' has a wrong offset!");

// Class JP.AmmoAttributeSet
// 0x00A0 (0x00D0 - 0x0030)
class UAmmoAttributeSet final : public UAttributeSetIW
{
public:
	struct FGameplayAttributeData                 SlingshotAmmo;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 SlingshotMaxAmmo;                                  // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 OrangeCannonAmmo;                                  // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 OrangeCannonMaxAmmo;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 FireworkBoxAmmo;                                   // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 FireworkBoxMaxAmmo;                                // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WrenchAmmo;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 WrenchMaxAmmo;                                     // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x20];                                      // 0x00B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_FireworkBoxAmmo(const struct FGameplayAttributeData& OldFireworkBoxAmmo);
	void OnRep_FireworkBoxMaxAmmo(const struct FGameplayAttributeData& OldFireworkBoxAmmoMax);
	void OnRep_OrangeCannonAmmo(const struct FGameplayAttributeData& OldOrangeCannonAmmo);
	void OnRep_OrangeCannonMaxAmmo(const struct FGameplayAttributeData& OldOrangeCannonAmmoMax);
	void OnRep_SlingshotAmmo(const struct FGameplayAttributeData& OldSlingshotAmmo);
	void OnRep_SlingshotMaxAmmo(const struct FGameplayAttributeData& OldSlingshotAmmoMax);
	void OnRep_WrenchAmmo(const struct FGameplayAttributeData& OldWrenchAmmo);
	void OnRep_WrenchMaxAmmo(const struct FGameplayAttributeData& OldWrenchAmmoMax);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmmoAttributeSet">();
	}
	static class UAmmoAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmmoAttributeSet>();
	}
};
static_assert(alignof(UAmmoAttributeSet) == 0x000008, "Wrong alignment on UAmmoAttributeSet");
static_assert(sizeof(UAmmoAttributeSet) == 0x0000D0, "Wrong size on UAmmoAttributeSet");
static_assert(offsetof(UAmmoAttributeSet, SlingshotAmmo) == 0x000030, "Member 'UAmmoAttributeSet::SlingshotAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, SlingshotMaxAmmo) == 0x000040, "Member 'UAmmoAttributeSet::SlingshotMaxAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, OrangeCannonAmmo) == 0x000050, "Member 'UAmmoAttributeSet::OrangeCannonAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, OrangeCannonMaxAmmo) == 0x000060, "Member 'UAmmoAttributeSet::OrangeCannonMaxAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, FireworkBoxAmmo) == 0x000070, "Member 'UAmmoAttributeSet::FireworkBoxAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, FireworkBoxMaxAmmo) == 0x000080, "Member 'UAmmoAttributeSet::FireworkBoxMaxAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, WrenchAmmo) == 0x000090, "Member 'UAmmoAttributeSet::WrenchAmmo' has a wrong offset!");
static_assert(offsetof(UAmmoAttributeSet, WrenchMaxAmmo) == 0x0000A0, "Member 'UAmmoAttributeSet::WrenchMaxAmmo' has a wrong offset!");

// Class JP.AuthenticationInitializationStep_BattlePassItems
// 0x0000 (0x0080 - 0x0080)
class UAuthenticationInitializationStep_BattlePassItems final : public UAuthenticationInitializationStepBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationInitializationStep_BattlePassItems">();
	}
	static class UAuthenticationInitializationStep_BattlePassItems* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationInitializationStep_BattlePassItems>();
	}
};
static_assert(alignof(UAuthenticationInitializationStep_BattlePassItems) == 0x000008, "Wrong alignment on UAuthenticationInitializationStep_BattlePassItems");
static_assert(sizeof(UAuthenticationInitializationStep_BattlePassItems) == 0x000080, "Wrong size on UAuthenticationInitializationStep_BattlePassItems");

// Class JP.SocialFriendEntryWidget
// 0x0048 (0x0328 - 0x02E0)
class USocialFriendEntryWidget : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x20];                                     // 0x02E0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialUserEntryWidget*                 UserEntryWidget;                                   // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialFriendInteractionWidget*         InteractionWidget;                                 // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisualAttachment*                InviteSentWidget;                                  // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       InviteSentWidgetAnimation;                         // 0x0318(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFriendEntryViewModel*                  ViewModel;                                         // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void GetLocalizedStatusInfo(const EOnlineServicesFriendStatus Status, class FText* StatusText, struct FLinearColor* Color);
	void SetIsInviteSent(const bool bIsInviteSent);
	void SetStatus(const EOnlineServicesFriendStatus Status);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFriendEntryWidget">();
	}
	static class USocialFriendEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFriendEntryWidget>();
	}
};
static_assert(alignof(USocialFriendEntryWidget) == 0x000008, "Wrong alignment on USocialFriendEntryWidget");
static_assert(sizeof(USocialFriendEntryWidget) == 0x000328, "Wrong size on USocialFriendEntryWidget");
static_assert(offsetof(USocialFriendEntryWidget, UserEntryWidget) == 0x000300, "Member 'USocialFriendEntryWidget::UserEntryWidget' has a wrong offset!");
static_assert(offsetof(USocialFriendEntryWidget, InteractionWidget) == 0x000308, "Member 'USocialFriendEntryWidget::InteractionWidget' has a wrong offset!");
static_assert(offsetof(USocialFriendEntryWidget, InviteSentWidget) == 0x000310, "Member 'USocialFriendEntryWidget::InviteSentWidget' has a wrong offset!");
static_assert(offsetof(USocialFriendEntryWidget, InviteSentWidgetAnimation) == 0x000318, "Member 'USocialFriendEntryWidget::InviteSentWidgetAnimation' has a wrong offset!");
static_assert(offsetof(USocialFriendEntryWidget, ViewModel) == 0x000320, "Member 'USocialFriendEntryWidget::ViewModel' has a wrong offset!");

// Class JP.AsyncAction_WaitForClientAuthenticationInitialized
// 0x0010 (0x0040 - 0x0030)
class UAsyncAction_WaitForClientAuthenticationInitialized final : public UAsyncAction_OnlineServicesBase
{
public:
	FMulticastInlineDelegateProperty_             OnClientAuthenticationInitialized;                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAsyncAction_WaitForClientAuthenticationInitialized* WaitForClientAuthenticationInitialized(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_WaitForClientAuthenticationInitialized">();
	}
	static class UAsyncAction_WaitForClientAuthenticationInitialized* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_WaitForClientAuthenticationInitialized>();
	}
};
static_assert(alignof(UAsyncAction_WaitForClientAuthenticationInitialized) == 0x000008, "Wrong alignment on UAsyncAction_WaitForClientAuthenticationInitialized");
static_assert(sizeof(UAsyncAction_WaitForClientAuthenticationInitialized) == 0x000040, "Wrong size on UAsyncAction_WaitForClientAuthenticationInitialized");
static_assert(offsetof(UAsyncAction_WaitForClientAuthenticationInitialized, OnClientAuthenticationInitialized) == 0x000030, "Member 'UAsyncAction_WaitForClientAuthenticationInitialized::OnClientAuthenticationInitialized' has a wrong offset!");

// Class JP.PlayerControllerJPExtensionComponent
// 0x0000 (0x00A0 - 0x00A0)
class UPlayerControllerJPExtensionComponent final : public UPlayerControllerExtensionComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerControllerJPExtensionComponent">();
	}
	static class UPlayerControllerJPExtensionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerControllerJPExtensionComponent>();
	}
};
static_assert(alignof(UPlayerControllerJPExtensionComponent) == 0x000008, "Wrong alignment on UPlayerControllerJPExtensionComponent");
static_assert(sizeof(UPlayerControllerJPExtensionComponent) == 0x0000A0, "Wrong size on UPlayerControllerJPExtensionComponent");

// Class JP.AuthenticationInitializationStep_Neighbors
// 0x0000 (0x0080 - 0x0080)
