#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JP

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "IWOnlineServices_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "IWCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "NetCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "AudioCapture_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function JP.LobbyConfigurationSummaryWidget.ApplyViewModel
// 0x0001 (0x0001 - 0x0000)
struct LobbyConfigurationSummaryWidget_ApplyViewModel final
{
public:
	struct FLobbyConfigurationSummaryViewModel    InModel;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LobbyConfigurationSummaryWidget_ApplyViewModel) == 0x000001, "Wrong alignment on LobbyConfigurationSummaryWidget_ApplyViewModel");
static_assert(sizeof(LobbyConfigurationSummaryWidget_ApplyViewModel) == 0x000001, "Wrong size on LobbyConfigurationSummaryWidget_ApplyViewModel");
static_assert(offsetof(LobbyConfigurationSummaryWidget_ApplyViewModel, InModel) == 0x000000, "Member 'LobbyConfigurationSummaryWidget_ApplyViewModel::InModel' has a wrong offset!");

// Function JP.LobbyConfigurationSummaryWidget.CanUserEditConfiguration
// 0x0001 (0x0001 - 0x0000)
struct LobbyConfigurationSummaryWidget_CanUserEditConfiguration final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LobbyConfigurationSummaryWidget_CanUserEditConfiguration) == 0x000001, "Wrong alignment on LobbyConfigurationSummaryWidget_CanUserEditConfiguration");
static_assert(sizeof(LobbyConfigurationSummaryWidget_CanUserEditConfiguration) == 0x000001, "Wrong size on LobbyConfigurationSummaryWidget_CanUserEditConfiguration");
static_assert(offsetof(LobbyConfigurationSummaryWidget_CanUserEditConfiguration, ReturnValue) == 0x000000, "Member 'LobbyConfigurationSummaryWidget_CanUserEditConfiguration::ReturnValue' has a wrong offset!");

// Function JP.AsyncAction_GetCurrencyAmountWhenReady.GetCurrencyAmountWhenReady
// 0x0018 (0x0018 - 0x0000)
struct AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CurrencyTag;                                       // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_GetCurrencyAmountWhenReady* ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady) == 0x000008, "Wrong alignment on AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady");
static_assert(sizeof(AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady) == 0x000018, "Wrong size on AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady");
static_assert(offsetof(AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady, WorldContextObject) == 0x000000, "Member 'AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady, CurrencyTag) == 0x000008, "Member 'AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady::CurrencyTag' has a wrong offset!");
static_assert(offsetof(AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady, ReturnValue) == 0x000010, "Member 'AsyncAction_GetCurrencyAmountWhenReady_GetCurrencyAmountWhenReady::ReturnValue' has a wrong offset!");

// Function JP.SeasonPassSingleRewardEntryWidget.HandleRewardContentCreated
// 0x0010 (0x0010 - 0x0000)
struct SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated final
{
public:
	class UUserWidget*                            NewRewardWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESeasonPassRewardType                         RewardType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated) == 0x000008, "Wrong alignment on SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated");
static_assert(sizeof(SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated) == 0x000010, "Wrong size on SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated");
static_assert(offsetof(SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated, NewRewardWidget) == 0x000000, "Member 'SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated::NewRewardWidget' has a wrong offset!");
static_assert(offsetof(SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated, RewardType) == 0x000008, "Member 'SeasonPassSingleRewardEntryWidget_HandleRewardContentCreated::RewardType' has a wrong offset!");

// Function JP.AsyncAction_GetProfileXPWhenReady.GetProfileXPWhenReady
// 0x0010 (0x0010 - 0x0000)
struct AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_GetProfileXPWhenReady*     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady) == 0x000008, "Wrong alignment on AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady");
static_assert(sizeof(AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady) == 0x000010, "Wrong size on AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady");
static_assert(offsetof(AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady, WorldContextObject) == 0x000000, "Member 'AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady, ReturnValue) == 0x000008, "Member 'AsyncAction_GetProfileXPWhenReady_GetProfileXPWhenReady::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetAllowAudioInBackgroundSetting
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetAllowAudioInBackgroundSetting final
{
public:
	ELyraAllowBackgroundAudioSetting              NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetAllowAudioInBackgroundSetting) == 0x000001, "Wrong alignment on LyraSettingsShared_SetAllowAudioInBackgroundSetting");
static_assert(sizeof(LyraSettingsShared_SetAllowAudioInBackgroundSetting) == 0x000001, "Wrong size on LyraSettingsShared_SetAllowAudioInBackgroundSetting");
static_assert(offsetof(LyraSettingsShared_SetAllowAudioInBackgroundSetting, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetAllowAudioInBackgroundSetting::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetColorBlindMode
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetColorBlindMode final
{
public:
	EColorBlindMode                               InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetColorBlindMode) == 0x000001, "Wrong alignment on LyraSettingsShared_SetColorBlindMode");
static_assert(sizeof(LyraSettingsShared_SetColorBlindMode) == 0x000001, "Wrong size on LyraSettingsShared_SetColorBlindMode");
static_assert(offsetof(LyraSettingsShared_SetColorBlindMode, InMode) == 0x000000, "Member 'LyraSettingsShared_SetColorBlindMode::InMode' has a wrong offset!");

// Function JP.LyraSettingsShared.SetColorBlindStrength
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_SetColorBlindStrength final
{
public:
	int32                                         InColorBlindStrength;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetColorBlindStrength) == 0x000004, "Wrong alignment on LyraSettingsShared_SetColorBlindStrength");
static_assert(sizeof(LyraSettingsShared_SetColorBlindStrength) == 0x000004, "Wrong size on LyraSettingsShared_SetColorBlindStrength");
static_assert(offsetof(LyraSettingsShared_SetColorBlindStrength, InColorBlindStrength) == 0x000000, "Member 'LyraSettingsShared_SetColorBlindStrength::InColorBlindStrength' has a wrong offset!");

// Function JP.LyraSettingsShared.SetForceFeedbackEnabled
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetForceFeedbackEnabled final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetForceFeedbackEnabled) == 0x000001, "Wrong alignment on LyraSettingsShared_SetForceFeedbackEnabled");
static_assert(sizeof(LyraSettingsShared_SetForceFeedbackEnabled) == 0x000001, "Wrong size on LyraSettingsShared_SetForceFeedbackEnabled");
static_assert(offsetof(LyraSettingsShared_SetForceFeedbackEnabled, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetForceFeedbackEnabled::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetFOV
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_SetFOV final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetFOV) == 0x000004, "Wrong alignment on LyraSettingsShared_SetFOV");
static_assert(sizeof(LyraSettingsShared_SetFOV) == 0x000004, "Wrong size on LyraSettingsShared_SetFOV");
static_assert(offsetof(LyraSettingsShared_SetFOV, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetFOV::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetGamepadLookStickDeadZone
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_SetGamepadLookStickDeadZone final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetGamepadLookStickDeadZone) == 0x000004, "Wrong alignment on LyraSettingsShared_SetGamepadLookStickDeadZone");
static_assert(sizeof(LyraSettingsShared_SetGamepadLookStickDeadZone) == 0x000004, "Wrong size on LyraSettingsShared_SetGamepadLookStickDeadZone");
static_assert(offsetof(LyraSettingsShared_SetGamepadLookStickDeadZone, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetGamepadLookStickDeadZone::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetGamepadMoveStickDeadZone
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_SetGamepadMoveStickDeadZone final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetGamepadMoveStickDeadZone) == 0x000004, "Wrong alignment on LyraSettingsShared_SetGamepadMoveStickDeadZone");
static_assert(sizeof(LyraSettingsShared_SetGamepadMoveStickDeadZone) == 0x000004, "Wrong size on LyraSettingsShared_SetGamepadMoveStickDeadZone");
static_assert(offsetof(LyraSettingsShared_SetGamepadMoveStickDeadZone, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetGamepadMoveStickDeadZone::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetGamepadTargetingSensitivityPreset
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetGamepadTargetingSensitivityPreset final
{
public:
	ELyraGamepadSensitivity                       NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetGamepadTargetingSensitivityPreset) == 0x000001, "Wrong alignment on LyraSettingsShared_SetGamepadTargetingSensitivityPreset");
static_assert(sizeof(LyraSettingsShared_SetGamepadTargetingSensitivityPreset) == 0x000001, "Wrong size on LyraSettingsShared_SetGamepadTargetingSensitivityPreset");
static_assert(offsetof(LyraSettingsShared_SetGamepadTargetingSensitivityPreset, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetGamepadTargetingSensitivityPreset::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetInvertHorizontalAxis
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetInvertHorizontalAxis final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetInvertHorizontalAxis) == 0x000001, "Wrong alignment on LyraSettingsShared_SetInvertHorizontalAxis");
static_assert(sizeof(LyraSettingsShared_SetInvertHorizontalAxis) == 0x000001, "Wrong size on LyraSettingsShared_SetInvertHorizontalAxis");
static_assert(offsetof(LyraSettingsShared_SetInvertHorizontalAxis, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetInvertHorizontalAxis::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetInvertHorizontalAxisMouse
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetInvertHorizontalAxisMouse final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetInvertHorizontalAxisMouse) == 0x000001, "Wrong alignment on LyraSettingsShared_SetInvertHorizontalAxisMouse");
static_assert(sizeof(LyraSettingsShared_SetInvertHorizontalAxisMouse) == 0x000001, "Wrong size on LyraSettingsShared_SetInvertHorizontalAxisMouse");
static_assert(offsetof(LyraSettingsShared_SetInvertHorizontalAxisMouse, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetInvertHorizontalAxisMouse::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetInvertVerticalAxis
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetInvertVerticalAxis final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetInvertVerticalAxis) == 0x000001, "Wrong alignment on LyraSettingsShared_SetInvertVerticalAxis");
static_assert(sizeof(LyraSettingsShared_SetInvertVerticalAxis) == 0x000001, "Wrong size on LyraSettingsShared_SetInvertVerticalAxis");
static_assert(offsetof(LyraSettingsShared_SetInvertVerticalAxis, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetInvertVerticalAxis::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetInvertVerticalAxisMouse
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetInvertVerticalAxisMouse final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetInvertVerticalAxisMouse) == 0x000001, "Wrong alignment on LyraSettingsShared_SetInvertVerticalAxisMouse");
static_assert(sizeof(LyraSettingsShared_SetInvertVerticalAxisMouse) == 0x000001, "Wrong size on LyraSettingsShared_SetInvertVerticalAxisMouse");
static_assert(offsetof(LyraSettingsShared_SetInvertVerticalAxisMouse, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetInvertVerticalAxisMouse::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetLookSensitivityPreset
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetLookSensitivityPreset final
{
public:
	ELyraGamepadSensitivity                       NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetLookSensitivityPreset) == 0x000001, "Wrong alignment on LyraSettingsShared_SetLookSensitivityPreset");
static_assert(sizeof(LyraSettingsShared_SetLookSensitivityPreset) == 0x000001, "Wrong size on LyraSettingsShared_SetLookSensitivityPreset");
static_assert(offsetof(LyraSettingsShared_SetLookSensitivityPreset, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetLookSensitivityPreset::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetMouseSensitivityX
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_SetMouseSensitivityX final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetMouseSensitivityX) == 0x000008, "Wrong alignment on LyraSettingsShared_SetMouseSensitivityX");
static_assert(sizeof(LyraSettingsShared_SetMouseSensitivityX) == 0x000008, "Wrong size on LyraSettingsShared_SetMouseSensitivityX");
static_assert(offsetof(LyraSettingsShared_SetMouseSensitivityX, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetMouseSensitivityX::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetMouseSensitivityY
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_SetMouseSensitivityY final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetMouseSensitivityY) == 0x000008, "Wrong alignment on LyraSettingsShared_SetMouseSensitivityY");
static_assert(sizeof(LyraSettingsShared_SetMouseSensitivityY) == 0x000008, "Wrong size on LyraSettingsShared_SetMouseSensitivityY");
static_assert(offsetof(LyraSettingsShared_SetMouseSensitivityY, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetMouseSensitivityY::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetTargetingMultiplier
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_SetTargetingMultiplier final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetTargetingMultiplier) == 0x000008, "Wrong alignment on LyraSettingsShared_SetTargetingMultiplier");
static_assert(sizeof(LyraSettingsShared_SetTargetingMultiplier) == 0x000008, "Wrong size on LyraSettingsShared_SetTargetingMultiplier");
static_assert(offsetof(LyraSettingsShared_SetTargetingMultiplier, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetTargetingMultiplier::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetTriggerHapticsEnabled
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetTriggerHapticsEnabled final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetTriggerHapticsEnabled) == 0x000001, "Wrong alignment on LyraSettingsShared_SetTriggerHapticsEnabled");
static_assert(sizeof(LyraSettingsShared_SetTriggerHapticsEnabled) == 0x000001, "Wrong size on LyraSettingsShared_SetTriggerHapticsEnabled");
static_assert(offsetof(LyraSettingsShared_SetTriggerHapticsEnabled, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetTriggerHapticsEnabled::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetTriggerHapticStartPosition
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetTriggerHapticStartPosition final
{
public:
	uint8                                         NewValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetTriggerHapticStartPosition) == 0x000001, "Wrong alignment on LyraSettingsShared_SetTriggerHapticStartPosition");
static_assert(sizeof(LyraSettingsShared_SetTriggerHapticStartPosition) == 0x000001, "Wrong size on LyraSettingsShared_SetTriggerHapticStartPosition");
static_assert(offsetof(LyraSettingsShared_SetTriggerHapticStartPosition, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetTriggerHapticStartPosition::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetTriggerHapticStrength
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetTriggerHapticStrength final
{
public:
	uint8                                         NewValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetTriggerHapticStrength) == 0x000001, "Wrong alignment on LyraSettingsShared_SetTriggerHapticStrength");
static_assert(sizeof(LyraSettingsShared_SetTriggerHapticStrength) == 0x000001, "Wrong size on LyraSettingsShared_SetTriggerHapticStrength");
static_assert(offsetof(LyraSettingsShared_SetTriggerHapticStrength, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetTriggerHapticStrength::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.SetTriggerPullUsesHapticThreshold
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_SetTriggerPullUsesHapticThreshold final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_SetTriggerPullUsesHapticThreshold) == 0x000001, "Wrong alignment on LyraSettingsShared_SetTriggerPullUsesHapticThreshold");
static_assert(sizeof(LyraSettingsShared_SetTriggerPullUsesHapticThreshold) == 0x000001, "Wrong size on LyraSettingsShared_SetTriggerPullUsesHapticThreshold");
static_assert(offsetof(LyraSettingsShared_SetTriggerPullUsesHapticThreshold, NewValue) == 0x000000, "Member 'LyraSettingsShared_SetTriggerPullUsesHapticThreshold::NewValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetAllowAudioInBackgroundSetting
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetAllowAudioInBackgroundSetting final
{
public:
	ELyraAllowBackgroundAudioSetting              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetAllowAudioInBackgroundSetting) == 0x000001, "Wrong alignment on LyraSettingsShared_GetAllowAudioInBackgroundSetting");
static_assert(sizeof(LyraSettingsShared_GetAllowAudioInBackgroundSetting) == 0x000001, "Wrong size on LyraSettingsShared_GetAllowAudioInBackgroundSetting");
static_assert(offsetof(LyraSettingsShared_GetAllowAudioInBackgroundSetting, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetAllowAudioInBackgroundSetting::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetColorBlindMode
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetColorBlindMode final
{
public:
	EColorBlindMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetColorBlindMode) == 0x000001, "Wrong alignment on LyraSettingsShared_GetColorBlindMode");
static_assert(sizeof(LyraSettingsShared_GetColorBlindMode) == 0x000001, "Wrong size on LyraSettingsShared_GetColorBlindMode");
static_assert(offsetof(LyraSettingsShared_GetColorBlindMode, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetColorBlindMode::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetColorBlindStrength
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_GetColorBlindStrength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetColorBlindStrength) == 0x000004, "Wrong alignment on LyraSettingsShared_GetColorBlindStrength");
static_assert(sizeof(LyraSettingsShared_GetColorBlindStrength) == 0x000004, "Wrong size on LyraSettingsShared_GetColorBlindStrength");
static_assert(offsetof(LyraSettingsShared_GetColorBlindStrength, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetColorBlindStrength::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetForceFeedbackEnabled
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetForceFeedbackEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetForceFeedbackEnabled) == 0x000001, "Wrong alignment on LyraSettingsShared_GetForceFeedbackEnabled");
static_assert(sizeof(LyraSettingsShared_GetForceFeedbackEnabled) == 0x000001, "Wrong size on LyraSettingsShared_GetForceFeedbackEnabled");
static_assert(offsetof(LyraSettingsShared_GetForceFeedbackEnabled, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetForceFeedbackEnabled::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetFOV
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_GetFOV final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetFOV) == 0x000004, "Wrong alignment on LyraSettingsShared_GetFOV");
static_assert(sizeof(LyraSettingsShared_GetFOV) == 0x000004, "Wrong size on LyraSettingsShared_GetFOV");
static_assert(offsetof(LyraSettingsShared_GetFOV, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetFOV::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetGamepadLookSensitivityPreset
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetGamepadLookSensitivityPreset final
{
public:
	ELyraGamepadSensitivity                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetGamepadLookSensitivityPreset) == 0x000001, "Wrong alignment on LyraSettingsShared_GetGamepadLookSensitivityPreset");
static_assert(sizeof(LyraSettingsShared_GetGamepadLookSensitivityPreset) == 0x000001, "Wrong size on LyraSettingsShared_GetGamepadLookSensitivityPreset");
static_assert(offsetof(LyraSettingsShared_GetGamepadLookSensitivityPreset, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetGamepadLookSensitivityPreset::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetGamepadLookStickDeadZone
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_GetGamepadLookStickDeadZone final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetGamepadLookStickDeadZone) == 0x000004, "Wrong alignment on LyraSettingsShared_GetGamepadLookStickDeadZone");
static_assert(sizeof(LyraSettingsShared_GetGamepadLookStickDeadZone) == 0x000004, "Wrong size on LyraSettingsShared_GetGamepadLookStickDeadZone");
static_assert(offsetof(LyraSettingsShared_GetGamepadLookStickDeadZone, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetGamepadLookStickDeadZone::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetGamepadMoveStickDeadZone
// 0x0004 (0x0004 - 0x0000)
struct LyraSettingsShared_GetGamepadMoveStickDeadZone final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetGamepadMoveStickDeadZone) == 0x000004, "Wrong alignment on LyraSettingsShared_GetGamepadMoveStickDeadZone");
static_assert(sizeof(LyraSettingsShared_GetGamepadMoveStickDeadZone) == 0x000004, "Wrong size on LyraSettingsShared_GetGamepadMoveStickDeadZone");
static_assert(offsetof(LyraSettingsShared_GetGamepadMoveStickDeadZone, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetGamepadMoveStickDeadZone::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetGamepadTargetingSensitivityPreset
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetGamepadTargetingSensitivityPreset final
{
public:
	ELyraGamepadSensitivity                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetGamepadTargetingSensitivityPreset) == 0x000001, "Wrong alignment on LyraSettingsShared_GetGamepadTargetingSensitivityPreset");
static_assert(sizeof(LyraSettingsShared_GetGamepadTargetingSensitivityPreset) == 0x000001, "Wrong size on LyraSettingsShared_GetGamepadTargetingSensitivityPreset");
static_assert(offsetof(LyraSettingsShared_GetGamepadTargetingSensitivityPreset, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetGamepadTargetingSensitivityPreset::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetInvertHorizontalAxis
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetInvertHorizontalAxis final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetInvertHorizontalAxis) == 0x000001, "Wrong alignment on LyraSettingsShared_GetInvertHorizontalAxis");
static_assert(sizeof(LyraSettingsShared_GetInvertHorizontalAxis) == 0x000001, "Wrong size on LyraSettingsShared_GetInvertHorizontalAxis");
static_assert(offsetof(LyraSettingsShared_GetInvertHorizontalAxis, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetInvertHorizontalAxis::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetInvertHorizontalAxisMouse
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetInvertHorizontalAxisMouse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetInvertHorizontalAxisMouse) == 0x000001, "Wrong alignment on LyraSettingsShared_GetInvertHorizontalAxisMouse");
static_assert(sizeof(LyraSettingsShared_GetInvertHorizontalAxisMouse) == 0x000001, "Wrong size on LyraSettingsShared_GetInvertHorizontalAxisMouse");
static_assert(offsetof(LyraSettingsShared_GetInvertHorizontalAxisMouse, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetInvertHorizontalAxisMouse::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetInvertVerticalAxis
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetInvertVerticalAxis final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetInvertVerticalAxis) == 0x000001, "Wrong alignment on LyraSettingsShared_GetInvertVerticalAxis");
static_assert(sizeof(LyraSettingsShared_GetInvertVerticalAxis) == 0x000001, "Wrong size on LyraSettingsShared_GetInvertVerticalAxis");
static_assert(offsetof(LyraSettingsShared_GetInvertVerticalAxis, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetInvertVerticalAxis::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetInvertVerticalAxisMouse
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetInvertVerticalAxisMouse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetInvertVerticalAxisMouse) == 0x000001, "Wrong alignment on LyraSettingsShared_GetInvertVerticalAxisMouse");
static_assert(sizeof(LyraSettingsShared_GetInvertVerticalAxisMouse) == 0x000001, "Wrong size on LyraSettingsShared_GetInvertVerticalAxisMouse");
static_assert(offsetof(LyraSettingsShared_GetInvertVerticalAxisMouse, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetInvertVerticalAxisMouse::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetMouseSensitivityX
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_GetMouseSensitivityX final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetMouseSensitivityX) == 0x000008, "Wrong alignment on LyraSettingsShared_GetMouseSensitivityX");
static_assert(sizeof(LyraSettingsShared_GetMouseSensitivityX) == 0x000008, "Wrong size on LyraSettingsShared_GetMouseSensitivityX");
static_assert(offsetof(LyraSettingsShared_GetMouseSensitivityX, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetMouseSensitivityX::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetMouseSensitivityY
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_GetMouseSensitivityY final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetMouseSensitivityY) == 0x000008, "Wrong alignment on LyraSettingsShared_GetMouseSensitivityY");
static_assert(sizeof(LyraSettingsShared_GetMouseSensitivityY) == 0x000008, "Wrong size on LyraSettingsShared_GetMouseSensitivityY");
static_assert(offsetof(LyraSettingsShared_GetMouseSensitivityY, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetMouseSensitivityY::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetTargetingMultiplier
// 0x0008 (0x0008 - 0x0000)
struct LyraSettingsShared_GetTargetingMultiplier final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetTargetingMultiplier) == 0x000008, "Wrong alignment on LyraSettingsShared_GetTargetingMultiplier");
static_assert(sizeof(LyraSettingsShared_GetTargetingMultiplier) == 0x000008, "Wrong size on LyraSettingsShared_GetTargetingMultiplier");
static_assert(offsetof(LyraSettingsShared_GetTargetingMultiplier, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetTargetingMultiplier::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetTriggerHapticsEnabled
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetTriggerHapticsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetTriggerHapticsEnabled) == 0x000001, "Wrong alignment on LyraSettingsShared_GetTriggerHapticsEnabled");
static_assert(sizeof(LyraSettingsShared_GetTriggerHapticsEnabled) == 0x000001, "Wrong size on LyraSettingsShared_GetTriggerHapticsEnabled");
static_assert(offsetof(LyraSettingsShared_GetTriggerHapticsEnabled, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetTriggerHapticsEnabled::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetTriggerHapticStartPosition
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetTriggerHapticStartPosition final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetTriggerHapticStartPosition) == 0x000001, "Wrong alignment on LyraSettingsShared_GetTriggerHapticStartPosition");
static_assert(sizeof(LyraSettingsShared_GetTriggerHapticStartPosition) == 0x000001, "Wrong size on LyraSettingsShared_GetTriggerHapticStartPosition");
static_assert(offsetof(LyraSettingsShared_GetTriggerHapticStartPosition, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetTriggerHapticStartPosition::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetTriggerHapticStrength
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetTriggerHapticStrength final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetTriggerHapticStrength) == 0x000001, "Wrong alignment on LyraSettingsShared_GetTriggerHapticStrength");
static_assert(sizeof(LyraSettingsShared_GetTriggerHapticStrength) == 0x000001, "Wrong size on LyraSettingsShared_GetTriggerHapticStrength");
static_assert(offsetof(LyraSettingsShared_GetTriggerHapticStrength, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetTriggerHapticStrength::ReturnValue' has a wrong offset!");

// Function JP.LyraSettingsShared.GetTriggerPullUsesHapticThreshold
// 0x0001 (0x0001 - 0x0000)
struct LyraSettingsShared_GetTriggerPullUsesHapticThreshold final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LyraSettingsShared_GetTriggerPullUsesHapticThreshold) == 0x000001, "Wrong alignment on LyraSettingsShared_GetTriggerPullUsesHapticThreshold");
static_assert(sizeof(LyraSettingsShared_GetTriggerPullUsesHapticThreshold) == 0x000001, "Wrong size on LyraSettingsShared_GetTriggerPullUsesHapticThreshold");
static_assert(offsetof(LyraSettingsShared_GetTriggerPullUsesHapticThreshold, ReturnValue) == 0x000000, "Member 'LyraSettingsShared_GetTriggerPullUsesHapticThreshold::ReturnValue' has a wrong offset!");

// Function JP.AnimNotify_PlaySoundForPerspective.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct AnimNotify_PlaySoundForPerspective_OnMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotify_PlaySoundForPerspective_OnMontageEnded) == 0x000008, "Wrong alignment on AnimNotify_PlaySoundForPerspective_OnMontageEnded");
static_assert(sizeof(AnimNotify_PlaySoundForPerspective_OnMontageEnded) == 0x000010, "Wrong size on AnimNotify_PlaySoundForPerspective_OnMontageEnded");
static_assert(offsetof(AnimNotify_PlaySoundForPerspective_OnMontageEnded, Montage) == 0x000000, "Member 'AnimNotify_PlaySoundForPerspective_OnMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlaySoundForPerspective_OnMontageEnded, bInterrupted) == 0x000008, "Member 'AnimNotify_PlaySoundForPerspective_OnMontageEnded::bInterrupted' has a wrong offset!");

// Function JP.SeasonPassRewardWidgetCatalogItemInterface.ApplyCatalogItemData
// 0x0018 (0x0018 - 0x0000)
struct SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData final
{
public:
	struct FSeasonPassCatalogItem                 Item;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData) == 0x000008, "Wrong alignment on SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData");
static_assert(sizeof(SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData) == 0x000018, "Wrong size on SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData");
static_assert(offsetof(SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData, Item) == 0x000000, "Member 'SeasonPassRewardWidgetCatalogItemInterface_ApplyCatalogItemData::Item' has a wrong offset!");

// Function JP.AuthenticationInitializationStep_AccountData.HandleUserAvatarLoaded
// 0x0030 (0x0030 - 0x0000)
struct AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded final
{
public:
	bool                                          bInWasSuccessful;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                InResultTexture;                                   // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded) == 0x000008, "Wrong alignment on AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded");
static_assert(sizeof(AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded) == 0x000030, "Wrong size on AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded");
static_assert(offsetof(AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded, bInWasSuccessful) == 0x000000, "Member 'AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded::bInWasSuccessful' has a wrong offset!");
static_assert(offsetof(AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded, InResultTexture) == 0x000008, "Member 'AuthenticationInitializationStep_AccountData_HandleUserAvatarLoaded::InResultTexture' has a wrong offset!");

// Function JP.EndCondition.EliminateTeam
// 0x0001 (0x0001 - 0x0000)
struct EndCondition_EliminateTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndCondition_EliminateTeam) == 0x000001, "Wrong alignment on EndCondition_EliminateTeam");
static_assert(sizeof(EndCondition_EliminateTeam) == 0x000001, "Wrong size on EndCondition_EliminateTeam");
static_assert(offsetof(EndCondition_EliminateTeam, TeamId) == 0x000000, "Member 'EndCondition_EliminateTeam::TeamId' has a wrong offset!");

// Function JP.EndCondition.GetEndConditionName
// 0x0008 (0x0008 - 0x0000)
struct EndCondition_GetEndConditionName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndCondition_GetEndConditionName) == 0x000004, "Wrong alignment on EndCondition_GetEndConditionName");
static_assert(sizeof(EndCondition_GetEndConditionName) == 0x000008, "Wrong size on EndCondition_GetEndConditionName");
static_assert(offsetof(EndCondition_GetEndConditionName, ReturnValue) == 0x000000, "Member 'EndCondition_GetEndConditionName::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetLocalPlayerTeamId
// 0x0010 (0x0010 - 0x0000)
struct TeamColorFunctionLibrary_GetLocalPlayerTeamId final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetLocalPlayerTeamId) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetLocalPlayerTeamId");
static_assert(sizeof(TeamColorFunctionLibrary_GetLocalPlayerTeamId) == 0x000010, "Wrong size on TeamColorFunctionLibrary_GetLocalPlayerTeamId");
static_assert(offsetof(TeamColorFunctionLibrary_GetLocalPlayerTeamId, WorldContext) == 0x000000, "Member 'TeamColorFunctionLibrary_GetLocalPlayerTeamId::WorldContext' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetLocalPlayerTeamId, ReturnValue) == 0x000008, "Member 'TeamColorFunctionLibrary_GetLocalPlayerTeamId::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamColorForTeamId
// 0x0020 (0x0020 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamColorForTeamId final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamId;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamColorForTeamId) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetTeamColorForTeamId");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamColorForTeamId) == 0x000020, "Wrong size on TeamColorFunctionLibrary_GetTeamColorForTeamId");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamColorForTeamId, WorldContext) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamColorForTeamId::WorldContext' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamColorForTeamId, TeamId) == 0x000008, "Member 'TeamColorFunctionLibrary_GetTeamColorForTeamId::TeamId' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamColorForTeamId, ReturnValue) == 0x00000C, "Member 'TeamColorFunctionLibrary_GetTeamColorForTeamId::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamColorForTeamType
// 0x0014 (0x0014 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamColorForTeamType final
{
public:
	ETeamType                                     TeamType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamColorForTeamType) == 0x000004, "Wrong alignment on TeamColorFunctionLibrary_GetTeamColorForTeamType");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamColorForTeamType) == 0x000014, "Wrong size on TeamColorFunctionLibrary_GetTeamColorForTeamType");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamColorForTeamType, TeamType) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamColorForTeamType::TeamType' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamColorForTeamType, ReturnValue) == 0x000004, "Member 'TeamColorFunctionLibrary_GetTeamColorForTeamType::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamIdFromTeamType
// 0x0010 (0x0010 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamIdFromTeamType final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamType                                     TeamType;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamIdFromTeamType) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetTeamIdFromTeamType");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamIdFromTeamType) == 0x000010, "Wrong size on TeamColorFunctionLibrary_GetTeamIdFromTeamType");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamType, WorldContext) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamType::WorldContext' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamType, TeamType) == 0x000008, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamType::TeamType' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamType, ReturnValue) == 0x000009, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamType::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView
// 0x0010 (0x0010 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamType                                     TeamTypeToConvert;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView) == 0x000010, "Wrong size on TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView, PlayerController) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView::PlayerController' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView, TeamTypeToConvert) == 0x000008, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView::TeamTypeToConvert' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView, ReturnValue) == 0x000009, "Member 'TeamColorFunctionLibrary_GetTeamIdFromTeamTypeFromSpecificPlayerPointOfView::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamTypeFromTeamId
// 0x0010 (0x0010 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamTypeFromTeamId final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamId;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamType                                     ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamTypeFromTeamId) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetTeamTypeFromTeamId");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamTypeFromTeamId) == 0x000010, "Wrong size on TeamColorFunctionLibrary_GetTeamTypeFromTeamId");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamTypeFromTeamId, WorldContext) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamTypeFromTeamId::WorldContext' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamTypeFromTeamId, TeamId) == 0x000008, "Member 'TeamColorFunctionLibrary_GetTeamTypeFromTeamId::TeamId' has a wrong offset!");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamTypeFromTeamId, ReturnValue) == 0x000009, "Member 'TeamColorFunctionLibrary_GetTeamTypeFromTeamId::ReturnValue' has a wrong offset!");

// Function JP.TeamColorFunctionLibrary.GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView
// 0x0010 (0x0010 - 0x0000)
struct TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamIdToConvert;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamType                                     ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView) == 0x000008, "Wrong alignment on TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView");
static_assert(sizeof(TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView) == 0x000010, "Wrong size on TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView");
static_assert(offsetof(TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView, PlayerController) == 0x000000, "Member 'TeamColorFunctionLibrary_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView::PlayerController' has a wrong offset!");
