#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingWI

#include "Basic.hpp"

#include "S_DefaultToolTips_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LoadingWI.LoadingWI_C.ExecuteUbergraph_LoadingWI
// 0x0168 (0x0168 - 0x0000)
struct LoadingWI_C_ExecuteUbergraph_LoadingWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0008(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_Texture;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Event_Sound;                                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StopMenuMusic;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_1;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StartMenuMusic;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRandomTip_Return;                      // 0x0088(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00E8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetBlurStrength_InStrength_ImplicitCast;  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_ExecuteUbergraph_LoadingWI) == 0x000008, "Wrong alignment on LoadingWI_C_ExecuteUbergraph_LoadingWI");
static_assert(sizeof(LoadingWI_C_ExecuteUbergraph_LoadingWI) == 0x000168, "Wrong size on LoadingWI_C_ExecuteUbergraph_LoadingWI");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, EntryPoint) == 0x000000, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, Temp_bool_Variable) == 0x000004, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, Temp_byte_Variable) == 0x000005, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, Temp_byte_Variable_1) == 0x000006, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_Message) == 0x000008, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_IsDesignTime) == 0x000028, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_Texture) == 0x000030, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_Sound) == 0x000038, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_Sound' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_StopMenuMusic) == 0x000040, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_StopMenuMusic' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_SpawnSound2D_ReturnValue) == 0x000048, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_GetGameInstance_ReturnValue_1) == 0x000060, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_DynamicCast_AsBP_GI) == 0x000068, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_DynamicCast_AsBP_GI_1) == 0x000078, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_DynamicCast_AsBP_GI_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Event_StartMenuMusic) == 0x000081, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Event_StartMenuMusic' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_GetRandomTip_Return) == 0x000088, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_GetRandomTip_Return' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_MakeLiteralText_ReturnValue) == 0x0000E8, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_MakeArray_Array) == 0x000140, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_Format_ReturnValue) == 0x000150, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, K2Node_Select_Default) == 0x000160, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_ExecuteUbergraph_LoadingWI, CallFunc_SetBlurStrength_InStrength_ImplicitCast) == 0x000164, "Member 'LoadingWI_C_ExecuteUbergraph_LoadingWI::CallFunc_SetBlurStrength_InStrength_ImplicitCast' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.GetRandomTip
// 0x0058 (0x0058 - 0x0000)
struct LoadingWI_C_GetRandomTip final
{
public:
	class FText                                   Return;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DefaultToolTips                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_GetRandomTip) == 0x000008, "Wrong alignment on LoadingWI_C_GetRandomTip");
static_assert(sizeof(LoadingWI_C_GetRandomTip) == 0x000058, "Wrong size on LoadingWI_C_GetRandomTip");
static_assert(offsetof(LoadingWI_C_GetRandomTip, Return) == 0x000000, "Member 'LoadingWI_C_GetRandomTip::Return' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_Get_ClassLog_Name_name) == 0x000010, "Member 'LoadingWI_C_GetRandomTip::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'LoadingWI_C_GetRandomTip::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_Array_Random_OutItem) == 0x000030, "Member 'LoadingWI_C_GetRandomTip::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_Array_Random_OutIndex) == 0x000038, "Member 'LoadingWI_C_GetRandomTip::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'LoadingWI_C_GetRandomTip::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_GetRandomTip, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'LoadingWI_C_GetRandomTip::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoadingWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_PreConstruct) == 0x000001, "Wrong alignment on LoadingWI_C_PreConstruct");
static_assert(sizeof(LoadingWI_C_PreConstruct) == 0x000001, "Wrong size on LoadingWI_C_PreConstruct");
static_assert(offsetof(LoadingWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoadingWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.UpdateBackground
// 0x0008 (0x0008 - 0x0000)
struct LoadingWI_C_UpdateBackground final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_UpdateBackground) == 0x000008, "Wrong alignment on LoadingWI_C_UpdateBackground");
static_assert(sizeof(LoadingWI_C_UpdateBackground) == 0x000008, "Wrong size on LoadingWI_C_UpdateBackground");
static_assert(offsetof(LoadingWI_C_UpdateBackground, Texture) == 0x000000, "Member 'LoadingWI_C_UpdateBackground::Texture' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.UpdateMessage
// 0x0010 (0x0010 - 0x0000)
struct LoadingWI_C_UpdateMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoadingWI_C_UpdateMessage) == 0x000008, "Wrong alignment on LoadingWI_C_UpdateMessage");
static_assert(sizeof(LoadingWI_C_UpdateMessage) == 0x000010, "Wrong size on LoadingWI_C_UpdateMessage");
static_assert(offsetof(LoadingWI_C_UpdateMessage, Message) == 0x000000, "Member 'LoadingWI_C_UpdateMessage::Message' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.UpdateSound
// 0x0010 (0x0010 - 0x0000)
struct LoadingWI_C_UpdateSound final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          StopMenuMusic;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_UpdateSound) == 0x000008, "Wrong alignment on LoadingWI_C_UpdateSound");
static_assert(sizeof(LoadingWI_C_UpdateSound) == 0x000010, "Wrong size on LoadingWI_C_UpdateSound");
static_assert(offsetof(LoadingWI_C_UpdateSound, Sound) == 0x000000, "Member 'LoadingWI_C_UpdateSound::Sound' has a wrong offset!");
static_assert(offsetof(LoadingWI_C_UpdateSound, StopMenuMusic) == 0x000008, "Member 'LoadingWI_C_UpdateSound::StopMenuMusic' has a wrong offset!");

// Function LoadingWI.LoadingWI_C.UpdateSoundLoadingScreenHidden
// 0x0001 (0x0001 - 0x0000)
struct LoadingWI_C_UpdateSoundLoadingScreenHidden final
{
public:
	bool                                          StartMenuMusic;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingWI_C_UpdateSoundLoadingScreenHidden) == 0x000001, "Wrong alignment on LoadingWI_C_UpdateSoundLoadingScreenHidden");
static_assert(sizeof(LoadingWI_C_UpdateSoundLoadingScreenHidden) == 0x000001, "Wrong size on LoadingWI_C_UpdateSoundLoadingScreenHidden");
static_assert(offsetof(LoadingWI_C_UpdateSoundLoadingScreenHidden, StartMenuMusic) == 0x000000, "Member 'LoadingWI_C_UpdateSoundLoadingScreenHidden::StartMenuMusic' has a wrong offset!");

}

