#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBounceComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MeshBounceComponent.MeshBounceComponent_C
// 0x0050 (0x00F0 - 0x00A0)
class UMeshBounceComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            HitCurve;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 Meshes;                                            // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       DynamicMaterialInstances;                          // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StartTime;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalHitImpact;                                    // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MeshBounceComponent(int32 EntryPoint);
	void HitBounce(const struct FVector& HitLocation, const struct FVector& HitImpact, double HitRadius);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void StartBounceTimeline();
	void StopBounceTimeline();
	void Update_Meshes(TArray<class UMeshComponent*>& Meshes_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MeshBounceComponent_C">();
	}
	static class UMeshBounceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBounceComponent_C>();
	}
};
static_assert(alignof(UMeshBounceComponent_C) == 0x000008, "Wrong alignment on UMeshBounceComponent_C");
static_assert(sizeof(UMeshBounceComponent_C) == 0x0000F0, "Wrong size on UMeshBounceComponent_C");
static_assert(offsetof(UMeshBounceComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UMeshBounceComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMeshBounceComponent_C, HitCurve) == 0x0000A8, "Member 'UMeshBounceComponent_C::HitCurve' has a wrong offset!");
static_assert(offsetof(UMeshBounceComponent_C, Meshes) == 0x0000B0, "Member 'UMeshBounceComponent_C::Meshes' has a wrong offset!");
static_assert(offsetof(UMeshBounceComponent_C, DynamicMaterialInstances) == 0x0000C0, "Member 'UMeshBounceComponent_C::DynamicMaterialInstances' has a wrong offset!");
static_assert(offsetof(UMeshBounceComponent_C, StartTime) == 0x0000D0, "Member 'UMeshBounceComponent_C::StartTime' has a wrong offset!");
static_assert(offsetof(UMeshBounceComponent_C, LocalHitImpact) == 0x0000D8, "Member 'UMeshBounceComponent_C::LocalHitImpact' has a wrong offset!");

}

