#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeighborhoodBenchmarkSequence

#include "Basic.hpp"

#include "LevelSequence_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NeighborhoodBenchmarkSequence.NeighborhoodBenchmarkSequence_DirectorBP_C
// 0x0028 (0x0070 - 0x0048)
class UNeighborhoodBenchmarkSequence_DirectorBP_C final : public ULevelSequenceDirector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_BenchmarkChicken_C*                 Chicken;                                           // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Window_Benchmark_C*                 Window;                                            // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ChangePP();
	void ExecuteUbergraph_NeighborhoodBenchmarkSequence_DirectorBP(int32 EntryPoint);
	void Fire_Orange();
	void Init();
	void NewEventDispatcher__DelegateSignature();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP_0();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP_1();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP_2();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP_3();
	void SequenceEvent__ENTRYPOINTNeighborhoodBenchmarkSequence_DirectorBP_4();
	void SmashWindow();
	void StartChicken();
	void Stop_Chicken();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NeighborhoodBenchmarkSequence_DirectorBP_C">();
	}
	static class UNeighborhoodBenchmarkSequence_DirectorBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeighborhoodBenchmarkSequence_DirectorBP_C>();
	}
};
static_assert(alignof(UNeighborhoodBenchmarkSequence_DirectorBP_C) == 0x000008, "Wrong alignment on UNeighborhoodBenchmarkSequence_DirectorBP_C");
static_assert(sizeof(UNeighborhoodBenchmarkSequence_DirectorBP_C) == 0x000070, "Wrong size on UNeighborhoodBenchmarkSequence_DirectorBP_C");
static_assert(offsetof(UNeighborhoodBenchmarkSequence_DirectorBP_C, UberGraphFrame) == 0x000048, "Member 'UNeighborhoodBenchmarkSequence_DirectorBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNeighborhoodBenchmarkSequence_DirectorBP_C, Chicken) == 0x000050, "Member 'UNeighborhoodBenchmarkSequence_DirectorBP_C::Chicken' has a wrong offset!");
static_assert(offsetof(UNeighborhoodBenchmarkSequence_DirectorBP_C, Window) == 0x000058, "Member 'UNeighborhoodBenchmarkSequence_DirectorBP_C::Window' has a wrong offset!");
static_assert(offsetof(UNeighborhoodBenchmarkSequence_DirectorBP_C, NewEventDispatcher) == 0x000060, "Member 'UNeighborhoodBenchmarkSequence_DirectorBP_C::NewEventDispatcher' has a wrong offset!");

}

