#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeighborsLogoSequence_New

#include "Basic.hpp"


namespace SDK::Params
{

// Function NeighborsLogoSequence_New.NeighborsLogoSequence_New_DirectorBP_C.Bp_TitleFenceDestructionEffect_Event
// 0x0008 (0x0008 - 0x0000)
struct NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event final
{
public:
	class ABp_TitleFenceDestructionEffect_C*      Bp_TitleFenceDestructionEffect;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event) == 0x000008, "Wrong alignment on NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event");
static_assert(sizeof(NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event) == 0x000008, "Wrong size on NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event");
static_assert(offsetof(NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event, Bp_TitleFenceDestructionEffect) == 0x000000, "Member 'NeighborsLogoSequence_New_DirectorBP_C_Bp_TitleFenceDestructionEffect_Event::Bp_TitleFenceDestructionEffect' has a wrong offset!");

// Function NeighborsLogoSequence_New.NeighborsLogoSequence_New_DirectorBP_C.ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP
// 0x0010 (0x0010 - 0x0000)
struct NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABp_TitleFenceDestructionEffect_C*      K2Node_CustomEvent_Bp_TitleFenceDestructionEffect; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP) == 0x000008, "Wrong alignment on NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP");
static_assert(sizeof(NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP) == 0x000010, "Wrong size on NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP");
static_assert(offsetof(NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP, EntryPoint) == 0x000000, "Member 'NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP, K2Node_CustomEvent_Bp_TitleFenceDestructionEffect) == 0x000008, "Member 'NeighborsLogoSequence_New_DirectorBP_C_ExecuteUbergraph_NeighborsLogoSequence_New_DirectorBP::K2Node_CustomEvent_Bp_TitleFenceDestructionEffect' has a wrong offset!");

// Function NeighborsLogoSequence_New.NeighborsLogoSequence_New_DirectorBP_C.SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP final
{
public:
	class ABp_TitleFenceDestructionEffect_C*      Bp_TitleFenceDestructionEffect;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP) == 0x000008, "Wrong alignment on NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP");
static_assert(sizeof(NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP) == 0x000008, "Wrong size on NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP");
static_assert(offsetof(NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP, Bp_TitleFenceDestructionEffect) == 0x000000, "Member 'NeighborsLogoSequence_New_DirectorBP_C_SequenceEvent__ENTRYPOINTNeighborsLogoSequence_New_DirectorBP::Bp_TitleFenceDestructionEffect' has a wrong offset!");

}

