#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenTrashBag_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass OpenTrashBag_PostProcess_AnimBP.OpenTrashBag_PostProcess_AnimBP_C
// 0x0AB0 (0x0E20 - 0x0370)
class UOpenTrashBag_PostProcess_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0390(0x0970)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0D00(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DB8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DD8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0DF8(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_OpenTrashBag_PostProcess_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OpenTrashBag_PostProcess_AnimBP_C">();
	}
	static class UOpenTrashBag_PostProcess_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenTrashBag_PostProcess_AnimBP_C>();
	}
};
static_assert(alignof(UOpenTrashBag_PostProcess_AnimBP_C) == 0x000010, "Wrong alignment on UOpenTrashBag_PostProcess_AnimBP_C");
static_assert(sizeof(UOpenTrashBag_PostProcess_AnimBP_C) == 0x000E20, "Wrong size on UOpenTrashBag_PostProcess_AnimBP_C");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimGraphNode_RigidBody) == 0x000390, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000D00, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000DB8, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DD8, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UOpenTrashBag_PostProcess_AnimBP_C, AnimGraphNode_Root) == 0x000DF8, "Member 'UOpenTrashBag_PostProcess_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

