#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ChangeItemIconsOnEquip

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PA_ChangeItemIconsOnEquip.PA_ChangeItemIconsOnEquip_C
// 0x0018 (0x0040 - 0x0028)
class UPA_ChangeItemIconsOnEquip_C final : public UPerkAction
{
public:
	class UClass*                                 InstanceToLookFor;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InputTag;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NewIcon;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void FindCorrectIcon(class UEquipmentInstance* Instance, const struct FGameplayTag& InputTag_0, bool* IconFound, class UTexture2D** NewIcon_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PA_ChangeItemIconsOnEquip_C">();
	}
	static class UPA_ChangeItemIconsOnEquip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPA_ChangeItemIconsOnEquip_C>();
	}
};
static_assert(alignof(UPA_ChangeItemIconsOnEquip_C) == 0x000008, "Wrong alignment on UPA_ChangeItemIconsOnEquip_C");
static_assert(sizeof(UPA_ChangeItemIconsOnEquip_C) == 0x000040, "Wrong size on UPA_ChangeItemIconsOnEquip_C");
static_assert(offsetof(UPA_ChangeItemIconsOnEquip_C, InstanceToLookFor) == 0x000028, "Member 'UPA_ChangeItemIconsOnEquip_C::InstanceToLookFor' has a wrong offset!");
static_assert(offsetof(UPA_ChangeItemIconsOnEquip_C, InputTag) == 0x000030, "Member 'UPA_ChangeItemIconsOnEquip_C::InputTag' has a wrong offset!");
static_assert(offsetof(UPA_ChangeItemIconsOnEquip_C, NewIcon) == 0x000038, "Member 'UPA_ChangeItemIconsOnEquip_C::NewIcon' has a wrong offset!");

}

