#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_GrantGameplayAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function PA_GrantGameplayAbility.PA_GrantGameplayAbility_C.ExecuteUbergraph_PA_GrantGameplayAbility
// 0x0030 (0x0030 - 0x0000)
struct PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_CustomEvent_Target_ASC;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_K2_GiveAbility_ReturnValue;               // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility) == 0x000008, "Wrong alignment on PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility");
static_assert(sizeof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility) == 0x000030, "Wrong size on PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, EntryPoint) == 0x000000, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, CallFunc_Array_Get_Item) == 0x000010, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, K2Node_CustomEvent_Target_ASC) == 0x000020, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::K2Node_CustomEvent_Target_ASC' has a wrong offset!");
static_assert(offsetof(PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility, CallFunc_K2_GiveAbility_ReturnValue) == 0x000028, "Member 'PA_GrantGameplayAbility_C_ExecuteUbergraph_PA_GrantGameplayAbility::CallFunc_K2_GiveAbility_ReturnValue' has a wrong offset!");

// Function PA_GrantGameplayAbility.PA_GrantGameplayAbility_C.GrantGameplayAbility
// 0x0008 (0x0008 - 0x0000)
struct PA_GrantGameplayAbility_C_GrantGameplayAbility final
{
public:
	class UAbilitySystemComponentIW*              Target_ASC;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_GrantGameplayAbility_C_GrantGameplayAbility) == 0x000008, "Wrong alignment on PA_GrantGameplayAbility_C_GrantGameplayAbility");
static_assert(sizeof(PA_GrantGameplayAbility_C_GrantGameplayAbility) == 0x000008, "Wrong size on PA_GrantGameplayAbility_C_GrantGameplayAbility");
static_assert(offsetof(PA_GrantGameplayAbility_C_GrantGameplayAbility, Target_ASC) == 0x000000, "Member 'PA_GrantGameplayAbility_C_GrantGameplayAbility::Target_ASC' has a wrong offset!");

}

