#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyPurchaseAmount

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PA_ModifyPurchaseAmount.PA_ModifyPurchaseAmount_C
// 0x0028 (0x0050 - 0x0028)
class UPA_ModifyPurchaseAmount_C final : public UPerkAction
{
public:
	struct FGameplayTagContainer                  AffectedItemTypes;                                 // 0x0028(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EArithmeticOperators                          Operator;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModifyingValue;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ModifyItemAmount(int32 AmountToAdd, int32* ModifiedAmountToAdd);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PA_ModifyPurchaseAmount_C">();
	}
	static class UPA_ModifyPurchaseAmount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPA_ModifyPurchaseAmount_C>();
	}
};
static_assert(alignof(UPA_ModifyPurchaseAmount_C) == 0x000008, "Wrong alignment on UPA_ModifyPurchaseAmount_C");
static_assert(sizeof(UPA_ModifyPurchaseAmount_C) == 0x000050, "Wrong size on UPA_ModifyPurchaseAmount_C");
static_assert(offsetof(UPA_ModifyPurchaseAmount_C, AffectedItemTypes) == 0x000028, "Member 'UPA_ModifyPurchaseAmount_C::AffectedItemTypes' has a wrong offset!");
static_assert(offsetof(UPA_ModifyPurchaseAmount_C, Operator) == 0x000048, "Member 'UPA_ModifyPurchaseAmount_C::Operator' has a wrong offset!");
static_assert(offsetof(UPA_ModifyPurchaseAmount_C, ModifyingValue) == 0x00004C, "Member 'UPA_ModifyPurchaseAmount_C::ModifyingValue' has a wrong offset!");

}

