#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyPurchasedItemDurability

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PA_ModifyPurchasedItemDurability.PA_ModifyPurchasedItemDurability_C
// 0x0030 (0x0058 - 0x0028)
class UPA_ModifyPurchasedItemDurability_C final : public UPerkAction
{
public:
	struct FGameplayTagContainer                  AffectedItems;                                     // 0x0028(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EArithmeticOperators                          Operator;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ModifyingValue;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ModifyDurability(int32 Current_Durability, int32* New_Durability);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PA_ModifyPurchasedItemDurability_C">();
	}
	static class UPA_ModifyPurchasedItemDurability_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPA_ModifyPurchasedItemDurability_C>();
	}
};
static_assert(alignof(UPA_ModifyPurchasedItemDurability_C) == 0x000008, "Wrong alignment on UPA_ModifyPurchasedItemDurability_C");
static_assert(sizeof(UPA_ModifyPurchasedItemDurability_C) == 0x000058, "Wrong size on UPA_ModifyPurchasedItemDurability_C");
static_assert(offsetof(UPA_ModifyPurchasedItemDurability_C, AffectedItems) == 0x000028, "Member 'UPA_ModifyPurchasedItemDurability_C::AffectedItems' has a wrong offset!");
static_assert(offsetof(UPA_ModifyPurchasedItemDurability_C, Operator) == 0x000048, "Member 'UPA_ModifyPurchasedItemDurability_C::Operator' has a wrong offset!");
static_assert(offsetof(UPA_ModifyPurchasedItemDurability_C, ModifyingValue) == 0x000050, "Member 'UPA_ModifyPurchasedItemDurability_C::ModifyingValue' has a wrong offset!");

}

