#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyInventorySize

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ModifyInventorySize.PA_ModifyInventorySize_C.Modify InventorySize
// 0x000C (0x000C - 0x0000)
struct PA_ModifyInventorySize_C_Modify_InventorySize final
{
public:
	int32                                         OriginalSize;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifiedSize;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_EvaluateIntValue_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyInventorySize_C_Modify_InventorySize) == 0x000004, "Wrong alignment on PA_ModifyInventorySize_C_Modify_InventorySize");
static_assert(sizeof(PA_ModifyInventorySize_C_Modify_InventorySize) == 0x00000C, "Wrong size on PA_ModifyInventorySize_C_Modify_InventorySize");
static_assert(offsetof(PA_ModifyInventorySize_C_Modify_InventorySize, OriginalSize) == 0x000000, "Member 'PA_ModifyInventorySize_C_Modify_InventorySize::OriginalSize' has a wrong offset!");
static_assert(offsetof(PA_ModifyInventorySize_C_Modify_InventorySize, ModifiedSize) == 0x000004, "Member 'PA_ModifyInventorySize_C_Modify_InventorySize::ModifiedSize' has a wrong offset!");
static_assert(offsetof(PA_ModifyInventorySize_C_Modify_InventorySize, CallFunc_EvaluateIntValue_ReturnValue) == 0x000008, "Member 'PA_ModifyInventorySize_C_Modify_InventorySize::CallFunc_EvaluateIntValue_ReturnValue' has a wrong offset!");

}

