#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyOutgoingDamage

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ModifyOutgoingDamage.PA_ModifyOutgoingDamage_C.ModifyOutgoingDamage
// 0x0028 (0x0028 - 0x0000)
struct PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage final
{
public:
	double                                        OutgoingDamage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ModifiedOutgoingDamage;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value1_ImplicitCast;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ModifiedOutgoingDamage_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value2_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage) == 0x000008, "Wrong alignment on PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage");
static_assert(sizeof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage) == 0x000028, "Wrong size on PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, OutgoingDamage) == 0x000000, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::OutgoingDamage' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, ModifiedOutgoingDamage) == 0x000008, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::ModifiedOutgoingDamage' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, CallFunc_EvaluateFloatValue_ReturnValue) == 0x000010, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::CallFunc_EvaluateFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, CallFunc_EvaluateFloatValue_Value1_ImplicitCast) == 0x000014, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::CallFunc_EvaluateFloatValue_Value1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, K2Node_FunctionResult_ModifiedOutgoingDamage_ImplicitCast) == 0x000018, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::K2Node_FunctionResult_ModifiedOutgoingDamage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage, CallFunc_EvaluateFloatValue_Value2_ImplicitCast) == 0x000020, "Member 'PA_ModifyOutgoingDamage_C_ModifyOutgoingDamage::CallFunc_EvaluateFloatValue_Value2_ImplicitCast' has a wrong offset!");

// Function PA_ModifyOutgoingDamage.PA_ModifyOutgoingDamage_C.CanModifyFromTags
// 0x0030 (0x0030 - 0x0000)
struct PA_ModifyOutgoingDamage_C_CanModifyFromTags final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyOutgoingDamage_C_CanModifyFromTags) == 0x000008, "Wrong alignment on PA_ModifyOutgoingDamage_C_CanModifyFromTags");
static_assert(sizeof(PA_ModifyOutgoingDamage_C_CanModifyFromTags) == 0x000030, "Wrong size on PA_ModifyOutgoingDamage_C_CanModifyFromTags");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, Target) == 0x000000, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::Target' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, ReturnValue) == 0x000008, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000010, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000020, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000024, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyOutgoingDamage_C_CanModifyFromTags, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'PA_ModifyOutgoingDamage_C_CanModifyFromTags::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

