#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyRespawnTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ModifyRespawnTime.PA_ModifyRespawnTime_C.ModifyTimerValue
// 0x0030 (0x0030 - 0x0000)
struct PA_ModifyRespawnTime_C_ModifyTimerValue final
{
public:
	double                                        DefaultRespawnTime;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ModifiedRespawnTime;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value1_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value2_ImplicitCast;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyRespawnTime_C_ModifyTimerValue) == 0x000008, "Wrong alignment on PA_ModifyRespawnTime_C_ModifyTimerValue");
static_assert(sizeof(PA_ModifyRespawnTime_C_ModifyTimerValue) == 0x000030, "Wrong size on PA_ModifyRespawnTime_C_ModifyTimerValue");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, DefaultRespawnTime) == 0x000000, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::DefaultRespawnTime' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, ModifiedRespawnTime) == 0x000008, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::ModifiedRespawnTime' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, CallFunc_EvaluateFloatValue_ReturnValue) == 0x000010, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::CallFunc_EvaluateFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, CallFunc_EvaluateFloatValue_Value1_ImplicitCast) == 0x000020, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::CallFunc_EvaluateFloatValue_Value1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, CallFunc_EvaluateFloatValue_Value2_ImplicitCast) == 0x000024, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::CallFunc_EvaluateFloatValue_Value2_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyRespawnTime_C_ModifyTimerValue, CallFunc_FMax_A_ImplicitCast) == 0x000028, "Member 'PA_ModifyRespawnTime_C_ModifyTimerValue::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

}

