#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyCritAndStrengthOnPossess

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function PA_ModifyCritAndStrengthOnPossess.PA_ModifyCritAndStrengthOnPossess_C.SetNewValuesToASC
// 0x0090 (0x0090 - 0x0000)
struct PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC final
{
public:
	class UAbilitySystemComponent*                ASC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0008(0x0010)()
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue_1;           // 0x0020(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0038(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0050(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2; // 0x0060(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC) == 0x000008, "Wrong alignment on PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC");
static_assert(sizeof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC) == 0x000090, "Wrong size on PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, ASC) == 0x000000, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::ASC' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000008, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000018, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00001C, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_MakeOutgoingSpec_ReturnValue_1) == 0x000020, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_MakeOutgoingSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000038, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000048, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000050, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2) == 0x000060, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1) == 0x000070, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000080, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x000084, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2) == 0x000088, "Member 'PA_ModifyCritAndStrengthOnPossess_C_SetNewValuesToASC::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2' has a wrong offset!");

}

