#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyResidentNoiseVolume

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ModifyResidentNoiseVolume.PA_ModifyResidentNoiseVolume_C.ModifyResidentNoiseVolume
// 0x0028 (0x0028 - 0x0000)
struct PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume final
{
public:
	double                                        Outgoing_Volume;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Modified_Outgoing_Volume;                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value1_ImplicitCast;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Modified_Outgoing_Volume_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateFloatValue_Value2_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume) == 0x000008, "Wrong alignment on PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume");
static_assert(sizeof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume) == 0x000028, "Wrong size on PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, Outgoing_Volume) == 0x000000, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::Outgoing_Volume' has a wrong offset!");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, Modified_Outgoing_Volume) == 0x000008, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::Modified_Outgoing_Volume' has a wrong offset!");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, CallFunc_EvaluateFloatValue_ReturnValue) == 0x000010, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::CallFunc_EvaluateFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, CallFunc_EvaluateFloatValue_Value1_ImplicitCast) == 0x000014, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::CallFunc_EvaluateFloatValue_Value1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, K2Node_FunctionResult_Modified_Outgoing_Volume_ImplicitCast) == 0x000018, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::K2Node_FunctionResult_Modified_Outgoing_Volume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume, CallFunc_EvaluateFloatValue_Value2_ImplicitCast) == 0x000020, "Member 'PA_ModifyResidentNoiseVolume_C_ModifyResidentNoiseVolume::CallFunc_EvaluateFloatValue_Value2_ImplicitCast' has a wrong offset!");

}

