#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ModifyPurchaseAmount

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ModifyPurchaseAmount.PA_ModifyPurchaseAmount_C.ModifyItemAmount
// 0x000C (0x000C - 0x0000)
struct PA_ModifyPurchaseAmount_C_ModifyItemAmount final
{
public:
	int32                                         AmountToAdd;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifiedAmountToAdd;                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_EvaluateIntValue_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ModifyPurchaseAmount_C_ModifyItemAmount) == 0x000004, "Wrong alignment on PA_ModifyPurchaseAmount_C_ModifyItemAmount");
static_assert(sizeof(PA_ModifyPurchaseAmount_C_ModifyItemAmount) == 0x00000C, "Wrong size on PA_ModifyPurchaseAmount_C_ModifyItemAmount");
static_assert(offsetof(PA_ModifyPurchaseAmount_C_ModifyItemAmount, AmountToAdd) == 0x000000, "Member 'PA_ModifyPurchaseAmount_C_ModifyItemAmount::AmountToAdd' has a wrong offset!");
static_assert(offsetof(PA_ModifyPurchaseAmount_C_ModifyItemAmount, ModifiedAmountToAdd) == 0x000004, "Member 'PA_ModifyPurchaseAmount_C_ModifyItemAmount::ModifiedAmountToAdd' has a wrong offset!");
static_assert(offsetof(PA_ModifyPurchaseAmount_C_ModifyItemAmount, CallFunc_EvaluateIntValue_ReturnValue) == 0x000008, "Member 'PA_ModifyPurchaseAmount_C_ModifyItemAmount::CallFunc_EvaluateIntValue_ReturnValue' has a wrong offset!");

}

