#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ReplaceItemDescriptionOnEquip

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ReplaceItemDescriptionOnEquip.PA_ReplaceItemDescriptionOnEquip_C.ReplaceDescription
// 0x0018 (0x0018 - 0x0000)
struct PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription final
{
public:
	class UEquipmentInstance*                     Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription) == 0x000008, "Wrong alignment on PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription");
static_assert(sizeof(PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription) == 0x000018, "Wrong size on PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription");
static_assert(offsetof(PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription, Instance) == 0x000000, "Member 'PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription::Instance' has a wrong offset!");
static_assert(offsetof(PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000010, "Member 'PA_ReplaceItemDescriptionOnEquip_C_ReplaceDescription::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

}

