#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerControllerJP_TutorialBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerControllerJP_TutorialBP.PlayerControllerJP_TutorialBP_C
// 0x0030 (0x0A70 - 0x0A40)
class APlayerControllerJP_TutorialBP_C final : public APlayerControllerJP_Tutorial
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPlayerControllerJP_MatchBPComponent_C* PlayerControllerJP_MatchBPComponent;               // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PingControllerComponent_C*          BP_PingControllerComponent;                        // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_TutorialManager_C*                  TutorialManager;                                   // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LookStickValue;                                    // 0x0A60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EndTestVoiceChat();
	void ExecuteUbergraph_PlayerControllerJP_TutorialBP(int32 EntryPoint);
	void InpActEvt_IA_LookStickUI_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_LookStickUI_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_N_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void Owner_Send_Item_Pick_Up_Message(const struct FGameplayTag& ItemTag);
	void Owner_SendMessage(const struct FPlayerMessage& PlayerMessage);
	void OwnerSendItemPickUpMessageToPlayerController(const struct FGameplayTag& ItemTag);
	void OwnerSendMessageToPlayerController(const struct FPlayerMessage& Message);
	void OwnerSendPlayerLeftMessage(class APlayerState* PlayerWhoLeft);
	void ReceiveBeginPlay();
	void StartMicrohoneTest(bool IsEnabled);
	void StartTestVoiceChat();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerControllerJP_TutorialBP_C">();
	}
	static class APlayerControllerJP_TutorialBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerControllerJP_TutorialBP_C>();
	}
};
static_assert(alignof(APlayerControllerJP_TutorialBP_C) == 0x000008, "Wrong alignment on APlayerControllerJP_TutorialBP_C");
static_assert(sizeof(APlayerControllerJP_TutorialBP_C) == 0x000A70, "Wrong size on APlayerControllerJP_TutorialBP_C");
static_assert(offsetof(APlayerControllerJP_TutorialBP_C, UberGraphFrame) == 0x000A40, "Member 'APlayerControllerJP_TutorialBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerControllerJP_TutorialBP_C, PlayerControllerJP_MatchBPComponent) == 0x000A48, "Member 'APlayerControllerJP_TutorialBP_C::PlayerControllerJP_MatchBPComponent' has a wrong offset!");
static_assert(offsetof(APlayerControllerJP_TutorialBP_C, BP_PingControllerComponent) == 0x000A50, "Member 'APlayerControllerJP_TutorialBP_C::BP_PingControllerComponent' has a wrong offset!");
static_assert(offsetof(APlayerControllerJP_TutorialBP_C, TutorialManager) == 0x000A58, "Member 'APlayerControllerJP_TutorialBP_C::TutorialManager' has a wrong offset!");
static_assert(offsetof(APlayerControllerJP_TutorialBP_C, LookStickValue) == 0x000A60, "Member 'APlayerControllerJP_TutorialBP_C::LookStickValue' has a wrong offset!");

}

