#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintMessageEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PrintMessageEntryWI.PrintMessageEntryWI_C
// 0x0028 (0x0308 - 0x02E0)
class UPrintMessageEntryWI_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Base;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_1;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_PrintMessageEntryWI(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrintMessageEntryWI_C">();
	}
	static class UPrintMessageEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrintMessageEntryWI_C>();
	}
};
static_assert(alignof(UPrintMessageEntryWI_C) == 0x000008, "Wrong alignment on UPrintMessageEntryWI_C");
static_assert(sizeof(UPrintMessageEntryWI_C) == 0x000308, "Wrong size on UPrintMessageEntryWI_C");
static_assert(offsetof(UPrintMessageEntryWI_C, UberGraphFrame) == 0x0002E0, "Member 'UPrintMessageEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrintMessageEntryWI_C, FadeIn) == 0x0002E8, "Member 'UPrintMessageEntryWI_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UPrintMessageEntryWI_C, Overlay_Base) == 0x0002F0, "Member 'UPrintMessageEntryWI_C::Overlay_Base' has a wrong offset!");
static_assert(offsetof(UPrintMessageEntryWI_C, RichTextBlock_1) == 0x0002F8, "Member 'UPrintMessageEntryWI_C::RichTextBlock_1' has a wrong offset!");
static_assert(offsetof(UPrintMessageEntryWI_C, ContentAlignment) == 0x000300, "Member 'UPrintMessageEntryWI_C::ContentAlignment' has a wrong offset!");

}

