#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintMessageEntryWI

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function PrintMessageEntryWI.PrintMessageEntryWI_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct PrintMessageEntryWI_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageEntryWI_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on PrintMessageEntryWI_C_BP_OnItemExpansionChanged");
static_assert(sizeof(PrintMessageEntryWI_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on PrintMessageEntryWI_C_BP_OnItemExpansionChanged");
static_assert(offsetof(PrintMessageEntryWI_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'PrintMessageEntryWI_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function PrintMessageEntryWI.PrintMessageEntryWI_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct PrintMessageEntryWI_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageEntryWI_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on PrintMessageEntryWI_C_BP_OnItemSelectionChanged");
static_assert(sizeof(PrintMessageEntryWI_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on PrintMessageEntryWI_C_BP_OnItemSelectionChanged");
static_assert(offsetof(PrintMessageEntryWI_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'PrintMessageEntryWI_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function PrintMessageEntryWI.PrintMessageEntryWI_C.ExecuteUbergraph_PrintMessageEntryWI
// 0x0110 (0x0110 - 0x0000)
struct PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PrintPlayerMessageEntry_C*          K2Node_DynamicCast_AsBP_Print_Player_Message_Entry; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMessageCategory                              Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0010)()
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI) == 0x000008, "Wrong alignment on PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI");
static_assert(sizeof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI) == 0x000110, "Wrong size on PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, EntryPoint) == 0x000000, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable) == 0x000008, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable_1) == 0x000018, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable_2) == 0x000028, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable_3) == 0x000038, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable_4) == 0x000048, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_int_Array_Index_Variable) == 0x000058, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_string_Variable_5) == 0x000068, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_Event_bIsExpanded) == 0x000078, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_Event_bIsSelected) == 0x000079, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_Event_ListItemObject) == 0x000080, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_DynamicCast_AsBP_Print_Player_Message_Entry) == 0x000088, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_DynamicCast_AsBP_Print_Player_Message_Entry' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, Temp_byte_Variable) == 0x0000A0, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_Select_Default) == 0x0000A8, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_GetAllChildren_ReturnValue) == 0x0000C8, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000100, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, K2Node_Event_IsDesignTime) == 0x00010C, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI, CallFunc_Less_IntInt_ReturnValue) == 0x00010D, "Member 'PrintMessageEntryWI_C_ExecuteUbergraph_PrintMessageEntryWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function PrintMessageEntryWI.PrintMessageEntryWI_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct PrintMessageEntryWI_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageEntryWI_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on PrintMessageEntryWI_C_OnListItemObjectSet");
static_assert(sizeof(PrintMessageEntryWI_C_OnListItemObjectSet) == 0x000008, "Wrong size on PrintMessageEntryWI_C_OnListItemObjectSet");
static_assert(offsetof(PrintMessageEntryWI_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'PrintMessageEntryWI_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function PrintMessageEntryWI.PrintMessageEntryWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PrintMessageEntryWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageEntryWI_C_PreConstruct) == 0x000001, "Wrong alignment on PrintMessageEntryWI_C_PreConstruct");
static_assert(sizeof(PrintMessageEntryWI_C_PreConstruct) == 0x000001, "Wrong size on PrintMessageEntryWI_C_PreConstruct");
static_assert(offsetof(PrintMessageEntryWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PrintMessageEntryWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

