#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressbarWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProgressbarWI.ProgressbarWI_C.ExecuteUbergraph_ProgressbarWI
// 0x01A8 (0x01A8 - 0x0000)
struct ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InPercent;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VectorSpringInterp_ReturnValue;           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_DelayedPercentage;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI) == 0x000008, "Wrong alignment on ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI");
static_assert(sizeof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI) == 0x0001A8, "Wrong size on ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, EntryPoint) == 0x000000, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_GetTimeSeconds_ReturnValue) == 0x000010, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, K2Node_Event_MyGeometry) == 0x000028, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, K2Node_Event_InDeltaTime) == 0x000060, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000068, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, K2Node_CustomEvent_InPercent) == 0x000070, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::K2Node_CustomEvent_InPercent' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_MakeVector2D_ReturnValue_1) == 0x000080, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_FInterpTo_ReturnValue) == 0x000098, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_VectorSpringInterp_ReturnValue) == 0x0000B8, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_VectorSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_MakeVector2D_ReturnValue_2) == 0x0000D8, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_RandomUnitVector_ReturnValue) == 0x0000E8, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000100, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000108, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000120, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_BreakVector_X) == 0x000138, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_BreakVector_Y) == 0x000140, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_BreakVector_Z) == 0x000148, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_MakeVector2D_ReturnValue_3) == 0x000150, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000160, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, K2Node_Event_IsDesignTime) == 0x000168, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, K2Node_CustomEvent_DelayedPercentage) == 0x000170, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::K2Node_CustomEvent_DelayedPercentage' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_MakeVector2D_ReturnValue_4) == 0x000178, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000188, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000190, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000198, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x00019C, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001A0, "Member 'ProgressbarWI_C_ExecuteUbergraph_ProgressbarWI::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function ProgressbarWI.ProgressbarWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ProgressbarWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressbarWI_C_PreConstruct) == 0x000001, "Wrong alignment on ProgressbarWI_C_PreConstruct");
static_assert(sizeof(ProgressbarWI_C_PreConstruct) == 0x000001, "Wrong size on ProgressbarWI_C_PreConstruct");
static_assert(offsetof(ProgressbarWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ProgressbarWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ProgressbarWI.ProgressbarWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct ProgressbarWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressbarWI_C_Tick) == 0x000004, "Wrong alignment on ProgressbarWI_C_Tick");
static_assert(sizeof(ProgressbarWI_C_Tick) == 0x00003C, "Wrong size on ProgressbarWI_C_Tick");
static_assert(offsetof(ProgressbarWI_C_Tick, MyGeometry) == 0x000000, "Member 'ProgressbarWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ProgressbarWI_C_Tick, InDeltaTime) == 0x000038, "Member 'ProgressbarWI_C_Tick::InDeltaTime' has a wrong offset!");

// Function ProgressbarWI.ProgressbarWI_C.Update Delayed Progressbar Instant
// 0x0008 (0x0008 - 0x0000)
struct ProgressbarWI_C_Update_Delayed_Progressbar_Instant final
{
public:
	double                                        DelayedPercentage_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressbarWI_C_Update_Delayed_Progressbar_Instant) == 0x000008, "Wrong alignment on ProgressbarWI_C_Update_Delayed_Progressbar_Instant");
static_assert(sizeof(ProgressbarWI_C_Update_Delayed_Progressbar_Instant) == 0x000008, "Wrong size on ProgressbarWI_C_Update_Delayed_Progressbar_Instant");
static_assert(offsetof(ProgressbarWI_C_Update_Delayed_Progressbar_Instant, DelayedPercentage_0) == 0x000000, "Member 'ProgressbarWI_C_Update_Delayed_Progressbar_Instant::DelayedPercentage_0' has a wrong offset!");

// Function ProgressbarWI.ProgressbarWI_C.Update Progressbar Percentage
// 0x0008 (0x0008 - 0x0000)
struct ProgressbarWI_C_Update_Progressbar_Percentage final
{
public:
	double                                        InPercent;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressbarWI_C_Update_Progressbar_Percentage) == 0x000008, "Wrong alignment on ProgressbarWI_C_Update_Progressbar_Percentage");
static_assert(sizeof(ProgressbarWI_C_Update_Progressbar_Percentage) == 0x000008, "Wrong size on ProgressbarWI_C_Update_Progressbar_Percentage");
static_assert(offsetof(ProgressbarWI_C_Update_Progressbar_Percentage, InPercent) == 0x000000, "Member 'ProgressbarWI_C_Update_Progressbar_Percentage::InPercent' has a wrong offset!");

}

