#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QueryContext_GooseControllingActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function QueryContext_GooseControllingActor.QueryContext_GooseControllingActor_C.ProvideSingleActor
// 0x0038 (0x0038 - 0x0000)
struct QueryContext_GooseControllingActor_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_GooseController_C>  K2Node_DynamicCast_AsI_Goose_Controller;           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGooseController_ControllingActor;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QueryContext_GooseControllingActor_C_ProvideSingleActor) == 0x000008, "Wrong alignment on QueryContext_GooseControllingActor_C_ProvideSingleActor");
static_assert(sizeof(QueryContext_GooseControllingActor_C_ProvideSingleActor) == 0x000038, "Wrong size on QueryContext_GooseControllingActor_C_ProvideSingleActor");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, K2Node_DynamicCast_AsI_Goose_Controller) == 0x000018, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::K2Node_DynamicCast_AsI_Goose_Controller' has a wrong offset!");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QueryContext_GooseControllingActor_C_ProvideSingleActor, CallFunc_GetGooseController_ControllingActor) == 0x000030, "Member 'QueryContext_GooseControllingActor_C_ProvideSingleActor::CallFunc_GetGooseController_ControllingActor' has a wrong offset!");

}

