#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebindKeyEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebindKeyEntryWI.RebindKeyEntryWI_C
// 0x00A8 (0x0388 - 0x02E0)
class URebindKeyEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BS;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                      InputKeySelector;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Action;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ShownSlotName;                                     // 0x0300(0x0010)(Edit, BlueprintVisible)
	class FName                                   InputMappingName;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            LastKeyChanged;                                    // 0x0318(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   LastInputAxisChanged;                              // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             AssignSound;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   ResetDefaultKey;                                   // 0x0368(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Axis;                                              // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__InputKeySelector_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__RebindKeyEntryWI_InputKeySelector_K2Node_ComponentBoundEvent_1_OnIsSelectingKeyChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_RebindKeyEntryWI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Widget();
	void Reset_To_Default_Key();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebindKeyEntryWI_C">();
	}
	static class URebindKeyEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebindKeyEntryWI_C>();
	}
};
static_assert(alignof(URebindKeyEntryWI_C) == 0x000008, "Wrong alignment on URebindKeyEntryWI_C");
static_assert(sizeof(URebindKeyEntryWI_C) == 0x000388, "Wrong size on URebindKeyEntryWI_C");
static_assert(offsetof(URebindKeyEntryWI_C, UberGraphFrame) == 0x0002E0, "Member 'URebindKeyEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, BS) == 0x0002E8, "Member 'URebindKeyEntryWI_C::BS' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, InputKeySelector) == 0x0002F0, "Member 'URebindKeyEntryWI_C::InputKeySelector' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, Text_Action) == 0x0002F8, "Member 'URebindKeyEntryWI_C::Text_Action' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, ShownSlotName) == 0x000300, "Member 'URebindKeyEntryWI_C::ShownSlotName' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, InputMappingName) == 0x000310, "Member 'URebindKeyEntryWI_C::InputMappingName' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, LastKeyChanged) == 0x000318, "Member 'URebindKeyEntryWI_C::LastKeyChanged' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, LastInputAxisChanged) == 0x000338, "Member 'URebindKeyEntryWI_C::LastInputAxisChanged' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, AssignSound) == 0x000360, "Member 'URebindKeyEntryWI_C::AssignSound' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, ResetDefaultKey) == 0x000368, "Member 'URebindKeyEntryWI_C::ResetDefaultKey' has a wrong offset!");
static_assert(offsetof(URebindKeyEntryWI_C, Axis) == 0x000380, "Member 'URebindKeyEntryWI_C::Axis' has a wrong offset!");

}

