#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AvatarInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_AvatarInfo.S_AvatarInfo
// 0x0040 (0x0040 - 0x0000)
struct FS_AvatarInfo final
{
public:
	class FString                                 PlayerName_2_324D9C084611C539C88BC2AD56483542;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              SoftPortraitTexture_10_8E15F8B8433178A6429A47B02BAE1BBB; // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Level_8_30459A2A45F53890044D868294B4ED00;          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterLevel_13_0E611E3F4FBC97CDC7CEE7B49F05FA72; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AvatarInfo) == 0x000008, "Wrong alignment on FS_AvatarInfo");
static_assert(sizeof(FS_AvatarInfo) == 0x000040, "Wrong size on FS_AvatarInfo");
static_assert(offsetof(FS_AvatarInfo, PlayerName_2_324D9C084611C539C88BC2AD56483542) == 0x000000, "Member 'FS_AvatarInfo::PlayerName_2_324D9C084611C539C88BC2AD56483542' has a wrong offset!");
static_assert(offsetof(FS_AvatarInfo, SoftPortraitTexture_10_8E15F8B8433178A6429A47B02BAE1BBB) == 0x000010, "Member 'FS_AvatarInfo::SoftPortraitTexture_10_8E15F8B8433178A6429A47B02BAE1BBB' has a wrong offset!");
static_assert(offsetof(FS_AvatarInfo, Level_8_30459A2A45F53890044D868294B4ED00) == 0x000038, "Member 'FS_AvatarInfo::Level_8_30459A2A45F53890044D868294B4ED00' has a wrong offset!");
static_assert(offsetof(FS_AvatarInfo, CharacterLevel_13_0E611E3F4FBC97CDC7CEE7B49F05FA72) == 0x00003C, "Member 'FS_AvatarInfo::CharacterLevel_13_0E611E3F4FBC97CDC7CEE7B49F05FA72' has a wrong offset!");

}

