#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CharacterIKOffset_TPP

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_CharacterIKOffset_TPP.S_CharacterIKOffset_TPP
// 0x00F0 (0x00F0 - 0x0000)
struct FS_CharacterIKOffset_TPP final
{
public:
	TMap<EItemsJP, struct FTransform>             WeaponMountTransformOffsetTPP_71_54891EDC40381A87CF799DADAE35EE8D; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<EItemsJP, struct FVector>                HandLOffsetTPP_66_A3461F3343FE08604DC071B167183D38; // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<EItemsJP, struct FVector>                HandROffsetTPP_73_A5E724F846E9128E8F24E09764B2E43E; // 0x00A0(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_CharacterIKOffset_TPP) == 0x000008, "Wrong alignment on FS_CharacterIKOffset_TPP");
static_assert(sizeof(FS_CharacterIKOffset_TPP) == 0x0000F0, "Wrong size on FS_CharacterIKOffset_TPP");
static_assert(offsetof(FS_CharacterIKOffset_TPP, WeaponMountTransformOffsetTPP_71_54891EDC40381A87CF799DADAE35EE8D) == 0x000000, "Member 'FS_CharacterIKOffset_TPP::WeaponMountTransformOffsetTPP_71_54891EDC40381A87CF799DADAE35EE8D' has a wrong offset!");
static_assert(offsetof(FS_CharacterIKOffset_TPP, HandLOffsetTPP_66_A3461F3343FE08604DC071B167183D38) == 0x000050, "Member 'FS_CharacterIKOffset_TPP::HandLOffsetTPP_66_A3461F3343FE08604DC071B167183D38' has a wrong offset!");
static_assert(offsetof(FS_CharacterIKOffset_TPP, HandROffsetTPP_73_A5E724F846E9128E8F24E09764B2E43E) == 0x0000A0, "Member 'FS_CharacterIKOffset_TPP::HandROffsetTPP_73_A5E724F846E9128E8F24E09764B2E43E' has a wrong offset!");

}

