#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EventMessageParams

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EventMessageParams.S_EventMessageParams
// 0x0028 (0x0028 - 0x0000)
struct FS_EventMessageParams final
{
public:
	class APlayerController*                      Controller_2_4451427A46AD550FAD7B2EB501A12C67;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        LifeTime_5_D214ACA040D76B4907B1EA90B430C58B;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMessageRecipient                             Reciever_8_C3A274DF4667903BA0070BA0FEC75C4B;       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color_11_5787775A44DE6443C5648990F0ECA49C;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Message_14_91BC1858476A140824F018944D92657A;       // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_EventMessageParams) == 0x000008, "Wrong alignment on FS_EventMessageParams");
static_assert(sizeof(FS_EventMessageParams) == 0x000028, "Wrong size on FS_EventMessageParams");
static_assert(offsetof(FS_EventMessageParams, Controller_2_4451427A46AD550FAD7B2EB501A12C67) == 0x000000, "Member 'FS_EventMessageParams::Controller_2_4451427A46AD550FAD7B2EB501A12C67' has a wrong offset!");
static_assert(offsetof(FS_EventMessageParams, LifeTime_5_D214ACA040D76B4907B1EA90B430C58B) == 0x000008, "Member 'FS_EventMessageParams::LifeTime_5_D214ACA040D76B4907B1EA90B430C58B' has a wrong offset!");
static_assert(offsetof(FS_EventMessageParams, Reciever_8_C3A274DF4667903BA0070BA0FEC75C4B) == 0x000010, "Member 'FS_EventMessageParams::Reciever_8_C3A274DF4667903BA0070BA0FEC75C4B' has a wrong offset!");
static_assert(offsetof(FS_EventMessageParams, Color_11_5787775A44DE6443C5648990F0ECA49C) == 0x000014, "Member 'FS_EventMessageParams::Color_11_5787775A44DE6443C5648990F0ECA49C' has a wrong offset!");
static_assert(offsetof(FS_EventMessageParams, Message_14_91BC1858476A140824F018944D92657A) == 0x000018, "Member 'FS_EventMessageParams::Message_14_91BC1858476A140824F018944D92657A' has a wrong offset!");

}

