#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ImportantNotificationReceivedMessage

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_ImportantNotificationReceivedMessage.S_ImportantNotificationReceivedMessage
// 0x0090 (0x0090 - 0x0000)
struct FS_ImportantNotificationReceivedMessage final
{
public:
	class FText                                   NotificationText_2_B6BF808C4FA809A45B50CB827BE469D7; // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              IconTexture_6_BE42D7144AEB60039CF2E59E480BE841;    // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      IconMaterial_16_EEFDC8A64E4E4E11398AA784DC329219;  // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        MaxLifetime_9_19854D0E440744DFB8D3889811543B68;    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SoundCue_12_DE5E9B774461D09257139CBE3795EFE2;      // 0x0068(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_ImportantNotificationReceivedMessage) == 0x000008, "Wrong alignment on FS_ImportantNotificationReceivedMessage");
static_assert(sizeof(FS_ImportantNotificationReceivedMessage) == 0x000090, "Wrong size on FS_ImportantNotificationReceivedMessage");
static_assert(offsetof(FS_ImportantNotificationReceivedMessage, NotificationText_2_B6BF808C4FA809A45B50CB827BE469D7) == 0x000000, "Member 'FS_ImportantNotificationReceivedMessage::NotificationText_2_B6BF808C4FA809A45B50CB827BE469D7' has a wrong offset!");
static_assert(offsetof(FS_ImportantNotificationReceivedMessage, IconTexture_6_BE42D7144AEB60039CF2E59E480BE841) == 0x000010, "Member 'FS_ImportantNotificationReceivedMessage::IconTexture_6_BE42D7144AEB60039CF2E59E480BE841' has a wrong offset!");
static_assert(offsetof(FS_ImportantNotificationReceivedMessage, IconMaterial_16_EEFDC8A64E4E4E11398AA784DC329219) == 0x000038, "Member 'FS_ImportantNotificationReceivedMessage::IconMaterial_16_EEFDC8A64E4E4E11398AA784DC329219' has a wrong offset!");
static_assert(offsetof(FS_ImportantNotificationReceivedMessage, MaxLifetime_9_19854D0E440744DFB8D3889811543B68) == 0x000060, "Member 'FS_ImportantNotificationReceivedMessage::MaxLifetime_9_19854D0E440744DFB8D3889811543B68' has a wrong offset!");
static_assert(offsetof(FS_ImportantNotificationReceivedMessage, SoundCue_12_DE5E9B774461D09257139CBE3795EFE2) == 0x000068, "Member 'FS_ImportantNotificationReceivedMessage::SoundCue_12_DE5E9B774461D09257139CBE3795EFE2' has a wrong offset!");

}

