#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ImageInsertion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ImageInsertion.S_ImageInsertion
// 0x0028 (0x0028 - 0x0000)
struct FS_ImageInsertion final
{
public:
	class UTexture2D*                             Image_10_DDDE20C14186382B1D4C5198AD4D047A;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size_9_B3E314F4447A66C6BAF2EABC8FE6D344;           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowThisImage_6_7B838DF9490023FBA1422E85C6D2CEBA;  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TopMargin_13_CCAAC14C4039901E0B0564862217F0AA;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottomMargin_15_219D687D48BD66ED1AB55D8E5AF3A6F3;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          HorizontalAlignment_18_ADF3199E4C3F9D1381D9CEB89A7D796D; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            VerticalAlignment_21_5B6CC596483769BC5FA32ABE283F62E7; // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ImageInsertion) == 0x000008, "Wrong alignment on FS_ImageInsertion");
static_assert(sizeof(FS_ImageInsertion) == 0x000028, "Wrong size on FS_ImageInsertion");
static_assert(offsetof(FS_ImageInsertion, Image_10_DDDE20C14186382B1D4C5198AD4D047A) == 0x000000, "Member 'FS_ImageInsertion::Image_10_DDDE20C14186382B1D4C5198AD4D047A' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, Size_9_B3E314F4447A66C6BAF2EABC8FE6D344) == 0x000008, "Member 'FS_ImageInsertion::Size_9_B3E314F4447A66C6BAF2EABC8FE6D344' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, ShowThisImage_6_7B838DF9490023FBA1422E85C6D2CEBA) == 0x000018, "Member 'FS_ImageInsertion::ShowThisImage_6_7B838DF9490023FBA1422E85C6D2CEBA' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, TopMargin_13_CCAAC14C4039901E0B0564862217F0AA) == 0x00001C, "Member 'FS_ImageInsertion::TopMargin_13_CCAAC14C4039901E0B0564862217F0AA' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, BottomMargin_15_219D687D48BD66ED1AB55D8E5AF3A6F3) == 0x000020, "Member 'FS_ImageInsertion::BottomMargin_15_219D687D48BD66ED1AB55D8E5AF3A6F3' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, HorizontalAlignment_18_ADF3199E4C3F9D1381D9CEB89A7D796D) == 0x000024, "Member 'FS_ImageInsertion::HorizontalAlignment_18_ADF3199E4C3F9D1381D9CEB89A7D796D' has a wrong offset!");
static_assert(offsetof(FS_ImageInsertion, VerticalAlignment_21_5B6CC596483769BC5FA32ABE283F62E7) == 0x000025, "Member 'FS_ImageInsertion::VerticalAlignment_21_5B6CC596483769BC5FA32ABE283F62E7' has a wrong offset!");

}

