#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LobbyCharacterWorldSlotInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LobbyCharacterWorldSlotInfo.S_LobbyCharacterWorldSlotInfo
// 0x0018 (0x0018 - 0x0000)
struct FS_LobbyCharacterWorldSlotInfo final
{
public:
	class APlayerStateJP_Lobby_BP_C*              PlayerState_13_6C579ACF4FE66AB6CA15F7B915E595A7;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharacterId_6_FD84BC964CF614C62FAED799BC15C9B6;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NeighborIdentifier_12_BE65402842BBA7426E69FCA88FC85650; // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LobbyCharacterWorldSlotInfo) == 0x000008, "Wrong alignment on FS_LobbyCharacterWorldSlotInfo");
static_assert(sizeof(FS_LobbyCharacterWorldSlotInfo) == 0x000018, "Wrong size on FS_LobbyCharacterWorldSlotInfo");
static_assert(offsetof(FS_LobbyCharacterWorldSlotInfo, PlayerState_13_6C579ACF4FE66AB6CA15F7B915E595A7) == 0x000000, "Member 'FS_LobbyCharacterWorldSlotInfo::PlayerState_13_6C579ACF4FE66AB6CA15F7B915E595A7' has a wrong offset!");
static_assert(offsetof(FS_LobbyCharacterWorldSlotInfo, CharacterId_6_FD84BC964CF614C62FAED799BC15C9B6) == 0x000008, "Member 'FS_LobbyCharacterWorldSlotInfo::CharacterId_6_FD84BC964CF614C62FAED799BC15C9B6' has a wrong offset!");
static_assert(offsetof(FS_LobbyCharacterWorldSlotInfo, NeighborIdentifier_12_BE65402842BBA7426E69FCA88FC85650) == 0x000010, "Member 'FS_LobbyCharacterWorldSlotInfo::NeighborIdentifier_12_BE65402842BBA7426E69FCA88FC85650' has a wrong offset!");

}

