#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_MatchItemPurchase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_MatchItemPurchase.S_MatchItemPurchase
// 0x0030 (0x0030 - 0x0000)
struct FS_MatchItemPurchase final
{
public:
	class FString                                 PlayerTitleId_28_30ED3C654895BB1325BF6FBF965C90E3; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           BoughtItemIdentifier_21_9E7A5B704D4C15F71AA8A388877EBC88; // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamId_11_A3D7C398493DA987DF3AB6B4D461D6AD;        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MoneyAfterPurchase_18_CEA15B7C43BF97DE9E8EB6A59B6623C8; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WoodAfterPurchase_17_569F244C4099FB853BF16887349C5E83; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_MatchItemPurchase) == 0x000008, "Wrong alignment on FS_MatchItemPurchase");
static_assert(sizeof(FS_MatchItemPurchase) == 0x000030, "Wrong size on FS_MatchItemPurchase");
static_assert(offsetof(FS_MatchItemPurchase, PlayerTitleId_28_30ED3C654895BB1325BF6FBF965C90E3) == 0x000000, "Member 'FS_MatchItemPurchase::PlayerTitleId_28_30ED3C654895BB1325BF6FBF965C90E3' has a wrong offset!");
static_assert(offsetof(FS_MatchItemPurchase, BoughtItemIdentifier_21_9E7A5B704D4C15F71AA8A388877EBC88) == 0x000010, "Member 'FS_MatchItemPurchase::BoughtItemIdentifier_21_9E7A5B704D4C15F71AA8A388877EBC88' has a wrong offset!");
static_assert(offsetof(FS_MatchItemPurchase, TeamId_11_A3D7C398493DA987DF3AB6B4D461D6AD) == 0x000018, "Member 'FS_MatchItemPurchase::TeamId_11_A3D7C398493DA987DF3AB6B4D461D6AD' has a wrong offset!");
static_assert(offsetof(FS_MatchItemPurchase, MoneyAfterPurchase_18_CEA15B7C43BF97DE9E8EB6A59B6623C8) == 0x000020, "Member 'FS_MatchItemPurchase::MoneyAfterPurchase_18_CEA15B7C43BF97DE9E8EB6A59B6623C8' has a wrong offset!");
static_assert(offsetof(FS_MatchItemPurchase, WoodAfterPurchase_17_569F244C4099FB853BF16887349C5E83) == 0x000028, "Member 'FS_MatchItemPurchase::WoodAfterPurchase_17_569F244C4099FB853BF16887349C5E83' has a wrong offset!");

}

