#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_MatchSummary

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_MatchSummary.S_MatchSummary
// 0x0060 (0x0060 - 0x0000)
struct FS_MatchSummary final
{
public:
	int32                                         TotalMatchTime_9_390EC82647E469F0BD4AD082EB67A695; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EndConditionName_8_45ED178F4DB7BD2567CE2FB28F8DF1FA; // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         WinningTeamId_11_213C301D406121E46370EFB38520342C; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PlayerMasterIdsTeam1_33_2D74C1F0448936350BE3AC8111C39C0A; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerMasterIdsTeam2_32_A391D44845F2A4A966C2DB9B4D63F822; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerMasterIdsTeam1MatchStart_30_3A2BB81F419063A44815879138D50933; // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerMasterIdsTeam2MatchStart_31_816FA8344912B3718A4EB89568C1031C; // 0x0050(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_MatchSummary) == 0x000008, "Wrong alignment on FS_MatchSummary");
static_assert(sizeof(FS_MatchSummary) == 0x000060, "Wrong size on FS_MatchSummary");
static_assert(offsetof(FS_MatchSummary, TotalMatchTime_9_390EC82647E469F0BD4AD082EB67A695) == 0x000000, "Member 'FS_MatchSummary::TotalMatchTime_9_390EC82647E469F0BD4AD082EB67A695' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, EndConditionName_8_45ED178F4DB7BD2567CE2FB28F8DF1FA) == 0x000008, "Member 'FS_MatchSummary::EndConditionName_8_45ED178F4DB7BD2567CE2FB28F8DF1FA' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, WinningTeamId_11_213C301D406121E46370EFB38520342C) == 0x000018, "Member 'FS_MatchSummary::WinningTeamId_11_213C301D406121E46370EFB38520342C' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, PlayerMasterIdsTeam1_33_2D74C1F0448936350BE3AC8111C39C0A) == 0x000020, "Member 'FS_MatchSummary::PlayerMasterIdsTeam1_33_2D74C1F0448936350BE3AC8111C39C0A' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, PlayerMasterIdsTeam2_32_A391D44845F2A4A966C2DB9B4D63F822) == 0x000030, "Member 'FS_MatchSummary::PlayerMasterIdsTeam2_32_A391D44845F2A4A966C2DB9B4D63F822' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, PlayerMasterIdsTeam1MatchStart_30_3A2BB81F419063A44815879138D50933) == 0x000040, "Member 'FS_MatchSummary::PlayerMasterIdsTeam1MatchStart_30_3A2BB81F419063A44815879138D50933' has a wrong offset!");
static_assert(offsetof(FS_MatchSummary, PlayerMasterIdsTeam2MatchStart_31_816FA8344912B3718A4EB89568C1031C) == 0x000050, "Member 'FS_MatchSummary::PlayerMasterIdsTeam2MatchStart_31_816FA8344912B3718A4EB89568C1031C' has a wrong offset!");

}

