#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PlayerSummary

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PlayerSummary.S_PlayerSummary
// 0x00B0 (0x00B0 - 0x0000)
struct FS_PlayerSummary final
{
public:
	int32                                         TeamId_9_D9ECE8AA4740FCD1B698C5AC71D285A0;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Kills_4_B39B8FAD47B7488EDB67DDB1A8527505;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Assists_5_AF218A994868415AA63C88B132FA49A0;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Deaths_7_02E2506B46BC689D49D5689698DF89DC;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, int32>                    KilledByPlayer_29_786B036D4F179A6279CB7E8306EB2FA5; // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, int32>                    KilledByNonPlayer_31_8E2D99014A5153A516D911AC35516143; // 0x0060(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_PlayerSummary) == 0x000008, "Wrong alignment on FS_PlayerSummary");
static_assert(sizeof(FS_PlayerSummary) == 0x0000B0, "Wrong size on FS_PlayerSummary");
static_assert(offsetof(FS_PlayerSummary, TeamId_9_D9ECE8AA4740FCD1B698C5AC71D285A0) == 0x000000, "Member 'FS_PlayerSummary::TeamId_9_D9ECE8AA4740FCD1B698C5AC71D285A0' has a wrong offset!");
static_assert(offsetof(FS_PlayerSummary, Kills_4_B39B8FAD47B7488EDB67DDB1A8527505) == 0x000004, "Member 'FS_PlayerSummary::Kills_4_B39B8FAD47B7488EDB67DDB1A8527505' has a wrong offset!");
static_assert(offsetof(FS_PlayerSummary, Assists_5_AF218A994868415AA63C88B132FA49A0) == 0x000008, "Member 'FS_PlayerSummary::Assists_5_AF218A994868415AA63C88B132FA49A0' has a wrong offset!");
static_assert(offsetof(FS_PlayerSummary, Deaths_7_02E2506B46BC689D49D5689698DF89DC) == 0x00000C, "Member 'FS_PlayerSummary::Deaths_7_02E2506B46BC689D49D5689698DF89DC' has a wrong offset!");
static_assert(offsetof(FS_PlayerSummary, KilledByPlayer_29_786B036D4F179A6279CB7E8306EB2FA5) == 0x000010, "Member 'FS_PlayerSummary::KilledByPlayer_29_786B036D4F179A6279CB7E8306EB2FA5' has a wrong offset!");
static_assert(offsetof(FS_PlayerSummary, KilledByNonPlayer_31_8E2D99014A5153A516D911AC35516143) == 0x000060, "Member 'FS_PlayerSummary::KilledByNonPlayer_31_8E2D99014A5153A516D911AC35516143' has a wrong offset!");

}

