#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Roles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ImageInsertion_structs.hpp"
#include "S_Section_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Roles.S_Roles
// 0x0060 (0x0060 - 0x0000)
struct FS_Roles final
{
public:
	TArray<struct FS_ImageInsertion>              ImagesBeforeTexts_19_A8C2BF4F4EFBCBB63BF94EB039A4170C; // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FText                                   RoleTitle_2_EDD532EF4DB87D534CF52396CA5B6E50;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    RoleFontAppearanceSelectRow_28_41E918664D8E15BBFB02BDA14AD8C6C4; // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FS_ImageInsertion>              ImagesBetweenRoleandSections_20_56AFD4364E85CC81CC146CB74DDAE89B; // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FS_Section>                     Section_6_1ABC8ED8435B9EF88EBE8F98FE3C5EC7;        // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_ImageInsertion>              ImagesAfterTexts_21_612B76F4495C4EB13C22398451A8D850; // 0x0050(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(FS_Roles) == 0x000008, "Wrong alignment on FS_Roles");
static_assert(sizeof(FS_Roles) == 0x000060, "Wrong size on FS_Roles");
static_assert(offsetof(FS_Roles, ImagesBeforeTexts_19_A8C2BF4F4EFBCBB63BF94EB039A4170C) == 0x000000, "Member 'FS_Roles::ImagesBeforeTexts_19_A8C2BF4F4EFBCBB63BF94EB039A4170C' has a wrong offset!");
static_assert(offsetof(FS_Roles, RoleTitle_2_EDD532EF4DB87D534CF52396CA5B6E50) == 0x000010, "Member 'FS_Roles::RoleTitle_2_EDD532EF4DB87D534CF52396CA5B6E50' has a wrong offset!");
static_assert(offsetof(FS_Roles, RoleFontAppearanceSelectRow_28_41E918664D8E15BBFB02BDA14AD8C6C4) == 0x000020, "Member 'FS_Roles::RoleFontAppearanceSelectRow_28_41E918664D8E15BBFB02BDA14AD8C6C4' has a wrong offset!");
static_assert(offsetof(FS_Roles, ImagesBetweenRoleandSections_20_56AFD4364E85CC81CC146CB74DDAE89B) == 0x000030, "Member 'FS_Roles::ImagesBetweenRoleandSections_20_56AFD4364E85CC81CC146CB74DDAE89B' has a wrong offset!");
static_assert(offsetof(FS_Roles, Section_6_1ABC8ED8435B9EF88EBE8F98FE3C5EC7) == 0x000040, "Member 'FS_Roles::Section_6_1ABC8ED8435B9EF88EBE8F98FE3C5EC7' has a wrong offset!");
static_assert(offsetof(FS_Roles, ImagesAfterTexts_21_612B76F4495C4EB13C22398451A8D850) == 0x000050, "Member 'FS_Roles::ImagesAfterTexts_21_612B76F4495C4EB13C22398451A8D850' has a wrong offset!");

}

