#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavedSettings

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "S_AudioSettings_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SavedSettings.SavedSettings_C
// 0x0028 (0x0050 - 0x0028)
class USavedSettings_C final : public USaveGame
{
public:
	struct FS_AudioSettings                       S_AudioSettings;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MouseSensitivity;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Culture;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SavedSettings_C">();
	}
	static class USavedSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USavedSettings_C>();
	}
};
static_assert(alignof(USavedSettings_C) == 0x000008, "Wrong alignment on USavedSettings_C");
static_assert(sizeof(USavedSettings_C) == 0x000050, "Wrong size on USavedSettings_C");
static_assert(offsetof(USavedSettings_C, S_AudioSettings) == 0x000028, "Member 'USavedSettings_C::S_AudioSettings' has a wrong offset!");
static_assert(offsetof(USavedSettings_C, MouseSensitivity) == 0x000038, "Member 'USavedSettings_C::MouseSensitivity' has a wrong offset!");
static_assert(offsetof(USavedSettings_C, Culture) == 0x000040, "Member 'USavedSettings_C::Culture' has a wrong offset!");

}

