#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_Tutorial_28Minus1_HeavyAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SOA_Tutorial_28-1_HeavyAttack.SOA_Tutorial_28-1_HeavyAttack_C.GetText
// 0x0030 (0x0030 - 0x0000)
struct SOA_Tutorial_28Minus1_HeavyAttack_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0010)()
};
static_assert(alignof(SOA_Tutorial_28Minus1_HeavyAttack_C_GetText) == 0x000008, "Wrong alignment on SOA_Tutorial_28Minus1_HeavyAttack_C_GetText");
static_assert(sizeof(SOA_Tutorial_28Minus1_HeavyAttack_C_GetText) == 0x000030, "Wrong size on SOA_Tutorial_28Minus1_HeavyAttack_C_GetText");
static_assert(offsetof(SOA_Tutorial_28Minus1_HeavyAttack_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_Tutorial_28Minus1_HeavyAttack_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_28Minus1_HeavyAttack_C_GetText, K2Node_MakeArray_Array) == 0x000010, "Member 'SOA_Tutorial_28Minus1_HeavyAttack_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_28Minus1_HeavyAttack_C_GetText, CallFunc_Format_ReturnValue) == 0x000020, "Member 'SOA_Tutorial_28Minus1_HeavyAttack_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

