#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_ThrowAwayTrash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOA_ThrowAwayTrash.SOA_ThrowAwayTrash_C
// 0x0020 (0x02F0 - 0x02D0)
class ASOA_ThrowAwayTrash_C final : public ASubObjective
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_GarbageSpawner_C*>           SpawnPositions;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         GarbageLeftToCollect;                              // 0x02E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Existing_Tasks();
	void CheckIfSubObjectiveCompleted();
	void CreateRemainingTasks();
	void ExecuteUbergraph_SOA_ThrowAwayTrash(int32 EntryPoint);
	void GarbageCollected(class AActor* DestroyedActor);
	void GetFittingSpawnPositions();
	class FText GetText();
	void OnRep_GarbageLeftToCollect();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SOA_ThrowAwayTrash_C">();
	}
	static class ASOA_ThrowAwayTrash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOA_ThrowAwayTrash_C>();
	}
};
static_assert(alignof(ASOA_ThrowAwayTrash_C) == 0x000008, "Wrong alignment on ASOA_ThrowAwayTrash_C");
static_assert(sizeof(ASOA_ThrowAwayTrash_C) == 0x0002F0, "Wrong size on ASOA_ThrowAwayTrash_C");
static_assert(offsetof(ASOA_ThrowAwayTrash_C, UberGraphFrame) == 0x0002D0, "Member 'ASOA_ThrowAwayTrash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASOA_ThrowAwayTrash_C, SpawnPositions) == 0x0002D8, "Member 'ASOA_ThrowAwayTrash_C::SpawnPositions' has a wrong offset!");
static_assert(offsetof(ASOA_ThrowAwayTrash_C, GarbageLeftToCollect) == 0x0002E8, "Member 'ASOA_ThrowAwayTrash_C::GarbageLeftToCollect' has a wrong offset!");

}

