#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_ObtainItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "E_ShopType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOA_ObtainItem.SOA_ObtainItem_C
// 0x0018 (0x02E8 - 0x02D0)
class ASOA_ObtainItem_C final : public ASubObjective
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UItemDefinition*                        ItemDefinitionToObtain;                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ItemObtained;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void CreateItemIcon(class AActor* StoreItemBelongsTo);
	void ExecuteUbergraph_SOA_ObtainItem(int32 EntryPoint);
	void FindShopWhereItemCanBeObtained(class ABP_StoreBase_C** Store);
	void GetShopTypeItems(E_ShopType Shop_Type, class ABP_TeamShopManager_C* TeamShopManager, TArray<struct FS_ShopItem>* ShopItems);
	void GetTeamShopManager(class ABP_TeamShopManager_C** Array_Element);
	class FText GetText();
	void ObjectiveTrackingChanged(const TArray<struct FObjectiveTracker>& ObjectiveTrackers);
	void OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE(class UObject* Loaded);
	void OnRep_ItemObtained();
	void PlayerObtainedNewItem(class UItemInstance* Item_Instance, class ABP_ResidentCharacter_C* CharacterWhoObtained);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SOA_ObtainItem_C">();
	}
	static class ASOA_ObtainItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOA_ObtainItem_C>();
	}
};
static_assert(alignof(ASOA_ObtainItem_C) == 0x000008, "Wrong alignment on ASOA_ObtainItem_C");
static_assert(sizeof(ASOA_ObtainItem_C) == 0x0002E8, "Wrong size on ASOA_ObtainItem_C");
static_assert(offsetof(ASOA_ObtainItem_C, UberGraphFrame) == 0x0002D0, "Member 'ASOA_ObtainItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASOA_ObtainItem_C, ItemDefinitionToObtain) == 0x0002D8, "Member 'ASOA_ObtainItem_C::ItemDefinitionToObtain' has a wrong offset!");
static_assert(offsetof(ASOA_ObtainItem_C, ItemObtained) == 0x0002E0, "Member 'ASOA_ObtainItem_C::ItemObtained' has a wrong offset!");

}

