#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_CompostHedgeBranches

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SOA_CompostHedgeBranches.SOA_CompostHedgeBranches_C.CheckIfSubObjectiveFinished
// 0x0008 (0x0008 - 0x0000)
struct SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished final
{
public:
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished) == 0x000004, "Wrong alignment on SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished");
static_assert(sizeof(SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished) == 0x000008, "Wrong size on SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished");
static_assert(offsetof(SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000000, "Member 'SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'SOA_CompostHedgeBranches_C_CheckIfSubObjectiveFinished::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function SOA_CompostHedgeBranches.SOA_CompostHedgeBranches_C.ExecuteUbergraph_SOA_CompostHedgeBranches
// 0x0050 (0x0050 - 0x0000)
struct SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CompostBin_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class ABP_Trashcan_C*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USOD_CompostHedgeBranches_C*            K2Node_DynamicCast_AsSOD_Compost_Hedge_Branches;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches) == 0x000008, "Wrong alignment on SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches");
static_assert(sizeof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches) == 0x000050, "Wrong size on SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, EntryPoint) == 0x000000, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_Array_Get_Item) == 0x000020, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_GetTeamID_ReturnValue) == 0x00002C, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, K2Node_DynamicCast_AsSOD_Compost_Hedge_Branches) == 0x000040, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::K2Node_DynamicCast_AsSOD_Compost_Hedge_Branches' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'SOA_CompostHedgeBranches_C_ExecuteUbergraph_SOA_CompostHedgeBranches::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SOA_CompostHedgeBranches.SOA_CompostHedgeBranches_C.GetText
// 0x0080 (0x0080 - 0x0000)
struct SOA_CompostHedgeBranches_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
};
static_assert(alignof(SOA_CompostHedgeBranches_C_GetText) == 0x000008, "Wrong alignment on SOA_CompostHedgeBranches_C_GetText");
static_assert(sizeof(SOA_CompostHedgeBranches_C_GetText) == 0x000080, "Wrong size on SOA_CompostHedgeBranches_C_GetText");
static_assert(offsetof(SOA_CompostHedgeBranches_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_CompostHedgeBranches_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_GetText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'SOA_CompostHedgeBranches_C_GetText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_GetText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'SOA_CompostHedgeBranches_C_GetText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_GetText, K2Node_MakeArray_Array) == 0x000060, "Member 'SOA_CompostHedgeBranches_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_CompostHedgeBranches_C_GetText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'SOA_CompostHedgeBranches_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

