#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_ObtainItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ShopItem_structs.hpp"
#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ShopType_structs.hpp"


namespace SDK::Params
{

// Function SOA_ObtainItem.SOA_ObtainItem_C.CreateItemIcon
// 0x0080 (0x0080 - 0x0000)
struct SOA_ObtainItem_C_CreateItemIcon final
{
public:
	class AActor*                                 StoreItemBelongsTo;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_POI_ItemMarker_C*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_ItemWheel*            CallFunc_FindActionByType_ReturnValue;             // 0x0078(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_CreateItemIcon) == 0x000010, "Wrong alignment on SOA_ObtainItem_C_CreateItemIcon");
static_assert(sizeof(SOA_ObtainItem_C_CreateItemIcon) == 0x000080, "Wrong size on SOA_ObtainItem_C_CreateItemIcon");
static_assert(offsetof(SOA_ObtainItem_C_CreateItemIcon, StoreItemBelongsTo) == 0x000000, "Member 'SOA_ObtainItem_C_CreateItemIcon::StoreItemBelongsTo' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_CreateItemIcon, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'SOA_ObtainItem_C_CreateItemIcon::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_CreateItemIcon, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'SOA_ObtainItem_C_CreateItemIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_CreateItemIcon, CallFunc_FindActionByType_ReturnValue) == 0x000078, "Member 'SOA_ObtainItem_C_CreateItemIcon::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.ExecuteUbergraph_SOA_ObtainItem
// 0x0180 (0x0180 - 0x0000)
struct SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FObjectiveTracker>& ObjectiveTrackers)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0040(0x0010)(ReferenceParm)
	class USOD_ObtainItem_C*                      K2Node_DynamicCast_AsSOD_Obtain_Item;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00A0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_CustomEvent_Item_Instance;                  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_CustomEvent_CharacterWhoObtained;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsOfType_ReturnValue;            // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition_1;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveTrackingManager*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FObjectiveTracker>              K2Node_CustomEvent_ObjectiveTrackers;              // 0x0120(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_StoreBase_C*                        CallFunc_FindShopWhereItemCanBeObtained_Store;     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrackingObjective_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    CallFunc_Get_Groundskeeper_from_Team_Groundskeeper; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UItemInstance* Item_Instance, class ABP_ResidentCharacter_C* CharacterWhoObtained)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem");
static_assert(sizeof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem) == 0x000180, "Wrong size on SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, EntryPoint) == 0x000000, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, Temp_object_Variable) == 0x000010, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_AsItem_Definition) == 0x000018, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, Temp_int_Array_Index_Variable) == 0x000024, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000040, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_AsSOD_Obtain_Item) == 0x000050, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_AsSOD_Obtain_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Array_Get_Item) == 0x000060, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetPawn_ReturnValue) == 0x000068, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000078, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Get_ClassLog_Name_name) == 0x000088, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000A0, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CustomEvent_Item_Instance) == 0x0000C8, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CustomEvent_Item_Instance' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CustomEvent_CharacterWhoObtained) == 0x0000D0, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CustomEvent_CharacterWhoObtained' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetAllItemsOfType_ReturnValue) == 0x0000D8, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetAllItemsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000E8, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000F0, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_AsItem_Definition_1) == 0x0000F8, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_AsItem_Definition_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetGameState_ReturnValue) == 0x000108, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000110, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetComponentByClass_ReturnValue) == 0x000118, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CustomEvent_ObjectiveTrackers) == 0x000120, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CustomEvent_ObjectiveTrackers' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_GetPlayerController_ReturnValue) == 0x000130, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_FindShopWhereItemCanBeObtained_Store) == 0x000138, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_FindShopWhereItemCanBeObtained_Store' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000140, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_DynamicCast_bSuccess_4) == 0x000148, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_IsTrackingObjective_ReturnValue) == 0x000149, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_IsTrackingObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Add_IntInt_ReturnValue) == 0x000154, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, CallFunc_Get_Groundskeeper_from_Team_Groundskeeper) == 0x000158, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::CallFunc_Get_Groundskeeper_from_Team_Groundskeeper' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000160, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x000170, "Member 'SOA_ObtainItem_C_ExecuteUbergraph_SOA_ObtainItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.FindShopWhereItemCanBeObtained
// 0x0108 (0x0108 - 0x0000)
struct SOA_ObtainItem_C_FindShopWhereItemCanBeObtained final
{
public:
	class ABP_StoreBase_C*                        Store;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USOD_ObtainItem_C*                      K2Node_DynamicCast_AsSOD_Obtain_Item;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TeamShopManager_C*                  CallFunc_GetTeamShopManager_Array_Element;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_StoreBase_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_StoreBase_C*                        CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ShopItem>                    CallFunc_GetShopTypeItems_ShopItems;               // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ShopItem                            CallFunc_Array_Get_Item_1;                         // 0x0088(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_FindShopWhereItemCanBeObtained");
static_assert(sizeof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained) == 0x000108, "Wrong size on SOA_ObtainItem_C_FindShopWhereItemCanBeObtained");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Store) == 0x000000, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Store' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Array_Index_Variable) == 0x000010, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, K2Node_DynamicCast_AsSOD_Obtain_Item) == 0x000028, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::K2Node_DynamicCast_AsSOD_Obtain_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, Temp_int_Loop_Counter_Variable_2) == 0x000034, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_GetTeamShopManager_Array_Element) == 0x000038, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_GetTeamShopManager_Array_Element' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Get_Item) == 0x000060, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_GetShopTypeItems_ShopItems) == 0x000070, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_GetShopTypeItems_ShopItems' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Length_ReturnValue_2) == 0x0000AC, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_Less_IntInt_ReturnValue_2) == 0x000100, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_FindShopWhereItemCanBeObtained, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000101, "Member 'SOA_ObtainItem_C_FindShopWhereItemCanBeObtained::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.GetShopTypeItems
// 0x0058 (0x0058 - 0x0000)
struct SOA_ObtainItem_C_GetShopTypeItems final
{
public:
	E_ShopType                                    Shop_Type;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TeamShopManager_C*                  TeamShopManager;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ShopItem>                    ShopItems;                                         // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	E_ShopType                                    Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ShopItem>                    Temp_struct_Variable;                              // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    Temp_struct_Variable_1;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    K2Node_Select_Default;                             // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SOA_ObtainItem_C_GetShopTypeItems) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_GetShopTypeItems");
static_assert(sizeof(SOA_ObtainItem_C_GetShopTypeItems) == 0x000058, "Wrong size on SOA_ObtainItem_C_GetShopTypeItems");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, Shop_Type) == 0x000000, "Member 'SOA_ObtainItem_C_GetShopTypeItems::Shop_Type' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, TeamShopManager) == 0x000008, "Member 'SOA_ObtainItem_C_GetShopTypeItems::TeamShopManager' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, ShopItems) == 0x000010, "Member 'SOA_ObtainItem_C_GetShopTypeItems::ShopItems' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, Temp_byte_Variable) == 0x000020, "Member 'SOA_ObtainItem_C_GetShopTypeItems::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, Temp_struct_Variable) == 0x000028, "Member 'SOA_ObtainItem_C_GetShopTypeItems::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, Temp_struct_Variable_1) == 0x000038, "Member 'SOA_ObtainItem_C_GetShopTypeItems::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetShopTypeItems, K2Node_Select_Default) == 0x000048, "Member 'SOA_ObtainItem_C_GetShopTypeItems::K2Node_Select_Default' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.GetTeamShopManager
// 0x0040 (0x0040 - 0x0000)
struct SOA_ObtainItem_C_GetTeamShopManager final
{
public:
	class ABP_TeamShopManager_C*                  Array_Element;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_TeamShopManager_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TeamShopManager_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_GetTeamShopManager) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_GetTeamShopManager");
static_assert(sizeof(SOA_ObtainItem_C_GetTeamShopManager) == 0x000040, "Wrong size on SOA_ObtainItem_C_GetTeamShopManager");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, Array_Element) == 0x000000, "Member 'SOA_ObtainItem_C_GetTeamShopManager::Array_Element' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SOA_ObtainItem_C_GetTeamShopManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SOA_ObtainItem_C_GetTeamShopManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_Array_Get_Item) == 0x000030, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_Conv_IntToByte_ReturnValue) == 0x000039, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetTeamShopManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'SOA_ObtainItem_C_GetTeamShopManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.GetText
// 0x0058 (0x0058 - 0x0000)
struct SOA_ObtainItem_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class USOD_ObtainItem_C*                      K2Node_DynamicCast_AsSOD_Obtain_Item;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0048(0x0010)()
};
static_assert(alignof(SOA_ObtainItem_C_GetText) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_GetText");
static_assert(sizeof(SOA_ObtainItem_C_GetText) == 0x000058, "Wrong size on SOA_ObtainItem_C_GetText");
static_assert(offsetof(SOA_ObtainItem_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_ObtainItem_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, K2Node_MakeArray_Array) == 0x000010, "Member 'SOA_ObtainItem_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, K2Node_DynamicCast_AsSOD_Obtain_Item) == 0x000020, "Member 'SOA_ObtainItem_C_GetText::K2Node_DynamicCast_AsSOD_Obtain_Item' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SOA_ObtainItem_C_GetText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'SOA_ObtainItem_C_GetText::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, K2Node_DynamicCast_AsItem_Definition) == 0x000038, "Member 'SOA_ObtainItem_C_GetText::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SOA_ObtainItem_C_GetText::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_GetText, CallFunc_Format_ReturnValue) == 0x000048, "Member 'SOA_ObtainItem_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.ObjectiveTrackingChanged
// 0x0010 (0x0010 - 0x0000)
struct SOA_ObtainItem_C_ObjectiveTrackingChanged final
{
public:
	TArray<struct FObjectiveTracker>              ObjectiveTrackers;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SOA_ObtainItem_C_ObjectiveTrackingChanged) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_ObjectiveTrackingChanged");
static_assert(sizeof(SOA_ObtainItem_C_ObjectiveTrackingChanged) == 0x000010, "Wrong size on SOA_ObtainItem_C_ObjectiveTrackingChanged");
static_assert(offsetof(SOA_ObtainItem_C_ObjectiveTrackingChanged, ObjectiveTrackers) == 0x000000, "Member 'SOA_ObtainItem_C_ObjectiveTrackingChanged::ObjectiveTrackers' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE
// 0x0008 (0x0008 - 0x0000)
struct SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE");
static_assert(sizeof(SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE) == 0x000008, "Wrong size on SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE");
static_assert(offsetof(SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE, Loaded) == 0x000000, "Member 'SOA_ObtainItem_C_OnLoaded_ED6476D04C5F8D5B314A80B49239FBEE::Loaded' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.OnRep_ItemObtained
// 0x0088 (0x0088 - 0x0000)
struct SOA_ObtainItem_C_OnRep_ItemObtained final
{
public:
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0000(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_OnRep_ItemObtained) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_OnRep_ItemObtained");
static_assert(sizeof(SOA_ObtainItem_C_OnRep_ItemObtained) == 0x000088, "Wrong size on SOA_ObtainItem_C_OnRep_ItemObtained");
static_assert(offsetof(SOA_ObtainItem_C_OnRep_ItemObtained, CallFunc_Conv_BoolToText_ReturnValue) == 0x000000, "Member 'SOA_ObtainItem_C_OnRep_ItemObtained::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_OnRep_ItemObtained, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'SOA_ObtainItem_C_OnRep_ItemObtained::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_OnRep_ItemObtained, K2Node_MakeArray_Array) == 0x000058, "Member 'SOA_ObtainItem_C_OnRep_ItemObtained::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_OnRep_ItemObtained, CallFunc_Format_ReturnValue) == 0x000068, "Member 'SOA_ObtainItem_C_OnRep_ItemObtained::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_OnRep_ItemObtained, CallFunc_Conv_TextToString_ReturnValue) == 0x000078, "Member 'SOA_ObtainItem_C_OnRep_ItemObtained::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function SOA_ObtainItem.SOA_ObtainItem_C.PlayerObtainedNewItem
// 0x0010 (0x0010 - 0x0000)
struct SOA_ObtainItem_C_PlayerObtainedNewItem final
{
public:
	class UItemInstance*                          Item_Instance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CharacterWhoObtained;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ObtainItem_C_PlayerObtainedNewItem) == 0x000008, "Wrong alignment on SOA_ObtainItem_C_PlayerObtainedNewItem");
static_assert(sizeof(SOA_ObtainItem_C_PlayerObtainedNewItem) == 0x000010, "Wrong size on SOA_ObtainItem_C_PlayerObtainedNewItem");
static_assert(offsetof(SOA_ObtainItem_C_PlayerObtainedNewItem, Item_Instance) == 0x000000, "Member 'SOA_ObtainItem_C_PlayerObtainedNewItem::Item_Instance' has a wrong offset!");
static_assert(offsetof(SOA_ObtainItem_C_PlayerObtainedNewItem, CharacterWhoObtained) == 0x000008, "Member 'SOA_ObtainItem_C_PlayerObtainedNewItem::CharacterWhoObtained' has a wrong offset!");

}

