#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_TutorialTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOA_TutorialTask.SOA_TutorialTask_C
// 0x0028 (0x02F8 - 0x02D0)
class ASOA_TutorialTask_C : public ASubObjective
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 SODClass;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   TutorialTaskDescription;                           // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentAmount;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalAmount;                                       // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForTaskCompletion(class UClass* CompletedTaskSOD);
	void ExecuteUbergraph_SOA_TutorialTask(int32 EntryPoint);
	class FText GetText();
	void OnMessageReceived_EC6AA3A9484EC765E24041B470E22E9E(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void ReceiveBeginPlay();
	void SetTaskProgressValues(int32 CurrentAmount_0, int32 TotalAmount_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SOA_TutorialTask_C">();
	}
	static class ASOA_TutorialTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOA_TutorialTask_C>();
	}
};
static_assert(alignof(ASOA_TutorialTask_C) == 0x000008, "Wrong alignment on ASOA_TutorialTask_C");
static_assert(sizeof(ASOA_TutorialTask_C) == 0x0002F8, "Wrong size on ASOA_TutorialTask_C");
static_assert(offsetof(ASOA_TutorialTask_C, UberGraphFrame) == 0x0002D0, "Member 'ASOA_TutorialTask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASOA_TutorialTask_C, SODClass) == 0x0002D8, "Member 'ASOA_TutorialTask_C::SODClass' has a wrong offset!");
static_assert(offsetof(ASOA_TutorialTask_C, TutorialTaskDescription) == 0x0002E0, "Member 'ASOA_TutorialTask_C::TutorialTaskDescription' has a wrong offset!");
static_assert(offsetof(ASOA_TutorialTask_C, CurrentAmount) == 0x0002F0, "Member 'ASOA_TutorialTask_C::CurrentAmount' has a wrong offset!");
static_assert(offsetof(ASOA_TutorialTask_C, TotalAmount) == 0x0002F4, "Member 'ASOA_TutorialTask_C::TotalAmount' has a wrong offset!");

}

