#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_VoiceChat

#include "Basic.hpp"


namespace SDK::Params
{

// Function SOA_VoiceChat.SOA_VoiceChat_C.ExecuteUbergraph_SOA_VoiceChat
// 0x0004 (0x0004 - 0x0000)
struct SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat) == 0x000004, "Wrong alignment on SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat");
static_assert(sizeof(SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat) == 0x000004, "Wrong size on SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat");
static_assert(offsetof(SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat, EntryPoint) == 0x000000, "Member 'SOA_VoiceChat_C_ExecuteUbergraph_SOA_VoiceChat::EntryPoint' has a wrong offset!");

// Function SOA_VoiceChat.SOA_VoiceChat_C.GetText
// 0x0010 (0x0010 - 0x0000)
struct SOA_VoiceChat_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(SOA_VoiceChat_C_GetText) == 0x000008, "Wrong alignment on SOA_VoiceChat_C_GetText");
static_assert(sizeof(SOA_VoiceChat_C_GetText) == 0x000010, "Wrong size on SOA_VoiceChat_C_GetText");
static_assert(offsetof(SOA_VoiceChat_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_VoiceChat_C_GetText::ReturnValue' has a wrong offset!");

}

