#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectatorPawnJP

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "E_FOVZoom_structs.hpp"


namespace SDK::Params
{

// Function SpectatorPawnJP.SpectatorPawnJP_C.ExecuteUbergraph_SpectatorPawnJP
// 0x02B0 (0x02B0 - 0x0000)
struct SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x0010(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0030(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0048(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0060(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0078(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0090(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x00D8(0x0018)(HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0100(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_8;                        // 0x0128(0x0018)(HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FOVZoom                                     Temp_byte_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_SpectatorCameraControls_C*>  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_SpectatorCameraControls_C*          CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_SpectatorCameraControls_C*          CallFunc_Create_ReturnValue;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_1;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_9;                        // 0x01F0(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0240(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_SpectatorCameraControls_C*          K2Node_DynamicCast_AsWI_Spectator_Camera_Controls; // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FOV_ImplicitCast;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Target_ImplicitCast;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSpeed_ImplicitCast;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSpeed_ImplicitCast_1;        // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP");
static_assert(sizeof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP) == 0x0002B0, "Wrong size on SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, EntryPoint) == 0x000000, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_7) == 0x000010, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_7' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_IsLocalController_ReturnValue) == 0x000028, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_6) == 0x000030, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_struct_Variable) == 0x000048, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_5) == 0x000060, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_4) == 0x000078, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_3) == 0x000090, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_2) == 0x0000A8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_1) == 0x0000C0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key) == 0x0000D8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_real_Variable) == 0x0000F0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_bool_Variable) == 0x0000F8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Not_PreBool_ReturnValue) == 0x0000F9, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_struct_Variable_1) == 0x000100, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_int_Array_Index_Variable) == 0x000118, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_int_Loop_Counter_Variable) == 0x00011C, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_int_Array_Index_Variable_1) == 0x000124, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_8) == 0x000128, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_8' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000140, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_Event_DeltaSeconds) == 0x000148, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_real_Variable_1) == 0x000150, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_real_Variable_2) == 0x000158, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_byte_Variable) == 0x000160, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000168, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Array_Get_Item) == 0x000178, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_Select_Default) == 0x000180, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000188, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FClamp_ReturnValue) == 0x000198, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetController_ReturnValue_1) == 0x0001A0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_AsPlayer_Controller) == 0x0001A8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Create_ReturnValue) == 0x0001B8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetController_ReturnValue_2) == 0x0001C0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x0001C8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Get_ClassLog_Name_name) == 0x0001D8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_IsLocalController_ReturnValue_1) == 0x0001E8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_IsLocalController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_InputKeyEvent_Key_9) == 0x0001F0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_InputKeyEvent_Key_9' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, Temp_int_Loop_Counter_Variable_1) == 0x000208, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Less_IntInt_ReturnValue) == 0x00020C, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000210, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FInterpTo_ReturnValue) == 0x000218, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000220, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FClamp_ReturnValue_1) == 0x000228, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000230, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FClamp_ReturnValue_2) == 0x000238, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000240, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Array_Get_Item_1) == 0x000250, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Array_Length_ReturnValue_1) == 0x000258, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_AsWI_Spectator_Camera_Controls) == 0x000260, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_AsWI_Spectator_Camera_Controls' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_DynamicCast_bSuccess_2) == 0x000268, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000269, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000278, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_VariableSet_FOV_ImplicitCast) == 0x000280, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_VariableSet_FOV_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_FInterpTo_Target_ImplicitCast) == 0x000288, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_FInterpTo_Target_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000290, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000298, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x0002A0, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_VariableSet_MaxSpeed_ImplicitCast) == 0x0002A4, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_VariableSet_MaxSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP, K2Node_VariableSet_MaxSpeed_ImplicitCast_1) == 0x0002A8, "Member 'SpectatorPawnJP_C_ExecuteUbergraph_SpectatorPawnJP::K2Node_VariableSet_MaxSpeed_ImplicitCast_1' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_N_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_N_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_9::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_Tab_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_Tab_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.InpActEvt_V_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1");
static_assert(sizeof(SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1");
static_assert(offsetof(SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'SpectatorPawnJP_C_InpActEvt_V_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SpectatorPawnJP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_ReceiveTick) == 0x000004, "Wrong alignment on SpectatorPawnJP_C_ReceiveTick");
static_assert(sizeof(SpectatorPawnJP_C_ReceiveTick) == 0x000004, "Wrong size on SpectatorPawnJP_C_ReceiveTick");
static_assert(offsetof(SpectatorPawnJP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SpectatorPawnJP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SpectatorPawnJP.SpectatorPawnJP_C.SetVisibilityForWidgets
// 0x0160 (0x0160 - 0x0000)
struct SpectatorPawnJP_C_SetVisibilityForWidgets final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_HouseIdentifier_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class ABP_HouseIdentifier_C*                  CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UAC_POI_C*>                      CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_POI_C*                              CallFunc_Array_Get_Item_4;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAC_Indicator_C*>                CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAC_Indicator_C*                        CallFunc_Array_Get_Item_5;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHouseActorBase_C*>              CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0110(0x0010)(ReferenceParm)
	class AHouseActorBase_C*                      CallFunc_Array_Get_Item_6;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_7;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_8;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnJP_C_SetVisibilityForWidgets) == 0x000008, "Wrong alignment on SpectatorPawnJP_C_SetVisibilityForWidgets");
static_assert(sizeof(SpectatorPawnJP_C_SetVisibilityForWidgets) == 0x000160, "Wrong size on SpectatorPawnJP_C_SetVisibilityForWidgets");
static_assert(offsetof(SpectatorPawnJP_C_SetVisibilityForWidgets, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'SpectatorPawnJP_C_SetVisibilityForWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnJP_C_SetVisibilityForWidgets, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SpectatorPawnJP_C_SetVisibilityForWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
