#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SingleFenceDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SingleFenceDetails.Struct_SingleFenceDetails
// 0x0060 (0x0060 - 0x0000)
struct FStruct_SingleFenceDetails final
{
public:
	struct FVector                                Location_30_7B7D07BB4131A448AE212EA33F06F615;      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_31_D07DAD7C484B994B8A5C1EB024FC782B;      // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale_32_822D545A44E7888DFE15ECAAA4477BCC;         // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh_33_F74E99F949513FD956E8339F4EFAB336;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_34_BAE8A0864B4B15A012854EB0A8516D0E;      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          FenceShouldBeSmall_35_BE5AC30D45F3E0D2EC8B788FEF4A5982; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsColumn_29_ADE3E2874B8E72A09EDC7CA9FEE3B65F;      // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_SingleFenceDetails) == 0x000008, "Wrong alignment on FStruct_SingleFenceDetails");
static_assert(sizeof(FStruct_SingleFenceDetails) == 0x000060, "Wrong size on FStruct_SingleFenceDetails");
static_assert(offsetof(FStruct_SingleFenceDetails, Location_30_7B7D07BB4131A448AE212EA33F06F615) == 0x000000, "Member 'FStruct_SingleFenceDetails::Location_30_7B7D07BB4131A448AE212EA33F06F615' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, Rotation_31_D07DAD7C484B994B8A5C1EB024FC782B) == 0x000018, "Member 'FStruct_SingleFenceDetails::Rotation_31_D07DAD7C484B994B8A5C1EB024FC782B' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, Scale_32_822D545A44E7888DFE15ECAAA4477BCC) == 0x000030, "Member 'FStruct_SingleFenceDetails::Scale_32_822D545A44E7888DFE15ECAAA4477BCC' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, Mesh_33_F74E99F949513FD956E8339F4EFAB336) == 0x000048, "Member 'FStruct_SingleFenceDetails::Mesh_33_F74E99F949513FD956E8339F4EFAB336' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, Material_34_BAE8A0864B4B15A012854EB0A8516D0E) == 0x000050, "Member 'FStruct_SingleFenceDetails::Material_34_BAE8A0864B4B15A012854EB0A8516D0E' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, FenceShouldBeSmall_35_BE5AC30D45F3E0D2EC8B788FEF4A5982) == 0x000058, "Member 'FStruct_SingleFenceDetails::FenceShouldBeSmall_35_BE5AC30D45F3E0D2EC8B788FEF4A5982' has a wrong offset!");
static_assert(offsetof(FStruct_SingleFenceDetails, IsColumn_29_ADE3E2874B8E72A09EDC7CA9FEE3B65F) == 0x000059, "Member 'FStruct_SingleFenceDetails::IsColumn_29_ADE3E2874B8E72A09EDC7CA9FEE3B65F' has a wrong offset!");

}

