#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuddenDeathEndCondition

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.AreTeamsEqual
// 0x0050 (0x0050 - 0x0000)
struct SuddenDeathEndCondition_C_AreTeamsEqual final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_NotAllEqual;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_Team1HouseEssentialsAlive;                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Values_Values_1;                      // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_AreTeamsEqual) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_AreTeamsEqual");
static_assert(sizeof(SuddenDeathEndCondition_C_AreTeamsEqual) == 0x000050, "Wrong size on SuddenDeathEndCondition_C_AreTeamsEqual");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, Return) == 0x000000, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, L_NotAllEqual) == 0x000001, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::L_NotAllEqual' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, L_Team1HouseEssentialsAlive) == 0x000004, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::L_Team1HouseEssentialsAlive' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Map_Values_Values) == 0x000010, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Map_Values_Values_1) == 0x000020, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Array_Get_Item) == 0x000030, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Array_Get_Item_1) == 0x000034, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_AreTeamsEqual, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'SuddenDeathEndCondition_C_AreTeamsEqual::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.CacheTeamHouseEssentials
// 0x0078 (0x0078 - 0x0000)
struct SuddenDeathEndCondition_C_CacheTeamHouseEssentials final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTeam>                          CallFunc_GetTeams_ReturnValue;                     // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0038)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmountOfAliveHouseEssentials_Return;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_CacheTeamHouseEssentials");
static_assert(sizeof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials) == 0x000078, "Wrong size on SuddenDeathEndCondition_C_CacheTeamHouseEssentials");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_GetTeams_ReturnValue) == 0x000010, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_Array_Get_Item) == 0x000028, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000068, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_CacheTeamHouseEssentials, CallFunc_GetAmountOfAliveHouseEssentials_Return) == 0x000074, "Member 'SuddenDeathEndCondition_C_CacheTeamHouseEssentials::CallFunc_GetAmountOfAliveHouseEssentials_Return' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.ExecuteUbergraph_SuddenDeathEndCondition
// 0x02E0 (0x02E0 - 0x0000)
struct SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_WhatTeamHasMostEssentialsAlive_Return;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreTeamsEqual_Return;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmountOfAliveHouseEssentials_Return;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountOfAliveHouseEssentials_Return_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data_1; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0078(0x0058)(ConstParm)
	class ABP_GooseSpawn_C*                       CallFunc_GetRandomGooseSpawn_Output;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropManager_C*               CallFunc_GetActorOfClass_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Goose_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_Map_Keys_Keys;                            // 0x0228(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_2;                 // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x02C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition) == 0x000010, "Wrong alignment on SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition");
static_assert(sizeof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition) == 0x0002E0, "Wrong size on SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, EntryPoint) == 0x000000, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000008, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_WhatTeamHasMostEssentialsAlive_Return) == 0x000011, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_WhatTeamHasMostEssentialsAlive_Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_AreTeamsEqual_Return) == 0x000012, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_AreTeamsEqual_Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetAmountOfAliveHouseEssentials_Return) == 0x00001C, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetAmountOfAliveHouseEssentials_Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000020, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetAmountOfAliveHouseEssentials_Return_1) == 0x000038, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetAmountOfAliveHouseEssentials_Return_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data_1) == 0x000068, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000078, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetRandomGooseSpawn_Output) == 0x0000D0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetRandomGooseSpawn_Output' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000E0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000150, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_BreakTransform_Location) == 0x000158, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_BreakTransform_Rotation) == 0x000170, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_BreakTransform_Scale) == 0x000188, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000200, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_GetActorOfClass_ReturnValue) == 0x000208, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_FinishSpawningActor_ReturnValue) == 0x000210, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Get_ClassLog_Name_name) == 0x000218, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Map_Keys_Keys) == 0x000228, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Concat_StrStr_ReturnValue) == 0x000238, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Conv_IntToString_ReturnValue) == 0x000250, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Get_ClassLog_Name_name_1) == 0x000260, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000270, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000280, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000290, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Get_ClassLog_Name_name_2) == 0x0002A0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Get_ClassLog_Name_name_2' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002B0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0002C0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002C8, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0002CC, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002D0, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2) == 0x0002D8, "Member 'SuddenDeathEndCondition_C_ExecuteUbergraph_SuddenDeathEndCondition::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.GetAmountOfAliveHouseEssentials
// 0x0098 (0x0098 - 0x0000)
struct SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials final
{
public:
	int32                                         Return;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_AliveHouseEssentials;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FTeam>                          CallFunc_GetTeams_ReturnValue;                     // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_Array_Get_Item;                           // 0x0040(0x0038)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmountOfAliveHouseEssentials_Return;   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials");
static_assert(sizeof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials) == 0x000098, "Wrong size on SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, Return) == 0x000000, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, L_AliveHouseEssentials) == 0x000004, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::L_AliveHouseEssentials' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Get_ClassLog_Name_name) == 0x000018, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_GetTeams_ReturnValue) == 0x000028, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Array_Get_Item) == 0x000040, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000080, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_GetAmountOfAliveHouseEssentials_Return) == 0x00008C, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_GetAmountOfAliveHouseEssentials_Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'SuddenDeathEndCondition_C_GetAmountOfAliveHouseEssentials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.GetRandomGooseSpawn
// 0x0030 (0x0030 - 0x0000)
struct SuddenDeathEndCondition_C_GetRandomGooseSpawn final
{
public:
	class ABP_GooseSpawn_C*                       Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_GooseSpawn_C*>               L_GooseSpawns;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_GooseSpawn_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_GooseSpawn_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(SuddenDeathEndCondition_C_GetRandomGooseSpawn) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_GetRandomGooseSpawn");
static_assert(sizeof(SuddenDeathEndCondition_C_GetRandomGooseSpawn) == 0x000030, "Wrong size on SuddenDeathEndCondition_C_GetRandomGooseSpawn");
static_assert(offsetof(SuddenDeathEndCondition_C_GetRandomGooseSpawn, Output) == 0x000000, "Member 'SuddenDeathEndCondition_C_GetRandomGooseSpawn::Output' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetRandomGooseSpawn, L_GooseSpawns) == 0x000008, "Member 'SuddenDeathEndCondition_C_GetRandomGooseSpawn::L_GooseSpawns' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetRandomGooseSpawn, CallFunc_Array_Get_Item) == 0x000018, "Member 'SuddenDeathEndCondition_C_GetRandomGooseSpawn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_GetRandomGooseSpawn, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'SuddenDeathEndCondition_C_GetRandomGooseSpawn::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.OnRep_SuddenDeathState
// 0x0018 (0x0018 - 0x0000)
struct SuddenDeathEndCondition_C_OnRep_SuddenDeathState final
{
public:
	class UWI_SuddenDeath_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_OnRep_SuddenDeathState) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_OnRep_SuddenDeathState");
static_assert(sizeof(SuddenDeathEndCondition_C_OnRep_SuddenDeathState) == 0x000018, "Wrong size on SuddenDeathEndCondition_C_OnRep_SuddenDeathState");
static_assert(offsetof(SuddenDeathEndCondition_C_OnRep_SuddenDeathState, CallFunc_Create_ReturnValue) == 0x000000, "Member 'SuddenDeathEndCondition_C_OnRep_SuddenDeathState::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_OnRep_SuddenDeathState, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000008, "Member 'SuddenDeathEndCondition_C_OnRep_SuddenDeathState::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_OnRep_SuddenDeathState, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'SuddenDeathEndCondition_C_OnRep_SuddenDeathState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.PrintEvaluation
// 0x0088 (0x0088 - 0x0000)
struct SuddenDeathEndCondition_C_PrintEvaluation final
{
public:
	int32                                         Alive;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cached;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_PrintEvaluation) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_PrintEvaluation");
static_assert(sizeof(SuddenDeathEndCondition_C_PrintEvaluation) == 0x000088, "Wrong size on SuddenDeathEndCondition_C_PrintEvaluation");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, Alive) == 0x000000, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::Alive' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, Cached) == 0x000004, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::Cached' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000038, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Get_ClassLog_Name_name) == 0x000058, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000068, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_PrintEvaluation, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000078, "Member 'SuddenDeathEndCondition_C_PrintEvaluation::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.SpawnNuke
// 0x0080 (0x0080 - 0x0000)
struct SuddenDeathEndCondition_C_SpawnNuke final
{
public:
	class ABP_NukeSpawn_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Nuke_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_SpawnNuke) == 0x000010, "Wrong alignment on SuddenDeathEndCondition_C_SpawnNuke");
static_assert(sizeof(SuddenDeathEndCondition_C_SpawnNuke) == 0x000080, "Wrong size on SuddenDeathEndCondition_C_SpawnNuke");
static_assert(offsetof(SuddenDeathEndCondition_C_SpawnNuke, CallFunc_GetActorOfClass_ReturnValue) == 0x000000, "Member 'SuddenDeathEndCondition_C_SpawnNuke::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_SpawnNuke, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'SuddenDeathEndCondition_C_SpawnNuke::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_SpawnNuke, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'SuddenDeathEndCondition_C_SpawnNuke::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_SpawnNuke, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'SuddenDeathEndCondition_C_SpawnNuke::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function SuddenDeathEndCondition.SuddenDeathEndCondition_C.WhatTeamHasMostEssentialsAlive
// 0x0060 (0x0060 - 0x0000)
struct SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive final
{
public:
	uint8                                         Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         L_TeamIDWithHighestValue;                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_HighestValue;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Values_Values_1;                      // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive) == 0x000008, "Wrong alignment on SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive");
static_assert(sizeof(SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive) == 0x000060, "Wrong size on SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive");
static_assert(offsetof(SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive, Return) == 0x000000, "Member 'SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive::Return' has a wrong offset!");
static_assert(offsetof(SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive, L_TeamIDWithHighestValue) == 0x000001, "Member 'SuddenDeathEndCondition_C_WhatTeamHasMostEssentialsAlive::L_TeamIDWithHighestValue' has a wrong offset!");
