#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TestButtonWI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TestButtonWI.TestButtonWI_C.ExecuteUbergraph_TestButtonWI
// 0x0040 (0x0040 - 0x0000)
struct TestButtonWI_C_ExecuteUbergraph_TestButtonWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0030(0x0010)()
};
static_assert(alignof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI) == 0x000008, "Wrong alignment on TestButtonWI_C_ExecuteUbergraph_TestButtonWI");
static_assert(sizeof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI) == 0x000040, "Wrong size on TestButtonWI_C_ExecuteUbergraph_TestButtonWI");
static_assert(offsetof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI, EntryPoint) == 0x000000, "Member 'TestButtonWI_C_ExecuteUbergraph_TestButtonWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'TestButtonWI_C_ExecuteUbergraph_TestButtonWI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'TestButtonWI_C_ExecuteUbergraph_TestButtonWI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'TestButtonWI_C_ExecuteUbergraph_TestButtonWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(TestButtonWI_C_ExecuteUbergraph_TestButtonWI, K2Node_CustomEvent_InText) == 0x000030, "Member 'TestButtonWI_C_ExecuteUbergraph_TestButtonWI::K2Node_CustomEvent_InText' has a wrong offset!");

// Function TestButtonWI.TestButtonWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TestButtonWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestButtonWI_C_PreConstruct) == 0x000001, "Wrong alignment on TestButtonWI_C_PreConstruct");
static_assert(sizeof(TestButtonWI_C_PreConstruct) == 0x000001, "Wrong size on TestButtonWI_C_PreConstruct");
static_assert(offsetof(TestButtonWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TestButtonWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TestButtonWI.TestButtonWI_C.Set Button Text
// 0x0010 (0x0010 - 0x0000)
struct TestButtonWI_C_Set_Button_Text final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TestButtonWI_C_Set_Button_Text) == 0x000008, "Wrong alignment on TestButtonWI_C_Set_Button_Text");
static_assert(sizeof(TestButtonWI_C_Set_Button_Text) == 0x000010, "Wrong size on TestButtonWI_C_Set_Button_Text");
static_assert(offsetof(TestButtonWI_C_Set_Button_Text, InText) == 0x000000, "Member 'TestButtonWI_C_Set_Button_Text::InText' has a wrong offset!");

}

