#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeEndConditionWI

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TimeEndConditionWI.TimeEndConditionWI_C.SetEndTime
// 0x0020 (0x0020 - 0x0000)
struct TimeEndConditionWI_C_SetEndTime final
{
public:
	double                                        ServerEndTime;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndConditionWI_C_SetEndTime) == 0x000008, "Wrong alignment on TimeEndConditionWI_C_SetEndTime");
static_assert(sizeof(TimeEndConditionWI_C_SetEndTime) == 0x000020, "Wrong size on TimeEndConditionWI_C_SetEndTime");
static_assert(offsetof(TimeEndConditionWI_C_SetEndTime, ServerEndTime) == 0x000000, "Member 'TimeEndConditionWI_C_SetEndTime::ServerEndTime' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_SetEndTime, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TimeEndConditionWI_C_SetEndTime::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_SetEndTime, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'TimeEndConditionWI_C_SetEndTime::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function TimeEndConditionWI.TimeEndConditionWI_C.UpdateCountdownText
// 0x0080 (0x0080 - 0x0000)
struct TimeEndConditionWI_C_UpdateCountdownText final
{
public:
	double                                        CallFunc_GetTimeLeft_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
};
static_assert(alignof(TimeEndConditionWI_C_UpdateCountdownText) == 0x000008, "Wrong alignment on TimeEndConditionWI_C_UpdateCountdownText");
static_assert(sizeof(TimeEndConditionWI_C_UpdateCountdownText) == 0x000080, "Wrong size on TimeEndConditionWI_C_UpdateCountdownText");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, CallFunc_GetTimeLeft_ReturnValue) == 0x000000, "Member 'TimeEndConditionWI_C_UpdateCountdownText::CallFunc_GetTimeLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, CallFunc_FCeil_ReturnValue) == 0x000008, "Member 'TimeEndConditionWI_C_UpdateCountdownText::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'TimeEndConditionWI_C_UpdateCountdownText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'TimeEndConditionWI_C_UpdateCountdownText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, K2Node_MakeArray_Array) == 0x000060, "Member 'TimeEndConditionWI_C_UpdateCountdownText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_UpdateCountdownText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'TimeEndConditionWI_C_UpdateCountdownText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function TimeEndConditionWI.TimeEndConditionWI_C.GetTimeLeft
// 0x0020 (0x0020 - 0x0000)
struct TimeEndConditionWI_C_GetTimeLeft final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSafe_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndConditionWI_C_GetTimeLeft) == 0x000008, "Wrong alignment on TimeEndConditionWI_C_GetTimeLeft");
static_assert(sizeof(TimeEndConditionWI_C_GetTimeLeft) == 0x000020, "Wrong size on TimeEndConditionWI_C_GetTimeLeft");
static_assert(offsetof(TimeEndConditionWI_C_GetTimeLeft, ReturnValue) == 0x000000, "Member 'TimeEndConditionWI_C_GetTimeLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_GetTimeLeft, CallFunc_GetServerWorldTimeSafe_ReturnValue) == 0x000008, "Member 'TimeEndConditionWI_C_GetTimeLeft::CallFunc_GetServerWorldTimeSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_GetTimeLeft, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'TimeEndConditionWI_C_GetTimeLeft::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndConditionWI_C_GetTimeLeft, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'TimeEndConditionWI_C_GetTimeLeft::CallFunc_FMax_ReturnValue' has a wrong offset!");

}

