#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeEndCondition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TimeEndCondition.TimeEndCondition_C
// 0x0028 (0x02D0 - 0x02A8)
class ATimeEndCondition_C final : public AEndCondition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        EndTime;                                           // 0x02B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UTimeEndConditionWI_C*                  Widget;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasReplicated;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeToEnd;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CreateWidget();
	void ExecuteUbergraph_TimeEndCondition(int32 EntryPoint);
	void OnRep_EndTime();
	void ReceiveBeginPlay();
	void SetEndTime();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TimeEndCondition_C">();
	}
	static class ATimeEndCondition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATimeEndCondition_C>();
	}
};
static_assert(alignof(ATimeEndCondition_C) == 0x000008, "Wrong alignment on ATimeEndCondition_C");
static_assert(sizeof(ATimeEndCondition_C) == 0x0002D0, "Wrong size on ATimeEndCondition_C");
static_assert(offsetof(ATimeEndCondition_C, UberGraphFrame) == 0x0002A8, "Member 'ATimeEndCondition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATimeEndCondition_C, EndTime) == 0x0002B0, "Member 'ATimeEndCondition_C::EndTime' has a wrong offset!");
static_assert(offsetof(ATimeEndCondition_C, Widget) == 0x0002B8, "Member 'ATimeEndCondition_C::Widget' has a wrong offset!");
static_assert(offsetof(ATimeEndCondition_C, bHasReplicated) == 0x0002C0, "Member 'ATimeEndCondition_C::bHasReplicated' has a wrong offset!");
static_assert(offsetof(ATimeEndCondition_C, TimeToEnd) == 0x0002C8, "Member 'ATimeEndCondition_C::TimeToEnd' has a wrong offset!");

}

