#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TreeRustler

#include "Basic.hpp"


namespace SDK::Params
{

// Function TreeRustler.TreeRustler_C.ExecuteUbergraph_TreeRustler
// 0x0020 (0x0020 - 0x0000)
struct TreeRustler_C_ExecuteUbergraph_TreeRustler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TreeRustler_C_ExecuteUbergraph_TreeRustler) == 0x000008, "Wrong alignment on TreeRustler_C_ExecuteUbergraph_TreeRustler");
static_assert(sizeof(TreeRustler_C_ExecuteUbergraph_TreeRustler) == 0x000020, "Wrong size on TreeRustler_C_ExecuteUbergraph_TreeRustler");
static_assert(offsetof(TreeRustler_C_ExecuteUbergraph_TreeRustler, EntryPoint) == 0x000000, "Member 'TreeRustler_C_ExecuteUbergraph_TreeRustler::EntryPoint' has a wrong offset!");
static_assert(offsetof(TreeRustler_C_ExecuteUbergraph_TreeRustler, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'TreeRustler_C_ExecuteUbergraph_TreeRustler::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TreeRustler_C_ExecuteUbergraph_TreeRustler, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'TreeRustler_C_ExecuteUbergraph_TreeRustler::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TreeRustler_C_ExecuteUbergraph_TreeRustler, CallFunc_Delay_Duration_ImplicitCast) == 0x000018, "Member 'TreeRustler_C_ExecuteUbergraph_TreeRustler::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TreeRustler_C_ExecuteUbergraph_TreeRustler, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00001C, "Member 'TreeRustler_C_ExecuteUbergraph_TreeRustler::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

}

