#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Image

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Image.UI_Image_C
// 0x0028 (0x0308 - 0x02E0)
class UUI_Image_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Image(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Image_C">();
	}
	static class UUI_Image_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Image_C>();
	}
};
static_assert(alignof(UUI_Image_C) == 0x000008, "Wrong alignment on UUI_Image_C");
static_assert(sizeof(UUI_Image_C) == 0x000308, "Wrong size on UUI_Image_C");
static_assert(offsetof(UUI_Image_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Image_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Image_C, Image) == 0x0002E8, "Member 'UUI_Image_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_Image_C, Texture) == 0x0002F0, "Member 'UUI_Image_C::Texture' has a wrong offset!");
static_assert(offsetof(UUI_Image_C, Size) == 0x0002F8, "Member 'UUI_Image_C::Size' has a wrong offset!");

}

