#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_RoleTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_RoleTitle.UI_RoleTitle_C
// 0x0038 (0x0318 - 0x02E0)
class UUI_RoleTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             RoleText;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Role;                                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	EHorizontalAlignment                          Justification;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    RoleTextAppearanceDTHandle;                        // 0x0308(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_RoleTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_RoleTitle_C">();
	}
	static class UUI_RoleTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_RoleTitle_C>();
	}
};
static_assert(alignof(UUI_RoleTitle_C) == 0x000008, "Wrong alignment on UUI_RoleTitle_C");
static_assert(sizeof(UUI_RoleTitle_C) == 0x000318, "Wrong size on UUI_RoleTitle_C");
static_assert(offsetof(UUI_RoleTitle_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_RoleTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_RoleTitle_C, RoleText) == 0x0002E8, "Member 'UUI_RoleTitle_C::RoleText' has a wrong offset!");
static_assert(offsetof(UUI_RoleTitle_C, Role) == 0x0002F0, "Member 'UUI_RoleTitle_C::Role' has a wrong offset!");
static_assert(offsetof(UUI_RoleTitle_C, Justification) == 0x000300, "Member 'UUI_RoleTitle_C::Justification' has a wrong offset!");
static_assert(offsetof(UUI_RoleTitle_C, RoleTextAppearanceDTHandle) == 0x000308, "Member 'UUI_RoleTitle_C::RoleTextAppearanceDTHandle' has a wrong offset!");

}

