#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Spacer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Spacer.UI_Spacer_C.ExecuteUbergraph_UI_Spacer
// 0x0018 (0x0018 - 0x0000)
struct UI_Spacer_C_ExecuteUbergraph_UI_Spacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Spacer_C_ExecuteUbergraph_UI_Spacer) == 0x000008, "Wrong alignment on UI_Spacer_C_ExecuteUbergraph_UI_Spacer");
static_assert(sizeof(UI_Spacer_C_ExecuteUbergraph_UI_Spacer) == 0x000018, "Wrong size on UI_Spacer_C_ExecuteUbergraph_UI_Spacer");
static_assert(offsetof(UI_Spacer_C_ExecuteUbergraph_UI_Spacer, EntryPoint) == 0x000000, "Member 'UI_Spacer_C_ExecuteUbergraph_UI_Spacer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Spacer_C_ExecuteUbergraph_UI_Spacer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_Spacer_C_ExecuteUbergraph_UI_Spacer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Spacer_C_ExecuteUbergraph_UI_Spacer, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'UI_Spacer_C_ExecuteUbergraph_UI_Spacer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UI_Spacer.UI_Spacer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Spacer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Spacer_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Spacer_C_PreConstruct");
static_assert(sizeof(UI_Spacer_C_PreConstruct) == 0x000001, "Wrong size on UI_Spacer_C_PreConstruct");
static_assert(offsetof(UI_Spacer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Spacer_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

