#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Section

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SectionLocation_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Section.UI_Section_C
// 0x0098 (0x0378 - 0x02E0)
class UUI_Section_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           NamesVerticalBox;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Section;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Verticalbox_TopStyle;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Names;                                             // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Delimiter;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SpacerSize;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   SectionText;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowSection;                                       // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Space_Between_Lines;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_SectionLocation                             SectionPosition;                                   // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SectionTextAppearanceDTHandle;                     // 0x0358(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FDataTableRowHandle                    NamesTextAppearanceDTHandle;                       // 0x0368(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_Section(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Section_C">();
	}
	static class UUI_Section_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Section_C>();
	}
};
static_assert(alignof(UUI_Section_C) == 0x000008, "Wrong alignment on UUI_Section_C");
static_assert(sizeof(UUI_Section_C) == 0x000378, "Wrong size on UUI_Section_C");
static_assert(offsetof(UUI_Section_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Section_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, NamesVerticalBox) == 0x0002E8, "Member 'UUI_Section_C::NamesVerticalBox' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Section) == 0x0002F0, "Member 'UUI_Section_C::Section' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Spacer) == 0x0002F8, "Member 'UUI_Section_C::Spacer' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Verticalbox_TopStyle) == 0x000300, "Member 'UUI_Section_C::Verticalbox_TopStyle' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Names) == 0x000308, "Member 'UUI_Section_C::Names' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Delimiter) == 0x000318, "Member 'UUI_Section_C::Delimiter' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, SpacerSize) == 0x000328, "Member 'UUI_Section_C::SpacerSize' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, SectionText) == 0x000330, "Member 'UUI_Section_C::SectionText' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, ShowSection) == 0x000340, "Member 'UUI_Section_C::ShowSection' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, Space_Between_Lines) == 0x000348, "Member 'UUI_Section_C::Space_Between_Lines' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, SectionPosition) == 0x000350, "Member 'UUI_Section_C::SectionPosition' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, SectionTextAppearanceDTHandle) == 0x000358, "Member 'UUI_Section_C::SectionTextAppearanceDTHandle' has a wrong offset!");
static_assert(offsetof(UUI_Section_C, NamesTextAppearanceDTHandle) == 0x000368, "Member 'UUI_Section_C::NamesTextAppearanceDTHandle' has a wrong offset!");

}

