#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LyraStartup

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function W_LyraStartup.W_LyraStartup_C.BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'W_LyraStartup_C_BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function W_LyraStartup.W_LyraStartup_C.ExecuteUbergraph_W_LyraStartup
// 0x0098 (0x0098 - 0x0000)
struct W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCommonUserInfo*                  K2Node_CustomEvent_UserInfo;                       // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error;                          // 0x0018(0x0010)()
	ECommonUserPrivilege                          K2Node_CustomEvent_RequestedPrivilege;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      K2Node_CustomEvent_OnlineContext;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      Temp_byte_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserPrivilege                          Temp_byte_Variable_1;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_CommonUserInitialize*      CallFunc_InitializeForLocalPlay_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup) == 0x000008, "Wrong alignment on W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup");
static_assert(sizeof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup) == 0x000098, "Wrong size on W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, EntryPoint) == 0x000000, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CustomEvent_UserInfo) == 0x000008, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CustomEvent_UserInfo' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CustomEvent_bSuccess) == 0x000010, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CustomEvent_Error) == 0x000018, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CustomEvent_Error' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CustomEvent_RequestedPrivilege) == 0x000028, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CustomEvent_RequestedPrivilege' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CustomEvent_OnlineContext) == 0x000029, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CustomEvent_OnlineContext' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, Temp_byte_Variable) == 0x00003C, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, Temp_byte_Variable_1) == 0x00003D, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, Temp_text_Variable) == 0x000040, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, Temp_bool_Variable) == 0x000050, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, Temp_object_Variable) == 0x000058, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000078, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, CallFunc_InitializeForLocalPlay_ReturnValue) == 0x000080, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::CallFunc_InitializeForLocalPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000090, "Member 'W_LyraStartup_C_ExecuteUbergraph_W_LyraStartup::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function W_LyraStartup.W_LyraStartup_C.HandleUserInitialize
// 0x0028 (0x0028 - 0x0000)
struct W_LyraStartup_C_HandleUserInitialize final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_HandleUserInitialize) == 0x000008, "Wrong alignment on W_LyraStartup_C_HandleUserInitialize");
static_assert(sizeof(W_LyraStartup_C_HandleUserInitialize) == 0x000028, "Wrong size on W_LyraStartup_C_HandleUserInitialize");
static_assert(offsetof(W_LyraStartup_C_HandleUserInitialize, UserInfo) == 0x000000, "Member 'W_LyraStartup_C_HandleUserInitialize::UserInfo' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_HandleUserInitialize, bSuccess) == 0x000008, "Member 'W_LyraStartup_C_HandleUserInitialize::bSuccess' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_HandleUserInitialize, Error) == 0x000010, "Member 'W_LyraStartup_C_HandleUserInitialize::Error' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_HandleUserInitialize, RequestedPrivilege) == 0x000020, "Member 'W_LyraStartup_C_HandleUserInitialize::RequestedPrivilege' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_HandleUserInitialize, OnlineContext) == 0x000021, "Member 'W_LyraStartup_C_HandleUserInitialize::OnlineContext' has a wrong offset!");

// Function W_LyraStartup.W_LyraStartup_C.OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482
// 0x0028 (0x0028 - 0x0000)
struct W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482 final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482) == 0x000008, "Wrong alignment on W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482");
static_assert(sizeof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482) == 0x000028, "Wrong size on W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482");
static_assert(offsetof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482, UserInfo) == 0x000000, "Member 'W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482::UserInfo' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482, bSuccess) == 0x000008, "Member 'W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482::bSuccess' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482, Error) == 0x000010, "Member 'W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482::Error' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482, RequestedPrivilege) == 0x000020, "Member 'W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482::RequestedPrivilege' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482, OnlineContext) == 0x000021, "Member 'W_LyraStartup_C_OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482::OnlineContext' has a wrong offset!");

// Function W_LyraStartup.W_LyraStartup_C.SetListenForLoginInput
// 0x0040 (0x0040 - 0x0000)
struct W_LyraStartup_C_SetListenForLoginInput final
{
public:
	bool                                          bShouldListen;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           EmptyKeys;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           PrimaryLoginKeys;                                  // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_SetListenForLoginInput) == 0x000008, "Wrong alignment on W_LyraStartup_C_SetListenForLoginInput");
static_assert(sizeof(W_LyraStartup_C_SetListenForLoginInput) == 0x000040, "Wrong size on W_LyraStartup_C_SetListenForLoginInput");
static_assert(offsetof(W_LyraStartup_C_SetListenForLoginInput, bShouldListen) == 0x000000, "Member 'W_LyraStartup_C_SetListenForLoginInput::bShouldListen' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_SetListenForLoginInput, EmptyKeys) == 0x000008, "Member 'W_LyraStartup_C_SetListenForLoginInput::EmptyKeys' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_SetListenForLoginInput, PrimaryLoginKeys) == 0x000018, "Member 'W_LyraStartup_C_SetListenForLoginInput::PrimaryLoginKeys' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_SetListenForLoginInput, K2Node_MakeArray_Array) == 0x000028, "Member 'W_LyraStartup_C_SetListenForLoginInput::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_LyraStartup_C_SetListenForLoginInput, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'W_LyraStartup_C_SetListenForLoginInput::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function W_LyraStartup.W_LyraStartup_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_LyraStartup_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraStartup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on W_LyraStartup_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(W_LyraStartup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on W_LyraStartup_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(W_LyraStartup_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'W_LyraStartup_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

