#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LyraMenuButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_LyraMenuButton.W_LyraMenuButton_C.ExecuteUbergraph_W_LyraMenuButton
// 0x0090 (0x0090 - 0x0000)
struct W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0080(0x0010)(ConstParm)
};
static_assert(alignof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton) == 0x000008, "Wrong alignment on W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton");
static_assert(sizeof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton) == 0x000090, "Wrong size on W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, EntryPoint) == 0x000000, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000028, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000030, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000038, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000040, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000050, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000068, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000070, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000078, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton, K2Node_Event_InText) == 0x000080, "Member 'W_LyraMenuButton_C_ExecuteUbergraph_W_LyraMenuButton::K2Node_Event_InText' has a wrong offset!");

// Function W_LyraMenuButton.W_LyraMenuButton_C.GetPressProgress
// 0x0008 (0x0008 - 0x0000)
struct W_LyraMenuButton_C_GetPressProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraMenuButton_C_GetPressProgress) == 0x000008, "Wrong alignment on W_LyraMenuButton_C_GetPressProgress");
static_assert(sizeof(W_LyraMenuButton_C_GetPressProgress) == 0x000008, "Wrong size on W_LyraMenuButton_C_GetPressProgress");
static_assert(offsetof(W_LyraMenuButton_C_GetPressProgress, Progress) == 0x000000, "Member 'W_LyraMenuButton_C_GetPressProgress::Progress' has a wrong offset!");

// Function W_LyraMenuButton.W_LyraMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_LyraMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_LyraMenuButton_C_PreConstruct");
static_assert(sizeof(W_LyraMenuButton_C_PreConstruct) == 0x000001, "Wrong size on W_LyraMenuButton_C_PreConstruct");
static_assert(offsetof(W_LyraMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_LyraMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_LyraMenuButton.W_LyraMenuButton_C.ResetMaterials
// 0x0010 (0x0010 - 0x0000)
struct W_LyraMenuButton_C_ResetMaterials final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraMenuButton_C_ResetMaterials) == 0x000008, "Wrong alignment on W_LyraMenuButton_C_ResetMaterials");
static_assert(sizeof(W_LyraMenuButton_C_ResetMaterials) == 0x000010, "Wrong size on W_LyraMenuButton_C_ResetMaterials");
static_assert(offsetof(W_LyraMenuButton_C_ResetMaterials, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'W_LyraMenuButton_C_ResetMaterials::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_LyraMenuButton_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function W_LyraMenuButton.W_LyraMenuButton_C.UpdateButtonStyles
// 0x00C0 (0x00C0 - 0x0000)
struct W_LyraMenuButton_C_UpdateButtonStyles final
{
public:
	float                                         Temp_real_Variable;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcherSlot*                    CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0060(0x0038)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_1;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LyraMenuButton_C_UpdateButtonStyles) == 0x000008, "Wrong alignment on W_LyraMenuButton_C_UpdateButtonStyles");
static_assert(sizeof(W_LyraMenuButton_C_UpdateButtonStyles) == 0x0000C0, "Wrong size on W_LyraMenuButton_C_UpdateButtonStyles");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_real_Variable) == 0x000000, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_real_Variable_1) == 0x000004, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_bool_Variable) == 0x000008, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_byte_Variable) == 0x000009, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_byte_Variable_1) == 0x00000A, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_bool_Variable_1) == 0x00000B, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_byte_Variable_2) == 0x00000C, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_byte_Variable_3) == 0x00000D, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, Temp_bool_Variable_2) == 0x00000E, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue) == 0x000018, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Margin) == 0x000020, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Margin_1) == 0x000030, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000040, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_Select_Default) == 0x000048, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_WidgetTransform) == 0x000060, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_Select_Default_1) == 0x000098, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_Select_Default_2) == 0x000099, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x00009C, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Top_ImplicitCast) == 0x0000A0, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000A4, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Right_ImplicitCast) == 0x0000A8, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x0000AC, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, K2Node_MakeStruct_Right_ImplicitCast_1) == 0x0000B0, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::K2Node_MakeStruct_Right_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonStyles, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0000B8, "Member 'W_LyraMenuButton_C_UpdateButtonStyles::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");

// Function W_LyraMenuButton.W_LyraMenuButton_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct W_LyraMenuButton_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_LyraMenuButton_C_UpdateButtonText) == 0x000008, "Wrong alignment on W_LyraMenuButton_C_UpdateButtonText");
static_assert(sizeof(W_LyraMenuButton_C_UpdateButtonText) == 0x000010, "Wrong size on W_LyraMenuButton_C_UpdateButtonText");
static_assert(offsetof(W_LyraMenuButton_C_UpdateButtonText, InText) == 0x000000, "Member 'W_LyraMenuButton_C_UpdateButtonText::InText' has a wrong offset!");

}

