#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerList.W_PlayerList_C
// 0x0040 (0x0320 - 0x02E0)
class UW_PlayerList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_JoinLeave;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Settings;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_PlayerList;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ActualTeam;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_JoinLeave;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_C*                          W_Settings;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsVisible_;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_48_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Mute_K2Node_ComponentBoundEvent_51_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_PlayerList(int32 EntryPoint);
	void OnTimer();
	void RefreshActualTeam();
	void RefreshPlayerList();
	void ShowHide(bool IgnoreInput_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayerList_C">();
	}
	static class UW_PlayerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerList_C>();
	}
};
static_assert(alignof(UW_PlayerList_C) == 0x000008, "Wrong alignment on UW_PlayerList_C");
static_assert(sizeof(UW_PlayerList_C) == 0x000320, "Wrong size on UW_PlayerList_C");
static_assert(offsetof(UW_PlayerList_C, UberGraphFrame) == 0x0002E0, "Member 'UW_PlayerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, Button_JoinLeave) == 0x0002E8, "Member 'UW_PlayerList_C::Button_JoinLeave' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, Button_Settings) == 0x0002F0, "Member 'UW_PlayerList_C::Button_Settings' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, ScrollBox_PlayerList) == 0x0002F8, "Member 'UW_PlayerList_C::ScrollBox_PlayerList' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, TextBlock_ActualTeam) == 0x000300, "Member 'UW_PlayerList_C::TextBlock_ActualTeam' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, TextBlock_JoinLeave) == 0x000308, "Member 'UW_PlayerList_C::TextBlock_JoinLeave' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, W_Settings) == 0x000310, "Member 'UW_PlayerList_C::W_Settings' has a wrong offset!");
static_assert(offsetof(UW_PlayerList_C, IsVisible_) == 0x000318, "Member 'UW_PlayerList_C::IsVisible_' has a wrong offset!");

}

