#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsListEntry_KBMBinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingsListEntry_KBMBinding.W_SettingsListEntry_KBMBinding_C
// 0x0018 (0x03A8 - 0x0390)
class UW_SettingsListEntry_KBMBinding_C final : public ULyraSettingsListEntrySetting_KeyboardInput
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               EntryHeightSB;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SettingsListEntry_KBMBinding(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingsListEntry_KBMBinding_C">();
	}
	static class UW_SettingsListEntry_KBMBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingsListEntry_KBMBinding_C>();
	}
};
static_assert(alignof(UW_SettingsListEntry_KBMBinding_C) == 0x000008, "Wrong alignment on UW_SettingsListEntry_KBMBinding_C");
static_assert(sizeof(UW_SettingsListEntry_KBMBinding_C) == 0x0003A8, "Wrong size on UW_SettingsListEntry_KBMBinding_C");
static_assert(offsetof(UW_SettingsListEntry_KBMBinding_C, UberGraphFrame) == 0x000390, "Member 'UW_SettingsListEntry_KBMBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_KBMBinding_C, OnHover) == 0x000398, "Member 'UW_SettingsListEntry_KBMBinding_C::OnHover' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_KBMBinding_C, EntryHeightSB) == 0x0003A0, "Member 'UW_SettingsListEntry_KBMBinding_C::EntryHeightSB' has a wrong offset!");

}

