#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsListEntry_Missing

#include "Basic.hpp"

#include "GameSettings_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingsListEntry_Missing.W_SettingsListEntry_Missing_C
// 0x0020 (0x0360 - 0x0340)
class UW_SettingsListEntry_Missing_C final : public UGameSettingListEntry_Setting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               EntryHeightSB;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SettingName_1;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SettingsListEntry_Missing(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingsListEntry_Missing_C">();
	}
	static class UW_SettingsListEntry_Missing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingsListEntry_Missing_C>();
	}
};
static_assert(alignof(UW_SettingsListEntry_Missing_C) == 0x000008, "Wrong alignment on UW_SettingsListEntry_Missing_C");
static_assert(sizeof(UW_SettingsListEntry_Missing_C) == 0x000360, "Wrong size on UW_SettingsListEntry_Missing_C");
static_assert(offsetof(UW_SettingsListEntry_Missing_C, UberGraphFrame) == 0x000340, "Member 'UW_SettingsListEntry_Missing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_Missing_C, OnHover) == 0x000348, "Member 'UW_SettingsListEntry_Missing_C::OnHover' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_Missing_C, EntryHeightSB) == 0x000350, "Member 'UW_SettingsListEntry_Missing_C::EntryHeightSB' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_Missing_C, Text_SettingName_1) == 0x000358, "Member 'UW_SettingsListEntry_Missing_C::Text_SettingName_1' has a wrong offset!");

}

