#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UserWatermark

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_UserWatermark.W_UserWatermark_C.ExecuteUbergraph_W_UserWatermark
// 0x00C0 (0x00C0 - 0x0000)
struct W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCommonUserInfo*                  CallFunc_GetUserInfoForControllerId_ReturnValue;   // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugString_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickname_ReturnValue;                  // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A8(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark) == 0x000008, "Wrong alignment on W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark");
static_assert(sizeof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark) == 0x0000C0, "Wrong size on W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, EntryPoint) == 0x000000, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, Temp_bool_Variable) == 0x000004, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, Temp_byte_Variable) == 0x000005, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, Temp_byte_Variable_1) == 0x000006, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, K2Node_Event_IsDesignTime) == 0x000007, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_IsLoggedIn_ReturnValue) == 0x000050, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetPlayerControllerID_ReturnValue) == 0x000068, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetUserInfoForControllerId_ReturnValue) == 0x000070, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetUserInfoForControllerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetDebugString_ReturnValue) == 0x000078, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetDebugString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_GetNickname_ReturnValue) == 0x000088, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_GetNickname_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A8, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark, K2Node_Select_Default) == 0x0000B8, "Member 'W_UserWatermark_C_ExecuteUbergraph_W_UserWatermark::K2Node_Select_Default' has a wrong offset!");

// Function W_UserWatermark.W_UserWatermark_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_UserWatermark_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UserWatermark_C_PreConstruct) == 0x000001, "Wrong alignment on W_UserWatermark_C_PreConstruct");
static_assert(sizeof(W_UserWatermark_C_PreConstruct) == 0x000001, "Wrong size on W_UserWatermark_C_PreConstruct");
static_assert(offsetof(W_UserWatermark_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_UserWatermark_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_UserWatermark.W_UserWatermark_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_UserWatermark_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UserWatermark_C_Tick) == 0x000004, "Wrong alignment on W_UserWatermark_C_Tick");
static_assert(sizeof(W_UserWatermark_C_Tick) == 0x00003C, "Wrong size on W_UserWatermark_C_Tick");
static_assert(offsetof(W_UserWatermark_C_Tick, MyGeometry) == 0x000000, "Member 'W_UserWatermark_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_UserWatermark_C_Tick, InDeltaTime) == 0x000038, "Member 'W_UserWatermark_C_Tick::InDeltaTime' has a wrong offset!");

}

