#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VOIPAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VOIPAnim.W_VOIPAnim_C
// 0x0018 (0x02F8 - 0x02E0)
class UW_VOIPAnim_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_VOIP;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_VOIPAnim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_VOIPAnim_C">();
	}
	static class UW_VOIPAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_VOIPAnim_C>();
	}
};
static_assert(alignof(UW_VOIPAnim_C) == 0x000008, "Wrong alignment on UW_VOIPAnim_C");
static_assert(sizeof(UW_VOIPAnim_C) == 0x0002F8, "Wrong size on UW_VOIPAnim_C");
static_assert(offsetof(UW_VOIPAnim_C, UberGraphFrame) == 0x0002E0, "Member 'UW_VOIPAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_VOIPAnim_C, Anim) == 0x0002E8, "Member 'UW_VOIPAnim_C::Anim' has a wrong offset!");
static_assert(offsetof(UW_VOIPAnim_C, Image_VOIP) == 0x0002F0, "Member 'UW_VOIPAnim_C::Image_VOIP' has a wrong offset!");

}

