#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallPartsStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct WallPartsStruct.WallPartsStruct
// 0x0090 (0x0090 - 0x0000)
struct FWallPartsStruct final
{
public:
	class UStaticMesh*                            Mesh_9_5D3A5CDA4B8E5A10EB5F30B37F30956A;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_12_644C30B144364A841E7EF8AE27BAF426;     // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spacing_6_35FEBAF74E8A45C81848DBA07F023DB1;        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AdditionalModules_15_A32F4F53414C06263C5CD78BC3AFFCFA; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RoundedCorner_1_4D3B75F24689D1EE979E9184FFEEC268;  // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddSupportLoopsRC_18_4A497B844EC56BF8AC62A38F3ACE4B09; // 0x007D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SmoothingAngleRC_21_83B5E1624670943206EE9EB4BD91ADFB; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWallPartsStruct) == 0x000010, "Wrong alignment on FWallPartsStruct");
static_assert(sizeof(FWallPartsStruct) == 0x000090, "Wrong size on FWallPartsStruct");
static_assert(offsetof(FWallPartsStruct, Mesh_9_5D3A5CDA4B8E5A10EB5F30B37F30956A) == 0x000000, "Member 'FWallPartsStruct::Mesh_9_5D3A5CDA4B8E5A10EB5F30B37F30956A' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, Transform_12_644C30B144364A841E7EF8AE27BAF426) == 0x000010, "Member 'FWallPartsStruct::Transform_12_644C30B144364A841E7EF8AE27BAF426' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, Spacing_6_35FEBAF74E8A45C81848DBA07F023DB1) == 0x000070, "Member 'FWallPartsStruct::Spacing_6_35FEBAF74E8A45C81848DBA07F023DB1' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, AdditionalModules_15_A32F4F53414C06263C5CD78BC3AFFCFA) == 0x000078, "Member 'FWallPartsStruct::AdditionalModules_15_A32F4F53414C06263C5CD78BC3AFFCFA' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, RoundedCorner_1_4D3B75F24689D1EE979E9184FFEEC268) == 0x00007C, "Member 'FWallPartsStruct::RoundedCorner_1_4D3B75F24689D1EE979E9184FFEEC268' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, AddSupportLoopsRC_18_4A497B844EC56BF8AC62A38F3ACE4B09) == 0x00007D, "Member 'FWallPartsStruct::AddSupportLoopsRC_18_4A497B844EC56BF8AC62A38F3ACE4B09' has a wrong offset!");
static_assert(offsetof(FWallPartsStruct, SmoothingAngleRC_21_83B5E1624670943206EE9EB4BD91ADFB) == 0x000080, "Member 'FWallPartsStruct::SmoothingAngleRC_21_83B5E1624670943206EE9EB4BD91ADFB' has a wrong offset!");

}

