#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ButtonWithCheckbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C
// 0x0080 (0x0360 - 0x02E0)
class UWB_ButtonWithCheckbox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressedAnimation;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0310(0x0010)(Edit, BlueprintVisible)
	double                                        ButtonWidth;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonHeight;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          DefaultValue;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCheckStateChanged;                               // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_Base_K2Node_ComponentBoundEvent_74_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WB_Button_Button_Base_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_Button_Button_Base_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void Construct();
	void ExecuteUbergraph_WB_ButtonWithCheckbox(int32 EntryPoint);
	void IsChecked(bool* IsChecked_0);
	void OnCheckStateChanged__DelegateSignature(bool IsChecked_0);
	void OnClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ButtonWithCheckbox_C">();
	}
	static class UWB_ButtonWithCheckbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ButtonWithCheckbox_C>();
	}
};
static_assert(alignof(UWB_ButtonWithCheckbox_C) == 0x000008, "Wrong alignment on UWB_ButtonWithCheckbox_C");
static_assert(sizeof(UWB_ButtonWithCheckbox_C) == 0x000360, "Wrong size on UWB_ButtonWithCheckbox_C");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_ButtonWithCheckbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, PressedAnimation) == 0x0002E8, "Member 'UWB_ButtonWithCheckbox_C::PressedAnimation' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, Button) == 0x0002F0, "Member 'UWB_ButtonWithCheckbox_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, CheckBox) == 0x0002F8, "Member 'UWB_ButtonWithCheckbox_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, SizeBox) == 0x000300, "Member 'UWB_ButtonWithCheckbox_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, TextBlock) == 0x000308, "Member 'UWB_ButtonWithCheckbox_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, Text) == 0x000310, "Member 'UWB_ButtonWithCheckbox_C::Text' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, ButtonWidth) == 0x000320, "Member 'UWB_ButtonWithCheckbox_C::ButtonWidth' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, ButtonHeight) == 0x000328, "Member 'UWB_ButtonWithCheckbox_C::ButtonHeight' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, FontSize) == 0x000330, "Member 'UWB_ButtonWithCheckbox_C::FontSize' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, OnClicked) == 0x000338, "Member 'UWB_ButtonWithCheckbox_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, DefaultValue) == 0x000348, "Member 'UWB_ButtonWithCheckbox_C::DefaultValue' has a wrong offset!");
static_assert(offsetof(UWB_ButtonWithCheckbox_C, OnCheckStateChanged) == 0x000350, "Member 'UWB_ButtonWithCheckbox_C::OnCheckStateChanged' has a wrong offset!");

}

