#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Button.WB_Button_C
// 0x0060 (0x0340 - 0x02E0)
class UWB_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressedAnimation;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Base;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Base;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Base;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0308(0x0010)(Edit, BlueprintVisible)
	double                                        ButtonWidth;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonHeight;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_Base_K2Node_ComponentBoundEvent_74_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WB_Button_Button_Base_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_Button_Button_Base_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WB_Button(int32 EntryPoint);
	void OnClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Button_C">();
	}
	static class UWB_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Button_C>();
	}
};
static_assert(alignof(UWB_Button_C) == 0x000008, "Wrong alignment on UWB_Button_C");
static_assert(sizeof(UWB_Button_C) == 0x000340, "Wrong size on UWB_Button_C");
static_assert(offsetof(UWB_Button_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, PressedAnimation) == 0x0002E8, "Member 'UWB_Button_C::PressedAnimation' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, Button_Base) == 0x0002F0, "Member 'UWB_Button_C::Button_Base' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, SizeBox_Base) == 0x0002F8, "Member 'UWB_Button_C::SizeBox_Base' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, TextBlock_Base) == 0x000300, "Member 'UWB_Button_C::TextBlock_Base' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, Text) == 0x000308, "Member 'UWB_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, ButtonWidth) == 0x000318, "Member 'UWB_Button_C::ButtonWidth' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, ButtonHeight) == 0x000320, "Member 'UWB_Button_C::ButtonHeight' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, FontSize) == 0x000328, "Member 'UWB_Button_C::FontSize' has a wrong offset!");
static_assert(offsetof(UWB_Button_C, OnClicked) == 0x000330, "Member 'UWB_Button_C::OnClicked' has a wrong offset!");

}

