#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HorizontalComboBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.AddOption
// 0x0028 (0x0028 - 0x0000)
struct WB_HorizontalComboBox_C_AddOption final
{
public:
	class FName                                   NewOptionKey;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NewOption;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(WB_HorizontalComboBox_C_AddOption) == 0x000008, "Wrong alignment on WB_HorizontalComboBox_C_AddOption");
static_assert(sizeof(WB_HorizontalComboBox_C_AddOption) == 0x000028, "Wrong size on WB_HorizontalComboBox_C_AddOption");
static_assert(offsetof(WB_HorizontalComboBox_C_AddOption, NewOptionKey) == 0x000000, "Member 'WB_HorizontalComboBox_C_AddOption::NewOptionKey' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_AddOption, NewOption) == 0x000008, "Member 'WB_HorizontalComboBox_C_AddOption::NewOption' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_AddOption, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'WB_HorizontalComboBox_C_AddOption::CallFunc_Map_Keys_Keys' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.ExecuteUbergraph_WB_HorizontalComboBox
// 0x00A0 (0x00A0 - 0x0000)
struct WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0008(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x0070(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MainMenu_Settings_C*                CallFunc_GetSettingsMenu_SettingsWI;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox) == 0x000008, "Wrong alignment on WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox");
static_assert(sizeof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox) == 0x0000A0, "Wrong size on WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, EntryPoint) == 0x000000, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Map_Find_Value) == 0x000008, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Map_Keys_Keys) == 0x000028, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_LastIndex_ReturnValue) == 0x000038, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SelectInt_ReturnValue) == 0x00003C, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000040, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SelectInt_ReturnValue_1) == 0x000044, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SelectInt_ReturnValue_2) == 0x000048, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_Get_Item) == 0x00004C, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_Get_Item_1) == 0x000054, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Array_Find_ReturnValue) == 0x000064, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SelectInt_ReturnValue_3) == 0x000068, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, Temp_bool_Has_Been_Initd_Variable_1) == 0x00006C, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Map_Find_Value_1) == 0x000070, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_Map_Find_ReturnValue_1) == 0x000080, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_GetSettingsMenu_SettingsWI) == 0x000088, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_GetSettingsMenu_SettingsWI' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, Temp_bool_IsClosed_Variable_1) == 0x000090, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000094, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000098, "Member 'WB_HorizontalComboBox_C_ExecuteUbergraph_WB_HorizontalComboBox::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.OnSelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature final
{
public:
	class FName                                   NewSelection;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'WB_HorizontalComboBox_C_OnSelectionChanged__DelegateSignature::NewSelection' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_HorizontalComboBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_PreConstruct) == 0x000001, "Wrong alignment on WB_HorizontalComboBox_C_PreConstruct");
static_assert(sizeof(WB_HorizontalComboBox_C_PreConstruct) == 0x000001, "Wrong size on WB_HorizontalComboBox_C_PreConstruct");
static_assert(offsetof(WB_HorizontalComboBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_HorizontalComboBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.SetSelectedOption
// 0x0038 (0x0038 - 0x0000)
struct WB_HorizontalComboBox_C_SetSelectedOption final
{
public:
	class FName                                   NewSelection;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTriggerDelegate;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FriendlyName;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0020(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_SetSelectedOption) == 0x000008, "Wrong alignment on WB_HorizontalComboBox_C_SetSelectedOption");
static_assert(sizeof(WB_HorizontalComboBox_C_SetSelectedOption) == 0x000038, "Wrong size on WB_HorizontalComboBox_C_SetSelectedOption");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, NewSelection) == 0x000000, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::NewSelection' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, bTriggerDelegate) == 0x000008, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::bTriggerDelegate' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, FriendlyName) == 0x000010, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::FriendlyName' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, CallFunc_Map_Find_Value) == 0x000020, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_HorizontalComboBox_C_SetSelectedOption, CallFunc_Array_Find_ReturnValue) == 0x000034, "Member 'WB_HorizontalComboBox_C_SetSelectedOption::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.GetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct WB_HorizontalComboBox_C_GetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_GetSelectedIndex) == 0x000004, "Wrong alignment on WB_HorizontalComboBox_C_GetSelectedIndex");
static_assert(sizeof(WB_HorizontalComboBox_C_GetSelectedIndex) == 0x000004, "Wrong size on WB_HorizontalComboBox_C_GetSelectedIndex");
static_assert(offsetof(WB_HorizontalComboBox_C_GetSelectedIndex, Index_0) == 0x000000, "Member 'WB_HorizontalComboBox_C_GetSelectedIndex::Index_0' has a wrong offset!");

// Function WB_HorizontalComboBox.WB_HorizontalComboBox_C.GetSelectedOption
// 0x0008 (0x0008 - 0x0000)
struct WB_HorizontalComboBox_C_GetSelectedOption final
{
public:
	class FName                                   Option;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_HorizontalComboBox_C_GetSelectedOption) == 0x000004, "Wrong alignment on WB_HorizontalComboBox_C_GetSelectedOption");
static_assert(sizeof(WB_HorizontalComboBox_C_GetSelectedOption) == 0x000008, "Wrong size on WB_HorizontalComboBox_C_GetSelectedOption");
static_assert(offsetof(WB_HorizontalComboBox_C_GetSelectedOption, Option) == 0x000000, "Member 'WB_HorizontalComboBox_C_GetSelectedOption::Option' has a wrong offset!");

}

