#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_Lobby.WB_Lobby_C.Bind on Ready
// 0x0058 (0x0058 - 0x0000)
struct WB_Lobby_C_Bind_on_Ready final
{
public:
	TDelegate<void(class APlayerStateJP_Lobby* PlayerState, bool ReadyAndWaiting)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool AllPlayersReadyAndWaiting)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Lobby*                     K2Node_DynamicCast_AsGame_State_JP_Lobby;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_Lobby*                   K2Node_DynamicCast_AsPlayer_State_JP_Lobby;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_Bind_on_Ready) == 0x000008, "Wrong alignment on WB_Lobby_C_Bind_on_Ready");
static_assert(sizeof(WB_Lobby_C_Bind_on_Ready) == 0x000058, "Wrong size on WB_Lobby_C_Bind_on_Ready");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'WB_Lobby_C_Bind_on_Ready::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_DynamicCast_AsGame_State_JP_Lobby) == 0x000028, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_DynamicCast_AsGame_State_JP_Lobby' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WB_Lobby_C_Bind_on_Ready::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WB_Lobby_C_Bind_on_Ready::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_DynamicCast_AsPlayer_State_JP_Lobby) == 0x000048, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_DynamicCast_AsPlayer_State_JP_Lobby' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_Bind_on_Ready, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WB_Lobby_C_Bind_on_Ready::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.CancelCountdown
// 0x0018 (0x0018 - 0x0000)
struct WB_Lobby_C_CancelCountdown final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_CancelCountdown) == 0x000008, "Wrong alignment on WB_Lobby_C_CancelCountdown");
static_assert(sizeof(WB_Lobby_C_CancelCountdown) == 0x000018, "Wrong size on WB_Lobby_C_CancelCountdown");
static_assert(offsetof(WB_Lobby_C_CancelCountdown, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_Lobby_C_CancelCountdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_CancelCountdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WB_Lobby_C_CancelCountdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.ExecuteUbergraph_WB_Lobby
// 0x01C8 (0x01C8 - 0x0000)
struct WB_Lobby_C_ExecuteUbergraph_WB_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogBox_C*                        CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0058(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerJP_Lobby*              CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectSettingsJP*                     CallFunc_GetProjectSettings_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Lobby*                   CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue; // 0x00B0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetNextTeamID_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerControllerJP_Lobby*              CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby_1; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0118(0x0048)(HasGetValueTypeHash)
	class APlayerStateJP_Lobby*                   CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetReadyAndWaiting_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerStateJP_Lobby*                   K2Node_CustomEvent_PlayerState;                    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ReadyAndWaiting;                // 0x01B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01B8(0x0010)()
};
static_assert(alignof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby) == 0x000008, "Wrong alignment on WB_Lobby_C_ExecuteUbergraph_WB_Lobby");
static_assert(sizeof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby) == 0x0001C8, "Wrong size on WB_Lobby_C_ExecuteUbergraph_WB_Lobby");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, EntryPoint) == 0x000000, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, Temp_text_Variable) == 0x000008, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, Temp_text_Variable_1) == 0x000018, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000058, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_DynamicCast_AsBP_GI) == 0x000078, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby) == 0x000088, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetPlayerController_ReturnValue_1) == 0x000090, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetIsPie_ReturnValue) == 0x000098, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, Temp_bool_Variable) == 0x000099, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetProjectSettings_ReturnValue) == 0x0000A0, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetProjectSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue) == 0x0000A8, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue) == 0x0000B0, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetTeamID_ReturnValue) == 0x0000D0, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_BreakSoftObjectPath_PathString) == 0x0000D8, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetNextTeamID_ReturnValue) == 0x0000E8, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetNextTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetBaseFilename_ReturnValue) == 0x0000F0, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby_1) == 0x000100, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetPCLobby_AsPlayer_Controller_JP_Lobby_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_MakeStruct_FormatArgumentData) == 0x000118, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue_1) == 0x000160, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetFirstPlayerStateJP_Lobby_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_MakeArray_Array) == 0x000168, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_GetReadyAndWaiting_ReturnValue) == 0x000178, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_GetReadyAndWaiting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Format_ReturnValue) == 0x000180, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Conv_TextToString_ReturnValue) == 0x000198, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_CustomEvent_PlayerState) == 0x0001A8, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_CustomEvent_ReadyAndWaiting) == 0x0001B0, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_CustomEvent_ReadyAndWaiting' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B1, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_ExecuteUbergraph_WB_Lobby, K2Node_Select_Default) == 0x0001B8, "Member 'WB_Lobby_C_ExecuteUbergraph_WB_Lobby::K2Node_Select_Default' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.GetPCLobby
// 0x0020 (0x0020 - 0x0000)
struct WB_Lobby_C_GetPCLobby final
{
public:
	class APlayerControllerJP_Lobby*              AsPlayer_Controller_JP_Lobby;                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerJP_Lobby*              K2Node_DynamicCast_AsPlayer_Controller_JP_Lobby;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_GetPCLobby) == 0x000008, "Wrong alignment on WB_Lobby_C_GetPCLobby");
static_assert(sizeof(WB_Lobby_C_GetPCLobby) == 0x000020, "Wrong size on WB_Lobby_C_GetPCLobby");
static_assert(offsetof(WB_Lobby_C_GetPCLobby, AsPlayer_Controller_JP_Lobby) == 0x000000, "Member 'WB_Lobby_C_GetPCLobby::AsPlayer_Controller_JP_Lobby' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_GetPCLobby, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WB_Lobby_C_GetPCLobby::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_GetPCLobby, K2Node_DynamicCast_AsPlayer_Controller_JP_Lobby) == 0x000010, "Member 'WB_Lobby_C_GetPCLobby::K2Node_DynamicCast_AsPlayer_Controller_JP_Lobby' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_GetPCLobby, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_Lobby_C_GetPCLobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.HandleReadyAndWaitingChanged
// 0x0010 (0x0010 - 0x0000)
struct WB_Lobby_C_HandleReadyAndWaitingChanged final
{
public:
	class APlayerStateJP_Lobby*                   PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReadyAndWaiting;                                   // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_HandleReadyAndWaitingChanged) == 0x000008, "Wrong alignment on WB_Lobby_C_HandleReadyAndWaitingChanged");
static_assert(sizeof(WB_Lobby_C_HandleReadyAndWaitingChanged) == 0x000010, "Wrong size on WB_Lobby_C_HandleReadyAndWaitingChanged");
static_assert(offsetof(WB_Lobby_C_HandleReadyAndWaitingChanged, PlayerState) == 0x000000, "Member 'WB_Lobby_C_HandleReadyAndWaitingChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_HandleReadyAndWaitingChanged, ReadyAndWaiting) == 0x000008, "Member 'WB_Lobby_C_HandleReadyAndWaitingChanged::ReadyAndWaiting' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.OnStartStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WB_Lobby_C_OnStartStateChanged final
{
public:
	bool                                          bNewStartingRound;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_OnStartStateChanged) == 0x000001, "Wrong alignment on WB_Lobby_C_OnStartStateChanged");
static_assert(sizeof(WB_Lobby_C_OnStartStateChanged) == 0x000001, "Wrong size on WB_Lobby_C_OnStartStateChanged");
static_assert(offsetof(WB_Lobby_C_OnStartStateChanged, bNewStartingRound) == 0x000000, "Member 'WB_Lobby_C_OnStartStateChanged::bNewStartingRound' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.StartCountdown
// 0x0038 (0x0038 - 0x0000)
struct WB_Lobby_C_StartCountdown final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue;             // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue_1;           // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_StartCountdown) == 0x000008, "Wrong alignment on WB_Lobby_C_StartCountdown");
static_assert(sizeof(WB_Lobby_C_StartCountdown) == 0x000038, "Wrong size on WB_Lobby_C_StartCountdown");
static_assert(offsetof(WB_Lobby_C_StartCountdown, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_Lobby_C_StartCountdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_StartCountdown, CallFunc_GetTweakableData_ReturnValue) == 0x000010, "Member 'WB_Lobby_C_StartCountdown::CallFunc_GetTweakableData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_StartCountdown, CallFunc_GetTweakableData_ReturnValue_1) == 0x000018, "Member 'WB_Lobby_C_StartCountdown::CallFunc_GetTweakableData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_StartCountdown, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WB_Lobby_C_StartCountdown::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_StartCountdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WB_Lobby_C_StartCountdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_StartCountdown, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000030, "Member 'WB_Lobby_C_StartCountdown::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.SwitchTab
// 0x0008 (0x0008 - 0x0000)
struct WB_Lobby_C_SwitchTab final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Lobby_C_SwitchTab) == 0x000008, "Wrong alignment on WB_Lobby_C_SwitchTab");
static_assert(sizeof(WB_Lobby_C_SwitchTab) == 0x000008, "Wrong size on WB_Lobby_C_SwitchTab");
static_assert(offsetof(WB_Lobby_C_SwitchTab, Widget) == 0x000000, "Member 'WB_Lobby_C_SwitchTab::Widget' has a wrong offset!");

// Function WB_Lobby.WB_Lobby_C.UpdateLobbyName
// 0x0050 (0x0050 - 0x0000)
struct WB_Lobby_C_UpdateLobbyName final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	bool                                          CallFunc_GetCurrentLobbyName_Success;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLobbyName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
};
static_assert(alignof(WB_Lobby_C_UpdateLobbyName) == 0x000008, "Wrong alignment on WB_Lobby_C_UpdateLobbyName");
static_assert(sizeof(WB_Lobby_C_UpdateLobbyName) == 0x000050, "Wrong size on WB_Lobby_C_UpdateLobbyName");
static_assert(offsetof(WB_Lobby_C_UpdateLobbyName, Temp_bool_Variable) == 0x000000, "Member 'WB_Lobby_C_UpdateLobbyName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_UpdateLobbyName, Temp_text_Variable) == 0x000008, "Member 'WB_Lobby_C_UpdateLobbyName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_UpdateLobbyName, CallFunc_GetCurrentLobbyName_Success) == 0x000018, "Member 'WB_Lobby_C_UpdateLobbyName::CallFunc_GetCurrentLobbyName_Success' has a wrong offset!");
static_assert(offsetof(WB_Lobby_C_UpdateLobbyName, CallFunc_GetCurrentLobbyName_ReturnValue) == 0x000020, "Member 'WB_Lobby_C_UpdateLobbyName::CallFunc_GetCurrentLobbyName_ReturnValue' has a wrong offset!");
