#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lobby_PlayerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lobby_PlayerList.WB_Lobby_PlayerList_C
// 0x0028 (0x0308 - 0x02E0)
class UWB_Lobby_PlayerList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_182;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULobbyPlayerListSectionWI_C*            LobbyPlayerListSectionWI_1;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULobbyPlayerListSectionWI_C*            LobbyPlayerListSectionWI_2;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULobbyPlayerListSectionWI_C*            LobbyPlayerListSectionWI_3;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WB_Lobby_PlayerList(int32 EntryPoint);
	void OnInitialized();
	void OnTeamsChanged(const struct FTeam& AffectedTeam);
	void RefreshLists();
	void RequireRefreshLists();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lobby_PlayerList_C">();
	}
	static class UWB_Lobby_PlayerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lobby_PlayerList_C>();
	}
};
static_assert(alignof(UWB_Lobby_PlayerList_C) == 0x000008, "Wrong alignment on UWB_Lobby_PlayerList_C");
static_assert(sizeof(UWB_Lobby_PlayerList_C) == 0x000308, "Wrong size on UWB_Lobby_PlayerList_C");
static_assert(offsetof(UWB_Lobby_PlayerList_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_Lobby_PlayerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_PlayerList_C, Image_182) == 0x0002E8, "Member 'UWB_Lobby_PlayerList_C::Image_182' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_PlayerList_C, LobbyPlayerListSectionWI_1) == 0x0002F0, "Member 'UWB_Lobby_PlayerList_C::LobbyPlayerListSectionWI_1' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_PlayerList_C, LobbyPlayerListSectionWI_2) == 0x0002F8, "Member 'UWB_Lobby_PlayerList_C::LobbyPlayerListSectionWI_2' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_PlayerList_C, LobbyPlayerListSectionWI_3) == 0x000300, "Member 'UWB_Lobby_PlayerList_C::LobbyPlayerListSectionWI_3' has a wrong offset!");

}

