#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lobby_CharacterSelection_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lobby_CharacterSelection_Entry.WB_Lobby_CharacterSelection_Entry_C
// 0x0370 (0x0650 - 0x02E0)
class UWB_Lobby_CharacterSelection_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Base;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CharacterIcon;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Role_Row_Name;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWB_Lobby_CharacterSelection_C*         WB_CharacterSelection;                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateBrush                            ButtonNotSelectedNormal;                           // 0x0310(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            ButtonSelectedNormal;                              // 0x03E0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            ButtonSelectedHovered;                             // 0x04B0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            ButtonNotSelectedHovered;                          // 0x0580(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Button_Base_K2Node_ComponentBoundEvent_80_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WB_Lobby_CharacterSelection_Entry(int32 EntryPoint);
	void OnLoaded_A016823B4B4E6AA2734A2C872B2A96F6(class UObject* Loaded);
	void SetButtonEnabledState();
	void SetButtonSelectedState(bool Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lobby_CharacterSelection_Entry_C">();
	}
	static class UWB_Lobby_CharacterSelection_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lobby_CharacterSelection_Entry_C>();
	}
};
static_assert(alignof(UWB_Lobby_CharacterSelection_Entry_C) == 0x000010, "Wrong alignment on UWB_Lobby_CharacterSelection_Entry_C");
static_assert(sizeof(UWB_Lobby_CharacterSelection_Entry_C) == 0x000650, "Wrong size on UWB_Lobby_CharacterSelection_Entry_C");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_Lobby_CharacterSelection_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, Button_Base) == 0x0002E8, "Member 'UWB_Lobby_CharacterSelection_Entry_C::Button_Base' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, Image_Background) == 0x0002F0, "Member 'UWB_Lobby_CharacterSelection_Entry_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, Image_CharacterIcon) == 0x0002F8, "Member 'UWB_Lobby_CharacterSelection_Entry_C::Image_CharacterIcon' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, Role_Row_Name) == 0x000300, "Member 'UWB_Lobby_CharacterSelection_Entry_C::Role_Row_Name' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, WB_CharacterSelection) == 0x000308, "Member 'UWB_Lobby_CharacterSelection_Entry_C::WB_CharacterSelection' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, ButtonNotSelectedNormal) == 0x000310, "Member 'UWB_Lobby_CharacterSelection_Entry_C::ButtonNotSelectedNormal' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, ButtonSelectedNormal) == 0x0003E0, "Member 'UWB_Lobby_CharacterSelection_Entry_C::ButtonSelectedNormal' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, ButtonSelectedHovered) == 0x0004B0, "Member 'UWB_Lobby_CharacterSelection_Entry_C::ButtonSelectedHovered' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_CharacterSelection_Entry_C, ButtonNotSelectedHovered) == 0x000580, "Member 'UWB_Lobby_CharacterSelection_Entry_C::ButtonNotSelectedHovered' has a wrong offset!");

}

