#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Lobby.WB_Lobby_C
// 0x00B0 (0x0390 - 0x02E0)
class UWB_Lobby_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTestButtonWI_C*                        Button_CharacterSelect;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Invite;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_PerksSelect;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_PlayerList;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_160;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_189;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_270;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInviteFriendsWI_C*                     InviteFriendsWI;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerName;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_LeaveLobby;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_SwitchTeam;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_ToggleReady;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Lobby_CharacterSelection_C*         WB_CharacterSelection;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Countdown_C*                        WB_Countdown;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Lobby_PerksSelection_C*             WB_Lobby_PerksSelection;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Lobby_PlayerList_C*                 WB_PlayerList;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            CountdownWidget;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowPreviewPawn;                                   // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowExperimentalPIESeamlessTravel;                // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginServerTravel();
	void Bind_on_Ready();
	void BndEvt__WB_Button_LeaveLobby_K2Node_ComponentBoundEvent_29_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_ToggleReady_K2Node_ComponentBoundEvent_30_OnClicked__DelegateSignature();
	void BndEvt__WB_Lobby_Button_Class_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__WB_Lobby_Button_Invite_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature();
	void BndEvt__WB_Lobby_Button_PerksSelect_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BndEvt__WB_Lobby_Button_PlayerList_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__WB_Lobby_WB_Button_LeaveLobby_1_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void CancelCountdown();
	void Construct();
	void ExecuteUbergraph_WB_Lobby(int32 EntryPoint);
	void GetPCLobby(class APlayerControllerJP_Lobby** AsPlayer_Controller_JP_Lobby);
	void HandleReadyAndWaitingChanged(class APlayerStateJP_Lobby* PlayerState, const bool ReadyAndWaiting);
	void OnInitialized();
	void OnStartStateChanged(bool bNewStartingRound);
	void OnYes_LeaveLobby();
	void StartCountdown();
	void SwitchTab(class UWidget* Widget);
	void UpdateLobbyName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Lobby_C">();
	}
	static class UWB_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Lobby_C>();
	}
};
static_assert(alignof(UWB_Lobby_C) == 0x000008, "Wrong alignment on UWB_Lobby_C");
static_assert(sizeof(UWB_Lobby_C) == 0x000390, "Wrong size on UWB_Lobby_C");
static_assert(offsetof(UWB_Lobby_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Button_CharacterSelect) == 0x0002E8, "Member 'UWB_Lobby_C::Button_CharacterSelect' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Button_Invite) == 0x0002F0, "Member 'UWB_Lobby_C::Button_Invite' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Button_PerksSelect) == 0x0002F8, "Member 'UWB_Lobby_C::Button_PerksSelect' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Button_PlayerList) == 0x000300, "Member 'UWB_Lobby_C::Button_PlayerList' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Image_35) == 0x000308, "Member 'UWB_Lobby_C::Image_35' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Image_160) == 0x000310, "Member 'UWB_Lobby_C::Image_160' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Image_189) == 0x000318, "Member 'UWB_Lobby_C::Image_189' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Image_270) == 0x000320, "Member 'UWB_Lobby_C::Image_270' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Image_OnlineStatus) == 0x000328, "Member 'UWB_Lobby_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, InviteFriendsWI) == 0x000330, "Member 'UWB_Lobby_C::InviteFriendsWI' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, Text_ServerName) == 0x000338, "Member 'UWB_Lobby_C::Text_ServerName' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_Button_LeaveLobby) == 0x000340, "Member 'UWB_Lobby_C::WB_Button_LeaveLobby' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_Button_SwitchTeam) == 0x000348, "Member 'UWB_Lobby_C::WB_Button_SwitchTeam' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_Button_ToggleReady) == 0x000350, "Member 'UWB_Lobby_C::WB_Button_ToggleReady' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_CharacterSelection) == 0x000358, "Member 'UWB_Lobby_C::WB_CharacterSelection' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_Countdown) == 0x000360, "Member 'UWB_Lobby_C::WB_Countdown' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_Lobby_PerksSelection) == 0x000368, "Member 'UWB_Lobby_C::WB_Lobby_PerksSelection' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WB_PlayerList) == 0x000370, "Member 'UWB_Lobby_C::WB_PlayerList' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, WidgetSwitcher_Content) == 0x000378, "Member 'UWB_Lobby_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, CountdownWidget) == 0x000380, "Member 'UWB_Lobby_C::CountdownWidget' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, ShowPreviewPawn) == 0x000388, "Member 'UWB_Lobby_C::ShowPreviewPawn' has a wrong offset!");
static_assert(offsetof(UWB_Lobby_C, AllowExperimentalPIESeamlessTravel) == 0x000389, "Member 'UWB_Lobby_C::AllowExperimentalPIESeamlessTravel' has a wrong offset!");

}

