#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MainMenu.WB_MainMenu_C
// 0x0150 (0x0430 - 0x02E0)
class UWB_MainMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BuildVersionText;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_CreateLobby;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_FindLobby;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_QuickPlay;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Quit;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Settings;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_CleanupSessions_Button;                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_FindLANSessions_Button;                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_HostLANSession_Button;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_InitializeUser_Button;                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_LANQuickPlay_Button;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_LoginForOnlinePlay_Button;                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Debug_ResetUserState_Button;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              DebugButtons_ScaleBox;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ApplyAndReset;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Host;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Join;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Leave;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_189;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_273;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingWI_C*                           LoadingWI;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlaceholderWI_C*                       Placeholder_Content;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlaceholderWI_C*                       PlaceholderWI_Button;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Popup04_Frame;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Popup04_TransparentBG;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Title;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_ApplySettings;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_HostMatch;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_JoinViaIP;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_LeaveGame;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Reset;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MainMenu_HostMatch_C*               WB_HostMatch_Content;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MainMenu_ServerBrowser_C*           WB_MainMenu_ServerBrowser_Content;                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MainMenu_Settings_C*                WB_Settings_Content;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_MenuCarousel_C*                     WI_MenuCarousel;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Buttons;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Close;                                             // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebugButtons;                                  // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WB_Button_ApplySettings_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_HostMatch_K2Node_ComponentBoundEvent_115_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_LeaveLobby_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_Reset_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Button_BrowseServers_K2Node_ComponentBoundEvent_13_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Button_Host_K2Node_ComponentBoundEvent_12_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Button_Join_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Button_Quit_K2Node_ComponentBoundEvent_9_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Button_Settings_K2Node_ComponentBoundEvent_8_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_CreateQuickPlaySession_Button_1_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Debug_CustomQuickPlay_Button_K2Node_ComponentBoundEvent_14_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Debug_HostSession_Button_K2Node_ComponentBoundEvent_13_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_FindSessions_Button_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_InitializeUser_Button_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_LoginForOnlinePlay_Button_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_ResetUserState_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void Construct();
	void Debug_OnSearchFinished(bool bSucceeded, const class FText& ErrorMessage);
	void ExecuteUbergraph_WB_MainMenu(int32 EntryPoint);
	struct FSlateBrush Get_Image_OnlineStatus_Brush_0();
	void HandleSearchFinished(bool bSucceeded, const class FText& ErrorMessage);
	void OnYes_LeaveGame();
	void PreConstruct(bool IsDesignTime);
	void QuickPlay();
	void Set_Lower_Button_To_Empty();
	void Should_Quit_();
	void ShowCameraBGAndFlicker();
	void UpdateDebugWidgetVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MainMenu_C">();
	}
	static class UWB_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MainMenu_C>();
	}
};
static_assert(alignof(UWB_MainMenu_C) == 0x000008, "Wrong alignment on UWB_MainMenu_C");
static_assert(sizeof(UWB_MainMenu_C) == 0x000430, "Wrong size on UWB_MainMenu_C");
static_assert(offsetof(UWB_MainMenu_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, BuildVersionText) == 0x0002E8, "Member 'UWB_MainMenu_C::BuildVersionText' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Button_CreateLobby) == 0x0002F0, "Member 'UWB_MainMenu_C::Button_CreateLobby' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Button_FindLobby) == 0x0002F8, "Member 'UWB_MainMenu_C::Button_FindLobby' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Button_QuickPlay) == 0x000300, "Member 'UWB_MainMenu_C::Button_QuickPlay' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Button_Quit) == 0x000308, "Member 'UWB_MainMenu_C::Button_Quit' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Button_Settings) == 0x000310, "Member 'UWB_MainMenu_C::Button_Settings' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_CleanupSessions_Button) == 0x000318, "Member 'UWB_MainMenu_C::Debug_CleanupSessions_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_FindLANSessions_Button) == 0x000320, "Member 'UWB_MainMenu_C::Debug_FindLANSessions_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_HostLANSession_Button) == 0x000328, "Member 'UWB_MainMenu_C::Debug_HostLANSession_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_InitializeUser_Button) == 0x000330, "Member 'UWB_MainMenu_C::Debug_InitializeUser_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_LANQuickPlay_Button) == 0x000338, "Member 'UWB_MainMenu_C::Debug_LANQuickPlay_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_LoginForOnlinePlay_Button) == 0x000340, "Member 'UWB_MainMenu_C::Debug_LoginForOnlinePlay_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Debug_ResetUserState_Button) == 0x000348, "Member 'UWB_MainMenu_C::Debug_ResetUserState_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, DebugButtons_ScaleBox) == 0x000350, "Member 'UWB_MainMenu_C::DebugButtons_ScaleBox' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, HorizontalBox_ApplyAndReset) == 0x000358, "Member 'UWB_MainMenu_C::HorizontalBox_ApplyAndReset' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, HorizontalBox_Host) == 0x000360, "Member 'UWB_MainMenu_C::HorizontalBox_Host' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, HorizontalBox_Join) == 0x000368, "Member 'UWB_MainMenu_C::HorizontalBox_Join' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, HorizontalBox_Leave) == 0x000370, "Member 'UWB_MainMenu_C::HorizontalBox_Leave' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Image_35) == 0x000378, "Member 'UWB_MainMenu_C::Image_35' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Image_189) == 0x000380, "Member 'UWB_MainMenu_C::Image_189' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Image_273) == 0x000388, "Member 'UWB_MainMenu_C::Image_273' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Image_OnlineStatus) == 0x000390, "Member 'UWB_MainMenu_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, LoadingWI) == 0x000398, "Member 'UWB_MainMenu_C::LoadingWI' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Placeholder_Content) == 0x0003A0, "Member 'UWB_MainMenu_C::Placeholder_Content' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, PlaceholderWI_Button) == 0x0003A8, "Member 'UWB_MainMenu_C::PlaceholderWI_Button' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Popup04_Frame) == 0x0003B0, "Member 'UWB_MainMenu_C::Popup04_Frame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Popup04_TransparentBG) == 0x0003B8, "Member 'UWB_MainMenu_C::Popup04_TransparentBG' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, TextBlock_Message) == 0x0003C0, "Member 'UWB_MainMenu_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, TextBlock_Title) == 0x0003C8, "Member 'UWB_MainMenu_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Button_ApplySettings) == 0x0003D0, "Member 'UWB_MainMenu_C::WB_Button_ApplySettings' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Button_HostMatch) == 0x0003D8, "Member 'UWB_MainMenu_C::WB_Button_HostMatch' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Button_JoinViaIP) == 0x0003E0, "Member 'UWB_MainMenu_C::WB_Button_JoinViaIP' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Button_LeaveGame) == 0x0003E8, "Member 'UWB_MainMenu_C::WB_Button_LeaveGame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Button_Reset) == 0x0003F0, "Member 'UWB_MainMenu_C::WB_Button_Reset' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_HostMatch_Content) == 0x0003F8, "Member 'UWB_MainMenu_C::WB_HostMatch_Content' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_MainMenu_ServerBrowser_Content) == 0x000400, "Member 'UWB_MainMenu_C::WB_MainMenu_ServerBrowser_Content' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WB_Settings_Content) == 0x000408, "Member 'UWB_MainMenu_C::WB_Settings_Content' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WI_MenuCarousel) == 0x000410, "Member 'UWB_MainMenu_C::WI_MenuCarousel' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WidgetSwitcher_Buttons) == 0x000418, "Member 'UWB_MainMenu_C::WidgetSwitcher_Buttons' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, WidgetSwitcher_Content) == 0x000420, "Member 'UWB_MainMenu_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, Close) == 0x000428, "Member 'UWB_MainMenu_C::Close' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_C, ShowDebugButtons) == 0x000429, "Member 'UWB_MainMenu_C::ShowDebugButtons' has a wrong offset!");

}

