#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu_ServerBrowser_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_MainMenu_ServerBrowser_Entry.WB_MainMenu_ServerBrowser_Entry_C.ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry
// 0x02C0 (0x02C0 - 0x0000)
struct WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInNeighbourhoodFromSession_Success;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0010)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0058(0x0010)()
	int32                                         Temp_int_Variable_1;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x0070(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0080(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x0090(0x0010)()
	int32                                         CallFunc_GetNumOpenPublicConnections_ReturnValue;  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPublicConnections_ReturnValue;      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0010)()
	int32                                         CallFunc_GetNumOpenPublicConnections_ReturnValue_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLobbyNameFromSession_Success;          // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLobbyNameFromSession_ReturnValue;      // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0010)()
	bool                                          CallFunc_GetIsInLobbyFromSession_Success;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInLobbyFromSession_ReturnValue;      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInNeighbourhoodFromSession_Success_1; // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue_1; // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetPingInMs_ReturnValue;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0218(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0230(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0240(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0288(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0298(0x0010)()
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x02B0(0x0010)()
};
static_assert(alignof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry) == 0x000008, "Wrong alignment on WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry");
static_assert(sizeof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry) == 0x0002C0, "Wrong size on WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, EntryPoint) == 0x000000, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_int_Variable) == 0x000004, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInNeighbourhoodFromSession_Success) == 0x000008, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInNeighbourhoodFromSession_Success' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue) == 0x000009, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable) == 0x000010, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_1) == 0x000028, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_2) == 0x000038, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_3) == 0x000048, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_4) == 0x000058, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_int_Variable_1) == 0x000068, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_5) == 0x000070, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_6) == 0x000080, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, Temp_text_Variable_7) == 0x000090, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetNumOpenPublicConnections_ReturnValue) == 0x0000A0, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetNumOpenPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetMaxPublicConnections_ReturnValue) == 0x0000A4, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetMaxPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000A8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000100, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeArray_Array) == 0x000150, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_Event_IsDesignTime) == 0x000160, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Format_ReturnValue) == 0x000168, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetNumOpenPublicConnections_ReturnValue_1) == 0x000178, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetNumOpenPublicConnections_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Greater_IntInt_ReturnValue) == 0x00017C, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetLobbyNameFromSession_Success) == 0x00017D, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetLobbyNameFromSession_Success' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetLobbyNameFromSession_ReturnValue) == 0x000180, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetLobbyNameFromSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInLobbyFromSession_Success) == 0x0001A8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInLobbyFromSession_Success' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInLobbyFromSession_ReturnValue) == 0x0001A9, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInLobbyFromSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_BooleanAND_ReturnValue_1) == 0x0001AA, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInNeighbourhoodFromSession_Success_1) == 0x0001AB, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInNeighbourhoodFromSession_Success_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue_1) == 0x0001AC, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetIsInNeighbourhoodFromSession_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_BooleanAND_ReturnValue_2) == 0x0001AD, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_RandomInteger_ReturnValue) == 0x0001B0, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_Select_Default) == 0x0001B8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001C8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_GetPingInMs_ReturnValue) == 0x000210, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_GetPingInMs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeArray_Array_1) == 0x000218, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000228, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Format_ReturnValue_1) == 0x000230, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeStruct_FormatArgumentData_3) == 0x000240, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_MakeArray_Array_2) == 0x000288, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_Format_ReturnValue_2) == 0x000298, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, CallFunc_RandomInteger_ReturnValue_1) == 0x0002A8, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry, K2Node_Select_Default_1) == 0x0002B0, "Member 'WB_MainMenu_ServerBrowser_Entry_C_ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry::K2Node_Select_Default_1' has a wrong offset!");

// Function WB_MainMenu_ServerBrowser_Entry.WB_MainMenu_ServerBrowser_Entry_C.OnJoinClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature final
{
public:
	class UWB_MainMenu_ServerBrowser_Entry_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature) == 0x000008, "Wrong alignment on WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature");
static_assert(sizeof(WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature) == 0x000008, "Wrong size on WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature, Widget) == 0x000000, "Member 'WB_MainMenu_ServerBrowser_Entry_C_OnJoinClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WB_MainMenu_ServerBrowser_Entry.WB_MainMenu_ServerBrowser_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_MainMenu_ServerBrowser_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_ServerBrowser_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on WB_MainMenu_ServerBrowser_Entry_C_PreConstruct");
static_assert(sizeof(WB_MainMenu_ServerBrowser_Entry_C_PreConstruct) == 0x000001, "Wrong size on WB_MainMenu_ServerBrowser_Entry_C_PreConstruct");
static_assert(offsetof(WB_MainMenu_ServerBrowser_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_MainMenu_ServerBrowser_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

