#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu_ServerBrowser_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MainMenu_ServerBrowser_Entry.WB_MainMenu_ServerBrowser_Entry_C
// 0x0050 (0x0330 - 0x02E0)
class UWB_MainMenu_ServerBrowser_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_Button_C*                           Button_Join;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LobbyName;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LobbyState;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Ping;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerCount;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            SessionResult;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnJoinClicked;                                     // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WB_MainMenu_ServerBrowser_Entry_Button_Join_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WB_MainMenu_ServerBrowser_Entry(int32 EntryPoint);
	void OnJoinClicked__DelegateSignature(class UWB_MainMenu_ServerBrowser_Entry_C* Widget);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MainMenu_ServerBrowser_Entry_C">();
	}
	static class UWB_MainMenu_ServerBrowser_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MainMenu_ServerBrowser_Entry_C>();
	}
};
static_assert(alignof(UWB_MainMenu_ServerBrowser_Entry_C) == 0x000008, "Wrong alignment on UWB_MainMenu_ServerBrowser_Entry_C");
static_assert(sizeof(UWB_MainMenu_ServerBrowser_Entry_C) == 0x000330, "Wrong size on UWB_MainMenu_ServerBrowser_Entry_C");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, Button_Join) == 0x0002E8, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::Button_Join' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, SafeZone_1) == 0x0002F0, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, TextBlock_LobbyName) == 0x0002F8, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::TextBlock_LobbyName' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, TextBlock_LobbyState) == 0x000300, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::TextBlock_LobbyState' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, TextBlock_Ping) == 0x000308, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::TextBlock_Ping' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, TextBlock_PlayerCount) == 0x000310, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::TextBlock_PlayerCount' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, SessionResult) == 0x000318, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::SessionResult' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_ServerBrowser_Entry_C, OnJoinClicked) == 0x000320, "Member 'UWB_MainMenu_ServerBrowser_Entry_C::OnJoinClicked' has a wrong offset!");

}

