#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu_Settings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MainMenu_Settings.WB_MainMenu_Settings_C
// 0x0158 (0x0438 - 0x02E0)
class UWB_MainMenu_Settings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BTN_TwitchLogin;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Audio;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Controls;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Game;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Graphics;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_Vsync;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebindKeyEntryWI_C*                    RebindKeyEntryWI;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebindKeyEntryWI_C*                    RebindKeyEntryWI_1;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebindKeyEntryWI_C*                    RebindKeyEntryWI_2;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebindKeyEntryWI_C*                    RebindKeyEntryWI_3;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebindKeyEntryWI_C*                    RebindKeyEntryWI_4;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           RunPerformanceBenchmarkButton;                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Audio;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Controls;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Game;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Graphics;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_79;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_MouseSens_Value;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TwitchUsername;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Audio;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxControls;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_FSR;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_FullscreenMode;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_Language;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_Main;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_Music;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_Resolution;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_SFX;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_TextureQuality_1;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_UI;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Settings;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bGraphicSettingsDirty;                             // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SettingsChanged;                                   // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USavedSettings_C*                       SavedSettings;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class URebindKeyEntryWI_C*>            ControlWidgets;                                    // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWB_DialogBox_C*                        DialogConfirm;                                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        OldSensitivityValue;                               // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   NeighbourhoodBenchmarkGameMode;                    // 0x0410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ApplySettings();
	void BndEvt__CheckBox_Vsync_K2Node_ComponentBoundEvent_1196_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__WB_HCB_FullscreenMode_K2Node_ComponentBoundEvent_60_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_Main_K2Node_ComponentBoundEvent_923_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_Music_K2Node_ComponentBoundEvent_898_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_Resolution_K2Node_ComponentBoundEvent_59_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_SFX_K2Node_ComponentBoundEvent_910_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_UI_K2Node_ComponentBoundEvent_887_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_MainMenu_Settings_Button_98_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Button_Audio_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Button_Controls_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Button_Game_K2Node_ComponentBoundEvent_8_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Button_Graphics_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_RunPerformanceBenchmarkButton_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Slider_79_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_Slider_79_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WB_MainMenu_Settings_Slider_79_K2Node_ComponentBoundEvent_7_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__WB_MainMenu_Settings_WB_HCB_FSR_K2Node_ComponentBoundEvent_9_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_MainMenu_Settings_WB_HCB_Language_K2Node_ComponentBoundEvent_6_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_MainMenu_Settings_WB_HCB_TextureQuality_1_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void Confirm_Set_Defaults();
	void Construct();
	void DefaultGraphicsComboBoxToHigh(class UWB_HorizontalComboBox_C* ComboBox);
	void ExecuteUbergraph_WB_MainMenu_Settings(int32 EntryPoint);
	void FillResolutionCB();
	void HideStartBenchmarkButtonIfCurrentMapIsNeighbourhood();
	void LoadAndSetAudioSettings();
	void LoadOrCreateTheSavedSettings();
	void OnLeftButtonClicked();
	void OnLoaded_256FAC19447A4F0F7CB33B93229A46F7(TSubclassOf<class UObject> Loaded);
	void OnRightButtonClicked();
	void Request_Settings_To_Default();
	void ResetVideoMode();
	void SetAudioSettingsInSaveFile();
	void SetAudioSettingsToDefault();
	void SetFullscreenSetting(class FName Setting);
	void SetKeyBindingsAndMouseSensToDefault();
	void SetLocalization(class FName InName);
	void SetMouseSensInSaveFile();
	void SetMouseSensitivityToDefault();
	void SetResolutionSetting(class FName ResolutionKey);
	void SetSelectedFSROption();
	void SetVolumeFromSetting(class USoundClass* SoundClass, class FName Setting);
	void TwitchAuthenticated();
	void UpdataOverallSettings();
	void Update_Mouse_Sensitivity_On_Controller(double Value);
	void UpdateFullscreenSetting();
	void UpdateLocalization();
	void UpdateMixAndSetComboBox(double AmountSaved, class UWB_HorizontalComboBox_C* ComboBox, class USoundClass* SoundMixClass);
	void UpdateMouseSens();
	void UpdateMouseSensText(double InFloat);
	void UpdateResolutionSetting();
	void UpdateSettings();
	void UpdateVsyncSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MainMenu_Settings_C">();
	}
	static class UWB_MainMenu_Settings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MainMenu_Settings_C>();
	}
};
static_assert(alignof(UWB_MainMenu_Settings_C) == 0x000008, "Wrong alignment on UWB_MainMenu_Settings_C");
static_assert(sizeof(UWB_MainMenu_Settings_C) == 0x000438, "Wrong size on UWB_MainMenu_Settings_C");
static_assert(offsetof(UWB_MainMenu_Settings_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_MainMenu_Settings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, BTN_TwitchLogin) == 0x0002E8, "Member 'UWB_MainMenu_Settings_C::BTN_TwitchLogin' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Button_Audio) == 0x0002F0, "Member 'UWB_MainMenu_Settings_C::Button_Audio' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Button_Controls) == 0x0002F8, "Member 'UWB_MainMenu_Settings_C::Button_Controls' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Button_Game) == 0x000300, "Member 'UWB_MainMenu_Settings_C::Button_Game' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Button_Graphics) == 0x000308, "Member 'UWB_MainMenu_Settings_C::Button_Graphics' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, CheckBox_Vsync) == 0x000310, "Member 'UWB_MainMenu_Settings_C::CheckBox_Vsync' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RebindKeyEntryWI) == 0x000318, "Member 'UWB_MainMenu_Settings_C::RebindKeyEntryWI' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RebindKeyEntryWI_1) == 0x000320, "Member 'UWB_MainMenu_Settings_C::RebindKeyEntryWI_1' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RebindKeyEntryWI_2) == 0x000328, "Member 'UWB_MainMenu_Settings_C::RebindKeyEntryWI_2' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RebindKeyEntryWI_3) == 0x000330, "Member 'UWB_MainMenu_Settings_C::RebindKeyEntryWI_3' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RebindKeyEntryWI_4) == 0x000338, "Member 'UWB_MainMenu_Settings_C::RebindKeyEntryWI_4' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, RunPerformanceBenchmarkButton) == 0x000340, "Member 'UWB_MainMenu_Settings_C::RunPerformanceBenchmarkButton' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, ScrollBox_Audio) == 0x000348, "Member 'UWB_MainMenu_Settings_C::ScrollBox_Audio' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, ScrollBox_Controls) == 0x000350, "Member 'UWB_MainMenu_Settings_C::ScrollBox_Controls' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, ScrollBox_Game) == 0x000358, "Member 'UWB_MainMenu_Settings_C::ScrollBox_Game' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, ScrollBox_Graphics) == 0x000360, "Member 'UWB_MainMenu_Settings_C::ScrollBox_Graphics' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Slider_79) == 0x000368, "Member 'UWB_MainMenu_Settings_C::Slider_79' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, Text_MouseSens_Value) == 0x000370, "Member 'UWB_MainMenu_Settings_C::Text_MouseSens_Value' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, TwitchUsername) == 0x000378, "Member 'UWB_MainMenu_Settings_C::TwitchUsername' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, VerticalBox_Audio) == 0x000380, "Member 'UWB_MainMenu_Settings_C::VerticalBox_Audio' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, VerticalBoxControls) == 0x000388, "Member 'UWB_MainMenu_Settings_C::VerticalBoxControls' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_FSR) == 0x000390, "Member 'UWB_MainMenu_Settings_C::WB_HCB_FSR' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_FullscreenMode) == 0x000398, "Member 'UWB_MainMenu_Settings_C::WB_HCB_FullscreenMode' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_Language) == 0x0003A0, "Member 'UWB_MainMenu_Settings_C::WB_HCB_Language' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_Main) == 0x0003A8, "Member 'UWB_MainMenu_Settings_C::WB_HCB_Main' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_Music) == 0x0003B0, "Member 'UWB_MainMenu_Settings_C::WB_HCB_Music' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_Resolution) == 0x0003B8, "Member 'UWB_MainMenu_Settings_C::WB_HCB_Resolution' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_SFX) == 0x0003C0, "Member 'UWB_MainMenu_Settings_C::WB_HCB_SFX' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_TextureQuality_1) == 0x0003C8, "Member 'UWB_MainMenu_Settings_C::WB_HCB_TextureQuality_1' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WB_HCB_UI) == 0x0003D0, "Member 'UWB_MainMenu_Settings_C::WB_HCB_UI' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, WidgetSwitcher_Settings) == 0x0003D8, "Member 'UWB_MainMenu_Settings_C::WidgetSwitcher_Settings' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, bGraphicSettingsDirty) == 0x0003E0, "Member 'UWB_MainMenu_Settings_C::bGraphicSettingsDirty' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, SettingsChanged) == 0x0003E1, "Member 'UWB_MainMenu_Settings_C::SettingsChanged' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, SavedSettings) == 0x0003E8, "Member 'UWB_MainMenu_Settings_C::SavedSettings' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, ControlWidgets) == 0x0003F0, "Member 'UWB_MainMenu_Settings_C::ControlWidgets' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, DialogConfirm) == 0x000400, "Member 'UWB_MainMenu_Settings_C::DialogConfirm' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, OldSensitivityValue) == 0x000408, "Member 'UWB_MainMenu_Settings_C::OldSensitivityValue' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_C, NeighbourhoodBenchmarkGameMode) == 0x000410, "Member 'UWB_MainMenu_Settings_C::NeighbourhoodBenchmarkGameMode' has a wrong offset!");

}

