#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu_Settings_Session

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C.BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature final
{
public:
	class FName                                   NewSelection;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature::NewSelection' has a wrong offset!");

// Function WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C.BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature final
{
public:
	class FName                                   NewSelection;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature, NewSelection) == 0x000000, "Member 'WB_MainMenu_Settings_Session_C_BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature::NewSelection' has a wrong offset!");

// Function WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C.BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WB_MainMenu_Settings_Session_C_BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C.ExecuteUbergraph_WB_MainMenu_Settings_Session
// 0x00F0 (0x00F0 - 0x0000)
struct WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_1;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_2;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedOption_Option;                 // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_NewSelection_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_3;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0090(0x0010)(ConstParm)
	class FString                                 CallFunc_TruncateString_String;                    // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TruncateString_Truncated;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_NewSelection;           // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0010)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectedOption_Option_1;               // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session) == 0x000008, "Wrong alignment on WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session");
static_assert(sizeof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session) == 0x0000F0, "Wrong size on WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, EntryPoint) == 0x000000, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetGameInstance_ReturnValue_1) == 0x000010, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_AsBP_GI) == 0x000018, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_AsBP_GI_1) == 0x000028, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_AsBP_GI_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetGameInstance_ReturnValue_2) == 0x000038, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_AsBP_GI_2) == 0x000040, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_AsBP_GI_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetSelectedOption_Option) == 0x00004C, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetSelectedOption_Option' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_Conv_NameToString_ReturnValue) == 0x000058, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_Conv_StringToInt_ReturnValue) == 0x000068, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetGameInstance_ReturnValue_3) == 0x000070, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_ComponentBoundEvent_NewSelection_1) == 0x000078, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_ComponentBoundEvent_NewSelection_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_AsBP_GI_3) == 0x000080, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_AsBP_GI_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000089, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_ComponentBoundEvent_Text) == 0x000090, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_TruncateString_String) == 0x0000A0, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_TruncateString_String' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_TruncateString_Truncated) == 0x0000B0, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_TruncateString_Truncated' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, K2Node_ComponentBoundEvent_NewSelection) == 0x0000B4, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::K2Node_ComponentBoundEvent_NewSelection' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000C0, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x0000E0, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_GetSelectedOption_Option_1) == 0x0000E4, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_GetSelectedOption_Option_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000EC, "Member 'WB_MainMenu_Settings_Session_C_ExecuteUbergraph_WB_MainMenu_Settings_Session::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C.TruncateString
// 0x0058 (0x0058 - 0x0000)
struct WB_MainMenu_Settings_Session_C_TruncateString final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MaxLength;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Truncated;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_Settings_Session_C_TruncateString) == 0x000008, "Wrong alignment on WB_MainMenu_Settings_Session_C_TruncateString");
static_assert(sizeof(WB_MainMenu_Settings_Session_C_TruncateString) == 0x000058, "Wrong size on WB_MainMenu_Settings_Session_C_TruncateString");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, InText) == 0x000000, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::InText' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, MaxLength) == 0x000010, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::MaxLength' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, String) == 0x000018, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::String' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, Truncated) == 0x000028, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::Truncated' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, CallFunc_Len_ReturnValue) == 0x000040, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_Settings_Session_C_TruncateString, CallFunc_GetSubstring_ReturnValue) == 0x000048, "Member 'WB_MainMenu_Settings_Session_C_TruncateString::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");

}

