#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_MainMenu.WB_MainMenu_C.Debug_OnSearchFinished
// 0x0018 (0x0018 - 0x0000)
struct WB_MainMenu_C_Debug_OnSearchFinished final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMessage;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_MainMenu_C_Debug_OnSearchFinished) == 0x000008, "Wrong alignment on WB_MainMenu_C_Debug_OnSearchFinished");
static_assert(sizeof(WB_MainMenu_C_Debug_OnSearchFinished) == 0x000018, "Wrong size on WB_MainMenu_C_Debug_OnSearchFinished");
static_assert(offsetof(WB_MainMenu_C_Debug_OnSearchFinished, bSucceeded) == 0x000000, "Member 'WB_MainMenu_C_Debug_OnSearchFinished::bSucceeded' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_Debug_OnSearchFinished, ErrorMessage) == 0x000008, "Member 'WB_MainMenu_C_Debug_OnSearchFinished::ErrorMessage' has a wrong offset!");

// Function WB_MainMenu.WB_MainMenu_C.ExecuteUbergraph_WB_MainMenu
// 0x04A8 (0x04A8 - 0x0000)
struct WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0040(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectVersion_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_1;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_2;                      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_3;                      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_4;                      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_5;                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSucceeded, class FText ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSucceeded_1;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ErrorMessage_1;                 // 0x0110(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	class UCommonSession_SearchSessionRequest*    CallFunc_CreateOnlineSearchSessionRequest_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            CallFunc_SelectBestAvailableSession_BestAvailableSession; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDescription_ReturnValue;               // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01C8(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0228(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0290(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02A0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_6;                      // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSucceeded;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ErrorMessage;                   // 0x0338(0x0010)()
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI_7;                      // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers_1; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWB_DialogBox_C*                        CallFunc_Create_ReturnValue;                       // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchSessionRequest*    CallFunc_CreateOnlineSearchSessionRequest_ReturnValue_1; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0398(0x0048)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03F8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBuildConfiguration_ReturnValue;        // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            CallFunc_Array_Get_Item;                           // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Dump_Session_Search_Result_To_String_SessionDebugString; // 0x0440(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool bSucceeded, class FText ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0450(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProjectSettingsJP*                     CallFunc_GetProjectSettings_ReturnValue;           // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProjectSettingsJP*                     CallFunc_GetProjectSettings_ReturnValue_1;         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue; // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Host_Request_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue_1; // 0x0490(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Host_Request_ReturnValue_1;        // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu) == 0x000008, "Wrong alignment on WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu");
static_assert(sizeof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu) == 0x0004A8, "Wrong size on WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, EntryPoint) == 0x000000, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI) == 0x000020, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x000040, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetProjectVersion_ReturnValue) == 0x000058, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetProjectVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x000078, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_1) == 0x000080, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000A0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_2) == 0x0000A8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_3) == 0x0000B8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_4) == 0x0000C0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_3) == 0x0000C8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_4) == 0x0000D8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_4) == 0x0000E0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_5) == 0x0000E8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_5) == 0x0000F0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_5) == 0x0000F8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000FC, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CustomEvent_bSucceeded_1) == 0x00010C, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CustomEvent_bSucceeded_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CustomEvent_ErrorMessage_1) == 0x000110, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CustomEvent_ErrorMessage_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000120, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeArray_Array) == 0x000168, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000178, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Format_ReturnValue) == 0x000180, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_CreateOnlineSearchSessionRequest_ReturnValue) == 0x000190, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_CreateOnlineSearchSessionRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000198, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_SelectBestAvailableSession_BestAvailableSession) == 0x0001A8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_SelectBestAvailableSession_BestAvailableSession' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetDescription_ReturnValue) == 0x0001B0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x0001C0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001C8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001D8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeStruct_FormatArgumentData_2) == 0x000228, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeArray_Array_1) == 0x000270, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeArray_Array_2) == 0x000280, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Format_ReturnValue_1) == 0x000290, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Format_ReturnValue_2) == 0x0002A0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0002B0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0002C0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0002D0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0002D8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002E0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0002E8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002F0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_6) == 0x0002F8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_6) == 0x000300, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_6' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_6) == 0x000308, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000310, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers) == 0x000318, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue_3) == 0x000320, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstance_ReturnValue_7) == 0x000328, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CustomEvent_bSucceeded) == 0x000330, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CustomEvent_bSucceeded' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CustomEvent_ErrorMessage) == 0x000338, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_AsBP_GI_7) == 0x000348, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_AsBP_GI_7' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_DynamicCast_bSuccess_7) == 0x000350, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers_1) == 0x000354, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue_4) == 0x000358, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000360, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000368, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Create_ReturnValue) == 0x000370, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_CreateOnlineSearchSessionRequest_ReturnValue_1) == 0x000378, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_CreateOnlineSearchSessionRequest_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Array_Length_ReturnValue_1) == 0x000380, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Array_Length_ReturnValue_2) == 0x000384, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000388, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000390, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeStruct_FormatArgumentData_3) == 0x000398, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPlayerController_ReturnValue_5) == 0x0003E0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_MakeArray_Array_3) == 0x0003E8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Format_ReturnValue_3) == 0x0003F8, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000408, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, Temp_int_Array_Index_Variable) == 0x000418, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetBuildConfiguration_ReturnValue) == 0x000420, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetBuildConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Array_Get_Item) == 0x000430, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000438, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Dump_Session_Search_Result_To_String_SessionDebugString) == 0x000440, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Dump_Session_Search_Result_To_String_SessionDebugString' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000450, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000460, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetProjectSettings_ReturnValue) == 0x000468, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetProjectSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetProjectSettings_ReturnValue_1) == 0x000470, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetProjectSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue) == 0x000478, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Create_Host_Request_ReturnValue) == 0x000488, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Create_Host_Request_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue_1) == 0x000490, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu, CallFunc_Create_Host_Request_ReturnValue_1) == 0x0004A0, "Member 'WB_MainMenu_C_ExecuteUbergraph_WB_MainMenu::CallFunc_Create_Host_Request_ReturnValue_1' has a wrong offset!");

// Function WB_MainMenu.WB_MainMenu_C.Get_Image_OnlineStatus_Brush_0
// 0x00D0 (0x00D0 - 0x0000)
struct WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0) == 0x000010, "Wrong alignment on WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0");
static_assert(sizeof(WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0) == 0x0000D0, "Wrong size on WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0");
static_assert(offsetof(WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0, ReturnValue) == 0x000000, "Member 'WB_MainMenu_C_Get_Image_OnlineStatus_Brush_0::ReturnValue' has a wrong offset!");

// Function WB_MainMenu.WB_MainMenu_C.HandleSearchFinished
// 0x0018 (0x0018 - 0x0000)
struct WB_MainMenu_C_HandleSearchFinished final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMessage;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_MainMenu_C_HandleSearchFinished) == 0x000008, "Wrong alignment on WB_MainMenu_C_HandleSearchFinished");
static_assert(sizeof(WB_MainMenu_C_HandleSearchFinished) == 0x000018, "Wrong size on WB_MainMenu_C_HandleSearchFinished");
static_assert(offsetof(WB_MainMenu_C_HandleSearchFinished, bSucceeded) == 0x000000, "Member 'WB_MainMenu_C_HandleSearchFinished::bSucceeded' has a wrong offset!");
static_assert(offsetof(WB_MainMenu_C_HandleSearchFinished, ErrorMessage) == 0x000008, "Member 'WB_MainMenu_C_HandleSearchFinished::ErrorMessage' has a wrong offset!");

// Function WB_MainMenu.WB_MainMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_MainMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MainMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WB_MainMenu_C_PreConstruct");
static_assert(sizeof(WB_MainMenu_C_PreConstruct) == 0x000001, "Wrong size on WB_MainMenu_C_PreConstruct");
static_assert(offsetof(WB_MainMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_MainMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

