#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_AmmoCollected

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_AmmoCollected.WI_AmmoCollected_C.ExecuteUbergraph_WI_AmmoCollected
// 0x00E0 (0x00E0 - 0x0000)
struct WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
};
static_assert(alignof(WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected) == 0x000010, "Wrong alignment on WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected");
static_assert(sizeof(WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected) == 0x0000E0, "Wrong size on WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected");
static_assert(offsetof(WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected, EntryPoint) == 0x000000, "Member 'WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WI_AmmoCollected_C_ExecuteUbergraph_WI_AmmoCollected::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

}

