#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_AbilityBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WI_AbilityBar.WI_AbilityBar_C.CheckExistingAbilities
// 0x00F8 (0x00F8 - 0x0000)
struct WI_AbilityBar_C_CheckExistingAbilities final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FGameplayAbilitySpecHandle>     CallFunc_GetAllAbilities_OutAbilityHandles;        // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue; // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0048)(HasGetValueTypeHash)
	class UGameplayAbilityIW*                     K2Node_DynamicCast_AsGameplay_Ability_IW;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_CheckExistingAbilities) == 0x000008, "Wrong alignment on WI_AbilityBar_C_CheckExistingAbilities");
static_assert(sizeof(WI_AbilityBar_C_CheckExistingAbilities) == 0x0000F8, "Wrong size on WI_AbilityBar_C_CheckExistingAbilities");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_AbilityBar_C_CheckExistingAbilities::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_AbilityBar_C_CheckExistingAbilities::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Get_ClassLog_Name_name) == 0x000010, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Get_ClassLog_Name_name_1) == 0x000020, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_GetAllAbilities_OutAbilityHandles) == 0x000030, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_GetAllAbilities_OutAbilityHandles' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Array_Get_Item) == 0x000044, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance) == 0x000050, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue) == 0x000058, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WI_AbilityBar_C_CheckExistingAbilities::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, K2Node_DynamicCast_AsGameplay_Ability_IW) == 0x0000A8, "Member 'WI_AbilityBar_C_CheckExistingAbilities::K2Node_DynamicCast_AsGameplay_Ability_IW' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WI_AbilityBar_C_CheckExistingAbilities::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WI_AbilityBar_C_CheckExistingAbilities::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E0, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_CheckExistingAbilities, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'WI_AbilityBar_C_CheckExistingAbilities::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_AbilityBar.WI_AbilityBar_C.ExecuteUbergraph_WI_AbilityBar
// 0x0040 (0x0040 - 0x0000)
struct WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar) == 0x000008, "Wrong alignment on WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar");
static_assert(sizeof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar) == 0x000040, "Wrong size on WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, EntryPoint) == 0x000000, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WI_AbilityBar_C_ExecuteUbergraph_WI_AbilityBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_AbilityBar.WI_AbilityBar_C.HandleAbilityGranted
// 0x0038 (0x0038 - 0x0000)
struct WI_AbilityBar_C_HandleAbilityGranted final
{
public:
	const class UAbilitySystemComponentJP*        AbilitySystemComponent_0;                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             AbilitySpecHandle;                                 // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue; // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameplayAbilityIW*                     K2Node_DynamicCast_AsGameplay_Ability_IW;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_HandleAbilityGranted) == 0x000008, "Wrong alignment on WI_AbilityBar_C_HandleAbilityGranted");
static_assert(sizeof(WI_AbilityBar_C_HandleAbilityGranted) == 0x000038, "Wrong size on WI_AbilityBar_C_HandleAbilityGranted");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, AbilitySystemComponent_0) == 0x000000, "Member 'WI_AbilityBar_C_HandleAbilityGranted::AbilitySystemComponent_0' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, AbilitySpecHandle) == 0x000008, "Member 'WI_AbilityBar_C_HandleAbilityGranted::AbilitySpecHandle' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance) == 0x00000C, "Member 'WI_AbilityBar_C_HandleAbilityGranted::CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue) == 0x000010, "Member 'WI_AbilityBar_C_HandleAbilityGranted::CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, CallFunc_Get_ClassLog_Name_name) == 0x000018, "Member 'WI_AbilityBar_C_HandleAbilityGranted::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, K2Node_DynamicCast_AsGameplay_Ability_IW) == 0x000028, "Member 'WI_AbilityBar_C_HandleAbilityGranted::K2Node_DynamicCast_AsGameplay_Ability_IW' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandleAbilityGranted, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_AbilityBar_C_HandleAbilityGranted::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_AbilityBar.WI_AbilityBar_C.HandlePosessedPawnChanged
// 0x0110 (0x0110 - 0x0000)
struct WI_AbilityBar_C_HandlePosessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0010(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_HandlePosessedPawnChanged) == 0x000008, "Wrong alignment on WI_AbilityBar_C_HandlePosessedPawnChanged");
static_assert(sizeof(WI_AbilityBar_C_HandlePosessedPawnChanged) == 0x000110, "Wrong size on WI_AbilityBar_C_HandlePosessedPawnChanged");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, OldPawn) == 0x000000, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::OldPawn' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, NewPawn) == 0x000008, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::NewPawn' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000010, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000078, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_Get_ClassLog_Name_name) == 0x0000F0, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_HandlePosessedPawnChanged, CallFunc_Conv_TextToString_ReturnValue) == 0x000100, "Member 'WI_AbilityBar_C_HandlePosessedPawnChanged::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WI_AbilityBar.WI_AbilityBar_C.SetAbilitySystemComponent
// 0x0020 (0x0020 - 0x0000)
struct WI_AbilityBar_C_SetAbilitySystemComponent final
{
public:
	class UAbilitySystemComponentJP*              NewAbilitySystemComponent;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAbilitySystemComponentJP* AbilitySystemComponent, struct FGameplayAbilitySpecHandle& AbilitySpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_SetAbilitySystemComponent) == 0x000008, "Wrong alignment on WI_AbilityBar_C_SetAbilitySystemComponent");
static_assert(sizeof(WI_AbilityBar_C_SetAbilitySystemComponent) == 0x000020, "Wrong size on WI_AbilityBar_C_SetAbilitySystemComponent");
static_assert(offsetof(WI_AbilityBar_C_SetAbilitySystemComponent, NewAbilitySystemComponent) == 0x000000, "Member 'WI_AbilityBar_C_SetAbilitySystemComponent::NewAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_SetAbilitySystemComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WI_AbilityBar_C_SetAbilitySystemComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_SetAbilitySystemComponent, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WI_AbilityBar_C_SetAbilitySystemComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_SetAbilitySystemComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WI_AbilityBar_C_SetAbilitySystemComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WI_AbilityBar.WI_AbilityBar_C.Spawn Widgets
// 0x0260 (0x0260 - 0x0000)
struct WI_AbilityBar_C_Spawn_Widgets final
{
public:
	class UGameplayAbilityIW*                     TargetAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0010)()
	TScriptInterface<class INeighborSpecialAbilityWidgetProvider> K2Node_DynamicCast_AsNeighbor_Special_Ability_Widget_Provider; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<TSubclassOf<class UUserWidget>>        CallFunc_GetWidgetTypes_ReturnValue;               // 0x0078(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0140(0x0010)()
	TScriptInterface<class INeighborSpecialAbilityWidget> K2Node_DynamicCast_AsNeighbor_Special_Ability_Widget; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0200(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_2;                 // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AbilityBar_C_Spawn_Widgets) == 0x000008, "Wrong alignment on WI_AbilityBar_C_Spawn_Widgets");
static_assert(sizeof(WI_AbilityBar_C_Spawn_Widgets) == 0x000260, "Wrong size on WI_AbilityBar_C_Spawn_Widgets");
static_assert(offsetof(WI_AbilityBar_C_Spawn_Widgets, TargetAbility) == 0x000000, "Member 'WI_AbilityBar_C_Spawn_Widgets::TargetAbility' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_Spawn_Widgets, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'WI_AbilityBar_C_Spawn_Widgets::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AbilityBar_C_Spawn_Widgets, K2Node_DynamicCast_AsNeighbor_Special_Ability_Widget_Provider) == 0x000018, "Member 'WI_AbilityBar_C_Spawn_Widgets::K2Node_DynamicCast_AsNeighbor_Special_Ability_Widget_Provider' has a wrong offset!");
