#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Avatar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Avatar.WI_Avatar_C
// 0x00E8 (0x03C8 - 0x02E0)
class UWI_Avatar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_70;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelLabel;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerNameLabel;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Level;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            Base_Color;                                        // 0x0328(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Outline_Color;                                     // 0x033C(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              Portrait_Soft_Texture;                             // 0x0350(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   PlayerNameText;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   LevelText;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   CharacterLevelText;                                // 0x0398(0x0010)(Edit, BlueprintVisible)
	bool                                          ShowPlayerName;                                    // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowPlayerLevel;                                   // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowCharacterLevel;                                // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAvatarValid;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             UserAvatar;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_Avatar(int32 EntryPoint);
	void OnAvatarValid__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetAvatarInfo(struct FS_AvatarInfo& AvatarInfo);
	void SetBaseColor(const struct FSlateColor& Base_Color_0);
	void SetLevelText(const class FText& LevelText_0);
	void SetOutlineColor(const struct FSlateColor& Outline_Color_0);
	void SetPlayerNameText(const class FText& PlayerNameText_0);
	void SetPortraitSoftTexture(TSoftObjectPtr<class UTexture2D> Portrait_Soft_Texture_0);
	void SetShowPlayerLevel(bool ShowPlayerLevel_0);
	void SetShowPlayerName(bool ShowPlayerName_0);
	void SetUserAvatarTexture(class UTexture2D* AvatarTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Avatar_C">();
	}
	static class UWI_Avatar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Avatar_C>();
	}
};
static_assert(alignof(UWI_Avatar_C) == 0x000008, "Wrong alignment on UWI_Avatar_C");
static_assert(sizeof(UWI_Avatar_C) == 0x0003C8, "Wrong size on UWI_Avatar_C");
static_assert(offsetof(UWI_Avatar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Avatar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, base) == 0x0002E8, "Member 'UWI_Avatar_C::base' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Image_60) == 0x0002F0, "Member 'UWI_Avatar_C::Image_60' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Image_70) == 0x0002F8, "Member 'UWI_Avatar_C::Image_70' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, LevelLabel) == 0x000300, "Member 'UWI_Avatar_C::LevelLabel' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Outline) == 0x000308, "Member 'UWI_Avatar_C::Outline' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, PlayerNameLabel) == 0x000310, "Member 'UWI_Avatar_C::PlayerNameLabel' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Portrait) == 0x000318, "Member 'UWI_Avatar_C::Portrait' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, SizeBox_Level) == 0x000320, "Member 'UWI_Avatar_C::SizeBox_Level' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Base_Color) == 0x000328, "Member 'UWI_Avatar_C::Base_Color' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Outline_Color) == 0x00033C, "Member 'UWI_Avatar_C::Outline_Color' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, Portrait_Soft_Texture) == 0x000350, "Member 'UWI_Avatar_C::Portrait_Soft_Texture' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, PlayerNameText) == 0x000378, "Member 'UWI_Avatar_C::PlayerNameText' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, LevelText) == 0x000388, "Member 'UWI_Avatar_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, CharacterLevelText) == 0x000398, "Member 'UWI_Avatar_C::CharacterLevelText' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, ShowPlayerName) == 0x0003A8, "Member 'UWI_Avatar_C::ShowPlayerName' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, ShowPlayerLevel) == 0x0003A9, "Member 'UWI_Avatar_C::ShowPlayerLevel' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, ShowCharacterLevel) == 0x0003AA, "Member 'UWI_Avatar_C::ShowCharacterLevel' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, OnAvatarValid) == 0x0003B0, "Member 'UWI_Avatar_C::OnAvatarValid' has a wrong offset!");
static_assert(offsetof(UWI_Avatar_C, UserAvatar) == 0x0003C0, "Member 'UWI_Avatar_C::UserAvatar' has a wrong offset!");

}

