#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_AdditionalHealthBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_AdditionalHealthBar.WI_AdditionalHealthBar_C.ExecuteUbergraph_WI_AdditionalHealthBar
// 0x0038 (0x0038 - 0x0000)
struct WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_Chat_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Chat_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar) == 0x000008, "Wrong alignment on WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar");
static_assert(sizeof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar) == 0x000038, "Wrong size on WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, EntryPoint) == 0x000000, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WI_AdditionalHealthBar_C_ExecuteUbergraph_WI_AdditionalHealthBar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

