#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_AbilityBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_AbilityBar.WI_AbilityBar_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_AbilityBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Layout;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              AbilitySystemComponent;                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckExistingAbilities();
	void ClearAllWidgets();
	void Construct();
	void ExecuteUbergraph_WI_AbilityBar(int32 EntryPoint);
	void HandleAbilityGranted(const class UAbilitySystemComponentJP* AbilitySystemComponent_0, const struct FGameplayAbilitySpecHandle& AbilitySpecHandle);
	void HandlePosessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void SetAbilitySystemComponent(class UAbilitySystemComponentJP* NewAbilitySystemComponent);
	void Spawn_Widgets(class UGameplayAbilityIW* TargetAbility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_AbilityBar_C">();
	}
	static class UWI_AbilityBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_AbilityBar_C>();
	}
};
static_assert(alignof(UWI_AbilityBar_C) == 0x000008, "Wrong alignment on UWI_AbilityBar_C");
static_assert(sizeof(UWI_AbilityBar_C) == 0x0002F8, "Wrong size on UWI_AbilityBar_C");
static_assert(offsetof(UWI_AbilityBar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_AbilityBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_AbilityBar_C, Layout) == 0x0002E8, "Member 'UWI_AbilityBar_C::Layout' has a wrong offset!");
static_assert(offsetof(UWI_AbilityBar_C, AbilitySystemComponent) == 0x0002F0, "Member 'UWI_AbilityBar_C::AbilitySystemComponent' has a wrong offset!");

}

