#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BenchmarkOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_BenchmarkState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_BenchmarkOverlay.WI_BenchmarkOverlay_C
// 0x0080 (0x0360 - 0x02E0)
class UWI_BenchmarkOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               BenchmarkCompleteSizeBox;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           ReturnToMenuButton;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RunningBenchmarkOverlay;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              TestResultsMultiLineEditableTextBox;               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, class FString>            Results;                                           // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddEntries(const TMap<class FString, class FString>& Input);
	void AddEntry(const class FText& LabelText, const class FText& ValueText, int32 Row);
	void AddOrUpdateEntries(const TMap<class FString, class FString>& Input);
	void AddOrUpdateEntry(const class FText& Label, const class FText& Value, int32 Row);
	void BndEvt__WI_BenchmarkOverlay_ReturnToMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WI_BenchmarkOverlay(int32 EntryPoint);
	void GetResultText(class FText* ResultText);
	void PreConstruct(bool IsDesignTime);
	void SetBenchmarkState(E_BenchmarkState State);
	void SetResults(const TMap<class FString, class FString>& Results_0, bool UpdateResultText);
	void UpdateResultText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_BenchmarkOverlay_C">();
	}
	static class UWI_BenchmarkOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_BenchmarkOverlay_C>();
	}
};
static_assert(alignof(UWI_BenchmarkOverlay_C) == 0x000008, "Wrong alignment on UWI_BenchmarkOverlay_C");
static_assert(sizeof(UWI_BenchmarkOverlay_C) == 0x000360, "Wrong size on UWI_BenchmarkOverlay_C");
static_assert(offsetof(UWI_BenchmarkOverlay_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_BenchmarkOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, BenchmarkCompleteSizeBox) == 0x0002E8, "Member 'UWI_BenchmarkOverlay_C::BenchmarkCompleteSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, ReturnToMenuButton) == 0x0002F0, "Member 'UWI_BenchmarkOverlay_C::ReturnToMenuButton' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, RunningBenchmarkOverlay) == 0x0002F8, "Member 'UWI_BenchmarkOverlay_C::RunningBenchmarkOverlay' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, TestResultsMultiLineEditableTextBox) == 0x000300, "Member 'UWI_BenchmarkOverlay_C::TestResultsMultiLineEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, UniformGridPanel) == 0x000308, "Member 'UWI_BenchmarkOverlay_C::UniformGridPanel' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlay_C, Results) == 0x000310, "Member 'UWI_BenchmarkOverlay_C::Results' has a wrong offset!");

}

