#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BottomBoundActionBar_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_BottomBoundActionBar_Popup.WI_BottomBoundActionBar_Popup_C
// 0x0048 (0x0350 - 0x0308)
class UWI_BottomBoundActionBar_Popup_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Background;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBoundActionBar*                  CommonBoundActionBar;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DesignerPreviewBoundActionsHorizontalBox;          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ExtraButtonsSlot;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackButtonClicked;                               // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 DesignerPreviewCommonBoundButtonWidgetClass;       // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignerPreviewCommonBoundButtons;                 // 0x0348(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_BottomBoundActionBar_Popup(int32 EntryPoint);
	void OnBackButtonClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_BottomBoundActionBar_Popup_C">();
	}
	static class UWI_BottomBoundActionBar_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_BottomBoundActionBar_Popup_C>();
	}
};
static_assert(alignof(UWI_BottomBoundActionBar_Popup_C) == 0x000008, "Wrong alignment on UWI_BottomBoundActionBar_Popup_C");
static_assert(sizeof(UWI_BottomBoundActionBar_Popup_C) == 0x000350, "Wrong size on UWI_BottomBoundActionBar_Popup_C");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, UberGraphFrame) == 0x000308, "Member 'UWI_BottomBoundActionBar_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, Background) == 0x000310, "Member 'UWI_BottomBoundActionBar_Popup_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, CommonBoundActionBar) == 0x000318, "Member 'UWI_BottomBoundActionBar_Popup_C::CommonBoundActionBar' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, DesignerPreviewBoundActionsHorizontalBox) == 0x000320, "Member 'UWI_BottomBoundActionBar_Popup_C::DesignerPreviewBoundActionsHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, ExtraButtonsSlot) == 0x000328, "Member 'UWI_BottomBoundActionBar_Popup_C::ExtraButtonsSlot' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, OnBackButtonClicked) == 0x000330, "Member 'UWI_BottomBoundActionBar_Popup_C::OnBackButtonClicked' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, DesignerPreviewCommonBoundButtonWidgetClass) == 0x000340, "Member 'UWI_BottomBoundActionBar_Popup_C::DesignerPreviewCommonBoundButtonWidgetClass' has a wrong offset!");
static_assert(offsetof(UWI_BottomBoundActionBar_Popup_C, DesignerPreviewCommonBoundButtons) == 0x000348, "Member 'UWI_BottomBoundActionBar_Popup_C::DesignerPreviewCommonBoundButtons' has a wrong offset!");

}

