#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BottomBoundActionBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_BottomBoundActionBar.WI_BottomBoundActionBar_C.BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_BottomBoundActionBar_C_BndEvt__WI_BottomBoundActionBar_BackButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_BottomBoundActionBar.WI_BottomBoundActionBar_C.ExecuteUbergraph_WI_BottomBoundActionBar
// 0x0058 (0x0058 - 0x0000)
struct WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar) == 0x000008, "Wrong alignment on WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar");
static_assert(sizeof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar) == 0x000058, "Wrong size on WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, EntryPoint) == 0x000000, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, Temp_int_Variable) == 0x000004, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000018, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000040, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x000050, "Member 'WI_BottomBoundActionBar_C_ExecuteUbergraph_WI_BottomBoundActionBar::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");

// Function WI_BottomBoundActionBar.WI_BottomBoundActionBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_BottomBoundActionBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BottomBoundActionBar_C_PreConstruct) == 0x000001, "Wrong alignment on WI_BottomBoundActionBar_C_PreConstruct");
static_assert(sizeof(WI_BottomBoundActionBar_C_PreConstruct) == 0x000001, "Wrong size on WI_BottomBoundActionBar_C_PreConstruct");
static_assert(offsetof(WI_BottomBoundActionBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_BottomBoundActionBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_BottomBoundActionBar.WI_BottomBoundActionBar_C.SetBackButtonVisibility
// 0x0005 (0x0005 - 0x0000)
struct WI_BottomBoundActionBar_C_SetBackButtonVisibility final
{
public:
	bool                                          ShowBackButton_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BottomBoundActionBar_C_SetBackButtonVisibility) == 0x000001, "Wrong alignment on WI_BottomBoundActionBar_C_SetBackButtonVisibility");
static_assert(sizeof(WI_BottomBoundActionBar_C_SetBackButtonVisibility) == 0x000005, "Wrong size on WI_BottomBoundActionBar_C_SetBackButtonVisibility");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackButtonVisibility, ShowBackButton_0) == 0x000000, "Member 'WI_BottomBoundActionBar_C_SetBackButtonVisibility::ShowBackButton_0' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'WI_BottomBoundActionBar_C_SetBackButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'WI_BottomBoundActionBar_C_SetBackButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WI_BottomBoundActionBar_C_SetBackButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackButtonVisibility, K2Node_Select_Default) == 0x000004, "Member 'WI_BottomBoundActionBar_C_SetBackButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WI_BottomBoundActionBar.WI_BottomBoundActionBar_C.SetBackgroundAlpha
// 0x0004 (0x0004 - 0x0000)
struct WI_BottomBoundActionBar_C_SetBackgroundAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BottomBoundActionBar_C_SetBackgroundAlpha) == 0x000004, "Wrong alignment on WI_BottomBoundActionBar_C_SetBackgroundAlpha");
static_assert(sizeof(WI_BottomBoundActionBar_C_SetBackgroundAlpha) == 0x000004, "Wrong size on WI_BottomBoundActionBar_C_SetBackgroundAlpha");
static_assert(offsetof(WI_BottomBoundActionBar_C_SetBackgroundAlpha, Alpha) == 0x000000, "Member 'WI_BottomBoundActionBar_C_SetBackgroundAlpha::Alpha' has a wrong offset!");

}

