#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BackButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_BackButton.WI_BackButton_C.ExecuteUbergraph_WI_BackButton
// 0x0028 (0x0028 - 0x0000)
struct WI_BackButton_C_ExecuteUbergraph_WI_BackButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton) == 0x000008, "Wrong alignment on WI_BackButton_C_ExecuteUbergraph_WI_BackButton");
static_assert(sizeof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton) == 0x000028, "Wrong size on WI_BackButton_C_ExecuteUbergraph_WI_BackButton");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, EntryPoint) == 0x000000, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, Temp_bool_Variable) == 0x000004, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, Temp_real_Variable) == 0x000008, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, Temp_real_Variable_1) == 0x00000C, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_BackButton_C_ExecuteUbergraph_WI_BackButton, K2Node_Select_Default) == 0x000024, "Member 'WI_BackButton_C_ExecuteUbergraph_WI_BackButton::K2Node_Select_Default' has a wrong offset!");

// Function WI_BackButton.WI_BackButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_BackButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BackButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_BackButton_C_PreConstruct");
static_assert(sizeof(WI_BackButton_C_PreConstruct) == 0x000001, "Wrong size on WI_BackButton_C_PreConstruct");
static_assert(offsetof(WI_BackButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_BackButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

