#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BenchmarkOverlayText

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_BenchmarkOverlayText.WI_BenchmarkOverlayText_C.ExecuteUbergraph_WI_BenchmarkOverlayText
// 0x0008 (0x0008 - 0x0000)
struct WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText) == 0x000004, "Wrong alignment on WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText");
static_assert(sizeof(WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText) == 0x000008, "Wrong size on WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText");
static_assert(offsetof(WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText, EntryPoint) == 0x000000, "Member 'WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_BenchmarkOverlayText_C_ExecuteUbergraph_WI_BenchmarkOverlayText::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_BenchmarkOverlayText.WI_BenchmarkOverlayText_C.GetText
// 0x0010 (0x0010 - 0x0000)
struct WI_BenchmarkOverlayText_C_GetText final
{
public:
	class FText                                   In_Text;                                           // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(WI_BenchmarkOverlayText_C_GetText) == 0x000008, "Wrong alignment on WI_BenchmarkOverlayText_C_GetText");
static_assert(sizeof(WI_BenchmarkOverlayText_C_GetText) == 0x000010, "Wrong size on WI_BenchmarkOverlayText_C_GetText");
static_assert(offsetof(WI_BenchmarkOverlayText_C_GetText, In_Text) == 0x000000, "Member 'WI_BenchmarkOverlayText_C_GetText::In_Text' has a wrong offset!");

// Function WI_BenchmarkOverlayText.WI_BenchmarkOverlayText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_BenchmarkOverlayText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_BenchmarkOverlayText_C_PreConstruct) == 0x000001, "Wrong alignment on WI_BenchmarkOverlayText_C_PreConstruct");
static_assert(sizeof(WI_BenchmarkOverlayText_C_PreConstruct) == 0x000001, "Wrong size on WI_BenchmarkOverlayText_C_PreConstruct");
static_assert(offsetof(WI_BenchmarkOverlayText_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_BenchmarkOverlayText_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_BenchmarkOverlayText.WI_BenchmarkOverlayText_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WI_BenchmarkOverlayText_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_BenchmarkOverlayText_C_SetText) == 0x000008, "Wrong alignment on WI_BenchmarkOverlayText_C_SetText");
static_assert(sizeof(WI_BenchmarkOverlayText_C_SetText) == 0x000010, "Wrong size on WI_BenchmarkOverlayText_C_SetText");
static_assert(offsetof(WI_BenchmarkOverlayText_C_SetText, Text) == 0x000000, "Member 'WI_BenchmarkOverlayText_C_SetText::Text' has a wrong offset!");

}

