#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CharacterPortrait

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_CharacterPortrait.WI_CharacterPortrait_C.ExecuteUbergraph_WI_CharacterPortrait
// 0x0008 (0x0008 - 0x0000)
struct WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait) == 0x000004, "Wrong alignment on WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait");
static_assert(sizeof(WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait) == 0x000008, "Wrong size on WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait");
static_assert(offsetof(WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait, EntryPoint) == 0x000000, "Member 'WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_CharacterPortrait_C_ExecuteUbergraph_WI_CharacterPortrait::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_CharacterPortrait.WI_CharacterPortrait_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_CharacterPortrait_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterPortrait_C_PreConstruct) == 0x000001, "Wrong alignment on WI_CharacterPortrait_C_PreConstruct");
static_assert(sizeof(WI_CharacterPortrait_C_PreConstruct) == 0x000001, "Wrong size on WI_CharacterPortrait_C_PreConstruct");
static_assert(offsetof(WI_CharacterPortrait_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_CharacterPortrait_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_CharacterPortrait.WI_CharacterPortrait_C.SetBackgroundColor
// 0x0014 (0x0014 - 0x0000)
struct WI_CharacterPortrait_C_SetBackgroundColor final
{
public:
	struct FLinearColor                           BackgroundColor_0;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterPortrait_C_SetBackgroundColor) == 0x000004, "Wrong alignment on WI_CharacterPortrait_C_SetBackgroundColor");
static_assert(sizeof(WI_CharacterPortrait_C_SetBackgroundColor) == 0x000014, "Wrong size on WI_CharacterPortrait_C_SetBackgroundColor");
static_assert(offsetof(WI_CharacterPortrait_C_SetBackgroundColor, BackgroundColor_0) == 0x000000, "Member 'WI_CharacterPortrait_C_SetBackgroundColor::BackgroundColor_0' has a wrong offset!");
static_assert(offsetof(WI_CharacterPortrait_C_SetBackgroundColor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WI_CharacterPortrait_C_SetBackgroundColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_CharacterPortrait.WI_CharacterPortrait_C.SetPortraitFromSoftTexture
// 0x0030 (0x0030 - 0x0000)
struct WI_CharacterPortrait_C_SetPortraitFromSoftTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Portait_Texture;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterPortrait_C_SetPortraitFromSoftTexture) == 0x000008, "Wrong alignment on WI_CharacterPortrait_C_SetPortraitFromSoftTexture");
static_assert(sizeof(WI_CharacterPortrait_C_SetPortraitFromSoftTexture) == 0x000030, "Wrong size on WI_CharacterPortrait_C_SetPortraitFromSoftTexture");
static_assert(offsetof(WI_CharacterPortrait_C_SetPortraitFromSoftTexture, Portait_Texture) == 0x000000, "Member 'WI_CharacterPortrait_C_SetPortraitFromSoftTexture::Portait_Texture' has a wrong offset!");
static_assert(offsetof(WI_CharacterPortrait_C_SetPortraitFromSoftTexture, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WI_CharacterPortrait_C_SetPortraitFromSoftTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_CharacterPortrait.WI_CharacterPortrait_C.SetPortraitFromTexture
// 0x0008 (0x0008 - 0x0000)
struct WI_CharacterPortrait_C_SetPortraitFromTexture final
{
public:
	class UTexture2D*                             Portait_Texture;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterPortrait_C_SetPortraitFromTexture) == 0x000008, "Wrong alignment on WI_CharacterPortrait_C_SetPortraitFromTexture");
static_assert(sizeof(WI_CharacterPortrait_C_SetPortraitFromTexture) == 0x000008, "Wrong size on WI_CharacterPortrait_C_SetPortraitFromTexture");
static_assert(offsetof(WI_CharacterPortrait_C_SetPortraitFromTexture, Portait_Texture) == 0x000000, "Member 'WI_CharacterPortrait_C_SetPortraitFromTexture::Portait_Texture' has a wrong offset!");

}

