#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CurrencyPurchaseCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WI_GenericCardButton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C
// 0x0030 (0x1700 - 0x16D0)
class UWI_CurrencyPurchaseCard_C final : public UWI_GenericCardButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_CurrencyPurchaseCard_C;          // 0x16D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       DiscountText;                                      // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PriceText;                                         // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DiscountDescriptionFormat;                         // 0x16E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WI_CurrencyPurchaseCard(int32 EntryPoint);
	void OnLoaded_7EFA03D042198D454280429198404B9A(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void SetBundleInfo(TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> CurrencyBundleDataAsset, const class FString& CurrencyCode, int32 OwnPrice, int32 OwnAmount, int32 ComparisonPrice, int32 ComparisonAmount, bool ShowDiscountDescription);
	void SetDiscountDescription(bool ShowDescription, const class FText& DiscountDescription);
	void SetPrice(const class FText& Price);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_CurrencyPurchaseCard_C">();
	}
	static class UWI_CurrencyPurchaseCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_CurrencyPurchaseCard_C>();
	}
};
static_assert(alignof(UWI_CurrencyPurchaseCard_C) == 0x000010, "Wrong alignment on UWI_CurrencyPurchaseCard_C");
static_assert(sizeof(UWI_CurrencyPurchaseCard_C) == 0x001700, "Wrong size on UWI_CurrencyPurchaseCard_C");
static_assert(offsetof(UWI_CurrencyPurchaseCard_C, UberGraphFrame_WI_CurrencyPurchaseCard_C) == 0x0016D0, "Member 'UWI_CurrencyPurchaseCard_C::UberGraphFrame_WI_CurrencyPurchaseCard_C' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseCard_C, DiscountText) == 0x0016D8, "Member 'UWI_CurrencyPurchaseCard_C::DiscountText' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseCard_C, PriceText) == 0x0016E0, "Member 'UWI_CurrencyPurchaseCard_C::PriceText' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseCard_C, DiscountDescriptionFormat) == 0x0016E8, "Member 'UWI_CurrencyPurchaseCard_C::DiscountDescriptionFormat' has a wrong offset!");

}

