#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CommonSettings_Pip

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_CommonSettings_Pip.WI_CommonSettings_Pip_C.ExecuteUbergraph_WI_CommonSettings_Pip
// 0x0008 (0x0008 - 0x0000)
struct WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip) == 0x000004, "Wrong alignment on WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip");
static_assert(sizeof(WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip) == 0x000008, "Wrong size on WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip");
static_assert(offsetof(WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip, EntryPoint) == 0x000000, "Member 'WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_CommonSettings_Pip_C_ExecuteUbergraph_WI_CommonSettings_Pip::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_CommonSettings_Pip.WI_CommonSettings_Pip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_CommonSettings_Pip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettings_Pip_C_PreConstruct) == 0x000001, "Wrong alignment on WI_CommonSettings_Pip_C_PreConstruct");
static_assert(sizeof(WI_CommonSettings_Pip_C_PreConstruct) == 0x000001, "Wrong size on WI_CommonSettings_Pip_C_PreConstruct");
static_assert(offsetof(WI_CommonSettings_Pip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_CommonSettings_Pip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_CommonSettings_Pip.WI_CommonSettings_Pip_C.SetActive
// 0x0010 (0x0010 - 0x0000)
struct WI_CommonSettings_Pip_C_SetActive final
{
public:
	bool                                          Active_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettings_Pip_C_SetActive) == 0x000008, "Wrong alignment on WI_CommonSettings_Pip_C_SetActive");
static_assert(sizeof(WI_CommonSettings_Pip_C_SetActive) == 0x000010, "Wrong size on WI_CommonSettings_Pip_C_SetActive");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetActive, Active_0) == 0x000000, "Member 'WI_CommonSettings_Pip_C_SetActive::Active_0' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetActive, Temp_bool_Variable) == 0x000001, "Member 'WI_CommonSettings_Pip_C_SetActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetActive, K2Node_Select_Default) == 0x000008, "Member 'WI_CommonSettings_Pip_C_SetActive::K2Node_Select_Default' has a wrong offset!");

// Function WI_CommonSettings_Pip.WI_CommonSettings_Pip_C.SetSelected
// 0x0005 (0x0005 - 0x0000)
struct WI_CommonSettings_Pip_C_SetSelected final
{
public:
	bool                                          Selected_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettings_Pip_C_SetSelected) == 0x000001, "Wrong alignment on WI_CommonSettings_Pip_C_SetSelected");
static_assert(sizeof(WI_CommonSettings_Pip_C_SetSelected) == 0x000005, "Wrong size on WI_CommonSettings_Pip_C_SetSelected");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetSelected, Selected_0) == 0x000000, "Member 'WI_CommonSettings_Pip_C_SetSelected::Selected_0' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WI_CommonSettings_Pip_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WI_CommonSettings_Pip_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WI_CommonSettings_Pip_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettings_Pip_C_SetSelected, K2Node_Select_Default) == 0x000004, "Member 'WI_CommonSettings_Pip_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

}

