#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CharacterProgression_Portrait

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_CharacterProgression_Portrait.WI_CharacterProgression_Portrait_C.ExecuteUbergraph_WI_CharacterProgression_Portrait
// 0x0050 (0x0050 - 0x0000)
struct WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NeighborTag;                    // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait) == 0x000008, "Wrong alignment on WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait");
static_assert(sizeof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait) == 0x000050, "Wrong size on WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, EntryPoint) == 0x000000, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, K2Node_CustomEvent_NeighborTag) == 0x000004, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::K2Node_CustomEvent_NeighborTag' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x00000C, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000010, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000040, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_CharacterProgression_Portrait_C_ExecuteUbergraph_WI_CharacterProgression_Portrait::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_CharacterProgression_Portrait.WI_CharacterProgression_Portrait_C.SetPortrait
// 0x0008 (0x0008 - 0x0000)
struct WI_CharacterProgression_Portrait_C_SetPortrait final
{
public:
	struct FGameplayTag                           NeighborTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CharacterProgression_Portrait_C_SetPortrait) == 0x000004, "Wrong alignment on WI_CharacterProgression_Portrait_C_SetPortrait");
static_assert(sizeof(WI_CharacterProgression_Portrait_C_SetPortrait) == 0x000008, "Wrong size on WI_CharacterProgression_Portrait_C_SetPortrait");
static_assert(offsetof(WI_CharacterProgression_Portrait_C_SetPortrait, NeighborTag) == 0x000000, "Member 'WI_CharacterProgression_Portrait_C_SetPortrait::NeighborTag' has a wrong offset!");

}

