#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CurrencyPurchaseCard

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.ExecuteUbergraph_WI_CurrencyPurchaseCard
// 0x00C8 (0x00C8 - 0x0000)
struct WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> K2Node_CustomEvent_CurrencyBundleDataAsset;        // 0x0008(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CurrencyCode;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OwnPrice;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OwnAmount;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ComparisonPrice;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ComparisonAmount;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowDiscountDescription;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineCurrencyBundleDataAsset*         K2Node_DynamicCast_AsOnline_Currency_Bundle_Data_Asset; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDiscountDescription_ReturnValue;       // 0x0078(0x0010)()
	class FText                                   CallFunc_GetPriceTag_ReturnValue;                  // 0x0088(0x0010)()
	class FString                                 CallFunc_GetTitle_ReturnValue;                     // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0010)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard) == 0x000008, "Wrong alignment on WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard) == 0x0000C8, "Wrong size on WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, EntryPoint) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_CurrencyBundleDataAsset) == 0x000008, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_CurrencyBundleDataAsset' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_CurrencyCode) == 0x000030, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_CurrencyCode' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_OwnPrice) == 0x000040, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_OwnPrice' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_OwnAmount) == 0x000044, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_OwnAmount' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_ComparisonPrice) == 0x000048, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_ComparisonPrice' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_ComparisonAmount) == 0x00004C, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_ComparisonAmount' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_ShowDiscountDescription) == 0x000050, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_ShowDiscountDescription' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, Temp_object_Variable) == 0x000058, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CustomEvent_Loaded) == 0x000060, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_DynamicCast_AsOnline_Currency_Bundle_Data_Asset) == 0x000068, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_DynamicCast_AsOnline_Currency_Bundle_Data_Asset' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, CallFunc_GetDiscountDescription_ReturnValue) == 0x000078, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::CallFunc_GetDiscountDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, CallFunc_GetPriceTag_ReturnValue) == 0x000088, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::CallFunc_GetPriceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, CallFunc_GetTitle_ReturnValue) == 0x000098, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WI_CurrencyPurchaseCard_C_ExecuteUbergraph_WI_CurrencyPurchaseCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.OnLoaded_7EFA03D042198D454280429198404B9A
// 0x0008 (0x0008 - 0x0000)
struct WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A) == 0x000008, "Wrong alignment on WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A) == 0x000008, "Wrong size on WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A, Loaded) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_OnLoaded_7EFA03D042198D454280429198404B9A::Loaded' has a wrong offset!");

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_CurrencyPurchaseCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_PreConstruct) == 0x000001, "Wrong alignment on WI_CurrencyPurchaseCard_C_PreConstruct");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_PreConstruct) == 0x000001, "Wrong size on WI_CurrencyPurchaseCard_C_PreConstruct");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.SetBundleInfo
// 0x0050 (0x0050 - 0x0000)
struct WI_CurrencyPurchaseCard_C_SetBundleInfo final
{
public:
	TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> CurrencyBundleDataAsset;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 CurrencyCode;                                      // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         OwnPrice;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnAmount;                                         // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComparisonPrice;                                   // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComparisonAmount;                                  // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDiscountDescription;                           // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_SetBundleInfo) == 0x000008, "Wrong alignment on WI_CurrencyPurchaseCard_C_SetBundleInfo");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_SetBundleInfo) == 0x000050, "Wrong size on WI_CurrencyPurchaseCard_C_SetBundleInfo");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, CurrencyBundleDataAsset) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::CurrencyBundleDataAsset' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, CurrencyCode) == 0x000028, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::CurrencyCode' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, OwnPrice) == 0x000038, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::OwnPrice' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, OwnAmount) == 0x00003C, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::OwnAmount' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, ComparisonPrice) == 0x000040, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::ComparisonPrice' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, ComparisonAmount) == 0x000044, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::ComparisonAmount' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetBundleInfo, ShowDiscountDescription) == 0x000048, "Member 'WI_CurrencyPurchaseCard_C_SetBundleInfo::ShowDiscountDescription' has a wrong offset!");

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.SetDiscountDescription
// 0x0020 (0x0020 - 0x0000)
struct WI_CurrencyPurchaseCard_C_SetDiscountDescription final
{
public:
	bool                                          ShowDescription;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DiscountDescription;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_SetDiscountDescription) == 0x000008, "Wrong alignment on WI_CurrencyPurchaseCard_C_SetDiscountDescription");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_SetDiscountDescription) == 0x000020, "Wrong size on WI_CurrencyPurchaseCard_C_SetDiscountDescription");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, ShowDescription) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::ShowDescription' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, DiscountDescription) == 0x000008, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::DiscountDescription' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, Temp_byte_Variable) == 0x000018, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, Temp_byte_Variable_1) == 0x000019, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, Temp_bool_Variable) == 0x00001A, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetDiscountDescription, K2Node_Select_Default) == 0x00001B, "Member 'WI_CurrencyPurchaseCard_C_SetDiscountDescription::K2Node_Select_Default' has a wrong offset!");

// Function WI_CurrencyPurchaseCard.WI_CurrencyPurchaseCard_C.SetPrice
// 0x0010 (0x0010 - 0x0000)
struct WI_CurrencyPurchaseCard_C_SetPrice final
{
public:
	class FText                                   Price;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_CurrencyPurchaseCard_C_SetPrice) == 0x000008, "Wrong alignment on WI_CurrencyPurchaseCard_C_SetPrice");
static_assert(sizeof(WI_CurrencyPurchaseCard_C_SetPrice) == 0x000010, "Wrong size on WI_CurrencyPurchaseCard_C_SetPrice");
static_assert(offsetof(WI_CurrencyPurchaseCard_C_SetPrice, Price) == 0x000000, "Member 'WI_CurrencyPurchaseCard_C_SetPrice::Price' has a wrong offset!");

}

