#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CommonSettingsCheckbox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_CommonSettingsCheckbox.WI_CommonSettingsCheckbox_C.ExecuteUbergraph_WI_CommonSettingsCheckbox
// 0x0030 (0x0030 - 0x0000)
struct WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InChecked;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox) == 0x000008, "Wrong alignment on WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox");
static_assert(sizeof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox) == 0x000030, "Wrong size on WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, EntryPoint) == 0x000000, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, K2Node_CustomEvent_InChecked) == 0x000019, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::K2Node_CustomEvent_InChecked' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000020, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'WI_CommonSettingsCheckbox_C_ExecuteUbergraph_WI_CommonSettingsCheckbox::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WI_CommonSettingsCheckbox.WI_CommonSettingsCheckbox_C.SetChecked
// 0x0001 (0x0001 - 0x0000)
struct WI_CommonSettingsCheckbox_C_SetChecked final
{
public:
	bool                                          InChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettingsCheckbox_C_SetChecked) == 0x000001, "Wrong alignment on WI_CommonSettingsCheckbox_C_SetChecked");
static_assert(sizeof(WI_CommonSettingsCheckbox_C_SetChecked) == 0x000001, "Wrong size on WI_CommonSettingsCheckbox_C_SetChecked");
static_assert(offsetof(WI_CommonSettingsCheckbox_C_SetChecked, InChecked) == 0x000000, "Member 'WI_CommonSettingsCheckbox_C_SetChecked::InChecked' has a wrong offset!");

}

