#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Chat_Message

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IWChat_structs.hpp"
#include "IWChat_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Chat_Message.WI_Chat_Message_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_Chat_Message_C final : public UChatMessageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Message;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             User;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FChatMessageWidgetViewModel& InViewModel);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WI_Chat_Message(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Chat_Message_C">();
	}
	static class UWI_Chat_Message_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Chat_Message_C>();
	}
};
static_assert(alignof(UWI_Chat_Message_C) == 0x000008, "Wrong alignment on UWI_Chat_Message_C");
static_assert(sizeof(UWI_Chat_Message_C) == 0x000300, "Wrong size on UWI_Chat_Message_C");
static_assert(offsetof(UWI_Chat_Message_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Chat_Message_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Chat_Message_C, Message) == 0x0002E8, "Member 'UWI_Chat_Message_C::Message' has a wrong offset!");
static_assert(offsetof(UWI_Chat_Message_C, Separator) == 0x0002F0, "Member 'UWI_Chat_Message_C::Separator' has a wrong offset!");
static_assert(offsetof(UWI_Chat_Message_C, User) == 0x0002F8, "Member 'UWI_Chat_Message_C::User' has a wrong offset!");

}

