#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CharacterLocator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_NameplateDistanceState_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_CharacterLocator.WI_CharacterLocator_C
// 0x0068 (0x0348 - 0x02E0)
class UWI_CharacterLocator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CombatActivated;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EventIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibleForPlayer;                                  // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NameplateDistanceState                      DistanceState;                                     // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CloseBackground;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MediumBackground;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FarBackground;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FarEventIcon;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MediumEventIcon;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NearEventIcon;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_CharacterLocator(int32 EntryPoint);
	void InitWidget(class AActor* Owner_0);
	void OnLoaded_86193B4D45EA099573C2B68F23262776(class UObject* Loaded);
	void SetCombatState(bool Active);
	void SetTeamVisibility();
	void UpdateDistanceState(E_NameplateDistanceState DistanceState_0);
	void UpdateRenderScale(double ScaleX, double ScaleY);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_CharacterLocator_C">();
	}
	static class UWI_CharacterLocator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_CharacterLocator_C>();
	}
};
static_assert(alignof(UWI_CharacterLocator_C) == 0x000008, "Wrong alignment on UWI_CharacterLocator_C");
static_assert(sizeof(UWI_CharacterLocator_C) == 0x000348, "Wrong size on UWI_CharacterLocator_C");
static_assert(offsetof(UWI_CharacterLocator_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_CharacterLocator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, CombatActivated) == 0x0002E8, "Member 'UWI_CharacterLocator_C::CombatActivated' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, Background) == 0x0002F0, "Member 'UWI_CharacterLocator_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, EventIcon) == 0x0002F8, "Member 'UWI_CharacterLocator_C::EventIcon' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, Portrait) == 0x000300, "Member 'UWI_CharacterLocator_C::Portrait' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, Owner) == 0x000308, "Member 'UWI_CharacterLocator_C::Owner' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, TeamId) == 0x000310, "Member 'UWI_CharacterLocator_C::TeamId' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, VisibleForPlayer) == 0x000311, "Member 'UWI_CharacterLocator_C::VisibleForPlayer' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, DistanceState) == 0x000312, "Member 'UWI_CharacterLocator_C::DistanceState' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, CloseBackground) == 0x000318, "Member 'UWI_CharacterLocator_C::CloseBackground' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, MediumBackground) == 0x000320, "Member 'UWI_CharacterLocator_C::MediumBackground' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, FarBackground) == 0x000328, "Member 'UWI_CharacterLocator_C::FarBackground' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, FarEventIcon) == 0x000330, "Member 'UWI_CharacterLocator_C::FarEventIcon' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, MediumEventIcon) == 0x000338, "Member 'UWI_CharacterLocator_C::MediumEventIcon' has a wrong offset!");
static_assert(offsetof(UWI_CharacterLocator_C, NearEventIcon) == 0x000340, "Member 'UWI_CharacterLocator_C::NearEventIcon' has a wrong offset!");

}

