#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ConfirmOrderOverlay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_ConfirmOrderOverlay.WI_ConfirmOrderOverlay_C.ClosePressed
// 0x0008 (0x0008 - 0x0000)
struct WI_ConfirmOrderOverlay_C_ClosePressed final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ConfirmOrderOverlay_C_ClosePressed) == 0x000008, "Wrong alignment on WI_ConfirmOrderOverlay_C_ClosePressed");
static_assert(sizeof(WI_ConfirmOrderOverlay_C_ClosePressed) == 0x000008, "Wrong size on WI_ConfirmOrderOverlay_C_ClosePressed");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ClosePressed, Button) == 0x000000, "Member 'WI_ConfirmOrderOverlay_C_ClosePressed::Button' has a wrong offset!");

// Function WI_ConfirmOrderOverlay.WI_ConfirmOrderOverlay_C.ConfirmPressed
// 0x0008 (0x0008 - 0x0000)
struct WI_ConfirmOrderOverlay_C_ConfirmPressed final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ConfirmOrderOverlay_C_ConfirmPressed) == 0x000008, "Wrong alignment on WI_ConfirmOrderOverlay_C_ConfirmPressed");
static_assert(sizeof(WI_ConfirmOrderOverlay_C_ConfirmPressed) == 0x000008, "Wrong size on WI_ConfirmOrderOverlay_C_ConfirmPressed");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ConfirmPressed, Button) == 0x000000, "Member 'WI_ConfirmOrderOverlay_C_ConfirmPressed::Button' has a wrong offset!");

// Function WI_ConfirmOrderOverlay.WI_ConfirmOrderOverlay_C.ExecuteUbergraph_WI_ConfirmOrderOverlay
// 0x0080 (0x0080 - 0x0000)
struct WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTagLookupPrimaryDataAsset> CallFunc_GetTaggedAsset_ReturnValue;               // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ItemToPurchaseTag;              // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_1;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay) == 0x000008, "Wrong alignment on WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay");
static_assert(sizeof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay) == 0x000080, "Wrong size on WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, EntryPoint) == 0x000000, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, CallFunc_GetTaggedAsset_ReturnValue) == 0x000008, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::CallFunc_GetTaggedAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000040, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_DynamicCast_AsItem_Definition) == 0x000048, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_CustomEvent_ItemToPurchaseTag) == 0x000064, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_CustomEvent_ItemToPurchaseTag' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_CustomEvent_Button_1) == 0x000070, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay, K2Node_CustomEvent_Button) == 0x000078, "Member 'WI_ConfirmOrderOverlay_C_ExecuteUbergraph_WI_ConfirmOrderOverlay::K2Node_CustomEvent_Button' has a wrong offset!");

// Function WI_ConfirmOrderOverlay.WI_ConfirmOrderOverlay_C.OnDeliveryConfirmed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature final
{
public:
	struct FGameplayTag                           ItemGameplayTag;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature) == 0x000004, "Wrong alignment on WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature");
static_assert(sizeof(WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature) == 0x000008, "Wrong size on WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature, ItemGameplayTag) == 0x000000, "Member 'WI_ConfirmOrderOverlay_C_OnDeliveryConfirmed__DelegateSignature::ItemGameplayTag' has a wrong offset!");

// Function WI_ConfirmOrderOverlay.WI_ConfirmOrderOverlay_C.Open
// 0x0008 (0x0008 - 0x0000)
struct WI_ConfirmOrderOverlay_C_Open final
{
public:
	struct FGameplayTag                           ItemToPurchaseTag;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ConfirmOrderOverlay_C_Open) == 0x000004, "Wrong alignment on WI_ConfirmOrderOverlay_C_Open");
static_assert(sizeof(WI_ConfirmOrderOverlay_C_Open) == 0x000008, "Wrong size on WI_ConfirmOrderOverlay_C_Open");
static_assert(offsetof(WI_ConfirmOrderOverlay_C_Open, ItemToPurchaseTag) == 0x000000, "Member 'WI_ConfirmOrderOverlay_C_Open::ItemToPurchaseTag' has a wrong offset!");

}

