#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DeliveryServiceTimer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C.ExecuteUbergraph_WI_DeliveryServiceTimer
// 0x0048 (0x0048 - 0x0000)
struct WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeliveryService_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer) == 0x000008, "Wrong alignment on WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer");
static_assert(sizeof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer) == 0x000048, "Wrong size on WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, EntryPoint) == 0x000000, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, Temp_bool_Variable) == 0x000014, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, Temp_byte_Variable) == 0x000015, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, Temp_byte_Variable_1) == 0x000016, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, CallFunc_GetActorOfClass_ReturnValue) == 0x000018, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, K2Node_CustomEvent_Time) == 0x000020, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000028, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, K2Node_CustomEvent_Enable_1) == 0x000038, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00003C, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, K2Node_CustomEvent_Enable) == 0x000040, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer, K2Node_Select_Default) == 0x000041, "Member 'WI_DeliveryServiceTimer_C_ExecuteUbergraph_WI_DeliveryServiceTimer::K2Node_Select_Default' has a wrong offset!");

// Function WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C.Set Is Out For Delivery
// 0x0001 (0x0001 - 0x0000)
struct WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery) == 0x000001, "Wrong alignment on WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery");
static_assert(sizeof(WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery) == 0x000001, "Wrong size on WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery");
static_assert(offsetof(WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery, Enable) == 0x000000, "Member 'WI_DeliveryServiceTimer_C_Set_Is_Out_For_Delivery::Enable' has a wrong offset!");

// Function WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C.Set Show Delivery Service Timer
// 0x0001 (0x0001 - 0x0000)
struct WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer) == 0x000001, "Wrong alignment on WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer");
static_assert(sizeof(WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer) == 0x000001, "Wrong size on WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer");
static_assert(offsetof(WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer, Enable) == 0x000000, "Member 'WI_DeliveryServiceTimer_C_Set_Show_Delivery_Service_Timer::Enable' has a wrong offset!");

// Function WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C.Start Local Timer
// 0x0004 (0x0004 - 0x0000)
struct WI_DeliveryServiceTimer_C_Start_Local_Timer final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeliveryServiceTimer_C_Start_Local_Timer) == 0x000004, "Wrong alignment on WI_DeliveryServiceTimer_C_Start_Local_Timer");
static_assert(sizeof(WI_DeliveryServiceTimer_C_Start_Local_Timer) == 0x000004, "Wrong size on WI_DeliveryServiceTimer_C_Start_Local_Timer");
static_assert(offsetof(WI_DeliveryServiceTimer_C_Start_Local_Timer, Time) == 0x000000, "Member 'WI_DeliveryServiceTimer_C_Start_Local_Timer::Time' has a wrong offset!");

// Function WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C.UpdateTime
// 0x0030 (0x0030 - 0x0000)
struct WI_DeliveryServiceTimer_C_UpdateTime final
{
public:
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0018(0x0010)()
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeliveryServiceTimer_C_UpdateTime) == 0x000008, "Wrong alignment on WI_DeliveryServiceTimer_C_UpdateTime");
static_assert(sizeof(WI_DeliveryServiceTimer_C_UpdateTime) == 0x000030, "Wrong size on WI_DeliveryServiceTimer_C_UpdateTime");
static_assert(offsetof(WI_DeliveryServiceTimer_C_UpdateTime, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000000, "Member 'WI_DeliveryServiceTimer_C_UpdateTime::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_UpdateTime, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WI_DeliveryServiceTimer_C_UpdateTime::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_UpdateTime, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000010, "Member 'WI_DeliveryServiceTimer_C_UpdateTime::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_UpdateTime, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000018, "Member 'WI_DeliveryServiceTimer_C_UpdateTime::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeliveryServiceTimer_C_UpdateTime, CallFunc_FClamp_Value_ImplicitCast) == 0x000028, "Member 'WI_DeliveryServiceTimer_C_UpdateTime::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");

}

