#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DamageValue

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_DamageValue.WI_DamageValue_C.ExecuteUbergraph_WI_DamageValue
// 0x0118 (0x0118 - 0x0000)
struct WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextAndColor_Text;                     // 0x00B8(0x0010)()
	struct FLinearColor                           CallFunc_GetTextAndColor_Color;                    // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D8(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00EC(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue) == 0x000008, "Wrong alignment on WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue");
static_assert(sizeof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue) == 0x000118, "Wrong size on WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, EntryPoint) == 0x000000, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_byte_Variable) == 0x000004, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_bool_Variable) == 0x000005, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_byte_Variable_1) == 0x000006, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_byte_Variable_2) == 0x000007, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000008, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_bool_IsClosed_Variable) == 0x00000A, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_GetViewportScale_ReturnValue) == 0x000050, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000058, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000068, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000070, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000078, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000088, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000090, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_Abs_ReturnValue) == 0x000098, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_Select_Default) == 0x0000B0, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_byte_Variable_3) == 0x0000B1, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_GetTextAndColor_Text) == 0x0000B8, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_GetTextAndColor_Text' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_GetTextAndColor_Color) == 0x0000C8, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_GetTextAndColor_Color' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_MakeStruct_SlateColor) == 0x0000D8, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_MakeStruct_SlateColor_1) == 0x0000EC, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_PlayAnimationForward_ReturnValue) == 0x000100, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000108, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, Temp_bool_Variable_1) == 0x000109, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, K2Node_Select_Default_1) == 0x00010A, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue, CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast) == 0x000110, "Member 'WI_DamageValue_C_ExecuteUbergraph_WI_DamageValue::CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast' has a wrong offset!");

// Function WI_DamageValue.WI_DamageValue_C.GetTextAndColor
// 0x0070 (0x0070 - 0x0000)
struct WI_DamageValue_C_GetTextAndColor final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Parm, OutParm)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0048(0x0010)()
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DamageValue_C_GetTextAndColor) == 0x000008, "Wrong alignment on WI_DamageValue_C_GetTextAndColor");
static_assert(sizeof(WI_DamageValue_C_GetTextAndColor) == 0x000070, "Wrong size on WI_DamageValue_C_GetTextAndColor");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, Text) == 0x000000, "Member 'WI_DamageValue_C_GetTextAndColor::Text' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, Color) == 0x000010, "Member 'WI_DamageValue_C_GetTextAndColor::Color' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, Temp_bool_Variable) == 0x000020, "Member 'WI_DamageValue_C_GetTextAndColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, Temp_struct_Variable) == 0x000024, "Member 'WI_DamageValue_C_GetTextAndColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, Temp_struct_Variable_1) == 0x000034, "Member 'WI_DamageValue_C_GetTextAndColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000048, "Member 'WI_DamageValue_C_GetTextAndColor::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'WI_DamageValue_C_GetTextAndColor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_GetTextAndColor, K2Node_Select_Default) == 0x00005C, "Member 'WI_DamageValue_C_GetTextAndColor::K2Node_Select_Default' has a wrong offset!");

// Function WI_DamageValue.WI_DamageValue_C.Tick
// 0x003C (0x003C - 0x0000)
struct WI_DamageValue_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DamageValue_C_Tick) == 0x000004, "Wrong alignment on WI_DamageValue_C_Tick");
static_assert(sizeof(WI_DamageValue_C_Tick) == 0x00003C, "Wrong size on WI_DamageValue_C_Tick");
static_assert(offsetof(WI_DamageValue_C_Tick, MyGeometry) == 0x000000, "Member 'WI_DamageValue_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_DamageValue_C_Tick, InDeltaTime) == 0x000038, "Member 'WI_DamageValue_C_Tick::InDeltaTime' has a wrong offset!");

}

