#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DestructionMultiplier

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_DestructionMultiplier.WI_DestructionMultiplier_C.ExecuteUbergraph_WI_DestructionMultiplier
// 0x0088 (0x0088 - 0x0000)
struct WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Multiplier;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
static_assert(alignof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier) == 0x000008, "Wrong alignment on WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier");
static_assert(sizeof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier) == 0x000088, "Wrong size on WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, EntryPoint) == 0x000000, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, K2Node_CustomEvent_Multiplier) == 0x000008, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::K2Node_CustomEvent_Multiplier' has a wrong offset!");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, K2Node_MakeArray_Array) == 0x000068, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier, CallFunc_Format_ReturnValue) == 0x000078, "Member 'WI_DestructionMultiplier_C_ExecuteUbergraph_WI_DestructionMultiplier::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_DestructionMultiplier.WI_DestructionMultiplier_C.SetDamageMultiplierText
// 0x0008 (0x0008 - 0x0000)
struct WI_DestructionMultiplier_C_SetDamageMultiplierText final
{
public:
	double                                        Multiplier;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DestructionMultiplier_C_SetDamageMultiplierText) == 0x000008, "Wrong alignment on WI_DestructionMultiplier_C_SetDamageMultiplierText");
static_assert(sizeof(WI_DestructionMultiplier_C_SetDamageMultiplierText) == 0x000008, "Wrong size on WI_DestructionMultiplier_C_SetDamageMultiplierText");
static_assert(offsetof(WI_DestructionMultiplier_C_SetDamageMultiplierText, Multiplier) == 0x000000, "Member 'WI_DestructionMultiplier_C_SetDamageMultiplierText::Multiplier' has a wrong offset!");

}

