#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DeathGrayoutWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_DeathGrayoutWrapper.WI_DeathGrayoutWrapper_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_DeathGrayoutWrapper_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             NamedSlot_41;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_28;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Preview;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_DeathGrayoutWrapper(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetGrayoutEnabled(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_DeathGrayoutWrapper_C">();
	}
	static class UWI_DeathGrayoutWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_DeathGrayoutWrapper_C>();
	}
};
static_assert(alignof(UWI_DeathGrayoutWrapper_C) == 0x000008, "Wrong alignment on UWI_DeathGrayoutWrapper_C");
static_assert(sizeof(UWI_DeathGrayoutWrapper_C) == 0x000300, "Wrong size on UWI_DeathGrayoutWrapper_C");
static_assert(offsetof(UWI_DeathGrayoutWrapper_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_DeathGrayoutWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_DeathGrayoutWrapper_C, NamedSlot_41) == 0x0002E8, "Member 'UWI_DeathGrayoutWrapper_C::NamedSlot_41' has a wrong offset!");
static_assert(offsetof(UWI_DeathGrayoutWrapper_C, RetainerBox_28) == 0x0002F0, "Member 'UWI_DeathGrayoutWrapper_C::RetainerBox_28' has a wrong offset!");
static_assert(offsetof(UWI_DeathGrayoutWrapper_C, Preview) == 0x0002F8, "Member 'UWI_DeathGrayoutWrapper_C::Preview' has a wrong offset!");

}

