#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DeathGrayoutWrapper

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_DeathGrayoutWrapper.WI_DeathGrayoutWrapper_C.ExecuteUbergraph_WI_DeathGrayoutWrapper
// 0x0028 (0x0028 - 0x0000)
struct WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper) == 0x000008, "Wrong alignment on WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper");
static_assert(sizeof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper) == 0x000028, "Wrong size on WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, EntryPoint) == 0x000000, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, Temp_bool_Variable) == 0x000004, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, Temp_object_Variable) == 0x000008, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, Temp_object_Variable_1) == 0x000010, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, K2Node_CustomEvent_bEnabled) == 0x000018, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::K2Node_CustomEvent_bEnabled' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, K2Node_Event_IsDesignTime) == 0x000019, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper, K2Node_Select_Default) == 0x000020, "Member 'WI_DeathGrayoutWrapper_C_ExecuteUbergraph_WI_DeathGrayoutWrapper::K2Node_Select_Default' has a wrong offset!");

// Function WI_DeathGrayoutWrapper.WI_DeathGrayoutWrapper_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_DeathGrayoutWrapper_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeathGrayoutWrapper_C_PreConstruct) == 0x000001, "Wrong alignment on WI_DeathGrayoutWrapper_C_PreConstruct");
static_assert(sizeof(WI_DeathGrayoutWrapper_C_PreConstruct) == 0x000001, "Wrong size on WI_DeathGrayoutWrapper_C_PreConstruct");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_DeathGrayoutWrapper_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_DeathGrayoutWrapper.WI_DeathGrayoutWrapper_C.SetGrayoutEnabled
// 0x0001 (0x0001 - 0x0000)
struct WI_DeathGrayoutWrapper_C_SetGrayoutEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeathGrayoutWrapper_C_SetGrayoutEnabled) == 0x000001, "Wrong alignment on WI_DeathGrayoutWrapper_C_SetGrayoutEnabled");
static_assert(sizeof(WI_DeathGrayoutWrapper_C_SetGrayoutEnabled) == 0x000001, "Wrong size on WI_DeathGrayoutWrapper_C_SetGrayoutEnabled");
static_assert(offsetof(WI_DeathGrayoutWrapper_C_SetGrayoutEnabled, bEnabled) == 0x000000, "Member 'WI_DeathGrayoutWrapper_C_SetGrayoutEnabled::bEnabled' has a wrong offset!");

}

