#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ExperienceIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_ExperienceIcon.WI_ExperienceIcon_C.ExecuteUbergraph_WI_ExperienceIcon
// 0x0020 (0x0020 - 0x0000)
struct WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Level;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Unlocked;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon) == 0x000008, "Wrong alignment on WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon");
static_assert(sizeof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon) == 0x000020, "Wrong size on WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, EntryPoint) == 0x000000, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, Temp_byte_Variable) == 0x000004, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, Temp_byte_Variable_1) == 0x000005, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, K2Node_CustomEvent_Level) == 0x000008, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, K2Node_CustomEvent_Unlocked) == 0x000010, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::K2Node_CustomEvent_Unlocked' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, Temp_bool_Variable) == 0x000011, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, K2Node_CustomEvent_NewValue) == 0x000014, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, K2Node_Select_Default) == 0x000018, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x00001C, "Member 'WI_ExperienceIcon_C_ExecuteUbergraph_WI_ExperienceIcon::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");

// Function WI_ExperienceIcon.WI_ExperienceIcon_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct WI_ExperienceIcon_C_SetLevel final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ExperienceIcon_C_SetLevel) == 0x000004, "Wrong alignment on WI_ExperienceIcon_C_SetLevel");
static_assert(sizeof(WI_ExperienceIcon_C_SetLevel) == 0x000004, "Wrong size on WI_ExperienceIcon_C_SetLevel");
static_assert(offsetof(WI_ExperienceIcon_C_SetLevel, NewValue) == 0x000000, "Member 'WI_ExperienceIcon_C_SetLevel::NewValue' has a wrong offset!");

// Function WI_ExperienceIcon.WI_ExperienceIcon_C.SetLevelRequirement
// 0x0010 (0x0010 - 0x0000)
struct WI_ExperienceIcon_C_SetLevelRequirement final
{
public:
	double                                        Level;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unlocked_0;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ExperienceIcon_C_SetLevelRequirement) == 0x000008, "Wrong alignment on WI_ExperienceIcon_C_SetLevelRequirement");
static_assert(sizeof(WI_ExperienceIcon_C_SetLevelRequirement) == 0x000010, "Wrong size on WI_ExperienceIcon_C_SetLevelRequirement");
static_assert(offsetof(WI_ExperienceIcon_C_SetLevelRequirement, Level) == 0x000000, "Member 'WI_ExperienceIcon_C_SetLevelRequirement::Level' has a wrong offset!");
static_assert(offsetof(WI_ExperienceIcon_C_SetLevelRequirement, Unlocked_0) == 0x000008, "Member 'WI_ExperienceIcon_C_SetLevelRequirement::Unlocked_0' has a wrong offset!");

}

