#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_EventLog

#include "Basic.hpp"

#include "S_EventMessageParams_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_EventLog.WI_EventLog_C.ExecuteUbergraph_WI_EventLog
// 0x00C0 (0x00C0 - 0x0000)
struct WI_EventLog_C_ExecuteUbergraph_WI_EventLog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EventMessageParams                  K2Node_CustomEvent_Message;                        // 0x0008(0x0028)(HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0058(0x0058)()
	class UBP_PrintPlayerMessageEntry_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog) == 0x000008, "Wrong alignment on WI_EventLog_C_ExecuteUbergraph_WI_EventLog");
static_assert(sizeof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog) == 0x0000C0, "Wrong size on WI_EventLog_C_ExecuteUbergraph_WI_EventLog");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, EntryPoint) == 0x000000, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, K2Node_CustomEvent_Message) == 0x000008, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_GetListItems_ReturnValue) == 0x000030, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_Array_Get_Item) == 0x000040, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, K2Node_MakeStruct_PlayerMessage) == 0x000058, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_SpawnObject_ReturnValue) == 0x0000B0, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_GetNumItems_ReturnValue) == 0x0000B8, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EventLog_C_ExecuteUbergraph_WI_EventLog, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BC, "Member 'WI_EventLog_C_ExecuteUbergraph_WI_EventLog::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WI_EventLog.WI_EventLog_C.SendMessage
// 0x0028 (0x0028 - 0x0000)
struct WI_EventLog_C_SendMessage final
{
public:
	struct FS_EventMessageParams                  Message;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_EventLog_C_SendMessage) == 0x000008, "Wrong alignment on WI_EventLog_C_SendMessage");
static_assert(sizeof(WI_EventLog_C_SendMessage) == 0x000028, "Wrong size on WI_EventLog_C_SendMessage");
static_assert(offsetof(WI_EventLog_C_SendMessage, Message) == 0x000000, "Member 'WI_EventLog_C_SendMessage::Message' has a wrong offset!");

}

