#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_EquippedItemIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_EquippedItemIcon.WI_EquippedItemIcon_C
// 0x0030 (0x0310 - 0x02E0)
class UWI_EquippedItemIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BG;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipmentInstance*                     EquippedItem;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          Item_Instance;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Bind_Delegates(class AActor* Pawn);
	void Construct();
	void Equipped(class UEquipmentInstance* Equipment_Instance);
	void ExecuteUbergraph_WI_EquippedItemIcon(int32 EntryPoint);
	void OnEquipped(class UEquipmentInstance* Instance);
	void OnStarted_B3F820314EFF311FC1749F844614902C();
	void OnUnequipped(class UEquipmentInstance* Instance);
	void Reconstruct(class APawn* OldPawn, class APawn* NewPawn);
	void SetBackgroundColorFromCategory(const EShopItemCategory Input);
	void SetCategoryCosmetics();
	void Unequipped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_EquippedItemIcon_C">();
	}
	static class UWI_EquippedItemIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_EquippedItemIcon_C>();
	}
};
static_assert(alignof(UWI_EquippedItemIcon_C) == 0x000008, "Wrong alignment on UWI_EquippedItemIcon_C");
static_assert(sizeof(UWI_EquippedItemIcon_C) == 0x000310, "Wrong size on UWI_EquippedItemIcon_C");
static_assert(offsetof(UWI_EquippedItemIcon_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_EquippedItemIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_EquippedItemIcon_C, Icon) == 0x0002E8, "Member 'UWI_EquippedItemIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_EquippedItemIcon_C, Icon_BG) == 0x0002F0, "Member 'UWI_EquippedItemIcon_C::Icon_BG' has a wrong offset!");
static_assert(offsetof(UWI_EquippedItemIcon_C, ImageBackground) == 0x0002F8, "Member 'UWI_EquippedItemIcon_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UWI_EquippedItemIcon_C, EquippedItem) == 0x000300, "Member 'UWI_EquippedItemIcon_C::EquippedItem' has a wrong offset!");
static_assert(offsetof(UWI_EquippedItemIcon_C, Item_Instance) == 0x000308, "Member 'UWI_EquippedItemIcon_C::Item_Instance' has a wrong offset!");

}

