#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesPurchaseConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_FinancesPurchaseConfirmation.WI_FinancesPurchaseConfirmation_C
// 0x0030 (0x0460 - 0x0430)
class UWI_FinancesPurchaseConfirmation_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BodyText;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         WI_JPButton;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_FinancesPurchaseConfirmation(int32 EntryPoint);
	void OnClicked__DelegateSignature();
	void SetPurchaseInformation(bool WalletUpdateSucceeded, const struct FPlatformStoreOffer& StoreOffer, const class FString& TransactionId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_FinancesPurchaseConfirmation_C">();
	}
	static class UWI_FinancesPurchaseConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_FinancesPurchaseConfirmation_C>();
	}
};
static_assert(alignof(UWI_FinancesPurchaseConfirmation_C) == 0x000008, "Wrong alignment on UWI_FinancesPurchaseConfirmation_C");
static_assert(sizeof(UWI_FinancesPurchaseConfirmation_C) == 0x000460, "Wrong size on UWI_FinancesPurchaseConfirmation_C");
static_assert(offsetof(UWI_FinancesPurchaseConfirmation_C, UberGraphFrame) == 0x000430, "Member 'UWI_FinancesPurchaseConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseConfirmation_C, BodyText) == 0x000438, "Member 'UWI_FinancesPurchaseConfirmation_C::BodyText' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseConfirmation_C, HeaderText) == 0x000440, "Member 'UWI_FinancesPurchaseConfirmation_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseConfirmation_C, WI_JPButton) == 0x000448, "Member 'UWI_FinancesPurchaseConfirmation_C::WI_JPButton' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseConfirmation_C, OnClicked) == 0x000450, "Member 'UWI_FinancesPurchaseConfirmation_C::OnClicked' has a wrong offset!");

}

