#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesBundlePurchaseList

#include "Basic.hpp"

#include "IWOnlineServices_structs.hpp"


namespace SDK::Params
{

// Function WI_FinancesBundlePurchaseList.WI_FinancesBundlePurchaseList_C.ExecuteUbergraph_WI_FinancesBundlePurchaseList
// 0x00F8 (0x00F8 - 0x0000)
struct WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlatformStoreOffer>            K2Node_Event_PlatformStoreOffers;                  // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FPlatformStoreOffer                    CallFunc_Array_Get_Item;                           // 0x0028(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset; // 0x0070(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_CurrencyPurchaseCard_C*             CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0028)(HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CurrencyPurchaseCard_C*             CallFunc_Create_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList) == 0x000008, "Wrong alignment on WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList");
static_assert(sizeof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList) == 0x0000F8, "Wrong size on WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, EntryPoint) == 0x000000, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000015, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, K2Node_Event_IsDesignTime) == 0x000016, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, K2Node_Event_PlatformStoreOffers) == 0x000018, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::K2Node_Event_PlatformStoreOffers' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset) == 0x000070, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue) == 0x000098, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, Temp_int_Loop_Counter_Variable_1) == 0x00009C, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_AddChild_ReturnValue) == 0x0000E0, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_Create_ReturnValue_1) == 0x0000E8, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList, CallFunc_AddChild_ReturnValue_1) == 0x0000F0, "Member 'WI_FinancesBundlePurchaseList_C_ExecuteUbergraph_WI_FinancesBundlePurchaseList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function WI_FinancesBundlePurchaseList.WI_FinancesBundlePurchaseList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_FinancesBundlePurchaseList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesBundlePurchaseList_C_PreConstruct) == 0x000001, "Wrong alignment on WI_FinancesBundlePurchaseList_C_PreConstruct");
static_assert(sizeof(WI_FinancesBundlePurchaseList_C_PreConstruct) == 0x000001, "Wrong size on WI_FinancesBundlePurchaseList_C_PreConstruct");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_FinancesBundlePurchaseList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_FinancesBundlePurchaseList.WI_FinancesBundlePurchaseList_C.SetStoreOffers
// 0x0010 (0x0010 - 0x0000)
struct WI_FinancesBundlePurchaseList_C_SetStoreOffers final
{
public:
	TArray<struct FPlatformStoreOffer>            PlatformStoreOffers;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_FinancesBundlePurchaseList_C_SetStoreOffers) == 0x000008, "Wrong alignment on WI_FinancesBundlePurchaseList_C_SetStoreOffers");
static_assert(sizeof(WI_FinancesBundlePurchaseList_C_SetStoreOffers) == 0x000010, "Wrong size on WI_FinancesBundlePurchaseList_C_SetStoreOffers");
static_assert(offsetof(WI_FinancesBundlePurchaseList_C_SetStoreOffers, PlatformStoreOffers) == 0x000000, "Member 'WI_FinancesBundlePurchaseList_C_SetStoreOffers::PlatformStoreOffers' has a wrong offset!");

}

