#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesScreen

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_Message_TabOpened_structs.hpp"


namespace SDK::Params
{

// Function WI_FinancesScreen.WI_FinancesScreen_C.ExecuteUbergraph_WI_FinancesScreen
// 0x0060 (0x0060 - 0x0000)
struct WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen) == 0x000008, "Wrong alignment on WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen");
static_assert(sizeof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen) == 0x000060, "Wrong size on WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, EntryPoint) == 0x000000, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, Temp_struct_Variable) == 0x000004, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, K2Node_CustomEvent_ProxyObject) == 0x000010, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, K2Node_CustomEvent_ActualChannel) == 0x000018, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, Temp_struct_Variable_1) == 0x000030, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, Temp_struct_Variable_2) == 0x000038, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, Temp_object_Variable) == 0x000040, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, CallFunc_GetPayload_ReturnValue) == 0x000049, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000050, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WI_FinancesScreen_C_ExecuteUbergraph_WI_FinancesScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_FinancesScreen.WI_FinancesScreen_C.OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3
// 0x0010 (0x0010 - 0x0000)
struct WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3) == 0x000008, "Wrong alignment on WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3");
static_assert(sizeof(WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3) == 0x000010, "Wrong size on WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3");
static_assert(offsetof(WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3, ProxyObject) == 0x000000, "Member 'WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3, ActualChannel) == 0x000008, "Member 'WI_FinancesScreen_C_OnMessageReceived_E0F96DCB475C30E53F1F0D887C3FBBA3::ActualChannel' has a wrong offset!");

}

