#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Finances

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"
#include "IWOnlineServices_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Finances.WI_Finances_C
// 0x0040 (0x0358 - 0x0318)
class UWI_Finances_C final : public UFinancesWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Currency_C*                         WI_Currency;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DesignerPreviewIsLoading;                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_FinancesThrobber_C*                 Throbber;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsModal;                                           // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowWalletCurrency;                                // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowRequiredCurrency;                              // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequiredCurrencyAmount;                            // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPurchaseConfirmed;                               // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ChangeThrobberMessage(const EPlatformStoreState StoreState);
	void DismissThrobber();
	void ExecuteUbergraph_WI_Finances(int32 EntryPoint);
	void OnLoaded_8101B2004735CA6DF704D58E812F1A70(class UObject* Loaded);
	void OnPurchaseConfirmationClick();
	void OnPurchaseConfirmed__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetIsModal(bool IsModal_0);
	void SetRequiredCurrency(int32 RequiredCurrencyAmount_0);
	void SetShowRequiredCurrency(bool ShowRequiredCurrency_0);
	void SetShowWalletCurrency(bool ShowWalletCurrency_0);
	void SetWalletCurrency(bool ShowWalletCurrency_0);
	void ShowPurchaseErrorModal(const EPlatformStoreState StoreState, const class FString& TransactionId);
	void ShowPurchaseSuccessModal(const bool bWalletUpdateSucceeded, const struct FPlatformStoreOffer& StoreOffer, const class FString& TransactionId);
	void ShowThrobber();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Finances_C">();
	}
	static class UWI_Finances_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Finances_C>();
	}
};
static_assert(alignof(UWI_Finances_C) == 0x000008, "Wrong alignment on UWI_Finances_C");
static_assert(sizeof(UWI_Finances_C) == 0x000358, "Wrong size on UWI_Finances_C");
static_assert(offsetof(UWI_Finances_C, UberGraphFrame) == 0x000318, "Member 'UWI_Finances_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, BackgroundBlur) == 0x000320, "Member 'UWI_Finances_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, WI_Currency) == 0x000328, "Member 'UWI_Finances_C::WI_Currency' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, DesignerPreviewIsLoading) == 0x000330, "Member 'UWI_Finances_C::DesignerPreviewIsLoading' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, Throbber) == 0x000338, "Member 'UWI_Finances_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, IsModal) == 0x000340, "Member 'UWI_Finances_C::IsModal' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, ShowWalletCurrency) == 0x000341, "Member 'UWI_Finances_C::ShowWalletCurrency' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, ShowRequiredCurrency) == 0x000342, "Member 'UWI_Finances_C::ShowRequiredCurrency' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, RequiredCurrencyAmount) == 0x000344, "Member 'UWI_Finances_C::RequiredCurrencyAmount' has a wrong offset!");
static_assert(offsetof(UWI_Finances_C, OnPurchaseConfirmed) == 0x000348, "Member 'UWI_Finances_C::OnPurchaseConfirmed' has a wrong offset!");

}

