#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_GenericCardButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WI_GenericCardButton.WI_GenericCardButton_C.ExecuteUbergraph_WI_GenericCardButton
// 0x0018 (0x0018 - 0x0000)
struct WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton");
static_assert(sizeof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton) == 0x000018, "Wrong size on WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton");
static_assert(offsetof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton, EntryPoint) == 0x000000, "Member 'WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WI_GenericCardButton_C_ExecuteUbergraph_WI_GenericCardButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.OnCardButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature final
{
public:
	class UWI_GenericCardButton_C*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature");
static_assert(sizeof(WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature");
static_assert(offsetof(WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature, Widget) == 0x000000, "Member 'WI_GenericCardButton_C_OnCardButtonClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_GenericCardButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_PreConstruct");
static_assert(sizeof(WI_GenericCardButton_C_PreConstruct) == 0x000001, "Wrong size on WI_GenericCardButton_C_PreConstruct");
static_assert(offsetof(WI_GenericCardButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_GenericCardButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardOuterMargin
// 0x0018 (0x0018 - 0x0000)
struct WI_GenericCardButton_C_SetCardOuterMargin final
{
public:
	struct FMargin                                CardOuterMargin_0;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardOuterMargin) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardOuterMargin");
static_assert(sizeof(WI_GenericCardButton_C_SetCardOuterMargin) == 0x000018, "Wrong size on WI_GenericCardButton_C_SetCardOuterMargin");
static_assert(offsetof(WI_GenericCardButton_C_SetCardOuterMargin, CardOuterMargin_0) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardOuterMargin::CardOuterMargin_0' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetCardOuterMargin, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'WI_GenericCardButton_C_SetCardOuterMargin::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectBackground
// 0x0028 (0x0028 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectBackground final
{
public:
	TSoftObjectPtr<class UTexture2D>              CardSubjectBackgroundTexture_0;                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectBackground) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectBackground");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectBackground) == 0x000028, "Wrong size on WI_GenericCardButton_C_SetCardSubjectBackground");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectBackground, CardSubjectBackgroundTexture_0) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectBackground::CardSubjectBackgroundTexture_0' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectBackgroundTint
// 0x0014 (0x0014 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectBackgroundTint final
{
public:
	struct FSlateColor                            Card_Subject_Background_Tint;                      // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectBackgroundTint) == 0x000004, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectBackgroundTint");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectBackgroundTint) == 0x000014, "Wrong size on WI_GenericCardButton_C_SetCardSubjectBackgroundTint");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectBackgroundTint, Card_Subject_Background_Tint) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectBackgroundTint::Card_Subject_Background_Tint' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectPadding
// 0x0018 (0x0018 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectPadding) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectPadding");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectPadding) == 0x000018, "Wrong size on WI_GenericCardButton_C_SetCardSubjectPadding");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectPadding, InPadding) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectPadding::InPadding' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectPadding, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'WI_GenericCardButton_C_SetCardSubjectPadding::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectSoftTexture
// 0x0028 (0x0028 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectSoftTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              CardSubjectTexture_0;                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectSoftTexture) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectSoftTexture");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectSoftTexture) == 0x000028, "Wrong size on WI_GenericCardButton_C_SetCardSubjectSoftTexture");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectSoftTexture, CardSubjectTexture_0) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectSoftTexture::CardSubjectTexture_0' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectStretchMode
// 0x0001 (0x0001 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectStretchMode final
{
public:
	EStretch                                      InStretch;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectStretchMode) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectStretchMode");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectStretchMode) == 0x000001, "Wrong size on WI_GenericCardButton_C_SetCardSubjectStretchMode");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectStretchMode, InStretch) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectStretchMode::InStretch' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectVerticalAlignment
// 0x0010 (0x0010 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectVerticalAlignment final
{
public:
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBoxSlot*                          CallFunc_SlotAsScaleBoxSlot_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectVerticalAlignment) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectVerticalAlignment");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectVerticalAlignment) == 0x000010, "Wrong size on WI_GenericCardButton_C_SetCardSubjectVerticalAlignment");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectVerticalAlignment, VerticalAlignment) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectVerticalAlignment::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectVerticalAlignment, CallFunc_SlotAsScaleBoxSlot_ReturnValue) == 0x000008, "Member 'WI_GenericCardButton_C_SetCardSubjectVerticalAlignment::CallFunc_SlotAsScaleBoxSlot_ReturnValue' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetCardSubjectVisibility
// 0x0018 (0x0018 - 0x0000)
struct WI_GenericCardButton_C_SetCardSubjectVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetCardSubjectVisibility) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetCardSubjectVisibility");
static_assert(sizeof(WI_GenericCardButton_C_SetCardSubjectVisibility) == 0x000018, "Wrong size on WI_GenericCardButton_C_SetCardSubjectVisibility");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectVisibility, bIsVisible) == 0x000000, "Member 'WI_GenericCardButton_C_SetCardSubjectVisibility::bIsVisible' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectVisibility, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WI_GenericCardButton_C_SetCardSubjectVisibility::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetCardSubjectVisibility, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x000010, "Member 'WI_GenericCardButton_C_SetCardSubjectVisibility::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetShowCheckmarkIcon
// 0x0005 (0x0005 - 0x0000)
struct WI_GenericCardButton_C_SetShowCheckmarkIcon final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetShowCheckmarkIcon) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_SetShowCheckmarkIcon");
static_assert(sizeof(WI_GenericCardButton_C_SetShowCheckmarkIcon) == 0x000005, "Wrong size on WI_GenericCardButton_C_SetShowCheckmarkIcon");
static_assert(offsetof(WI_GenericCardButton_C_SetShowCheckmarkIcon, Show) == 0x000000, "Member 'WI_GenericCardButton_C_SetShowCheckmarkIcon::Show' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowCheckmarkIcon, Temp_bool_Variable) == 0x000001, "Member 'WI_GenericCardButton_C_SetShowCheckmarkIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowCheckmarkIcon, Temp_byte_Variable) == 0x000002, "Member 'WI_GenericCardButton_C_SetShowCheckmarkIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowCheckmarkIcon, Temp_byte_Variable_1) == 0x000003, "Member 'WI_GenericCardButton_C_SetShowCheckmarkIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowCheckmarkIcon, K2Node_Select_Default) == 0x000004, "Member 'WI_GenericCardButton_C_SetShowCheckmarkIcon::K2Node_Select_Default' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetShowHoverFrame
// 0x0005 (0x0005 - 0x0000)
struct WI_GenericCardButton_C_SetShowHoverFrame final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetShowHoverFrame) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_SetShowHoverFrame");
static_assert(sizeof(WI_GenericCardButton_C_SetShowHoverFrame) == 0x000005, "Wrong size on WI_GenericCardButton_C_SetShowHoverFrame");
static_assert(offsetof(WI_GenericCardButton_C_SetShowHoverFrame, Show) == 0x000000, "Member 'WI_GenericCardButton_C_SetShowHoverFrame::Show' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowHoverFrame, Temp_bool_Variable) == 0x000001, "Member 'WI_GenericCardButton_C_SetShowHoverFrame::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowHoverFrame, Temp_byte_Variable) == 0x000002, "Member 'WI_GenericCardButton_C_SetShowHoverFrame::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowHoverFrame, Temp_byte_Variable_1) == 0x000003, "Member 'WI_GenericCardButton_C_SetShowHoverFrame::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowHoverFrame, K2Node_Select_Default) == 0x000004, "Member 'WI_GenericCardButton_C_SetShowHoverFrame::K2Node_Select_Default' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetShowLockedIcon
// 0x0005 (0x0005 - 0x0000)
struct WI_GenericCardButton_C_SetShowLockedIcon final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetShowLockedIcon) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_SetShowLockedIcon");
static_assert(sizeof(WI_GenericCardButton_C_SetShowLockedIcon) == 0x000005, "Wrong size on WI_GenericCardButton_C_SetShowLockedIcon");
static_assert(offsetof(WI_GenericCardButton_C_SetShowLockedIcon, Show) == 0x000000, "Member 'WI_GenericCardButton_C_SetShowLockedIcon::Show' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowLockedIcon, Temp_bool_Variable) == 0x000001, "Member 'WI_GenericCardButton_C_SetShowLockedIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowLockedIcon, Temp_byte_Variable) == 0x000002, "Member 'WI_GenericCardButton_C_SetShowLockedIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowLockedIcon, Temp_byte_Variable_1) == 0x000003, "Member 'WI_GenericCardButton_C_SetShowLockedIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_GenericCardButton_C_SetShowLockedIcon, K2Node_Select_Default) == 0x000004, "Member 'WI_GenericCardButton_C_SetShowLockedIcon::K2Node_Select_Default' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetShowNewIcon
// 0x0001 (0x0001 - 0x0000)
struct WI_GenericCardButton_C_SetShowNewIcon final
{
public:
	bool                                          ShowNewIcon_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_GenericCardButton_C_SetShowNewIcon) == 0x000001, "Wrong alignment on WI_GenericCardButton_C_SetShowNewIcon");
static_assert(sizeof(WI_GenericCardButton_C_SetShowNewIcon) == 0x000001, "Wrong size on WI_GenericCardButton_C_SetShowNewIcon");
static_assert(offsetof(WI_GenericCardButton_C_SetShowNewIcon, ShowNewIcon_0) == 0x000000, "Member 'WI_GenericCardButton_C_SetShowNewIcon::ShowNewIcon_0' has a wrong offset!");

// Function WI_GenericCardButton.WI_GenericCardButton_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WI_GenericCardButton_C_SetTitle final
{
public:
	class FText                                   Title_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_GenericCardButton_C_SetTitle) == 0x000008, "Wrong alignment on WI_GenericCardButton_C_SetTitle");
static_assert(sizeof(WI_GenericCardButton_C_SetTitle) == 0x000010, "Wrong size on WI_GenericCardButton_C_SetTitle");
static_assert(offsetof(WI_GenericCardButton_C_SetTitle, Title_0) == 0x000000, "Member 'WI_GenericCardButton_C_SetTitle::Title_0' has a wrong offset!");

}

