#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseScreen

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "S_Message_TabOpened_structs.hpp"


namespace SDK::Params
{

// Function WI_HouseScreen.WI_HouseScreen_C.AddHouseWidget
// 0x0030 (0x0030 - 0x0000)
struct WI_HouseScreen_C_AddHouseWidget final
{
public:
	class UWI_HouseButton_C*                      Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_HouseButton_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_AddHouseWidget) == 0x000008, "Wrong alignment on WI_HouseScreen_C_AddHouseWidget");
static_assert(sizeof(WI_HouseScreen_C_AddHouseWidget) == 0x000030, "Wrong size on WI_HouseScreen_C_AddHouseWidget");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidget, Widget) == 0x000000, "Member 'WI_HouseScreen_C_AddHouseWidget::Widget' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_HouseScreen_C_AddHouseWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WI_HouseScreen_C_AddHouseWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidget, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WI_HouseScreen_C_AddHouseWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidget, CallFunc_Array_AddUnique_ReturnValue) == 0x000028, "Member 'WI_HouseScreen_C_AddHouseWidget::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.AddHouseWidgets
// 0x0110 (0x0110 - 0x0000)
struct WI_HouseScreen_C_AddHouseWidgets final
{
public:
	struct FHouseOnlineServicesContainer          ActiveHouses_0;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FOnlineStoreItemData>           OwnedHouses;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FOnlineStoreItemData>           UnownedHouses;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetHouseID_ReturnValue;                   // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHouseOnlineServicesData               CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_HouseButton_C*                      CallFunc_AddHouseWidget_Widget;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetMatchingStoreData_MatchFound;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_TryGetMatchingStoreData_MatchingStoreItemData; // 0x00C0(0x0048)()
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_AddHouseWidgets) == 0x000008, "Wrong alignment on WI_HouseScreen_C_AddHouseWidgets");
static_assert(sizeof(WI_HouseScreen_C_AddHouseWidgets) == 0x000110, "Wrong size on WI_HouseScreen_C_AddHouseWidgets");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, ActiveHouses_0) == 0x000000, "Member 'WI_HouseScreen_C_AddHouseWidgets::ActiveHouses_0' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, OwnedHouses) == 0x000010, "Member 'WI_HouseScreen_C_AddHouseWidgets::OwnedHouses' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, UnownedHouses) == 0x000020, "Member 'WI_HouseScreen_C_AddHouseWidgets::UnownedHouses' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WI_HouseScreen_C_AddHouseWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WI_HouseScreen_C_AddHouseWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_GetHouseID_ReturnValue) == 0x000048, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_GetHouseID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_Array_Get_Item) == 0x000050, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x000060, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x000088, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000090, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_Array_AddUnique_ReturnValue) == 0x000098, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, K2Node_DynamicCast_AsHouse_Definition) == 0x0000A0, "Member 'WI_HouseScreen_C_AddHouseWidgets::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WI_HouseScreen_C_AddHouseWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_AddHouseWidget_Widget) == 0x0000B0, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_AddHouseWidget_Widget' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_TryGetMatchingStoreData_MatchFound) == 0x0000B8, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_TryGetMatchingStoreData_MatchFound' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_TryGetMatchingStoreData_MatchingStoreItemData) == 0x0000C0, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_TryGetMatchingStoreData_MatchingStoreItemData' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgets, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000108, "Member 'WI_HouseScreen_C_AddHouseWidgets::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.AddHouseWidgetsForDefinitions
// 0x0078 (0x0078 - 0x0000)
struct WI_HouseScreen_C_AddHouseWidgetsForDefinitions final
{
public:
	TArray<TSoftObjectPtr<class UHouseDefinition>> House_Definitions;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_HouseButton_C*                      CallFunc_AddHouseWidget_Widget;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions) == 0x000008, "Wrong alignment on WI_HouseScreen_C_AddHouseWidgetsForDefinitions");
static_assert(sizeof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions) == 0x000078, "Wrong size on WI_HouseScreen_C_AddHouseWidgetsForDefinitions");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, House_Definitions) == 0x000000, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::House_Definitions' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_Array_Get_Item) == 0x000020, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000050, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, K2Node_DynamicCast_AsHouse_Definition) == 0x000060, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000069, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_AddHouseWidgetsForDefinitions, CallFunc_AddHouseWidget_Widget) == 0x000070, "Member 'WI_HouseScreen_C_AddHouseWidgetsForDefinitions::CallFunc_AddHouseWidget_Widget' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.ExecuteUbergraph_WI_HouseScreen
// 0x0180 (0x0180 - 0x0000)
struct WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_ButtonWidget;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_HouseButton_C*                      K2Node_DynamicCast_AsWI_House_Button;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_HouseScreen_HousePreviewPopup_C*    K2Node_DynamicCast_AsWI_House_Screen_House_Preview_Popup; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable_2;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FOnlineStoreItemData>& OwnedItems, TArray<struct FOnlineStoreItemData>& UnownedItems)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_OwnedItems;                     // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_UnownedItems;                   // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	struct FHouseOnlineServicesContainer          CallFunc_GetActiveHouses_ReturnValue;              // 0x00F8(0x0010)(ConstParm)
	TDelegate<void(const struct FGameplayTag& HouseID)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FOnlineStoreItemData& UnlockedItemData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_HouseID;                        // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   K2Node_CustomEvent_UnlockedItemData;               // 0x0138(0x0048)()
};
static_assert(alignof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen) == 0x000008, "Wrong alignment on WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen");
static_assert(sizeof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen) == 0x000180, "Wrong size on WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, EntryPoint) == 0x000000, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_struct_Variable) == 0x000028, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_struct_Variable_1) == 0x000030, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_object_Variable) == 0x000040, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000048, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000068, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000070, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_bool_IsClosed_Variable) == 0x000071, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_Event_IsDesignTime) == 0x000072, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_ButtonWidget) == 0x000088, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_ButtonWidget' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_DynamicCast_AsWI_House_Button) == 0x000090, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_DynamicCast_AsWI_House_Button' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x0000A0, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_DynamicCast_AsWI_House_Screen_House_Preview_Popup) == 0x0000A8, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_DynamicCast_AsWI_House_Screen_House_Preview_Popup' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_Array_Find_ReturnValue) == 0x0000B4, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, Temp_struct_Variable_2) == 0x0000B8, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_GetPayload_ReturnValue) == 0x0000C0, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_OwnedItems) == 0x0000D8, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_OwnedItems' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_UnownedItems) == 0x0000E8, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_UnownedItems' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_GetActiveHouses_ReturnValue) == 0x0000F8, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_GetActiveHouses_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, CallFunc_Array_Get_Item) == 0x000118, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000120, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_HouseID) == 0x000130, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_HouseID' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen, K2Node_CustomEvent_UnlockedItemData) == 0x000138, "Member 'WI_HouseScreen_C_ExecuteUbergraph_WI_HouseScreen::K2Node_CustomEvent_UnlockedItemData' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.HandleHouseWidgetClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_C_HandleHouseWidgetClicked final
{
public:
	class UCommonButtonBase*                      ButtonWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_HandleHouseWidgetClicked) == 0x000008, "Wrong alignment on WI_HouseScreen_C_HandleHouseWidgetClicked");
static_assert(sizeof(WI_HouseScreen_C_HandleHouseWidgetClicked) == 0x000008, "Wrong size on WI_HouseScreen_C_HandleHouseWidgetClicked");
static_assert(offsetof(WI_HouseScreen_C_HandleHouseWidgetClicked, ButtonWidget) == 0x000000, "Member 'WI_HouseScreen_C_HandleHouseWidgetClicked::ButtonWidget' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.Initialize
// 0x0020 (0x0020 - 0x0000)
struct WI_HouseScreen_C_Initialize final
{
public:
	TArray<struct FOnlineStoreItemData>           OwnedItems;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FOnlineStoreItemData>           UnownedItems;                                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_HouseScreen_C_Initialize) == 0x000008, "Wrong alignment on WI_HouseScreen_C_Initialize");
static_assert(sizeof(WI_HouseScreen_C_Initialize) == 0x000020, "Wrong size on WI_HouseScreen_C_Initialize");
static_assert(offsetof(WI_HouseScreen_C_Initialize, OwnedItems) == 0x000000, "Member 'WI_HouseScreen_C_Initialize::OwnedItems' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_Initialize, UnownedItems) == 0x000010, "Member 'WI_HouseScreen_C_Initialize::UnownedItems' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.OnEquipHouse
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_C_OnEquipHouse final
{
public:
	struct FGameplayTag                           HouseID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_OnEquipHouse) == 0x000004, "Wrong alignment on WI_HouseScreen_C_OnEquipHouse");
static_assert(sizeof(WI_HouseScreen_C_OnEquipHouse) == 0x000008, "Wrong size on WI_HouseScreen_C_OnEquipHouse");
static_assert(offsetof(WI_HouseScreen_C_OnEquipHouse, HouseID) == 0x000000, "Member 'WI_HouseScreen_C_OnEquipHouse::HouseID' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811
// 0x0010 (0x0010 - 0x0000)
struct WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811) == 0x000008, "Wrong alignment on WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811");
static_assert(sizeof(WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811) == 0x000010, "Wrong size on WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811");
static_assert(offsetof(WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811, ProxyObject) == 0x000000, "Member 'WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811, ActualChannel) == 0x000008, "Member 'WI_HouseScreen_C_OnMessageReceived_D4377C5C40A4BF24B1F7EAB0D0720811::ActualChannel' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.OnUnlockHouse
// 0x0048 (0x0048 - 0x0000)
struct WI_HouseScreen_C_OnUnlockHouse final
{
public:
	struct FOnlineStoreItemData                   UnlockedItemData;                                  // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_HouseScreen_C_OnUnlockHouse) == 0x000008, "Wrong alignment on WI_HouseScreen_C_OnUnlockHouse");
static_assert(sizeof(WI_HouseScreen_C_OnUnlockHouse) == 0x000048, "Wrong size on WI_HouseScreen_C_OnUnlockHouse");
static_assert(offsetof(WI_HouseScreen_C_OnUnlockHouse, UnlockedItemData) == 0x000000, "Member 'WI_HouseScreen_C_OnUnlockHouse::UnlockedItemData' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_HouseScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WI_HouseScreen_C_PreConstruct");
static_assert(sizeof(WI_HouseScreen_C_PreConstruct) == 0x000001, "Wrong size on WI_HouseScreen_C_PreConstruct");
static_assert(offsetof(WI_HouseScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_HouseScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.RefreshHouseWidgets
// 0x00E8 (0x00E8 - 0x0000)
struct WI_HouseScreen_C_RefreshHouseWidgets final
{
public:
	struct FGameplayTag                           EquippedHouseID;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetHouseID_ReturnValue;                   // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWI_HouseButton_C*                      CallFunc_AddHouseWidget_Widget;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_Map_Find_Value;                           // 0x0080(0x0048)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_RefreshHouseWidgets) == 0x000008, "Wrong alignment on WI_HouseScreen_C_RefreshHouseWidgets");
static_assert(sizeof(WI_HouseScreen_C_RefreshHouseWidgets) == 0x0000E8, "Wrong size on WI_HouseScreen_C_RefreshHouseWidgets");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, EquippedHouseID) == 0x000000, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::EquippedHouseID' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_GetHouseID_ReturnValue) == 0x000020, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_GetHouseID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_AddHouseWidget_Widget) == 0x000028, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_AddHouseWidget_Widget' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Array_Get_Item) == 0x000044, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00004D, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x000050, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x000078, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Map_Find_Value) == 0x000080, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D0, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, K2Node_DynamicCast_AsHouse_Definition) == 0x0000D8, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RefreshHouseWidgets, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WI_HouseScreen_C_RefreshHouseWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.RemoveAllHouseWidgets
// 0x0020 (0x0020 - 0x0000)
struct WI_HouseScreen_C_RemoveAllHouseWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_HouseButton_C*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_RemoveAllHouseWidgets) == 0x000008, "Wrong alignment on WI_HouseScreen_C_RemoveAllHouseWidgets");
static_assert(sizeof(WI_HouseScreen_C_RemoveAllHouseWidgets) == 0x000020, "Wrong size on WI_HouseScreen_C_RemoveAllHouseWidgets");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, CallFunc_Array_Get_Item) == 0x000010, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_RemoveAllHouseWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WI_HouseScreen_C_RemoveAllHouseWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen.WI_HouseScreen_C.TryGetMatchingStoreData
// 0x0148 (0x0148 - 0x0000)
struct WI_HouseScreen_C_TryGetMatchingStoreData final
{
public:
	struct FGameplayTag                           HouseID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineStoreItemData>           OwnedHouses;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FOnlineStoreItemData>           UnownedHouses;                                     // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          MatchFound;                                        // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   MatchingStoreItemData;                             // 0x0030(0x0048)(Parm, OutParm)
	bool                                          IsMatchingStoreItemDataSet;                        // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_Array_Get_Item;                           // 0x0098(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0048)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_C_TryGetMatchingStoreData) == 0x000008, "Wrong alignment on WI_HouseScreen_C_TryGetMatchingStoreData");
static_assert(sizeof(WI_HouseScreen_C_TryGetMatchingStoreData) == 0x000148, "Wrong size on WI_HouseScreen_C_TryGetMatchingStoreData");
static_assert(offsetof(WI_HouseScreen_C_TryGetMatchingStoreData, HouseID) == 0x000000, "Member 'WI_HouseScreen_C_TryGetMatchingStoreData::HouseID' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_TryGetMatchingStoreData, OwnedHouses) == 0x000008, "Member 'WI_HouseScreen_C_TryGetMatchingStoreData::OwnedHouses' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_C_TryGetMatchingStoreData, UnownedHouses) == 0x000018, "Member 'WI_HouseScreen_C_TryGetMatchingStoreData::UnownedHouses' has a wrong offset!");
