#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WI_GenericCardButton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HouseButton.WI_HouseButton_C
// 0x0080 (0x1750 - 0x16D0)
class UWI_HouseButton_C final : public UWI_GenericCardButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_HouseButton_C;                   // 0x16D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       OwnedText;                                         // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SinglePrice_C*                      Price;                                             // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            NormalBackgroundTint;                              // 0x16E8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            EpicBackgroundTint;                                // 0x16FC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Epic;                                              // 0x1710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1711[0x7];                                     // 0x1711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        DesignerPreviewHouseDefinition;                    // 0x1718(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x1740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1741[0x3];                                     // 0x1741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PriceAmount;                                       // 0x1744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceCurrency;                                     // 0x1748(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_HouseButton(int32 EntryPoint);
	void MatchHouseDefinition(class UHouseDefinition* HouseDefinition);
	void PreConstruct(bool IsDesignTime);
	void SetIsEquipped(bool IsEquipped);
	void SetIsOwned(bool IsOwned_0);
	void SetPrice(const struct FOnlineStoreItemCost& OnlineStoreItemCost);
	void SetStoreItemData(const struct FOnlineStoreItemData& StoreItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HouseButton_C">();
	}
	static class UWI_HouseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HouseButton_C>();
	}
};
static_assert(alignof(UWI_HouseButton_C) == 0x000010, "Wrong alignment on UWI_HouseButton_C");
static_assert(sizeof(UWI_HouseButton_C) == 0x001750, "Wrong size on UWI_HouseButton_C");
static_assert(offsetof(UWI_HouseButton_C, UberGraphFrame_WI_HouseButton_C) == 0x0016D0, "Member 'UWI_HouseButton_C::UberGraphFrame_WI_HouseButton_C' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, OwnedText) == 0x0016D8, "Member 'UWI_HouseButton_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, Price) == 0x0016E0, "Member 'UWI_HouseButton_C::Price' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, NormalBackgroundTint) == 0x0016E8, "Member 'UWI_HouseButton_C::NormalBackgroundTint' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, EpicBackgroundTint) == 0x0016FC, "Member 'UWI_HouseButton_C::EpicBackgroundTint' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, Epic) == 0x001710, "Member 'UWI_HouseButton_C::Epic' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, DesignerPreviewHouseDefinition) == 0x001718, "Member 'UWI_HouseButton_C::DesignerPreviewHouseDefinition' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, IsOwned) == 0x001740, "Member 'UWI_HouseButton_C::IsOwned' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, PriceAmount) == 0x001744, "Member 'UWI_HouseButton_C::PriceAmount' has a wrong offset!");
static_assert(offsetof(UWI_HouseButton_C, PriceCurrency) == 0x001748, "Member 'UWI_HouseButton_C::PriceCurrency' has a wrong offset!");

}

