#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HUD_Match

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_HUD_Match.WI_HUD_Match_C.ExecuteUbergraph_WI_HUD_Match
// 0x0004 (0x0004 - 0x0000)
struct WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match) == 0x000004, "Wrong alignment on WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match");
static_assert(sizeof(WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match) == 0x000004, "Wrong size on WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match");
static_assert(offsetof(WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match, EntryPoint) == 0x000000, "Member 'WI_HUD_Match_C_ExecuteUbergraph_WI_HUD_Match::EntryPoint' has a wrong offset!");

// Function WI_HUD_Match.WI_HUD_Match_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WI_HUD_Match_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HUD_Match_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WI_HUD_Match_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WI_HUD_Match_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WI_HUD_Match_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WI_HUD_Match_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WI_HUD_Match_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

