#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseButton

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_HouseButton.WI_HouseButton_C.ExecuteUbergraph_WI_HouseButton
// 0x0040 (0x0040 - 0x0000)
struct WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0008(0x0014)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemCost                   CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue; // 0x0034(0x000C)(NoDestructor)
};
static_assert(alignof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton) == 0x000008, "Wrong alignment on WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton");
static_assert(sizeof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton) == 0x000040, "Wrong size on WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, EntryPoint) == 0x000000, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000005, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, Temp_bool_Variable) == 0x000006, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, K2Node_Select_Default) == 0x000008, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000020, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, K2Node_DynamicCast_AsHouse_Definition) == 0x000028, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton, CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue) == 0x000034, "Member 'WI_HouseButton_C_ExecuteUbergraph_WI_HouseButton::CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.MatchHouseDefinition
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseButton_C_MatchHouseDefinition final
{
public:
	class UHouseDefinition*                       HouseDefinition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseButton_C_MatchHouseDefinition) == 0x000008, "Wrong alignment on WI_HouseButton_C_MatchHouseDefinition");
static_assert(sizeof(WI_HouseButton_C_MatchHouseDefinition) == 0x000008, "Wrong size on WI_HouseButton_C_MatchHouseDefinition");
static_assert(offsetof(WI_HouseButton_C_MatchHouseDefinition, HouseDefinition) == 0x000000, "Member 'WI_HouseButton_C_MatchHouseDefinition::HouseDefinition' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_HouseButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_HouseButton_C_PreConstruct");
static_assert(sizeof(WI_HouseButton_C_PreConstruct) == 0x000001, "Wrong size on WI_HouseButton_C_PreConstruct");
static_assert(offsetof(WI_HouseButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_HouseButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.SetIsEquipped
// 0x0001 (0x0001 - 0x0000)
struct WI_HouseButton_C_SetIsEquipped final
{
public:
	bool                                          IsEquipped;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseButton_C_SetIsEquipped) == 0x000001, "Wrong alignment on WI_HouseButton_C_SetIsEquipped");
static_assert(sizeof(WI_HouseButton_C_SetIsEquipped) == 0x000001, "Wrong size on WI_HouseButton_C_SetIsEquipped");
static_assert(offsetof(WI_HouseButton_C_SetIsEquipped, IsEquipped) == 0x000000, "Member 'WI_HouseButton_C_SetIsEquipped::IsEquipped' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.SetIsOwned
// 0x0009 (0x0009 - 0x0000)
struct WI_HouseButton_C_SetIsOwned final
{
public:
	bool                                          IsOwned_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseButton_C_SetIsOwned) == 0x000001, "Wrong alignment on WI_HouseButton_C_SetIsOwned");
static_assert(sizeof(WI_HouseButton_C_SetIsOwned) == 0x000009, "Wrong size on WI_HouseButton_C_SetIsOwned");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, IsOwned_0) == 0x000000, "Member 'WI_HouseButton_C_SetIsOwned::IsOwned_0' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_bool_Variable) == 0x000001, "Member 'WI_HouseButton_C_SetIsOwned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_byte_Variable) == 0x000002, "Member 'WI_HouseButton_C_SetIsOwned::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_byte_Variable_1) == 0x000003, "Member 'WI_HouseButton_C_SetIsOwned::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_bool_Variable_1) == 0x000004, "Member 'WI_HouseButton_C_SetIsOwned::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, K2Node_Select_Default) == 0x000005, "Member 'WI_HouseButton_C_SetIsOwned::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_byte_Variable_2) == 0x000006, "Member 'WI_HouseButton_C_SetIsOwned::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, Temp_byte_Variable_3) == 0x000007, "Member 'WI_HouseButton_C_SetIsOwned::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetIsOwned, K2Node_Select_Default_1) == 0x000008, "Member 'WI_HouseButton_C_SetIsOwned::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.SetPrice
// 0x000C (0x000C - 0x0000)
struct WI_HouseButton_C_SetPrice final
{
public:
	struct FOnlineStoreItemCost                   OnlineStoreItemCost;                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_HouseButton_C_SetPrice) == 0x000004, "Wrong alignment on WI_HouseButton_C_SetPrice");
static_assert(sizeof(WI_HouseButton_C_SetPrice) == 0x00000C, "Wrong size on WI_HouseButton_C_SetPrice");
static_assert(offsetof(WI_HouseButton_C_SetPrice, OnlineStoreItemCost) == 0x000000, "Member 'WI_HouseButton_C_SetPrice::OnlineStoreItemCost' has a wrong offset!");

// Function WI_HouseButton.WI_HouseButton_C.SetStoreItemData
// 0x0050 (0x0050 - 0x0000)
struct WI_HouseButton_C_SetStoreItemData final
{
public:
	struct FOnlineStoreItemData                   StoreItemData;                                     // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseButton_C_SetStoreItemData) == 0x000008, "Wrong alignment on WI_HouseButton_C_SetStoreItemData");
static_assert(sizeof(WI_HouseButton_C_SetStoreItemData) == 0x000050, "Wrong size on WI_HouseButton_C_SetStoreItemData");
static_assert(offsetof(WI_HouseButton_C_SetStoreItemData, StoreItemData) == 0x000000, "Member 'WI_HouseButton_C_SetStoreItemData::StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_HouseButton_C_SetStoreItemData, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WI_HouseButton_C_SetStoreItemData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

