#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseLevel

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_HouseLevel.WI_HouseLevel_C.ExecuteUbergraph_WI_HouseLevel
// 0x000C (0x000C - 0x0000)
struct WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Level;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel) == 0x000004, "Wrong alignment on WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel");
static_assert(sizeof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel) == 0x00000C, "Wrong size on WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel");
static_assert(offsetof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel, EntryPoint) == 0x000000, "Member 'WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel, K2Node_CustomEvent_Level) == 0x000008, "Member 'WI_HouseLevel_C_ExecuteUbergraph_WI_HouseLevel::K2Node_CustomEvent_Level' has a wrong offset!");

// Function WI_HouseLevel.WI_HouseLevel_C.On_UpdateHouseLevel
// 0x0004 (0x0004 - 0x0000)
struct WI_HouseLevel_C_On_UpdateHouseLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseLevel_C_On_UpdateHouseLevel) == 0x000004, "Wrong alignment on WI_HouseLevel_C_On_UpdateHouseLevel");
static_assert(sizeof(WI_HouseLevel_C_On_UpdateHouseLevel) == 0x000004, "Wrong size on WI_HouseLevel_C_On_UpdateHouseLevel");
static_assert(offsetof(WI_HouseLevel_C_On_UpdateHouseLevel, Level) == 0x000000, "Member 'WI_HouseLevel_C_On_UpdateHouseLevel::Level' has a wrong offset!");

// Function WI_HouseLevel.WI_HouseLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_HouseLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseLevel_C_PreConstruct) == 0x000001, "Wrong alignment on WI_HouseLevel_C_PreConstruct");
static_assert(sizeof(WI_HouseLevel_C_PreConstruct) == 0x000001, "Wrong size on WI_HouseLevel_C_PreConstruct");
static_assert(offsetof(WI_HouseLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_HouseLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_HouseLevel.WI_HouseLevel_C.SetHouseLevel
// 0x0020 (0x0020 - 0x0000)
struct WI_HouseLevel_C_SetHouseLevel final
{
public:
	int32                                         HouseLevel_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseLevel_C_SetHouseLevel) == 0x000008, "Wrong alignment on WI_HouseLevel_C_SetHouseLevel");
static_assert(sizeof(WI_HouseLevel_C_SetHouseLevel) == 0x000020, "Wrong size on WI_HouseLevel_C_SetHouseLevel");
static_assert(offsetof(WI_HouseLevel_C_SetHouseLevel, HouseLevel_0) == 0x000000, "Member 'WI_HouseLevel_C_SetHouseLevel::HouseLevel_0' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetHouseLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_HouseLevel_C_SetHouseLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetHouseLevel, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WI_HouseLevel_C_SetHouseLevel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_HouseLevel.WI_HouseLevel_C.SetTeamType
// 0x0010 (0x0010 - 0x0000)
struct WI_HouseLevel_C_SetTeamType final
{
public:
	ETeamType                                     TeamType_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseLevel_C_SetTeamType) == 0x000008, "Wrong alignment on WI_HouseLevel_C_SetTeamType");
static_assert(sizeof(WI_HouseLevel_C_SetTeamType) == 0x000010, "Wrong size on WI_HouseLevel_C_SetTeamType");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, TeamType_0) == 0x000000, "Member 'WI_HouseLevel_C_SetTeamType::TeamType_0' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, Temp_byte_Variable) == 0x000001, "Member 'WI_HouseLevel_C_SetTeamType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, Temp_byte_Variable_1) == 0x000002, "Member 'WI_HouseLevel_C_SetTeamType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, K2Node_Select_Default) == 0x000003, "Member 'WI_HouseLevel_C_SetTeamType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, K2Node_Select_Default_1) == 0x000004, "Member 'WI_HouseLevel_C_SetTeamType::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_HouseLevel_C_SetTeamType, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WI_HouseLevel_C_SetTeamType::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

}

