#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IconButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_IconButton.WI_IconButton_C
// 0x0080 (0x1620 - 0x15A0)
class UWI_IconButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnimation;                                    // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backdrop;                                          // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CircleButtonHoverEffectMinus512x512_C* ButtonHoverEffect;                                 // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ButtonSizeBox;                                     // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IconSizeBox;                                       // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconSoftTexture;                                   // 0x15D8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          DesignerPreviewShowHoverEffect;                    // 0x1600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1601[0x7];                                     // 0x1601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ButtonDiameter;                                    // 0x1608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconDiameter;                                      // 0x1610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WI_IconButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetButtonDiameter(double Diameter);
	void SetIconDiameter(double IconDiameter_0);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D> IconTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_IconButton_C">();
	}
	static class UWI_IconButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_IconButton_C>();
	}
};
static_assert(alignof(UWI_IconButton_C) == 0x000010, "Wrong alignment on UWI_IconButton_C");
static_assert(sizeof(UWI_IconButton_C) == 0x001620, "Wrong size on UWI_IconButton_C");
static_assert(offsetof(UWI_IconButton_C, UberGraphFrame) == 0x0015A0, "Member 'UWI_IconButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, HoverAnimation) == 0x0015A8, "Member 'UWI_IconButton_C::HoverAnimation' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, Backdrop) == 0x0015B0, "Member 'UWI_IconButton_C::Backdrop' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, ButtonHoverEffect) == 0x0015B8, "Member 'UWI_IconButton_C::ButtonHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, ButtonSizeBox) == 0x0015C0, "Member 'UWI_IconButton_C::ButtonSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, Icon) == 0x0015C8, "Member 'UWI_IconButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, IconSizeBox) == 0x0015D0, "Member 'UWI_IconButton_C::IconSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, IconSoftTexture) == 0x0015D8, "Member 'UWI_IconButton_C::IconSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, DesignerPreviewShowHoverEffect) == 0x001600, "Member 'UWI_IconButton_C::DesignerPreviewShowHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, ButtonDiameter) == 0x001608, "Member 'UWI_IconButton_C::ButtonDiameter' has a wrong offset!");
static_assert(offsetof(UWI_IconButton_C, IconDiameter) == 0x001610, "Member 'UWI_IconButton_C::IconDiameter' has a wrong offset!");

}

