#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IncomeChangeNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_IncomeChangeNotification.WI_IncomeChangeNotification_C
// 0x0068 (0x0348 - 0x02E0)
class UWI_IncomeChangeNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FloatDown;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FloatUp;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Fill;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Fill_WhiteEdge;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_120;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextIncomeChange;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        IncomeChange;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_IncomeChangeNotification(int32 EntryPoint);
	void Play_Cosmetics(double IncomeChange_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_IncomeChangeNotification_C">();
	}
	static class UWI_IncomeChangeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_IncomeChangeNotification_C>();
	}
};
static_assert(alignof(UWI_IncomeChangeNotification_C) == 0x000008, "Wrong alignment on UWI_IncomeChangeNotification_C");
static_assert(sizeof(UWI_IncomeChangeNotification_C) == 0x000348, "Wrong size on UWI_IncomeChangeNotification_C");
static_assert(offsetof(UWI_IncomeChangeNotification_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_IncomeChangeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, FloatDown) == 0x0002E8, "Member 'UWI_IncomeChangeNotification_C::FloatDown' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, FloatUp) == 0x0002F0, "Member 'UWI_IncomeChangeNotification_C::FloatUp' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, BG_Fill) == 0x0002F8, "Member 'UWI_IncomeChangeNotification_C::BG_Fill' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, BG_Fill_WhiteEdge) == 0x000300, "Member 'UWI_IncomeChangeNotification_C::BG_Fill_WhiteEdge' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, CanvasPanel_120) == 0x000308, "Member 'UWI_IncomeChangeNotification_C::CanvasPanel_120' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, Image) == 0x000310, "Member 'UWI_IncomeChangeNotification_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, Image_94) == 0x000318, "Member 'UWI_IncomeChangeNotification_C::Image_94' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, TextIncomeChange) == 0x000320, "Member 'UWI_IncomeChangeNotification_C::TextIncomeChange' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, IncomeChange) == 0x000328, "Member 'UWI_IncomeChangeNotification_C::IncomeChange' has a wrong offset!");
static_assert(offsetof(UWI_IncomeChangeNotification_C, WorldLocation) == 0x000330, "Member 'UWI_IncomeChangeNotification_C::WorldLocation' has a wrong offset!");

}

