#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_InGameMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_InGameMenu.WI_InGameMenu_C
// 0x0048 (0x0478 - 0x0430)
class UWI_InGameMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnActivation;                                      // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_188;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         IAmStuckButton;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         QuitToMenuButton;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         ResumeButton;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         SettingsButton;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PanelBackground_C*                  WI_PanelBackground;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SurrenderVote_C*                    WI_SurrenderVote;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyKillEffect(class ABP_ResidentCharacter_C* ResidentCharacter);
	void BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseInGameMenu();
	void ExecuteUbergraph_WI_InGameMenu(int32 EntryPoint);
	void HandleInGameMenuActionPressed();
	void InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC(ECommonMessagingResult Result);
	void OnSettingsClosed();
	void TogglePlayerInGame_HUD(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_InGameMenu_C">();
	}
	static class UWI_InGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_InGameMenu_C>();
	}
};
static_assert(alignof(UWI_InGameMenu_C) == 0x000008, "Wrong alignment on UWI_InGameMenu_C");
static_assert(sizeof(UWI_InGameMenu_C) == 0x000478, "Wrong size on UWI_InGameMenu_C");
static_assert(offsetof(UWI_InGameMenu_C, UberGraphFrame) == 0x000430, "Member 'UWI_InGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, OnActivation) == 0x000438, "Member 'UWI_InGameMenu_C::OnActivation' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, Button_188) == 0x000440, "Member 'UWI_InGameMenu_C::Button_188' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, IAmStuckButton) == 0x000448, "Member 'UWI_InGameMenu_C::IAmStuckButton' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, QuitToMenuButton) == 0x000450, "Member 'UWI_InGameMenu_C::QuitToMenuButton' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, ResumeButton) == 0x000458, "Member 'UWI_InGameMenu_C::ResumeButton' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, SettingsButton) == 0x000460, "Member 'UWI_InGameMenu_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, WI_PanelBackground) == 0x000468, "Member 'UWI_InGameMenu_C::WI_PanelBackground' has a wrong offset!");
static_assert(offsetof(UWI_InGameMenu_C, WI_SurrenderVote) == 0x000470, "Member 'UWI_InGameMenu_C::WI_SurrenderVote' has a wrong offset!");

}

