#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IngameScoreboard_Entry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.ExecuteUbergraph_WI_IngameScoreboard_Entry
// 0x0100 (0x0100 - 0x0000)
struct WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	struct FLinearColor                           CallFunc_GetTeamColorForTeamId_ReturnValue;        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0090(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0098(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry) == 0x000100, "Wrong size on WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, EntryPoint) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, Temp_object_Variable) == 0x000020, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000028, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_GetTeamColorForTeamId_ReturnValue) == 0x000048, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_GetTeamColorForTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x000058, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000060, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000068, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_Event_InFocusEvent_1) == 0x000090, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, K2Node_Event_InFocusEvent) == 0x000098, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000A0, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue) == 0x0000B0, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D0, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000E0, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F0, "Member 'WI_IngameScoreboard_Entry_C_ExecuteUbergraph_WI_IngameScoreboard_Entry::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.HideInventory
// 0x0038 (0x0038 - 0x0000)
struct WI_IngameScoreboard_Entry_C_HideInventory final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_HideInventory) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_HideInventory");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_HideInventory) == 0x000038, "Wrong size on WI_IngameScoreboard_Entry_C_HideInventory");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_HideInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WI_IngameScoreboard_Entry_C_HideInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_IngameScoreboard_Entry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WI_IngameScoreboard_Entry_C_OnAddedToFocusPath");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WI_IngameScoreboard_Entry_C_OnAddedToFocusPath");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764
// 0x0008 (0x0008 - 0x0000)
struct WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764) == 0x000008, "Wrong size on WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764, Loaded) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764::Loaded' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateAssists
// 0x0020 (0x0020 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateAssists final
{
public:
	class APlayerStateJP*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Assists_0;                                         // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateAssists) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateAssists");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateAssists) == 0x000020, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateAssists");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateAssists, PlayerState) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateAssists::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateAssists, Assists_0) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_UpdateAssists::Assists_0' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateAssists, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_UpdateAssists::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateAssists, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x000018, "Member 'WI_IngameScoreboard_Entry_C_UpdateAssists::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateDeaths
// 0x0020 (0x0020 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateDeaths final
{
public:
	class APlayerStateJP*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Deaths_0;                                          // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateDeaths) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateDeaths");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateDeaths) == 0x000020, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateDeaths");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateDeaths, PlayerState) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateDeaths::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateDeaths, Deaths_0) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_UpdateDeaths::Deaths_0' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateDeaths, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_UpdateDeaths::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateDeaths, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x000018, "Member 'WI_IngameScoreboard_Entry_C_UpdateDeaths::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateInventory
// 0x00A0 (0x00A0 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateInventory final
{
public:
	int32                                         ItemsInInventory;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_Scoreboard_InventoryItem_C*         K2Node_DynamicCast_AsWI_Scoreboard_Inventory_Item; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_ItemWheel*            CallFunc_FindActionByType_ReturnValue;             // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateInventory) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateInventory");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateInventory) == 0x0000A0, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateInventory");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, ItemsInInventory) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::ItemsInInventory' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_byte_Variable) == 0x000014, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_byte_Variable_1) == 0x000015, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000016, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Array_Get_Item) == 0x000038, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, Temp_bool_Variable) == 0x000045, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, K2Node_Select_Default) == 0x000046, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, K2Node_DynamicCast_AsWI_Scoreboard_Inventory_Item) == 0x000050, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::K2Node_DynamicCast_AsWI_Scoreboard_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_GetPawn_ReturnValue) == 0x000060, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000070, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_FindActionByType_ReturnValue) == 0x000090, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Array_Length_ReturnValue_2) == 0x000098, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateInventory, CallFunc_Less_IntInt_ReturnValue_2) == 0x00009C, "Member 'WI_IngameScoreboard_Entry_C_UpdateInventory::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateKills
// 0x0020 (0x0020 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateKills final
{
public:
	class APlayerStateJP*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Kills_0;                                           // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateKills) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateKills");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateKills) == 0x000020, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateKills");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateKills, PlayerState) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateKills::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateKills, Kills_0) == 0x000008, "Member 'WI_IngameScoreboard_Entry_C_UpdateKills::Kills_0' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateKills, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WI_IngameScoreboard_Entry_C_UpdateKills::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateKills, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x000018, "Member 'WI_IngameScoreboard_Entry_C_UpdateKills::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateMuteIcon
// 0x0014 (0x0014 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateMuteIcon final
{
public:
	bool                                          CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateMuteIcon) == 0x000004, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateMuteIcon");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateMuteIcon) == 0x000014, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateMuteIcon");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateMuteIcon, CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateMuteIcon::CallFunc_VoiceChatLocalIsMutedSomeone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateMuteIcon, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WI_IngameScoreboard_Entry_C_UpdateMuteIcon::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C.UpdateStats
// 0x0038 (0x0038 - 0x0000)
struct WI_IngameScoreboard_Entry_C_UpdateStats final
{
public:
	int32                                         CallFunc_GetAssists_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDeaths_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKills_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast_1;  // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast_2;  // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_Entry_C_UpdateStats) == 0x000008, "Wrong alignment on WI_IngameScoreboard_Entry_C_UpdateStats");
static_assert(sizeof(WI_IngameScoreboard_Entry_C_UpdateStats) == 0x000038, "Wrong size on WI_IngameScoreboard_Entry_C_UpdateStats");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateStats, CallFunc_GetAssists_ReturnValue) == 0x000000, "Member 'WI_IngameScoreboard_Entry_C_UpdateStats::CallFunc_GetAssists_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_Entry_C_UpdateStats, CallFunc_GetDeaths_ReturnValue) == 0x000004, "Member 'WI_IngameScoreboard_Entry_C_UpdateStats::CallFunc_GetDeaths_ReturnValue' has a wrong offset!");
