#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IngameScoreboard_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_IngameScoreboard_Entry.WI_IngameScoreboard_Entry_C
// 0x00D0 (0x03B0 - 0x02E0)
class UWI_IngameScoreboard_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                Assists;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AssistsBG;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_393;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Deaths;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DeathsBG;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Inventory;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Kills;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KillsBG;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MuteButton;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MuteButtonController;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MuteIcon;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameBG;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PortraitBG;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PortraitBGColor;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ButtonHoverEffectBase_C*            WI_ButtonHoverEffectBase;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_HorizontalDivider_Dashed_C*         WI_HorizontalDivider_Dashed;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Scoreboard_InventoryItem_C*         WI_Scoreboard_InventoryItem;                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Scoreboard_InventoryItem_C*         WI_Scoreboard_InventoryItem_1;                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Scoreboard_InventoryItem_C*         WI_Scoreboard_InventoryItem_2;                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsOwningPlayer;                                    // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         AssociatedPlayerstate;                             // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WI_IngameScoreboard_Entry_MuteButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WI_IngameScoreboard_Entry(int32 EntryPoint);
	void HideInventory();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnLoaded_EC7FBBD44D1DE4DBDB89E2BA1C84C764(class UObject* Loaded);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void UpdateAssists(class APlayerStateJP* PlayerState, const int32& Assists_0);
	void UpdateDeaths(class APlayerStateJP* PlayerState, const int32& Deaths_0);
	void UpdateInventory();
	void UpdateKills(class APlayerStateJP* PlayerState, const int32& Kills_0);
	void UpdateMuteIcon();
	void UpdateStats();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_IngameScoreboard_Entry_C">();
	}
	static class UWI_IngameScoreboard_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_IngameScoreboard_Entry_C>();
	}
};
static_assert(alignof(UWI_IngameScoreboard_Entry_C) == 0x000008, "Wrong alignment on UWI_IngameScoreboard_Entry_C");
static_assert(sizeof(UWI_IngameScoreboard_Entry_C) == 0x0003B0, "Wrong size on UWI_IngameScoreboard_Entry_C");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_IngameScoreboard_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Assists) == 0x0002E8, "Member 'UWI_IngameScoreboard_Entry_C::Assists' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, AssistsBG) == 0x0002F0, "Member 'UWI_IngameScoreboard_Entry_C::AssistsBG' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, CommonBorder_393) == 0x0002F8, "Member 'UWI_IngameScoreboard_Entry_C::CommonBorder_393' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Deaths) == 0x000300, "Member 'UWI_IngameScoreboard_Entry_C::Deaths' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, DeathsBG) == 0x000308, "Member 'UWI_IngameScoreboard_Entry_C::DeathsBG' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Inventory) == 0x000310, "Member 'UWI_IngameScoreboard_Entry_C::Inventory' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Kills) == 0x000318, "Member 'UWI_IngameScoreboard_Entry_C::Kills' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, KillsBG) == 0x000320, "Member 'UWI_IngameScoreboard_Entry_C::KillsBG' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, MuteButton) == 0x000328, "Member 'UWI_IngameScoreboard_Entry_C::MuteButton' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, MuteButtonController) == 0x000330, "Member 'UWI_IngameScoreboard_Entry_C::MuteButtonController' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, MuteIcon) == 0x000338, "Member 'UWI_IngameScoreboard_Entry_C::MuteIcon' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, NameBG) == 0x000340, "Member 'UWI_IngameScoreboard_Entry_C::NameBG' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, PlayerName) == 0x000348, "Member 'UWI_IngameScoreboard_Entry_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Portrait) == 0x000350, "Member 'UWI_IngameScoreboard_Entry_C::Portrait' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, PortraitBG) == 0x000358, "Member 'UWI_IngameScoreboard_Entry_C::PortraitBG' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, PortraitBGColor) == 0x000360, "Member 'UWI_IngameScoreboard_Entry_C::PortraitBGColor' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, WI_ButtonHoverEffectBase) == 0x000368, "Member 'UWI_IngameScoreboard_Entry_C::WI_ButtonHoverEffectBase' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, WI_HorizontalDivider_Dashed) == 0x000370, "Member 'UWI_IngameScoreboard_Entry_C::WI_HorizontalDivider_Dashed' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, WI_Scoreboard_InventoryItem) == 0x000378, "Member 'UWI_IngameScoreboard_Entry_C::WI_Scoreboard_InventoryItem' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, WI_Scoreboard_InventoryItem_1) == 0x000380, "Member 'UWI_IngameScoreboard_Entry_C::WI_Scoreboard_InventoryItem_1' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, WI_Scoreboard_InventoryItem_2) == 0x000388, "Member 'UWI_IngameScoreboard_Entry_C::WI_Scoreboard_InventoryItem_2' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Name_0) == 0x000390, "Member 'UWI_IngameScoreboard_Entry_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, Team) == 0x0003A0, "Member 'UWI_IngameScoreboard_Entry_C::Team' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, IsOwningPlayer) == 0x0003A1, "Member 'UWI_IngameScoreboard_Entry_C::IsOwningPlayer' has a wrong offset!");
static_assert(offsetof(UWI_IngameScoreboard_Entry_C, AssociatedPlayerstate) == 0x0003A8, "Member 'UWI_IngameScoreboard_Entry_C::AssociatedPlayerstate' has a wrong offset!");

}

