#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IntroOverlayBase

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "E_IntroType_structs.hpp"


namespace SDK::Params
{

// Function WI_IntroOverlayBase.WI_IntroOverlayBase_C.ExecuteUbergraph_WI_IntroOverlayBase
// 0x00A0 (0x00A0 - 0x0000)
struct WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   K2Node_CustomEvent_Intro;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Map_Find_Value;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase) == 0x000008, "Wrong alignment on WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase");
static_assert(sizeof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase) == 0x0000A0, "Wrong size on WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, EntryPoint) == 0x000000, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000039, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_object_Variable) == 0x000040, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_real_Variable) == 0x000048, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_real_Variable_0) == 0x000050, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_real_Variable_1) == 0x000058, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_bool_Variable) == 0x000060, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, Temp_real_Variable_1_0) == 0x000068, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_CustomEvent_Intro) == 0x000070, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_CustomEvent_Intro' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_Map_Find_Value) == 0x000078, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000088, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'WI_IntroOverlayBase_C_ExecuteUbergraph_WI_IntroOverlayBase::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_IntroOverlayBase.WI_IntroOverlayBase_C.InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WI_IntroOverlayBase_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WI_IntroOverlayBase.WI_IntroOverlayBase_C.PopulateMap
// 0x0004 (0x0004 - 0x0000)
struct WI_IntroOverlayBase_C_PopulateMap final
{
public:
	E_IntroType                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_1;                              // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_2;                              // 0x0002(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_IntroType                                   Temp_byte_Variable_3;                              // 0x0003(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IntroOverlayBase_C_PopulateMap) == 0x000001, "Wrong alignment on WI_IntroOverlayBase_C_PopulateMap");
static_assert(sizeof(WI_IntroOverlayBase_C_PopulateMap) == 0x000004, "Wrong size on WI_IntroOverlayBase_C_PopulateMap");
static_assert(offsetof(WI_IntroOverlayBase_C_PopulateMap, Temp_byte_Variable) == 0x000000, "Member 'WI_IntroOverlayBase_C_PopulateMap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_PopulateMap, Temp_byte_Variable_1) == 0x000001, "Member 'WI_IntroOverlayBase_C_PopulateMap::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_PopulateMap, Temp_byte_Variable_2) == 0x000002, "Member 'WI_IntroOverlayBase_C_PopulateMap::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_IntroOverlayBase_C_PopulateMap, Temp_byte_Variable_3) == 0x000003, "Member 'WI_IntroOverlayBase_C_PopulateMap::Temp_byte_Variable_3' has a wrong offset!");

// Function WI_IntroOverlayBase.WI_IntroOverlayBase_C.ShowRelatedWidget
// 0x0001 (0x0001 - 0x0000)
struct WI_IntroOverlayBase_C_ShowRelatedWidget final
{
public:
	E_IntroType                                   Intro;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IntroOverlayBase_C_ShowRelatedWidget) == 0x000001, "Wrong alignment on WI_IntroOverlayBase_C_ShowRelatedWidget");
static_assert(sizeof(WI_IntroOverlayBase_C_ShowRelatedWidget) == 0x000001, "Wrong size on WI_IntroOverlayBase_C_ShowRelatedWidget");
static_assert(offsetof(WI_IntroOverlayBase_C_ShowRelatedWidget, Intro) == 0x000000, "Member 'WI_IntroOverlayBase_C_ShowRelatedWidget::Intro' has a wrong offset!");

}

