#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ImportantNotificationEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ImportantNotificationEntry.WI_ImportantNotificationEntry_C
// 0x0098 (0x0378 - 0x02E0)
class UWI_ImportantNotificationEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pulse;                                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimateOut;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimateIn;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PanelBackgroundSlim_C*              WI_PanelBackgroundSlim;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NotificationText;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0328(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      IconMaterial;                                      // 0x0350(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_ImportantNotificationEntry(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ImportantNotificationEntry_C">();
	}
	static class UWI_ImportantNotificationEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ImportantNotificationEntry_C>();
	}
};
static_assert(alignof(UWI_ImportantNotificationEntry_C) == 0x000008, "Wrong alignment on UWI_ImportantNotificationEntry_C");
static_assert(sizeof(UWI_ImportantNotificationEntry_C) == 0x000378, "Wrong size on UWI_ImportantNotificationEntry_C");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ImportantNotificationEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, Pulse) == 0x0002E8, "Member 'UWI_ImportantNotificationEntry_C::Pulse' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, AnimateOut) == 0x0002F0, "Member 'UWI_ImportantNotificationEntry_C::AnimateOut' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, AnimateIn) == 0x0002F8, "Member 'UWI_ImportantNotificationEntry_C::AnimateIn' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, Icon) == 0x000300, "Member 'UWI_ImportantNotificationEntry_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, Text) == 0x000308, "Member 'UWI_ImportantNotificationEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, WI_PanelBackgroundSlim) == 0x000310, "Member 'UWI_ImportantNotificationEntry_C::WI_PanelBackgroundSlim' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, NotificationText) == 0x000318, "Member 'UWI_ImportantNotificationEntry_C::NotificationText' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, IconTexture) == 0x000328, "Member 'UWI_ImportantNotificationEntry_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UWI_ImportantNotificationEntry_C, IconMaterial) == 0x000350, "Member 'UWI_ImportantNotificationEntry_C::IconMaterial' has a wrong offset!");

}

