#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Intro_Team

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_Intro_Team.WI_Intro_Team_C.ExecuteUbergraph_WI_Intro_Team
// 0x00A0 (0x00A0 - 0x0000)
struct WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team) == 0x000008, "Wrong alignment on WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team");
static_assert(sizeof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team) == 0x0000A0, "Wrong size on WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, EntryPoint) == 0x000000, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, Temp_int_Variable) == 0x000004, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, K2Node_MakeArray_Array) == 0x000078, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team, CallFunc_PlayAnimationForward_ReturnValue) == 0x000098, "Member 'WI_Intro_Team_C_ExecuteUbergraph_WI_Intro_Team::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_Intro_Team.WI_Intro_Team_C.SetDuration
// 0x0004 (0x0004 - 0x0000)
struct WI_Intro_Team_C_SetDuration final
{
public:
	int32                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Intro_Team_C_SetDuration) == 0x000004, "Wrong alignment on WI_Intro_Team_C_SetDuration");
static_assert(sizeof(WI_Intro_Team_C_SetDuration) == 0x000004, "Wrong size on WI_Intro_Team_C_SetDuration");
static_assert(offsetof(WI_Intro_Team_C_SetDuration, Duration) == 0x000000, "Member 'WI_Intro_Team_C_SetDuration::Duration' has a wrong offset!");

}

