#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IngameScoreboard

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.ExecuteUbergraph_WI_IngameScoreboard
// 0x0078 (0x0078 - 0x0000)
struct WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_IngameScoreboard_Entry_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_IngameScoreboard_Entry_C*           CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_IngameScoreboard_Entry_C*           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetOwningPlayerInputType_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard) == 0x000008, "Wrong alignment on WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard");
static_assert(sizeof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard) == 0x000078, "Wrong size on WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, EntryPoint) == 0x000000, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000010, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, K2Node_CustomEvent_Visible) == 0x00001C, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_GetOwningPlayerInputType_ReturnValue) == 0x000050, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_GetOwningPlayerInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_GetPlayerController_ReturnValue_2) == 0x000058, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_GetPlayerController_ReturnValue_3) == 0x000060, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, K2Node_Event_IsDesignTime) == 0x000068, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000070, "Member 'WI_IngameScoreboard_C_ExecuteUbergraph_WI_IngameScoreboard::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.PopulateWithPlayersForTeam
// 0x00E0 (0x00E0 - 0x0000)
struct WI_IngameScoreboard_C_PopulateWithPlayersForTeam final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FriendlyTeam;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_IngameScoreboard_Entry_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0058(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default_1;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam) == 0x000008, "Wrong alignment on WI_IngameScoreboard_C_PopulateWithPlayersForTeam");
static_assert(sizeof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam) == 0x0000E0, "Wrong size on WI_IngameScoreboard_C_PopulateWithPlayersForTeam");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Team) == 0x000000, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Team' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, FriendlyTeam) == 0x000001, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::FriendlyTeam' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000028, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000040, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_DynamicCast_AsPlayer_State_JP_1) == 0x000048, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_DynamicCast_AsPlayer_State_JP_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetTeamID_ReturnValue) == 0x000051, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000058, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_bool_Variable) == 0x000068, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Array_Get_Item) == 0x000070, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_Select_Default) == 0x000080, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x000090, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Array_AddUnique_ReturnValue) == 0x0000A8, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, Temp_bool_Variable_1) == 0x0000AC, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, K2Node_Select_Default_1) == 0x0000B0, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_GetAllChildren_ReturnValue) == 0x0000B8, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_PopulateWithPlayersForTeam, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D8, "Member 'WI_IngameScoreboard_C_PopulateWithPlayersForTeam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_IngameScoreboard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_PreConstruct) == 0x000001, "Wrong alignment on WI_IngameScoreboard_C_PreConstruct");
static_assert(sizeof(WI_IngameScoreboard_C_PreConstruct) == 0x000001, "Wrong size on WI_IngameScoreboard_C_PreConstruct");
static_assert(offsetof(WI_IngameScoreboard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_IngameScoreboard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.SetupControllerNavigation
// 0x0040 (0x0040 - 0x0000)
struct WI_IngameScoreboard_C_SetupControllerNavigation final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_IngameScoreboard_Entry_C*           K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_IngameScoreboard_Entry_C*           K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue_1;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_SetupControllerNavigation) == 0x000008, "Wrong alignment on WI_IngameScoreboard_C_SetupControllerNavigation");
static_assert(sizeof(WI_IngameScoreboard_C_SetupControllerNavigation) == 0x000040, "Wrong size on WI_IngameScoreboard_C_SetupControllerNavigation");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry) == 0x000018, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_Array_LastIndex_ReturnValue) == 0x000024, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_GetChildAt_ReturnValue_1) == 0x000028, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry_1) == 0x000030, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_HasAnyChildren_ReturnValue) == 0x000039, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_HasAnyChildren_ReturnValue_1) == 0x00003A, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_HasAnyChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigation, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'WI_IngameScoreboard_C_SetupControllerNavigation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.SetupControllerNavigationWithinList
// 0x0070 (0x0070 - 0x0000)
struct WI_IngameScoreboard_C_SetupControllerNavigationWithinList final
{
public:
	class UPanelWidget*                           TeamBox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_IngameScoreboard_Entry_C*           K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList) == 0x000008, "Wrong alignment on WI_IngameScoreboard_C_SetupControllerNavigationWithinList");
static_assert(sizeof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList) == 0x000070, "Wrong size on WI_IngameScoreboard_C_SetupControllerNavigationWithinList");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, TeamBox) == 0x000000, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::TeamBox' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Array_Get_Item) == 0x000020, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry) == 0x000030, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::K2Node_DynamicCast_AsWI_Ingame_Scoreboard_Entry' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000060, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Less_IntInt_ReturnValue_1) == 0x000065, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_SetupControllerNavigationWithinList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'WI_IngameScoreboard_C_SetupControllerNavigationWithinList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.ShowScoreBoard
// 0x0001 (0x0001 - 0x0000)
struct WI_IngameScoreboard_C_ShowScoreBoard final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_ShowScoreBoard) == 0x000001, "Wrong alignment on WI_IngameScoreboard_C_ShowScoreBoard");
static_assert(sizeof(WI_IngameScoreboard_C_ShowScoreBoard) == 0x000001, "Wrong size on WI_IngameScoreboard_C_ShowScoreBoard");
static_assert(offsetof(WI_IngameScoreboard_C_ShowScoreBoard, Visible) == 0x000000, "Member 'WI_IngameScoreboard_C_ShowScoreBoard::Visible' has a wrong offset!");

// Function WI_IngameScoreboard.WI_IngameScoreboard_C.UpdateValues
// 0x0038 (0x0038 - 0x0000)
struct WI_IngameScoreboard_C_UpdateValues final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_IngameScoreboard_Entry_C*           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IngameScoreboard_C_UpdateValues) == 0x000008, "Wrong alignment on WI_IngameScoreboard_C_UpdateValues");
static_assert(sizeof(WI_IngameScoreboard_C_UpdateValues) == 0x000038, "Wrong size on WI_IngameScoreboard_C_UpdateValues");
static_assert(offsetof(WI_IngameScoreboard_C_UpdateValues, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_IngameScoreboard_C_UpdateValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_UpdateValues, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_IngameScoreboard_C_UpdateValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_IngameScoreboard_C_UpdateValues, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_IngameScoreboard_C_UpdateValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
