#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IconButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_IconButton.WI_IconButton_C.ExecuteUbergraph_WI_IconButton
// 0x0028 (0x0028 - 0x0000)
struct WI_IconButton_C_ExecuteUbergraph_WI_IconButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton) == 0x000008, "Wrong alignment on WI_IconButton_C_ExecuteUbergraph_WI_IconButton");
static_assert(sizeof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton) == 0x000028, "Wrong size on WI_IconButton_C_ExecuteUbergraph_WI_IconButton");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, EntryPoint) == 0x000000, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, Temp_bool_Variable) == 0x000004, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, Temp_real_Variable) == 0x000008, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, Temp_real_Variable_1) == 0x00000C, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, K2Node_Select_Default) == 0x000014, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_ExecuteUbergraph_WI_IconButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'WI_IconButton_C_ExecuteUbergraph_WI_IconButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WI_IconButton.WI_IconButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_IconButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IconButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_IconButton_C_PreConstruct");
static_assert(sizeof(WI_IconButton_C_PreConstruct) == 0x000001, "Wrong size on WI_IconButton_C_PreConstruct");
static_assert(offsetof(WI_IconButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_IconButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_IconButton.WI_IconButton_C.SetButtonDiameter
// 0x0010 (0x0010 - 0x0000)
struct WI_IconButton_C_SetButtonDiameter final
{
public:
	double                                        Diameter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IconButton_C_SetButtonDiameter) == 0x000008, "Wrong alignment on WI_IconButton_C_SetButtonDiameter");
static_assert(sizeof(WI_IconButton_C_SetButtonDiameter) == 0x000010, "Wrong size on WI_IconButton_C_SetButtonDiameter");
static_assert(offsetof(WI_IconButton_C_SetButtonDiameter, Diameter) == 0x000000, "Member 'WI_IconButton_C_SetButtonDiameter::Diameter' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetButtonDiameter, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000008, "Member 'WI_IconButton_C_SetButtonDiameter::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetButtonDiameter, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00000C, "Member 'WI_IconButton_C_SetButtonDiameter::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WI_IconButton.WI_IconButton_C.SetIconDiameter
// 0x0020 (0x0020 - 0x0000)
struct WI_IconButton_C_SetIconDiameter final
{
public:
	double                                        IconDiameter_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IconButton_C_SetIconDiameter) == 0x000008, "Wrong alignment on WI_IconButton_C_SetIconDiameter");
static_assert(sizeof(WI_IconButton_C_SetIconDiameter) == 0x000020, "Wrong size on WI_IconButton_C_SetIconDiameter");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, IconDiameter_0) == 0x000000, "Member 'WI_IconButton_C_SetIconDiameter::IconDiameter_0' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, Temp_bool_Variable) == 0x000008, "Member 'WI_IconButton_C_SetIconDiameter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000009, "Member 'WI_IconButton_C_SetIconDiameter::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, K2Node_Select_Default) == 0x000010, "Member 'WI_IconButton_C_SetIconDiameter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000018, "Member 'WI_IconButton_C_SetIconDiameter::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconDiameter, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00001C, "Member 'WI_IconButton_C_SetIconDiameter::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WI_IconButton.WI_IconButton_C.SetIconTexture
// 0x0040 (0x0040 - 0x0000)
struct WI_IconButton_C_SetIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_IconButton_C_SetIconTexture) == 0x000008, "Wrong alignment on WI_IconButton_C_SetIconTexture");
static_assert(sizeof(WI_IconButton_C_SetIconTexture) == 0x000040, "Wrong size on WI_IconButton_C_SetIconTexture");
static_assert(offsetof(WI_IconButton_C_SetIconTexture, IconTexture) == 0x000000, "Member 'WI_IconButton_C_SetIconTexture::IconTexture' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconTexture, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WI_IconButton_C_SetIconTexture::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconTexture, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'WI_IconButton_C_SetIconTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_IconButton_C_SetIconTexture, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WI_IconButton_C_SetIconTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

