#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsListEntry_SubCollection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection
// 0x0198 (0x0198 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ActionText;                           // 0x0008(0x0010)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0078)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	bool                                          CallFunc_IsOwningPlayerUsingTouch_ReturnValue;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPButton_C*                         K2Node_DynamicCast_AsWI_JPButton;                  // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_LyraMenuButton_C*                    K2Node_DynamicCast_AsW_Lyra_Menu_Button;           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IJPGameSettingWithOddEvenInterface> K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEven_ReturnValue;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection) == 0x000198, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, EntryPoint) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_Event_ActionText) == 0x000008, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_Event_ActionText' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_Event_MyGeometry) == 0x000018, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C8, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D0, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, CallFunc_IsOwningPlayerUsingTouch_ReturnValue) == 0x000150, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::CallFunc_IsOwningPlayerUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_AsWI_JPButton) == 0x000158, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_AsWI_JPButton' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_AsW_Lyra_Menu_Button) == 0x000168, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_AsW_Lyra_Menu_Button' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_Event_ListItemObject) == 0x000178, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface) == 0x000180, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection, CallFunc_GetIsEven_ReturnValue) == 0x000191, "Member 'WI_JPSettingsListEntry_SubCollection_C_ExecuteUbergraph_WI_JPSettingsListEntry_SubCollection::CallFunc_GetIsEven_ReturnValue' has a wrong offset!");

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet) == 0x000008, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter) == 0x0000B0, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WI_JPSettingsListEntry_SubCollection_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000078, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WI_JPSettingsListEntry_SubCollection.WI_JPSettingsListEntry_SubCollection_C.OnSettingAssigned
// 0x0010 (0x0010 - 0x0000)
struct WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(sizeof(WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000010, "Wrong size on WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(offsetof(WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned, ActionText) == 0x000000, "Member 'WI_JPSettingsListEntry_SubCollection_C_OnSettingAssigned::ActionText' has a wrong offset!");

}

