#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSettingItemCheckbox

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_JPCommonSettingItemCheckbox.WI_JPCommonSettingItemCheckbox_C.ExecuteUbergraph_WI_JPCommonSettingItemCheckbox
// 0x0020 (0x0020 - 0x0000)
struct WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox) == 0x000008, "Wrong alignment on WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox");
static_assert(sizeof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox) == 0x000020, "Wrong size on WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox, EntryPoint) == 0x000000, "Member 'WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox, K2Node_CustomEvent_Button) == 0x000018, "Member 'WI_JPCommonSettingItemCheckbox_C_ExecuteUbergraph_WI_JPCommonSettingItemCheckbox::K2Node_CustomEvent_Button' has a wrong offset!");

// Function WI_JPCommonSettingItemCheckbox.WI_JPCommonSettingItemCheckbox_C.SetVisuals
// 0x0050 (0x0050 - 0x0000)
struct WI_JPCommonSettingItemCheckbox_C_SetVisuals final
{
public:
	struct FMatchConfigurationItemViewModel       ViewModel_0;                                       // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingItemCheckbox_C_SetVisuals) == 0x000008, "Wrong alignment on WI_JPCommonSettingItemCheckbox_C_SetVisuals");
static_assert(sizeof(WI_JPCommonSettingItemCheckbox_C_SetVisuals) == 0x000050, "Wrong size on WI_JPCommonSettingItemCheckbox_C_SetVisuals");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_SetVisuals, ViewModel_0) == 0x000000, "Member 'WI_JPCommonSettingItemCheckbox_C_SetVisuals::ViewModel_0' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_SetVisuals, Temp_bool_Variable) == 0x000048, "Member 'WI_JPCommonSettingItemCheckbox_C_SetVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_SetVisuals, Temp_byte_Variable) == 0x000049, "Member 'WI_JPCommonSettingItemCheckbox_C_SetVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_SetVisuals, Temp_byte_Variable_1) == 0x00004A, "Member 'WI_JPCommonSettingItemCheckbox_C_SetVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_SetVisuals, K2Node_Select_Default) == 0x00004B, "Member 'WI_JPCommonSettingItemCheckbox_C_SetVisuals::K2Node_Select_Default' has a wrong offset!");

// Function WI_JPCommonSettingItemCheckbox.WI_JPCommonSettingItemCheckbox_C.Toggled
// 0x0008 (0x0008 - 0x0000)
struct WI_JPCommonSettingItemCheckbox_C_Toggled final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingItemCheckbox_C_Toggled) == 0x000008, "Wrong alignment on WI_JPCommonSettingItemCheckbox_C_Toggled");
static_assert(sizeof(WI_JPCommonSettingItemCheckbox_C_Toggled) == 0x000008, "Wrong size on WI_JPCommonSettingItemCheckbox_C_Toggled");
static_assert(offsetof(WI_JPCommonSettingItemCheckbox_C_Toggled, Button) == 0x000000, "Member 'WI_JPCommonSettingItemCheckbox_C_Toggled::Button' has a wrong offset!");

}

