#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSetting_MultiChoice_Option

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPCommonSetting_MultiChoice_Option.WI_JPCommonSetting_MultiChoice_Option_C
// 0x0048 (0x0328 - 0x02E0)
class UWI_JPCommonSetting_MultiChoice_Option_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_95;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CommonSettingsCheckbox_C*           WI_JPCheckbox;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Option;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Index_0;                                           // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnChanged;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WI_JPCommonSetting_MultiChoice_Option_Button_95_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WI_JPCommonSetting_MultiChoice_Option_WI_JPCheckbox_K2Node_ComponentBoundEvent_0_OnChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WI_JPCommonSetting_MultiChoice_Option(int32 EntryPoint);
	void GetValue(bool* Checked);
	void OnChanged__DelegateSignature(int32 InIndex);
	void PreConstruct(bool IsDesignTime);
	void SetValue(bool InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPCommonSetting_MultiChoice_Option_C">();
	}
	static class UWI_JPCommonSetting_MultiChoice_Option_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPCommonSetting_MultiChoice_Option_C>();
	}
};
static_assert(alignof(UWI_JPCommonSetting_MultiChoice_Option_C) == 0x000008, "Wrong alignment on UWI_JPCommonSetting_MultiChoice_Option_C");
static_assert(sizeof(UWI_JPCommonSetting_MultiChoice_Option_C) == 0x000328, "Wrong size on UWI_JPCommonSetting_MultiChoice_Option_C");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, Button_95) == 0x0002E8, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::Button_95' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, Text) == 0x0002F0, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, WI_JPCheckbox) == 0x0002F8, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::WI_JPCheckbox' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, Option) == 0x000300, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::Option' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, Index_0) == 0x000310, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_MultiChoice_Option_C, OnChanged) == 0x000318, "Member 'UWI_JPCommonSetting_MultiChoice_Option_C::OnChanged' has a wrong offset!");

}

