#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPHeroButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "JP_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPHeroButton.WI_JPHeroButton_C
// 0x0050 (0x1610 - 0x15C0)
class UWI_JPHeroButton_C final : public ULyraButtonBase
{
public:
	uint8                                         Pad_15B8[0x8];                                     // 0x15B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_ButtonHoverEffectMinus480x150_C*    ButtonHoverEffect;                                 // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle;                                      // 0x15E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerInputStyle;                              // 0x15F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x15F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  TextJustification;                                 // 0x15F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x15FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15FB[0x5];                                     // 0x15FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PressProgress;                                     // 0x1600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DesignerPreviewShowHoverEffect;                    // 0x1608(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_JPHeroButton(int32 EntryPoint);
	void GetPressProgress(double* Progress);
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void UpdateButtonStyle();
	void UpdateButtonText(const class FText& InText);
	void UpdateContentAlignment();
	void UpdateStyle(bool UsingGamepad);
	void UpdateTextAndStyle(ECommonInputType InputType);
	void UpdateTextStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPHeroButton_C">();
	}
	static class UWI_JPHeroButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPHeroButton_C>();
	}
};
static_assert(alignof(UWI_JPHeroButton_C) == 0x000010, "Wrong alignment on UWI_JPHeroButton_C");
static_assert(sizeof(UWI_JPHeroButton_C) == 0x001610, "Wrong size on UWI_JPHeroButton_C");
static_assert(offsetof(UWI_JPHeroButton_C, UberGraphFrame) == 0x0015C0, "Member 'UWI_JPHeroButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, Hover) == 0x0015C8, "Member 'UWI_JPHeroButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, ButtonHoverEffect) == 0x0015D0, "Member 'UWI_JPHeroButton_C::ButtonHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, ContentBorder) == 0x0015D8, "Member 'UWI_JPHeroButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, Text) == 0x0015E0, "Member 'UWI_JPHeroButton_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, DefaultStyle) == 0x0015E8, "Member 'UWI_JPHeroButton_C::DefaultStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, ControllerInputStyle) == 0x0015F0, "Member 'UWI_JPHeroButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, ContentAlignment) == 0x0015F8, "Member 'UWI_JPHeroButton_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, TextJustification) == 0x0015F9, "Member 'UWI_JPHeroButton_C::TextJustification' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, TextTransformPolicy) == 0x0015FA, "Member 'UWI_JPHeroButton_C::TextTransformPolicy' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, PressProgress) == 0x001600, "Member 'UWI_JPHeroButton_C::PressProgress' has a wrong offset!");
static_assert(offsetof(UWI_JPHeroButton_C, DesignerPreviewShowHoverEffect) == 0x001608, "Member 'UWI_JPHeroButton_C::DesignerPreviewShowHoverEffect' has a wrong offset!");

}

