#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPSettingsScreen.WI_JPSettingsScreen_C
// 0x0020 (0x0520 - 0x0500)
class UWI_JPSettingsScreen_C final : public ULyraSettingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_47;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_BottomBoundActionBar_CreditsButton_C* WI_BottomBoundActionBar_CreditsButton;             // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonBase>          Tab_Button_Type;                                   // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AfterPush_8E19BDE241DFA102EC2222970133BA0B(class UCommonActivatableWidget* UserWidget);
	void AfterPush_98F0BED840880C12F41A1F9E61B64043(class UCommonActivatableWidget* UserWidget);
	void BeforePush_8E19BDE241DFA102EC2222970133BA0B(class UCommonActivatableWidget* UserWidget);
	void BeforePush_98F0BED840880C12F41A1F9E61B64043(class UCommonActivatableWidget* UserWidget);
	void BndEvt__LyraSettingScreen_Settings_Panel_K2Node_ComponentBoundEvent_0_OnExecuteNamedActionBP__DelegateSignature(class UGameSetting* Setting, const struct FGameplayTag& Action);
	void BndEvt__SettingsPanel_HorizontalTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WI_JPSettingsScreen(int32 EntryPoint);
	void InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void PreConstruct(bool IsDesignTime);
	void RegisterTopLevelTab(class FName SettingDevName);

	TArray<struct FLyraTabDescriptor> GetTabDescriptors(const TArray<struct FLyraTabDescriptor>& ExistingTabDescriptors) const;
	bool IsTabDisabled(const class FName TabName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPSettingsScreen_C">();
	}
	static class UWI_JPSettingsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPSettingsScreen_C>();
	}
};
static_assert(alignof(UWI_JPSettingsScreen_C) == 0x000008, "Wrong alignment on UWI_JPSettingsScreen_C");
static_assert(sizeof(UWI_JPSettingsScreen_C) == 0x000520, "Wrong size on UWI_JPSettingsScreen_C");
static_assert(offsetof(UWI_JPSettingsScreen_C, UberGraphFrame) == 0x000500, "Member 'UWI_JPSettingsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsScreen_C, Button_47) == 0x000508, "Member 'UWI_JPSettingsScreen_C::Button_47' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsScreen_C, WI_BottomBoundActionBar_CreditsButton) == 0x000510, "Member 'UWI_JPSettingsScreen_C::WI_BottomBoundActionBar_CreditsButton' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsScreen_C, Tab_Button_Type) == 0x000518, "Member 'UWI_JPSettingsScreen_C::Tab_Button_Type' has a wrong offset!");

}

