#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSimpleSpinner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPSimpleSpinner.WI_JPSimpleSpinner_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_JPSimpleSpinner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Rotation;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_JPSimpleSpinner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPSimpleSpinner_C">();
	}
	static class UWI_JPSimpleSpinner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPSimpleSpinner_C>();
	}
};
static_assert(alignof(UWI_JPSimpleSpinner_C) == 0x000008, "Wrong alignment on UWI_JPSimpleSpinner_C");
static_assert(sizeof(UWI_JPSimpleSpinner_C) == 0x0002F8, "Wrong size on UWI_JPSimpleSpinner_C");
static_assert(offsetof(UWI_JPSimpleSpinner_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_JPSimpleSpinner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPSimpleSpinner_C, Rotation) == 0x0002E8, "Member 'UWI_JPSimpleSpinner_C::Rotation' has a wrong offset!");
static_assert(offsetof(UWI_JPSimpleSpinner_C, ProgressSpinner) == 0x0002F0, "Member 'UWI_JPSimpleSpinner_C::ProgressSpinner' has a wrong offset!");

}

