#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSetting_Integer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPCommonSetting_Integer.WI_JPCommonSetting_Integer_C
// 0x0078 (0x03C0 - 0x0348)
class UWI_JPCommonSetting_Integer_C final : public UJPSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_CommonSettingsArrowButton_C*        Button_Decrease;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CommonSettingsArrowButton_C*        Button_Increase;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DropShadowText;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_30;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Panel_Value;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBar;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          Slider;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          TextBox;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextTitle;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPSettingsEntryOneLiner_C*          WI_JPSettingsEntryOneLiner;                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrValue;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min;                                               // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Step;                                              // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSlider;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Even;                                           // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPCommonSetting_Integer_C*          Self_0;                                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WI_JPCommonSetting_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_JPCommonSetting_Scalar_Button_Increase_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_JPCommonSetting_Scalar_EditableTextBox_90_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WI_JPCommonSetting_Scalar_Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WI_JPCommonSetting_Scalar_TextBox_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_WI_JPCommonSetting_Integer(int32 EntryPoint);
	void GetValue(int32* CurrValue_0);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSettingClicked_1();
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPCommonSetting_Integer_C">();
	}
	static class UWI_JPCommonSetting_Integer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPCommonSetting_Integer_C>();
	}
};
static_assert(alignof(UWI_JPCommonSetting_Integer_C) == 0x000008, "Wrong alignment on UWI_JPCommonSetting_Integer_C");
static_assert(sizeof(UWI_JPCommonSetting_Integer_C) == 0x0003C0, "Wrong size on UWI_JPCommonSetting_Integer_C");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, UberGraphFrame) == 0x000348, "Member 'UWI_JPCommonSetting_Integer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Button_Decrease) == 0x000350, "Member 'UWI_JPCommonSetting_Integer_C::Button_Decrease' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Button_Increase) == 0x000358, "Member 'UWI_JPCommonSetting_Integer_C::Button_Increase' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, DropShadowText) == 0x000360, "Member 'UWI_JPCommonSetting_Integer_C::DropShadowText' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Image_30) == 0x000368, "Member 'UWI_JPCommonSetting_Integer_C::Image_30' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Panel_Value) == 0x000370, "Member 'UWI_JPCommonSetting_Integer_C::Panel_Value' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, ProgressBar) == 0x000378, "Member 'UWI_JPCommonSetting_Integer_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Slider) == 0x000380, "Member 'UWI_JPCommonSetting_Integer_C::Slider' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, TextBox) == 0x000388, "Member 'UWI_JPCommonSetting_Integer_C::TextBox' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, TextTitle) == 0x000390, "Member 'UWI_JPCommonSetting_Integer_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, WI_JPSettingsEntryOneLiner) == 0x000398, "Member 'UWI_JPCommonSetting_Integer_C::WI_JPSettingsEntryOneLiner' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, CurrValue) == 0x0003A0, "Member 'UWI_JPCommonSetting_Integer_C::CurrValue' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Min) == 0x0003A4, "Member 'UWI_JPCommonSetting_Integer_C::Min' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Max) == 0x0003A8, "Member 'UWI_JPCommonSetting_Integer_C::Max' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Step) == 0x0003AC, "Member 'UWI_JPCommonSetting_Integer_C::Step' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, ShowSlider) == 0x0003B0, "Member 'UWI_JPCommonSetting_Integer_C::ShowSlider' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Is_Even) == 0x0003B1, "Member 'UWI_JPCommonSetting_Integer_C::Is_Even' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Integer_C, Self_0) == 0x0003B8, "Member 'UWI_JPCommonSetting_Integer_C::Self_0' has a wrong offset!");

}

