#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingEntryBackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C
// 0x0040 (0x0320 - 0x02E0)
class UWI_JPSettingEntryBackground_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverImage;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMouseEnterChanged;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShowHoverImage;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEven;                                            // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_JPSettingEntryBackground(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnterChanged__DelegateSignature(bool IsEnterEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetIsEven(bool IsEven_0);
	void SetShowHoverImage(bool ShowHoverImage_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPSettingEntryBackground_C">();
	}
	static class UWI_JPSettingEntryBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPSettingEntryBackground_C>();
	}
};
static_assert(alignof(UWI_JPSettingEntryBackground_C) == 0x000008, "Wrong alignment on UWI_JPSettingEntryBackground_C");
static_assert(sizeof(UWI_JPSettingEntryBackground_C) == 0x000320, "Wrong size on UWI_JPSettingEntryBackground_C");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_JPSettingEntryBackground_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, OnHovered) == 0x0002E8, "Member 'UWI_JPSettingEntryBackground_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, Background) == 0x0002F0, "Member 'UWI_JPSettingEntryBackground_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, Content) == 0x0002F8, "Member 'UWI_JPSettingEntryBackground_C::Content' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, HoverImage) == 0x000300, "Member 'UWI_JPSettingEntryBackground_C::HoverImage' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, OnMouseEnterChanged) == 0x000308, "Member 'UWI_JPSettingEntryBackground_C::OnMouseEnterChanged' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, ShowHoverImage) == 0x000318, "Member 'UWI_JPSettingEntryBackground_C::ShowHoverImage' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingEntryBackground_C, IsEven) == 0x000319, "Member 'UWI_JPSettingEntryBackground_C::IsEven' has a wrong offset!");

}

