#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPPrimaryButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.ExecuteUbergraph_WI_JPPrimaryButton
// 0x0028 (0x0028 - 0x0000)
struct WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HeldPercent;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetOwningPlayerInputType_ReturnValue;     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0010(0x0010)(ConstParm)
	double                                        K2Node_VariableSet_PressProgress_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton");
static_assert(sizeof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton) == 0x000028, "Wrong size on WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, EntryPoint) == 0x000000, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, K2Node_Event_HeldPercent) == 0x000008, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::K2Node_Event_HeldPercent' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, CallFunc_GetOwningPlayerInputType_ReturnValue) == 0x00000C, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::CallFunc_GetOwningPlayerInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, K2Node_Event_InText) == 0x000010, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton, K2Node_VariableSet_PressProgress_ImplicitCast) == 0x000020, "Member 'WI_JPPrimaryButton_C_ExecuteUbergraph_WI_JPPrimaryButton::K2Node_VariableSet_PressProgress_ImplicitCast' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.GetPressProgress
// 0x0008 (0x0008 - 0x0000)
struct WI_JPPrimaryButton_C_GetPressProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_GetPressProgress) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_GetPressProgress");
static_assert(sizeof(WI_JPPrimaryButton_C_GetPressProgress) == 0x000008, "Wrong size on WI_JPPrimaryButton_C_GetPressProgress");
static_assert(offsetof(WI_JPPrimaryButton_C_GetPressProgress, Progress) == 0x000000, "Member 'WI_JPPrimaryButton_C_GetPressProgress::Progress' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct WI_JPPrimaryButton_C_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_OnActionProgress) == 0x000004, "Wrong alignment on WI_JPPrimaryButton_C_OnActionProgress");
static_assert(sizeof(WI_JPPrimaryButton_C_OnActionProgress) == 0x000004, "Wrong size on WI_JPPrimaryButton_C_OnActionProgress");
static_assert(offsetof(WI_JPPrimaryButton_C_OnActionProgress, HeldPercent) == 0x000000, "Member 'WI_JPPrimaryButton_C_OnActionProgress::HeldPercent' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_JPPrimaryButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_JPPrimaryButton_C_PreConstruct");
static_assert(sizeof(WI_JPPrimaryButton_C_PreConstruct) == 0x000001, "Wrong size on WI_JPPrimaryButton_C_PreConstruct");
static_assert(offsetof(WI_JPPrimaryButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_JPPrimaryButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.SetContentAlignment
// 0x0001 (0x0001 - 0x0000)
struct WI_JPPrimaryButton_C_SetContentAlignment final
{
public:
	EHorizontalAlignment                          ContentAlignment_0;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_SetContentAlignment) == 0x000001, "Wrong alignment on WI_JPPrimaryButton_C_SetContentAlignment");
static_assert(sizeof(WI_JPPrimaryButton_C_SetContentAlignment) == 0x000001, "Wrong size on WI_JPPrimaryButton_C_SetContentAlignment");
static_assert(offsetof(WI_JPPrimaryButton_C_SetContentAlignment, ContentAlignment_0) == 0x000000, "Member 'WI_JPPrimaryButton_C_SetContentAlignment::ContentAlignment_0' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.SetControllerStyle
// 0x0010 (0x0010 - 0x0000)
struct WI_JPPrimaryButton_C_SetControllerStyle final
{
public:
	class UClass*                                 ControllerInputStyle_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwningPlayerUsingGamepad_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_SetControllerStyle) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_SetControllerStyle");
static_assert(sizeof(WI_JPPrimaryButton_C_SetControllerStyle) == 0x000010, "Wrong size on WI_JPPrimaryButton_C_SetControllerStyle");
static_assert(offsetof(WI_JPPrimaryButton_C_SetControllerStyle, ControllerInputStyle_0) == 0x000000, "Member 'WI_JPPrimaryButton_C_SetControllerStyle::ControllerInputStyle_0' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_SetControllerStyle, CallFunc_IsOwningPlayerUsingGamepad_ReturnValue) == 0x000008, "Member 'WI_JPPrimaryButton_C_SetControllerStyle::CallFunc_IsOwningPlayerUsingGamepad_ReturnValue' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.SetMouseKeyboardStyle
// 0x0010 (0x0010 - 0x0000)
struct WI_JPPrimaryButton_C_SetMouseKeyboardStyle final
{
public:
	class UClass*                                 ControllerInputStyle_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwningPlayerUsingGamepad_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_SetMouseKeyboardStyle) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_SetMouseKeyboardStyle");
static_assert(sizeof(WI_JPPrimaryButton_C_SetMouseKeyboardStyle) == 0x000010, "Wrong size on WI_JPPrimaryButton_C_SetMouseKeyboardStyle");
static_assert(offsetof(WI_JPPrimaryButton_C_SetMouseKeyboardStyle, ControllerInputStyle_0) == 0x000000, "Member 'WI_JPPrimaryButton_C_SetMouseKeyboardStyle::ControllerInputStyle_0' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_SetMouseKeyboardStyle, CallFunc_IsOwningPlayerUsingGamepad_ReturnValue) == 0x000008, "Member 'WI_JPPrimaryButton_C_SetMouseKeyboardStyle::CallFunc_IsOwningPlayerUsingGamepad_ReturnValue' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WI_JPPrimaryButton_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPPrimaryButton_C_UpdateButtonText) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_UpdateButtonText");
static_assert(sizeof(WI_JPPrimaryButton_C_UpdateButtonText) == 0x000010, "Wrong size on WI_JPPrimaryButton_C_UpdateButtonText");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateButtonText, InText) == 0x000000, "Member 'WI_JPPrimaryButton_C_UpdateButtonText::InText' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.UpdateContentAlignment
// 0x0018 (0x0018 - 0x0000)
struct WI_JPPrimaryButton_C_UpdateContentAlignment final
{
public:
	class UPanelSlot*                             CallFunc_GetContentSlot_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_UpdateContentAlignment) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_UpdateContentAlignment");
static_assert(sizeof(WI_JPPrimaryButton_C_UpdateContentAlignment) == 0x000018, "Wrong size on WI_JPPrimaryButton_C_UpdateContentAlignment");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateContentAlignment, CallFunc_GetContentSlot_ReturnValue) == 0x000000, "Member 'WI_JPPrimaryButton_C_UpdateContentAlignment::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateContentAlignment, K2Node_DynamicCast_AsBorder_Slot) == 0x000008, "Member 'WI_JPPrimaryButton_C_UpdateContentAlignment::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateContentAlignment, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WI_JPPrimaryButton_C_UpdateContentAlignment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.UpdateStyle
// 0x0002 (0x0002 - 0x0000)
struct WI_JPPrimaryButton_C_UpdateStyle final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_UpdateStyle) == 0x000001, "Wrong alignment on WI_JPPrimaryButton_C_UpdateStyle");
static_assert(sizeof(WI_JPPrimaryButton_C_UpdateStyle) == 0x000002, "Wrong size on WI_JPPrimaryButton_C_UpdateStyle");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateStyle, UsingGamepad) == 0x000000, "Member 'WI_JPPrimaryButton_C_UpdateStyle::UsingGamepad' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateStyle, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'WI_JPPrimaryButton_C_UpdateStyle::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.UpdateTextAndStyle
// 0x0002 (0x0002 - 0x0000)
struct WI_JPPrimaryButton_C_UpdateTextAndStyle final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_UpdateTextAndStyle) == 0x000001, "Wrong alignment on WI_JPPrimaryButton_C_UpdateTextAndStyle");
static_assert(sizeof(WI_JPPrimaryButton_C_UpdateTextAndStyle) == 0x000002, "Wrong size on WI_JPPrimaryButton_C_UpdateTextAndStyle");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateTextAndStyle, InputType) == 0x000000, "Member 'WI_JPPrimaryButton_C_UpdateTextAndStyle::InputType' has a wrong offset!");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateTextAndStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WI_JPPrimaryButton_C_UpdateTextAndStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WI_JPPrimaryButton.WI_JPPrimaryButton_C.UpdateTextStyle
// 0x0008 (0x0008 - 0x0000)
struct WI_JPPrimaryButton_C_UpdateTextStyle final
{
public:
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPPrimaryButton_C_UpdateTextStyle) == 0x000008, "Wrong alignment on WI_JPPrimaryButton_C_UpdateTextStyle");
static_assert(sizeof(WI_JPPrimaryButton_C_UpdateTextStyle) == 0x000008, "Wrong size on WI_JPPrimaryButton_C_UpdateTextStyle");
static_assert(offsetof(WI_JPPrimaryButton_C_UpdateTextStyle, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000000, "Member 'WI_JPPrimaryButton_C_UpdateTextStyle::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");

}

