#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPConfirmationDialogBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPConfirmationDialogBase.WI_JPConfirmationDialogBase_C
// 0x0018 (0x0488 - 0x0470)
class UWI_JPConfirmationDialogBase_C : public ULyraConfirmationScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnActivated;                                       // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DarkBackground;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_WI_JPConfirmationDialogBase(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPConfirmationDialogBase_C">();
	}
	static class UWI_JPConfirmationDialogBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPConfirmationDialogBase_C>();
	}
};
static_assert(alignof(UWI_JPConfirmationDialogBase_C) == 0x000008, "Wrong alignment on UWI_JPConfirmationDialogBase_C");
static_assert(sizeof(UWI_JPConfirmationDialogBase_C) == 0x000488, "Wrong size on UWI_JPConfirmationDialogBase_C");
static_assert(offsetof(UWI_JPConfirmationDialogBase_C, UberGraphFrame) == 0x000470, "Member 'UWI_JPConfirmationDialogBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPConfirmationDialogBase_C, OnActivated) == 0x000478, "Member 'UWI_JPConfirmationDialogBase_C::OnActivated' has a wrong offset!");
static_assert(offsetof(UWI_JPConfirmationDialogBase_C, DarkBackground) == 0x000480, "Member 'UWI_JPConfirmationDialogBase_C::DarkBackground' has a wrong offset!");

}

