#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsRotator

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.BP_OnDefaultOptionSpecified
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified final
{
public:
	int32                                         DefaultOptionIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified) == 0x000004, "Wrong alignment on WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified");
static_assert(sizeof(WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified) == 0x000004, "Wrong size on WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified");
static_assert(offsetof(WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified, DefaultOptionIndex) == 0x000000, "Member 'WI_JPSettingsRotator_C_BP_OnDefaultOptionSpecified::DefaultOptionIndex' has a wrong offset!");

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.BP_OnOptionSelected
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsRotator_C_BP_OnOptionSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_BP_OnOptionSelected) == 0x000004, "Wrong alignment on WI_JPSettingsRotator_C_BP_OnOptionSelected");
static_assert(sizeof(WI_JPSettingsRotator_C_BP_OnOptionSelected) == 0x000004, "Wrong size on WI_JPSettingsRotator_C_BP_OnOptionSelected");
static_assert(offsetof(WI_JPSettingsRotator_C_BP_OnOptionSelected, Index_0) == 0x000000, "Member 'WI_JPSettingsRotator_C_BP_OnOptionSelected::Index_0' has a wrong offset!");

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.BP_OnOptionsPopulated
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsRotator_C_BP_OnOptionsPopulated final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_BP_OnOptionsPopulated) == 0x000004, "Wrong alignment on WI_JPSettingsRotator_C_BP_OnOptionsPopulated");
static_assert(sizeof(WI_JPSettingsRotator_C_BP_OnOptionsPopulated) == 0x000004, "Wrong size on WI_JPSettingsRotator_C_BP_OnOptionsPopulated");
static_assert(offsetof(WI_JPSettingsRotator_C_BP_OnOptionsPopulated, Count) == 0x000000, "Member 'WI_JPSettingsRotator_C_BP_OnOptionsPopulated::Count' has a wrong offset!");

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.ExecuteUbergraph_WI_JPSettingsRotator
// 0x0090 (0x0090 - 0x0000)
struct WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DefaultOptionIndex;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_CommonSettings_Pip_C*               CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Count;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_CommonSettings_Pip_C*               CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CommonSettings_Pip_C*               CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_CommonSettings_Pip_C*               CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_CommonSettings_Pip_C*               CallFunc_Array_Get_Item_3;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator) == 0x000008, "Wrong alignment on WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator");
static_assert(sizeof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator) == 0x000090, "Wrong size on WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, EntryPoint) == 0x000000, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, K2Node_Event_Count) == 0x000018, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, K2Node_Event_Index) == 0x00001C, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, K2Node_Event_DefaultOptionIndex) == 0x000020, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::K2Node_Event_DefaultOptionIndex' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, K2Node_CustomEvent_Count) == 0x000030, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000048, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Get_Item) == 0x000050, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, Temp_int_Variable) == 0x000060, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Get_Item_3) == 0x000080, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'WI_JPSettingsRotator_C_ExecuteUbergraph_WI_JPSettingsRotator::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_JPSettingsRotator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_PreConstruct) == 0x000001, "Wrong alignment on WI_JPSettingsRotator_C_PreConstruct");
static_assert(sizeof(WI_JPSettingsRotator_C_PreConstruct) == 0x000001, "Wrong size on WI_JPSettingsRotator_C_PreConstruct");
static_assert(offsetof(WI_JPSettingsRotator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_JPSettingsRotator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_JPSettingsRotator.WI_JPSettingsRotator_C.SpawnPips
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsRotator_C_SpawnPips final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsRotator_C_SpawnPips) == 0x000004, "Wrong alignment on WI_JPSettingsRotator_C_SpawnPips");
static_assert(sizeof(WI_JPSettingsRotator_C_SpawnPips) == 0x000004, "Wrong size on WI_JPSettingsRotator_C_SpawnPips");
static_assert(offsetof(WI_JPSettingsRotator_C_SpawnPips, Count) == 0x000000, "Member 'WI_JPSettingsRotator_C_SpawnPips::Count' has a wrong offset!");

}

