#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPHorizontalTabList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPHorizontalTabList.WI_JPHorizontalTabList_C
// 0x0098 (0x05B8 - 0x0520)
class UWI_JPHorizontalTabList_C final : public UJPTabListWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DottedLine;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DottedLine_1;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                LeftSpacer;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   NextTabActionWidget;                               // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NextTabActionWrapper;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   PreviousTabActionWidget;                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PreviousTabActionWrapper;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                RightSpacer;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabButtonBox;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TabButtonPadding;                                  // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UClass*                                 ButtonStyle;                                       // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseButtonStyle;                                    // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinTabWidth;                                       // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DebugButtonTypeDisplay;                            // 0x0590(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugTabCount;                                     // 0x0598(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DebugTabText;                                      // 0x05A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          EnableLeftSpacer;                                  // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableRightSpacer;                                 // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DebugCreateTabsForDesigner();
	void ExecuteUbergraph_WI_JPHorizontalTabList(int32 EntryPoint);
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void HandleTabRemoval(class FName TabNameID, class UCommonButtonBase* TabButton);
	void HandleTabSelected(class FName TabId);
	void HandleVisibilityChanged(ESlateVisibility InVisibility);
	void PreConstruct(bool IsDesignTime);
	void Previous_Visibility();
	void UpdateTabStyles(class FName TabName, class UCommonButtonBase* ButtonWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPHorizontalTabList_C">();
	}
	static class UWI_JPHorizontalTabList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPHorizontalTabList_C>();
	}
};
static_assert(alignof(UWI_JPHorizontalTabList_C) == 0x000008, "Wrong alignment on UWI_JPHorizontalTabList_C");
static_assert(sizeof(UWI_JPHorizontalTabList_C) == 0x0005B8, "Wrong size on UWI_JPHorizontalTabList_C");
static_assert(offsetof(UWI_JPHorizontalTabList_C, UberGraphFrame) == 0x000520, "Member 'UWI_JPHorizontalTabList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, DottedLine) == 0x000528, "Member 'UWI_JPHorizontalTabList_C::DottedLine' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, DottedLine_1) == 0x000530, "Member 'UWI_JPHorizontalTabList_C::DottedLine_1' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, LeftSpacer) == 0x000538, "Member 'UWI_JPHorizontalTabList_C::LeftSpacer' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, NextTabActionWidget) == 0x000540, "Member 'UWI_JPHorizontalTabList_C::NextTabActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, NextTabActionWrapper) == 0x000548, "Member 'UWI_JPHorizontalTabList_C::NextTabActionWrapper' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, PreviousTabActionWidget) == 0x000550, "Member 'UWI_JPHorizontalTabList_C::PreviousTabActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, PreviousTabActionWrapper) == 0x000558, "Member 'UWI_JPHorizontalTabList_C::PreviousTabActionWrapper' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, RightSpacer) == 0x000560, "Member 'UWI_JPHorizontalTabList_C::RightSpacer' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, TabButtonBox) == 0x000568, "Member 'UWI_JPHorizontalTabList_C::TabButtonBox' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, TabButtonPadding) == 0x000570, "Member 'UWI_JPHorizontalTabList_C::TabButtonPadding' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, ButtonStyle) == 0x000580, "Member 'UWI_JPHorizontalTabList_C::ButtonStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, UseButtonStyle) == 0x000588, "Member 'UWI_JPHorizontalTabList_C::UseButtonStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, MinTabWidth) == 0x00058C, "Member 'UWI_JPHorizontalTabList_C::MinTabWidth' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, DebugButtonTypeDisplay) == 0x000590, "Member 'UWI_JPHorizontalTabList_C::DebugButtonTypeDisplay' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, DebugTabCount) == 0x000598, "Member 'UWI_JPHorizontalTabList_C::DebugTabCount' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, DebugTabText) == 0x0005A0, "Member 'UWI_JPHorizontalTabList_C::DebugTabText' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, EnableLeftSpacer) == 0x0005B0, "Member 'UWI_JPHorizontalTabList_C::EnableLeftSpacer' has a wrong offset!");
static_assert(offsetof(UWI_JPHorizontalTabList_C, EnableRightSpacer) == 0x0005B1, "Member 'UWI_JPHorizontalTabList_C::EnableRightSpacer' has a wrong offset!");

}

