#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSetting_Checkbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPCommonSetting_Checkbox.WI_JPCommonSetting_Checkbox_C
// 0x0030 (0x0378 - 0x0348)
class UWI_JPCommonSetting_Checkbox_C final : public UJPSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       TextTitle;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CommonSettingsCheckbox_C*           WI_JPCheckbox;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPSettingsEntryOneLiner_C*          WI_JPSettingsEntryOneLiner;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Even;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 TextStyleOverwrite;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WI_JPCommonSetting_Checkbox_WI_JPCheckbox_K2Node_ComponentBoundEvent_0_OnChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WI_JPCommonSetting_Checkbox(int32 EntryPoint);
	bool GetValue();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetTextStyle();
	void SetValue(bool InChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPCommonSetting_Checkbox_C">();
	}
	static class UWI_JPCommonSetting_Checkbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPCommonSetting_Checkbox_C>();
	}
};
static_assert(alignof(UWI_JPCommonSetting_Checkbox_C) == 0x000008, "Wrong alignment on UWI_JPCommonSetting_Checkbox_C");
static_assert(sizeof(UWI_JPCommonSetting_Checkbox_C) == 0x000378, "Wrong size on UWI_JPCommonSetting_Checkbox_C");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, UberGraphFrame) == 0x000348, "Member 'UWI_JPCommonSetting_Checkbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, TextTitle) == 0x000350, "Member 'UWI_JPCommonSetting_Checkbox_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, WI_JPCheckbox) == 0x000358, "Member 'UWI_JPCommonSetting_Checkbox_C::WI_JPCheckbox' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, WI_JPSettingsEntryOneLiner) == 0x000360, "Member 'UWI_JPCommonSetting_Checkbox_C::WI_JPSettingsEntryOneLiner' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, Is_Even) == 0x000368, "Member 'UWI_JPCommonSetting_Checkbox_C::Is_Even' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSetting_Checkbox_C, TextStyleOverwrite) == 0x000370, "Member 'UWI_JPCommonSetting_Checkbox_C::TextStyleOverwrite' has a wrong offset!");

}

