#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsListEntry_Scalar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.Add Normalized Value Clamped
// 0x0040 (0x0040 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped final
{
public:
	double                                        NormalizedValue;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped) == 0x000040, "Wrong size on WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, NormalizedValue) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::NormalizedValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_GetNormalizedValue_ReturnValue) == 0x000008, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000028, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast) == 0x000030, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped, CallFunc_SetValue_InValue_ImplicitCast) == 0x000038, "Member 'WI_JPSettingsListEntry_Scalar_C_Add_Normalized_Value_Clamped::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Decrease_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_BndEvt__WI_JPSettingsListEntry_Scalar_Button_Increase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.ExecuteUbergraph_WI_JPSettingsListEntry_Scalar
// 0x01D0 (0x01D0 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedStep_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DefaultValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0078)(ConstParm)
	bool                                          CallFunc_IsOwningPlayerUsingTouch_ReturnValue;     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IJPGameSettingWithOddEvenInterface> K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface; // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEven_ReturnValue;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedStep_ReturnValue_1;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_Normalized_Value_Clamped_NormalizedValue_ImplicitCast; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar) == 0x0001D0, "Wrong size on WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, EntryPoint) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_GetNormalizedStep_ReturnValue) == 0x000004, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_GetNormalizedStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_Value) == 0x000008, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_DefaultValue) == 0x000020, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_DefaultValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_MyGeometry) == 0x000024, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000D8, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000E0, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_IsOwningPlayerUsingTouch_ReturnValue) == 0x000160, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_IsOwningPlayerUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000168, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000170, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_Event_ListItemObject) == 0x000178, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface) == 0x000180, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_DynamicCast_AsJPGame_Setting_with_Odd_Even_Interface' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_GetIsEven_ReturnValue) == 0x000191, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_GetIsEven_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_ComponentBoundEvent_Button_1) == 0x000198, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, K2Node_ComponentBoundEvent_Button) == 0x0001A0, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_GetNormalizedStep_ReturnValue_1) == 0x0001A8, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_GetNormalizedStep_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001B0, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0001B8, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast) == 0x0001C0, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar, CallFunc_Add_Normalized_Value_Clamped_NormalizedValue_ImplicitCast) == 0x0001C8, "Member 'WI_JPSettingsListEntry_Scalar_C_ExecuteUbergraph_WI_JPSettingsListEntry_Scalar::CallFunc_Add_Normalized_Value_Clamped_NormalizedValue_ImplicitCast' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong size on WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged, DefaultValue) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_OnDefaultValueChanged::DefaultValue' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet) == 0x000008, "Wrong size on WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_OnMouseEnter) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_OnMouseEnter");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_OnMouseEnter) == 0x0000B0, "Wrong size on WI_JPSettingsListEntry_Scalar_C_OnMouseEnter");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WI_JPSettingsListEntry_Scalar_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_OnMouseLeave) == 0x000008, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_OnMouseLeave");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_OnMouseLeave) == 0x000078, "Wrong size on WI_JPSettingsListEntry_Scalar_C_OnMouseLeave");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WI_JPSettingsListEntry_Scalar.WI_JPSettingsListEntry_Scalar_C.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct WI_JPSettingsListEntry_Scalar_C_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong alignment on WI_JPSettingsListEntry_Scalar_C_OnValueChanged");
static_assert(sizeof(WI_JPSettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong size on WI_JPSettingsListEntry_Scalar_C_OnValueChanged");
static_assert(offsetof(WI_JPSettingsListEntry_Scalar_C_OnValueChanged, Value) == 0x000000, "Member 'WI_JPSettingsListEntry_Scalar_C_OnValueChanged::Value' has a wrong offset!");

}

