#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_KnockedOut

#include "Basic.hpp"

#include "S_ProTip_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_KnockedOut.WI_KnockedOut_C.ExecuteUbergraph_WI_KnockedOut
// 0x01C0 (0x01C0 - 0x0000)
struct WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_DeathGrayoutWrapper_C*>      CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_DeathGrayoutWrapper_C*              K2Node_DynamicCast_AsWI_Death_Grayout_Wrapper;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InEnabled;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0070(0x0010)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRuntimeFloatCurveValue_ReturnValue;    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerControllerJP_MatchBPComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP*                           K2Node_DynamicCast_AsGame_State_JP;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DeathComponent_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWantsToRespawn_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerControllerJP_MatchBPComponent_C* CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0140(0x0010)()
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Deathtimer;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0010)()
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue_2;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01A8(0x0010)()
	float                                         CallFunc_GetRuntimeFloatCurveValue_InTime_ImplicitCast; // 0x01B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut) == 0x000008, "Wrong alignment on WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut");
static_assert(sizeof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut) == 0x0001C0, "Wrong size on WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, EntryPoint) == 0x000000, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000018, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Array_Get_Item) == 0x000038, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_DynamicCast_AsWI_Death_Grayout_Wrapper) == 0x000040, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_DynamicCast_AsWI_Death_Grayout_Wrapper' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000060, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000068, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_CustomEvent_InEnabled) == 0x000069, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_CustomEvent_InEnabled' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, Temp_text_Variable) == 0x000070, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_Event_MyGeometry) == 0x000080, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_Event_InDeltaTime) == 0x0000B8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000C0, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x0000C8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetRuntimeFloatCurveValue_ReturnValue) == 0x0000D8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetRuntimeFloatCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetPlayerController_ReturnValue) == 0x0000E0, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetGameState_ReturnValue) == 0x0000E8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetComponentByClass_ReturnValue) == 0x0000F0, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_DynamicCast_AsGame_State_JP) == 0x0000F8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_DynamicCast_AsGame_State_JP' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000108, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetWantsToRespawn_ReturnValue) == 0x000110, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetWantsToRespawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetPlayerController_ReturnValue_1) == 0x000118, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000120, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000128, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000130, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, Temp_text_Variable_1) == 0x000140, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x000150, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000158, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000160, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_FFloor_ReturnValue) == 0x000168, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Add_IntInt_ReturnValue_1) == 0x00016C, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_CustomEvent_Deathtimer) == 0x000170, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_CustomEvent_Deathtimer' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Greater_IntInt_ReturnValue) == 0x000178, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000179, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetRealTimeSeconds_ReturnValue_2) == 0x000190, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetRealTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, Temp_bool_Variable) == 0x000198, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001A0, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, K2Node_Select_Default) == 0x0001A8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut, CallFunc_GetRuntimeFloatCurveValue_InTime_ImplicitCast) == 0x0001B8, "Member 'WI_KnockedOut_C_ExecuteUbergraph_WI_KnockedOut::CallFunc_GetRuntimeFloatCurveValue_InTime_ImplicitCast' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.GetTipActionFromID
// 0x0010 (0x0010 - 0x0000)
struct WI_KnockedOut_C_GetTipActionFromID final
{
public:
	class UItemDefinition*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemAction_KnockedOutTips*             AsItem_Action_Knocked_Out_Tips;                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_GetTipActionFromID) == 0x000008, "Wrong alignment on WI_KnockedOut_C_GetTipActionFromID");
static_assert(sizeof(WI_KnockedOut_C_GetTipActionFromID) == 0x000010, "Wrong size on WI_KnockedOut_C_GetTipActionFromID");
static_assert(offsetof(WI_KnockedOut_C_GetTipActionFromID, Target) == 0x000000, "Member 'WI_KnockedOut_C_GetTipActionFromID::Target' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_GetTipActionFromID, AsItem_Action_Knocked_Out_Tips) == 0x000008, "Member 'WI_KnockedOut_C_GetTipActionFromID::AsItem_Action_Knocked_Out_Tips' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.SetDeathtimer
// 0x0008 (0x0008 - 0x0000)
struct WI_KnockedOut_C_SetDeathtimer final
{
public:
	double                                        Deathtimer_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_SetDeathtimer) == 0x000008, "Wrong alignment on WI_KnockedOut_C_SetDeathtimer");
static_assert(sizeof(WI_KnockedOut_C_SetDeathtimer) == 0x000008, "Wrong size on WI_KnockedOut_C_SetDeathtimer");
static_assert(offsetof(WI_KnockedOut_C_SetDeathtimer, Deathtimer_0) == 0x000000, "Member 'WI_KnockedOut_C_SetDeathtimer::Deathtimer_0' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.SetGrayoutEnabled
// 0x0001 (0x0001 - 0x0000)
struct WI_KnockedOut_C_SetGrayoutEnabled final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_SetGrayoutEnabled) == 0x000001, "Wrong alignment on WI_KnockedOut_C_SetGrayoutEnabled");
static_assert(sizeof(WI_KnockedOut_C_SetGrayoutEnabled) == 0x000001, "Wrong size on WI_KnockedOut_C_SetGrayoutEnabled");
static_assert(offsetof(WI_KnockedOut_C_SetGrayoutEnabled, InEnabled) == 0x000000, "Member 'WI_KnockedOut_C_SetGrayoutEnabled::InEnabled' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.SetRandomTipText
// 0x0040 (0x0040 - 0x0000)
struct WI_KnockedOut_C_SetRandomTipText final
{
public:
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0000(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ProTip                              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0018)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_SetRandomTipText) == 0x000008, "Wrong alignment on WI_KnockedOut_C_SetRandomTipText");
static_assert(sizeof(WI_KnockedOut_C_SetRandomTipText) == 0x000040, "Wrong size on WI_KnockedOut_C_SetRandomTipText");
static_assert(offsetof(WI_KnockedOut_C_SetRandomTipText, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000000, "Member 'WI_KnockedOut_C_SetRandomTipText::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_SetRandomTipText, CallFunc_Array_Random_OutItem) == 0x000010, "Member 'WI_KnockedOut_C_SetRandomTipText::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_SetRandomTipText, CallFunc_Array_Random_OutIndex) == 0x000018, "Member 'WI_KnockedOut_C_SetRandomTipText::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_SetRandomTipText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WI_KnockedOut_C_SetRandomTipText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_SetRandomTipText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000038, "Member 'WI_KnockedOut_C_SetRandomTipText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.Tick
// 0x003C (0x003C - 0x0000)
struct WI_KnockedOut_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_Tick) == 0x000004, "Wrong alignment on WI_KnockedOut_C_Tick");
static_assert(sizeof(WI_KnockedOut_C_Tick) == 0x00003C, "Wrong size on WI_KnockedOut_C_Tick");
static_assert(offsetof(WI_KnockedOut_C_Tick, MyGeometry) == 0x000000, "Member 'WI_KnockedOut_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_Tick, InDeltaTime) == 0x000038, "Member 'WI_KnockedOut_C_Tick::InDeltaTime' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.TrySetContextualTipText
// 0x00B8 (0x00B8 - 0x0000)
struct WI_KnockedOut_C_TrySetContextualTipText final
{
public:
	class UItemDefinition*                        ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAction*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAction_KnockedOutTips*             K2Node_DynamicCast_AsItem_Action_Knocked_Out_Tips; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_Array_Random_OutItem;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Random_OutItem_1;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ProTip                              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0018)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_TrySetContextualTipText) == 0x000008, "Wrong alignment on WI_KnockedOut_C_TrySetContextualTipText");
static_assert(sizeof(WI_KnockedOut_C_TrySetContextualTipText) == 0x0000B8, "Wrong size on WI_KnockedOut_C_TrySetContextualTipText");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, ItemDefinition) == 0x000000, "Member 'WI_KnockedOut_C_TrySetContextualTipText::ItemDefinition' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WI_KnockedOut_C_TrySetContextualTipText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Get_Item) == 0x000010, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, K2Node_DynamicCast_AsItem_Action_Knocked_Out_Tips) == 0x000020, "Member 'WI_KnockedOut_C_TrySetContextualTipText::K2Node_DynamicCast_AsItem_Action_Knocked_Out_Tips' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WI_KnockedOut_C_TrySetContextualTipText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WI_KnockedOut_C_TrySetContextualTipText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Random_OutItem) == 0x000030, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Random_OutIndex) == 0x000038, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000040, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Random_OutItem_1) == 0x000054, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Array_Random_OutIndex_1) == 0x00005C, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Conv_NameToString_ReturnValue) == 0x000080, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_TrySetContextualTipText, CallFunc_Get_ClassLog_Name_name) == 0x0000A8, "Member 'WI_KnockedOut_C_TrySetContextualTipText::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.UpdateEliminationData
// 0x0001 (0x0001 - 0x0000)
struct WI_KnockedOut_C_UpdateEliminationData final
{
public:
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_KnockedOut_C_UpdateEliminationData) == 0x000001, "Wrong alignment on WI_KnockedOut_C_UpdateEliminationData");
static_assert(sizeof(WI_KnockedOut_C_UpdateEliminationData) == 0x000001, "Wrong size on WI_KnockedOut_C_UpdateEliminationData");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationData, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000000, "Member 'WI_KnockedOut_C_UpdateEliminationData::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.UpdateEliminationDataEnvironment
// 0x01C8 (0x01C8 - 0x0000)
struct WI_KnockedOut_C_UpdateEliminationDataEnvironment final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0018(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0028(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0038(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0048(0x0010)()
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0098(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x00B8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E8(0x0048)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0130(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0150(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0010)()
};
static_assert(alignof(WI_KnockedOut_C_UpdateEliminationDataEnvironment) == 0x000008, "Wrong alignment on WI_KnockedOut_C_UpdateEliminationDataEnvironment");
static_assert(sizeof(WI_KnockedOut_C_UpdateEliminationDataEnvironment) == 0x0001C8, "Wrong size on WI_KnockedOut_C_UpdateEliminationDataEnvironment");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, Temp_int_Variable) == 0x000000, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000018, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000028, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000038, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000048, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_RandomInteger_ReturnValue) == 0x000058, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Conv_TextToString_ReturnValue) == 0x000068, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_DynamicCast_AsTexture_2D) == 0x000078, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000098, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0000B8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_MakeLiteralText_ReturnValue_7) == 0x0000D8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_MakeStruct_FormatArgumentData) == 0x0000E8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_Select_Default) == 0x000130, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_MakeArray_Array) == 0x000140, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_MakeStruct_FormatArgumentData_1) == 0x000150, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Format_ReturnValue) == 0x000198, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataEnvironment, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'WI_KnockedOut_C_UpdateEliminationDataEnvironment::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WI_KnockedOut.WI_KnockedOut_C.UpdateEliminationDataPlayer
// 0x0218 (0x0218 - 0x0000)
struct WI_KnockedOut_C_UpdateEliminationDataPlayer final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0018(0x0010)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0170(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0180(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0190(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0010)()
};
static_assert(alignof(WI_KnockedOut_C_UpdateEliminationDataPlayer) == 0x000008, "Wrong alignment on WI_KnockedOut_C_UpdateEliminationDataPlayer");
static_assert(sizeof(WI_KnockedOut_C_UpdateEliminationDataPlayer) == 0x000218, "Wrong size on WI_KnockedOut_C_UpdateEliminationDataPlayer");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataPlayer, Temp_int_Variable) == 0x000000, "Member 'WI_KnockedOut_C_UpdateEliminationDataPlayer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataPlayer, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WI_KnockedOut_C_UpdateEliminationDataPlayer::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_KnockedOut_C_UpdateEliminationDataPlayer, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000018, "Member 'WI_KnockedOut_C_UpdateEliminationDataPlayer::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
