#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_KnockedOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_DeathTimerDetails_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_KnockedOut.WI_KnockedOut_C
// 0x0540 (0x0970 - 0x0430)
class UWI_KnockedOut_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RespawnDecrement;                                  // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RespawnAvailable;                                  // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ElimInfo;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_501;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Eliminator;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionWidget_C*                   InputActionWidget_C;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputActionWidget_C*                   InputActionWidget_C_0;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RespawnCountdown;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RespawnInfo;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RespawnText;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_EliminationCause;                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_77;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTip;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeText;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_KnockedOut_DeathTimerDetails_C*     WI_KnockedOut_DeathTimerDetails;                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Deathtimer;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          TempEliminated;                                    // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DeathTimerDetails                   Death_Timer_Details;                               // 0x04D0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKillInfo                              KillInfo;                                          // 0x04F8(0x03D8)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          RespawnBlocked;                                    // 0x08D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x3];                                      // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrevRespawnCountdown;                              // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GrayoutTimestamp;                                  // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     GrayoutFadeCurve;                                  // 0x08E0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        RespawnTime;                                       // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WI_KnockedOut(int32 EntryPoint);
	void FadeGrayoutPostProcessing();
	void GetTipActionFromID(class UItemDefinition* Target, class UItemAction_KnockedOutTips** AsItem_Action_Knocked_Out_Tips);
	void HandleGameEnded();
	void SetDeathtimer(double Deathtimer_0);
	void SetGrayoutEnabled(bool InEnabled);
	void SetRandomTipText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickDeathCountdown();
	void TrySetContextualTipText(class UItemDefinition* ItemDefinition);
	void UpdateEliminationData();
	void UpdateEliminationDataEnvironment();
	void UpdateEliminationDataPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_KnockedOut_C">();
	}
	static class UWI_KnockedOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_KnockedOut_C>();
	}
};
static_assert(alignof(UWI_KnockedOut_C) == 0x000008, "Wrong alignment on UWI_KnockedOut_C");
static_assert(sizeof(UWI_KnockedOut_C) == 0x000970, "Wrong size on UWI_KnockedOut_C");
static_assert(offsetof(UWI_KnockedOut_C, UberGraphFrame) == 0x000430, "Member 'UWI_KnockedOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnDecrement) == 0x000438, "Member 'UWI_KnockedOut_C::RespawnDecrement' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnAvailable) == 0x000440, "Member 'UWI_KnockedOut_C::RespawnAvailable' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, Open) == 0x000448, "Member 'UWI_KnockedOut_C::Open' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, ElimInfo) == 0x000450, "Member 'UWI_KnockedOut_C::ElimInfo' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, Image_501) == 0x000458, "Member 'UWI_KnockedOut_C::Image_501' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, Image_Eliminator) == 0x000460, "Member 'UWI_KnockedOut_C::Image_Eliminator' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, InputActionWidget_C) == 0x000468, "Member 'UWI_KnockedOut_C::InputActionWidget_C' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, InputActionWidget_C_0) == 0x000470, "Member 'UWI_KnockedOut_C::InputActionWidget_C_0' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnCountdown) == 0x000478, "Member 'UWI_KnockedOut_C::RespawnCountdown' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnInfo) == 0x000480, "Member 'UWI_KnockedOut_C::RespawnInfo' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnText) == 0x000488, "Member 'UWI_KnockedOut_C::RespawnText' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RichTextBlock_EliminationCause) == 0x000490, "Member 'UWI_KnockedOut_C::RichTextBlock_EliminationCause' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, TextBlock_77) == 0x000498, "Member 'UWI_KnockedOut_C::TextBlock_77' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, TextTip) == 0x0004A0, "Member 'UWI_KnockedOut_C::TextTip' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, TimeText) == 0x0004A8, "Member 'UWI_KnockedOut_C::TimeText' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, WI_JPActionWidget) == 0x0004B0, "Member 'UWI_KnockedOut_C::WI_JPActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, WI_KnockedOut_DeathTimerDetails) == 0x0004B8, "Member 'UWI_KnockedOut_C::WI_KnockedOut_DeathTimerDetails' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, Deathtimer) == 0x0004C0, "Member 'UWI_KnockedOut_C::Deathtimer' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, TempEliminated) == 0x0004C8, "Member 'UWI_KnockedOut_C::TempEliminated' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, Death_Timer_Details) == 0x0004D0, "Member 'UWI_KnockedOut_C::Death_Timer_Details' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, KillInfo) == 0x0004F8, "Member 'UWI_KnockedOut_C::KillInfo' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnBlocked) == 0x0008D0, "Member 'UWI_KnockedOut_C::RespawnBlocked' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, PrevRespawnCountdown) == 0x0008D4, "Member 'UWI_KnockedOut_C::PrevRespawnCountdown' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, GrayoutTimestamp) == 0x0008D8, "Member 'UWI_KnockedOut_C::GrayoutTimestamp' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, GrayoutFadeCurve) == 0x0008E0, "Member 'UWI_KnockedOut_C::GrayoutFadeCurve' has a wrong offset!");
static_assert(offsetof(UWI_KnockedOut_C, RespawnTime) == 0x000968, "Member 'UWI_KnockedOut_C::RespawnTime' has a wrong offset!");

}

