#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_KillFeedEntry_PlayerKnockedOutPlayer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_KillFeedEntry_PlayerKnockedOutPlayer.WI_KillFeedEntry_PlayerKnockedOutPlayer_C.ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer
// 0x00B8 (0x00B8 - 0x0000)
struct WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_AttackerPortraitTexture;        // 0x0008(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_ReceiverPortraitTExture;        // 0x0030(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_AttackerPortraitBackgroundColor; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_ReceiverPortraitBackgroundColor; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_AttackerType;                   // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	ETeamType                                     K2Node_CustomEvent_AttackerTeam;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_AttackerName;                   // 0x0088(0x0010)()
	struct FGameplayTag                           K2Node_CustomEvent_ReceiverType;                   // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	ETeamType                                     K2Node_CustomEvent_ReceiverTeam;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ReceiverName;                   // 0x00A8(0x0010)()
};
static_assert(alignof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer) == 0x000008, "Wrong alignment on WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer");
static_assert(sizeof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer) == 0x0000B8, "Wrong size on WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, EntryPoint) == 0x000000, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_AttackerPortraitTexture) == 0x000008, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_AttackerPortraitTexture' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_ReceiverPortraitTExture) == 0x000030, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_ReceiverPortraitTExture' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_AttackerPortraitBackgroundColor) == 0x000058, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_AttackerPortraitBackgroundColor' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_ReceiverPortraitBackgroundColor) == 0x000068, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_ReceiverPortraitBackgroundColor' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_AttackerType) == 0x000078, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_AttackerType' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_AttackerTeam) == 0x000080, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_AttackerTeam' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_AttackerName) == 0x000088, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_AttackerName' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_ReceiverType) == 0x000098, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_ReceiverType' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_ReceiverTeam) == 0x0000A0, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_ReceiverTeam' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer, K2Node_CustomEvent_ReceiverName) == 0x0000A8, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_ExecuteUbergraph_WI_KillFeedEntry_PlayerKnockedOutPlayer::K2Node_CustomEvent_ReceiverName' has a wrong offset!");

// Function WI_KillFeedEntry_PlayerKnockedOutPlayer.WI_KillFeedEntry_PlayerKnockedOutPlayer_C.UpdateKillDataAndShow
// 0x00B0 (0x00B0 - 0x0000)
struct WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow final
{
public:
	TSoftObjectPtr<class UTexture2D>              AttackerPortraitTexture;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReceiverPortraitTExture;                           // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FLinearColor                           AttackerPortraitBackgroundColor_0;                 // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ReceiverPortraitBackgroundColor_0;                 // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AttackerType_0;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     AttackerTeam_0;                                    // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AttackerName_0;                                    // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ReceiverType_0;                                    // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     ReceiverTeam_0;                                    // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReceiverName_0;                                    // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow) == 0x000008, "Wrong alignment on WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow");
static_assert(sizeof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow) == 0x0000B0, "Wrong size on WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, AttackerPortraitTexture) == 0x000000, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::AttackerPortraitTexture' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, ReceiverPortraitTExture) == 0x000028, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::ReceiverPortraitTExture' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, AttackerPortraitBackgroundColor_0) == 0x000050, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::AttackerPortraitBackgroundColor_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, ReceiverPortraitBackgroundColor_0) == 0x000060, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::ReceiverPortraitBackgroundColor_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, AttackerType_0) == 0x000070, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::AttackerType_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, AttackerTeam_0) == 0x000078, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::AttackerTeam_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, AttackerName_0) == 0x000080, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::AttackerName_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, ReceiverType_0) == 0x000090, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::ReceiverType_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, ReceiverTeam_0) == 0x000098, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::ReceiverTeam_0' has a wrong offset!");
static_assert(offsetof(WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow, ReceiverName_0) == 0x0000A0, "Member 'WI_KillFeedEntry_PlayerKnockedOutPlayer_C_UpdateKillDataAndShow::ReceiverName_0' has a wrong offset!");

}

