#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_KillFeedEntry_PlayerDestroyedHouseEssential

#include "Basic.hpp"

#include "WI_BaseKillFeedEntry_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_KillFeedEntry_PlayerDestroyedHouseEssential.WI_KillFeedEntry_PlayerDestroyedHouseEssential_C
// 0x00A0 (0x0450 - 0x03B0)
class UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C final : public UWI_BaseKillFeedEntry_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_CharacterPortrait_C*                AttackerCharacterPortrait;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              AttackerCharacterPortraitScaleBox;                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               AttackerNonCharacterSizeBox;                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReceiverDestroyedHouseEssential_Icon;              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReceiverDestroyedHouseEssential_StarBackground;    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              AttackerPortaitTexture;                            // 0x03E0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReceiverDestroyedHouseEssential_IconTexture;       // 0x0408(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           AttackerPortraitBackgroundColor;                   // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           ReceiverDestroyedHouseEssential_IconColor;         // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_KillFeedEntry_PlayerDestroyedHouseEssential(int32 EntryPoint);
	void UpdateKillDataAndShow(TSoftObjectPtr<class UTexture2D> AttackerPortraitTexture, TSoftObjectPtr<class UTexture2D> ReceiverDestroyedHouseEssentialIconTexture, const struct FLinearColor& AttackerPortraitBackgroundColor_0, const struct FLinearColor& ReceiverDestroyedHouseEssentialIconColor, const struct FGameplayTag& AttackerType_0, ETeamType AttackerTeam_0, const class FText& AttackerName_0, const struct FGameplayTag& ReceiverType_0, ETeamType ReceiverTeam_0, const class FText& ReceiverName_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_KillFeedEntry_PlayerDestroyedHouseEssential_C">();
	}
	static class UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C>();
	}
};
static_assert(alignof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C) == 0x000008, "Wrong alignment on UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C");
static_assert(sizeof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C) == 0x000450, "Wrong size on UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, UberGraphFrame) == 0x0003B0, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, AttackerCharacterPortrait) == 0x0003B8, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::AttackerCharacterPortrait' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, AttackerCharacterPortraitScaleBox) == 0x0003C0, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::AttackerCharacterPortraitScaleBox' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, AttackerNonCharacterSizeBox) == 0x0003C8, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::AttackerNonCharacterSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, ReceiverDestroyedHouseEssential_Icon) == 0x0003D0, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::ReceiverDestroyedHouseEssential_Icon' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, ReceiverDestroyedHouseEssential_StarBackground) == 0x0003D8, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::ReceiverDestroyedHouseEssential_StarBackground' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, AttackerPortaitTexture) == 0x0003E0, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::AttackerPortaitTexture' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, ReceiverDestroyedHouseEssential_IconTexture) == 0x000408, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::ReceiverDestroyedHouseEssential_IconTexture' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, AttackerPortraitBackgroundColor) == 0x000430, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::AttackerPortraitBackgroundColor' has a wrong offset!");
static_assert(offsetof(UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C, ReceiverDestroyedHouseEssential_IconColor) == 0x000440, "Member 'UWI_KillFeedEntry_PlayerDestroyedHouseEssential_C::ReceiverDestroyedHouseEssential_IconColor' has a wrong offset!");

}

