#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LobbyV3_ConfigurationSummary

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_LobbyV3_ConfigurationSummary.WI_LobbyV3_ConfigurationSummary_C.ApplyViewModel
// 0x0001 (0x0001 - 0x0000)
struct WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel final
{
public:
	struct FLobbyConfigurationSummaryViewModel    InModel;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel) == 0x000001, "Wrong alignment on WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel");
static_assert(sizeof(WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel) == 0x000001, "Wrong size on WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel, InModel) == 0x000000, "Member 'WI_LobbyV3_ConfigurationSummary_C_ApplyViewModel::InModel' has a wrong offset!");

// Function WI_LobbyV3_ConfigurationSummary.WI_LobbyV3_ConfigurationSummary_C.BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_LobbyV3_ConfigurationSummary_C_BndEvt__WI_LobbyV3_ConfigurationSummary_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_LobbyV3_ConfigurationSummary.WI_LobbyV3_ConfigurationSummary_C.ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary
// 0x0048 (0x0048 - 0x0000)
struct WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLobbyConfigurationSummaryViewModel    K2Node_Event_InModel;                              // 0x0009(0x0001)(ConstParm, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0028(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0038(0x0010)(ConstParm)
};
static_assert(alignof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary) == 0x000008, "Wrong alignment on WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary");
static_assert(sizeof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary) == 0x000048, "Wrong size on WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, EntryPoint) == 0x000000, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, Temp_bool_Variable) == 0x000005, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, Temp_bool_Variable_1) == 0x000006, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, Temp_byte_Variable) == 0x000007, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, Temp_byte_Variable_1) == 0x000008, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, K2Node_Event_InModel) == 0x000009, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::K2Node_Event_InModel' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, K2Node_Select_Default) == 0x00000A, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000028, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary, K2Node_Select_Default_1) == 0x000038, "Member 'WI_LobbyV3_ConfigurationSummary_C_ExecuteUbergraph_WI_LobbyV3_ConfigurationSummary::K2Node_Select_Default_1' has a wrong offset!");

}

