#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LocationState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_LocationState.WI_LocationState_C
// 0x0038 (0x0318 - 0x02E0)
class UWI_LocationState_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SpinOut;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpinIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AtHomeImage;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrespassingImage;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_36;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                OwningResident;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_LocationState(int32 EntryPoint);
	void Reconstruct(class APawn* OldPawn, class APawn* NewPawn);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_LocationState_C">();
	}
	static class UWI_LocationState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_LocationState_C>();
	}
};
static_assert(alignof(UWI_LocationState_C) == 0x000008, "Wrong alignment on UWI_LocationState_C");
static_assert(sizeof(UWI_LocationState_C) == 0x000318, "Wrong size on UWI_LocationState_C");
static_assert(offsetof(UWI_LocationState_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_LocationState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, SpinOut) == 0x0002E8, "Member 'UWI_LocationState_C::SpinOut' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, SpinIn) == 0x0002F0, "Member 'UWI_LocationState_C::SpinIn' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, AtHomeImage) == 0x0002F8, "Member 'UWI_LocationState_C::AtHomeImage' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, TrespassingImage) == 0x000300, "Member 'UWI_LocationState_C::TrespassingImage' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, WidgetSwitcher_36) == 0x000308, "Member 'UWI_LocationState_C::WidgetSwitcher_36' has a wrong offset!");
static_assert(offsetof(UWI_LocationState_C, OwningResident) == 0x000310, "Member 'UWI_LocationState_C::OwningResident' has a wrong offset!");

}

