#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LookAtMeEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.ExecuteUbergraph_WI_LookAtMeEffect
// 0x0018 (0x0018 - 0x0000)
struct WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect) == 0x000004, "Wrong alignment on WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect");
static_assert(sizeof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect) == 0x000018, "Wrong size on WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, EntryPoint) == 0x000000, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, Temp_bool_Variable) == 0x000004, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, Temp_real_Variable) == 0x000008, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, Temp_real_Variable_1) == 0x00000C, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect, K2Node_Select_Default) == 0x000014, "Member 'WI_LookAtMeEffect_C_ExecuteUbergraph_WI_LookAtMeEffect::K2Node_Select_Default' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.PlayPulseAnimationLoop
// 0x0008 (0x0008 - 0x0000)
struct WI_LookAtMeEffect_C_PlayPulseAnimationLoop final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_PlayPulseAnimationLoop) == 0x000008, "Wrong alignment on WI_LookAtMeEffect_C_PlayPulseAnimationLoop");
static_assert(sizeof(WI_LookAtMeEffect_C_PlayPulseAnimationLoop) == 0x000008, "Wrong size on WI_LookAtMeEffect_C_PlayPulseAnimationLoop");
static_assert(offsetof(WI_LookAtMeEffect_C_PlayPulseAnimationLoop, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WI_LookAtMeEffect_C_PlayPulseAnimationLoop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.PlayPulseAnimationOnce
// 0x0008 (0x0008 - 0x0000)
struct WI_LookAtMeEffect_C_PlayPulseAnimationOnce final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_PlayPulseAnimationOnce) == 0x000008, "Wrong alignment on WI_LookAtMeEffect_C_PlayPulseAnimationOnce");
static_assert(sizeof(WI_LookAtMeEffect_C_PlayPulseAnimationOnce) == 0x000008, "Wrong size on WI_LookAtMeEffect_C_PlayPulseAnimationOnce");
static_assert(offsetof(WI_LookAtMeEffect_C_PlayPulseAnimationOnce, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WI_LookAtMeEffect_C_PlayPulseAnimationOnce::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_LookAtMeEffect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_PreConstruct) == 0x000001, "Wrong alignment on WI_LookAtMeEffect_C_PreConstruct");
static_assert(sizeof(WI_LookAtMeEffect_C_PreConstruct) == 0x000001, "Wrong size on WI_LookAtMeEffect_C_PreConstruct");
static_assert(offsetof(WI_LookAtMeEffect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_LookAtMeEffect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.SetColor
// 0x0018 (0x0018 - 0x0000)
struct WI_LookAtMeEffect_C_SetColor final
{
public:
	struct FLinearColor                           Color_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_SetColor) == 0x000008, "Wrong alignment on WI_LookAtMeEffect_C_SetColor");
static_assert(sizeof(WI_LookAtMeEffect_C_SetColor) == 0x000018, "Wrong size on WI_LookAtMeEffect_C_SetColor");
static_assert(offsetof(WI_LookAtMeEffect_C_SetColor, Color_0) == 0x000000, "Member 'WI_LookAtMeEffect_C_SetColor::Color_0' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_SetColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WI_LookAtMeEffect_C_SetColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.SetMaskTexture
// 0x0010 (0x0010 - 0x0000)
struct WI_LookAtMeEffect_C_SetMaskTexture final
{
public:
	class UTexture*                               TextureMask_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_SetMaskTexture) == 0x000008, "Wrong alignment on WI_LookAtMeEffect_C_SetMaskTexture");
static_assert(sizeof(WI_LookAtMeEffect_C_SetMaskTexture) == 0x000010, "Wrong size on WI_LookAtMeEffect_C_SetMaskTexture");
static_assert(offsetof(WI_LookAtMeEffect_C_SetMaskTexture, TextureMask_0) == 0x000000, "Member 'WI_LookAtMeEffect_C_SetMaskTexture::TextureMask_0' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_SetMaskTexture, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WI_LookAtMeEffect_C_SetMaskTexture::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WI_LookAtMeEffect.WI_LookAtMeEffect_C.SetRevealFraction
// 0x0010 (0x0010 - 0x0000)
struct WI_LookAtMeEffect_C_SetRevealFraction final
{
public:
	float                                         RevealFraction;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LookAtMeEffect_C_SetRevealFraction) == 0x000008, "Wrong alignment on WI_LookAtMeEffect_C_SetRevealFraction");
static_assert(sizeof(WI_LookAtMeEffect_C_SetRevealFraction) == 0x000010, "Wrong size on WI_LookAtMeEffect_C_SetRevealFraction");
static_assert(offsetof(WI_LookAtMeEffect_C_SetRevealFraction, RevealFraction) == 0x000000, "Member 'WI_LookAtMeEffect_C_SetRevealFraction::RevealFraction' has a wrong offset!");
static_assert(offsetof(WI_LookAtMeEffect_C_SetRevealFraction, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WI_LookAtMeEffect_C_SetRevealFraction::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

