#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LobbyV3_PlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_LobbyV3_PlayerWidget.WI_LobbyV3_PlayerWidget_C
// 0x0050 (0x1640 - 0x15F0)
class UWI_LobbyV3_PlayerWidget_C final : public ULobbyPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowContextMenu;                                   // 0x15F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckBox;                                          // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                ContextMenuAnchor;                                 // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HostIcon;                                          // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IsInPartySizeBox;                                  // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Name_0;                                            // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsContextMenuVisible;                              // 0x1638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FLobbyPlayerAvatarViewModel& ViewModel);
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_LobbyV3_PlayerWidget(int32 EntryPoint);
	class FText GetPlayerKickedBanReasonText();
	void OnInitialized();
	void ToggleContextMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_LobbyV3_PlayerWidget_C">();
	}
	static class UWI_LobbyV3_PlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_LobbyV3_PlayerWidget_C>();
	}
};
static_assert(alignof(UWI_LobbyV3_PlayerWidget_C) == 0x000010, "Wrong alignment on UWI_LobbyV3_PlayerWidget_C");
static_assert(sizeof(UWI_LobbyV3_PlayerWidget_C) == 0x001640, "Wrong size on UWI_LobbyV3_PlayerWidget_C");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, UberGraphFrame) == 0x0015F0, "Member 'UWI_LobbyV3_PlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, ShowContextMenu) == 0x0015F8, "Member 'UWI_LobbyV3_PlayerWidget_C::ShowContextMenu' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, OnHovered) == 0x001600, "Member 'UWI_LobbyV3_PlayerWidget_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, CheckBox) == 0x001608, "Member 'UWI_LobbyV3_PlayerWidget_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, ContextMenuAnchor) == 0x001610, "Member 'UWI_LobbyV3_PlayerWidget_C::ContextMenuAnchor' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, HostIcon) == 0x001618, "Member 'UWI_LobbyV3_PlayerWidget_C::HostIcon' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, Icon) == 0x001620, "Member 'UWI_LobbyV3_PlayerWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, IsInPartySizeBox) == 0x001628, "Member 'UWI_LobbyV3_PlayerWidget_C::IsInPartySizeBox' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, Name_0) == 0x001630, "Member 'UWI_LobbyV3_PlayerWidget_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_PlayerWidget_C, IsContextMenuVisible) == 0x001638, "Member 'UWI_LobbyV3_PlayerWidget_C::IsContextMenuVisible' has a wrong offset!");

}

