#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MenuCarousel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MenuCarousel.WI_MenuCarousel_C
// 0x0090 (0x0370 - 0x02E0)
class UWI_MenuCarousel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ActiveLink;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemDots;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LinkScaleBox;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MessageScroller;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedServiceMessage;                            // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UServiceMessageHandler*                 ServiceMessageHandler;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             All_Service_Messages_Loaded;                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWI_MenuCarousel_Item_C*>        ServiceMessageWidgets;                             // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        ChangeDelay;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 SMEndPoint;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                           AutoSwapTimer;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_MenuCarousel_Item_Dot_C*>    ItemDotList;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void All_Service_Messages_Loaded__DelegateSignature();
	void All_Service_Messages_Loaded_Event();
	void BndEvt__WI_MenuCarousel_ActiveLink_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ChangeToNextServiceMessage();
	void ChangeToPreviousServiceMessage();
	void Construct();
	void ExecuteUbergraph_WI_MenuCarousel(int32 EntryPoint);
	void FirstBrushSet();
	void GetSelectedItemDot(class UWI_MenuCarousel_Item_Dot_C** SelectedItemDot);
	void OnDotClicked(int32 DotIndex);
	void PreConstruct(bool IsDesignTime);
	void SetAutoSwapTimer();
	void SetSelectedItem();
	void ValidateAndClearTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MenuCarousel_C">();
	}
	static class UWI_MenuCarousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MenuCarousel_C>();
	}
};
static_assert(alignof(UWI_MenuCarousel_C) == 0x000008, "Wrong alignment on UWI_MenuCarousel_C");
static_assert(sizeof(UWI_MenuCarousel_C) == 0x000370, "Wrong size on UWI_MenuCarousel_C");
static_assert(offsetof(UWI_MenuCarousel_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_MenuCarousel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ActiveLink) == 0x0002E8, "Member 'UWI_MenuCarousel_C::ActiveLink' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, Image_87) == 0x0002F0, "Member 'UWI_MenuCarousel_C::Image_87' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ItemDots) == 0x0002F8, "Member 'UWI_MenuCarousel_C::ItemDots' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, LinkScaleBox) == 0x000300, "Member 'UWI_MenuCarousel_C::LinkScaleBox' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, MessageScroller) == 0x000308, "Member 'UWI_MenuCarousel_C::MessageScroller' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, SelectedServiceMessage) == 0x000310, "Member 'UWI_MenuCarousel_C::SelectedServiceMessage' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ServiceMessageHandler) == 0x000318, "Member 'UWI_MenuCarousel_C::ServiceMessageHandler' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, All_Service_Messages_Loaded) == 0x000320, "Member 'UWI_MenuCarousel_C::All_Service_Messages_Loaded' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ServiceMessageWidgets) == 0x000330, "Member 'UWI_MenuCarousel_C::ServiceMessageWidgets' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ChangeDelay) == 0x000340, "Member 'UWI_MenuCarousel_C::ChangeDelay' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, SMEndPoint) == 0x000348, "Member 'UWI_MenuCarousel_C::SMEndPoint' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, AutoSwapTimer) == 0x000358, "Member 'UWI_MenuCarousel_C::AutoSwapTimer' has a wrong offset!");
static_assert(offsetof(UWI_MenuCarousel_C, ItemDotList) == 0x000360, "Member 'UWI_MenuCarousel_C::ItemDotList' has a wrong offset!");

}

