#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MainShopV2

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MainShopV2.WI_MainShopV2_C
// 0x01C0 (0x0610 - 0x0450)
class UWI_MainShopV2_C final : public UShopWidgetMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ConfirmDeliveryOverlay;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackgroundDarken;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMainBackground;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBackground;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBackground_1;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ShopDropItemOverlay;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDefenseT1;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDefenseT2;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDefenseT3;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDeliveryT1;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDeliveryT2;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierDeliveryT3;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierOffenseT1;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierOffenseT2;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierOffenseT3;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierSupportT1;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierSupportT2;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTierSupportT3;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxDefense;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxDelivery;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOffense;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxSupport;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ConfirmOrderOverlay_C*              WI_ConfirmOrderOverlay;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget_NextTab;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget_PreviousTab;                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         WI_JPButton;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             WI_ShopCategoryButtonV2Defense;                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             WI_ShopCategoryButtonV2Offense;                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             WI_ShopCategoryButtonV2Support;                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             WI_ShopCategoryButtonVDelivery;                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopDropItemOverlay_C*              WI_ShopDropItemOverlay;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopItemDetailsV2_C*                WI_ShopItemDetailsV2;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopPlayerResourcesV2_C*            WI_ShopPlayerResourcesV2;                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherCategory;                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             CurrentSelectedButton;                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FShopItemViewModel                     CurrentShopItemViewModel;                          // 0x0578(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_RoomManager_C*>              RoomManagersForTeam;                               // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          FirstTimeActivate;                                 // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddItemToTier(const struct FShopItemViewModel& ShopItemViewModel);
	void AddShopItemToTierAndAddToItemList(class UWI_ShopTierV2_C* TierWidget);
	void BindToHoveredAndPressedEventForItemsInTiers();
	void BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature(class UWI_ShopCategoryButtonV2_C* Button);
	void BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature(class UWI_ShopCategoryButtonV2_C* Button);
	void BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature(class UWI_ShopCategoryButtonV2_C* Button);
	void BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature(class UWI_ShopCategoryButtonV2_C* Button);
	void Close_Shop();
	void Construct();
	void DeliveryConfirmed(const struct FGameplayTag& ItemGameplayTag);
	void Destruct();
	void ExecuteUbergraph_WI_MainShopV2(int32 EntryPoint);
	void FindShopItemWidgetFromItemDefinition(TSoftObjectPtr<class UItemDefinition> ItemDefinition, class UWI_ShopItemEntryV2_C** ShopEntry);
	void HandleGameEnded();
	void InitialSetupControllerNavigation();
	void InputCloseShop();
	void InputNextTab();
	void InputPreviousTab();
	void ItemDropOverlayClose();
	void ItemToDropChosen(class UItemInstance* ItemInstance, const struct FGameplayTag& ItemGameplayTag);
	void On_Shop_Item_Hovered(class UWI_ShopItemEntryV2_C* ShopItem);
	void On_Shop_Item_Pressed(class UWI_ShopItemEntryV2_C* ShopItemWidget);
	void On_Dead_Event(class ACharacter* Character);
	void On_Upgrade_Button_Pressed(class UWI_ShopUpgradeButtonV2_C* ShopUpgradeButton, class UWI_ShopTierV2_C* ShopTier);
	void OrderDeliveryCanceled();
	void Play_Purchase_Confirmed_Cosmetics(TSoftObjectPtr<class UItemDefinition> ItemDefinition);
	void SetActiveCategory(EShopItemCategory ShopCategory, bool* CategoryChanged);
	void SetActiveShopCategoryButton(class UWI_ShopCategoryButtonV2_C* CategoryButton);
	void SetFocusToFirstShopItemEntryInTier(class UWI_ShopTierV2_C* Self2);
	void SetInitialFocus();
	void ShowDropChoiceScreen(const struct FGameplayTag& ItemBeingBought);
	void ShowOrderDeliveryConfirmation(const struct FGameplayTag& OrderedDeliveryTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MainShopV2_C">();
	}
	static class UWI_MainShopV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MainShopV2_C>();
	}
};
static_assert(alignof(UWI_MainShopV2_C) == 0x000008, "Wrong alignment on UWI_MainShopV2_C");
static_assert(sizeof(UWI_MainShopV2_C) == 0x000610, "Wrong size on UWI_MainShopV2_C");
static_assert(offsetof(UWI_MainShopV2_C, UberGraphFrame) == 0x000450, "Member 'UWI_MainShopV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ConfirmDeliveryOverlay) == 0x000458, "Member 'UWI_MainShopV2_C::ConfirmDeliveryOverlay' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ImageBackgroundDarken) == 0x000460, "Member 'UWI_MainShopV2_C::ImageBackgroundDarken' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ImageMainBackground) == 0x000468, "Member 'UWI_MainShopV2_C::ImageMainBackground' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, OverlayBackground) == 0x000470, "Member 'UWI_MainShopV2_C::OverlayBackground' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, OverlayBackground_1) == 0x000478, "Member 'UWI_MainShopV2_C::OverlayBackground_1' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopDropItemOverlay) == 0x000480, "Member 'UWI_MainShopV2_C::ShopDropItemOverlay' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDefenseT1) == 0x000488, "Member 'UWI_MainShopV2_C::ShopTierDefenseT1' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDefenseT2) == 0x000490, "Member 'UWI_MainShopV2_C::ShopTierDefenseT2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDefenseT3) == 0x000498, "Member 'UWI_MainShopV2_C::ShopTierDefenseT3' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDeliveryT1) == 0x0004A0, "Member 'UWI_MainShopV2_C::ShopTierDeliveryT1' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDeliveryT2) == 0x0004A8, "Member 'UWI_MainShopV2_C::ShopTierDeliveryT2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierDeliveryT3) == 0x0004B0, "Member 'UWI_MainShopV2_C::ShopTierDeliveryT3' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierOffenseT1) == 0x0004B8, "Member 'UWI_MainShopV2_C::ShopTierOffenseT1' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierOffenseT2) == 0x0004C0, "Member 'UWI_MainShopV2_C::ShopTierOffenseT2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierOffenseT3) == 0x0004C8, "Member 'UWI_MainShopV2_C::ShopTierOffenseT3' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierSupportT1) == 0x0004D0, "Member 'UWI_MainShopV2_C::ShopTierSupportT1' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierSupportT2) == 0x0004D8, "Member 'UWI_MainShopV2_C::ShopTierSupportT2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, ShopTierSupportT3) == 0x0004E0, "Member 'UWI_MainShopV2_C::ShopTierSupportT3' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, VBoxDefense) == 0x0004E8, "Member 'UWI_MainShopV2_C::VBoxDefense' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, VBoxDelivery) == 0x0004F0, "Member 'UWI_MainShopV2_C::VBoxDelivery' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, VBoxOffense) == 0x0004F8, "Member 'UWI_MainShopV2_C::VBoxOffense' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, VBoxSupport) == 0x000500, "Member 'UWI_MainShopV2_C::VBoxSupport' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ConfirmOrderOverlay) == 0x000508, "Member 'UWI_MainShopV2_C::WI_ConfirmOrderOverlay' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_JPActionWidget) == 0x000510, "Member 'UWI_MainShopV2_C::WI_JPActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_JPActionWidget_NextTab) == 0x000518, "Member 'UWI_MainShopV2_C::WI_JPActionWidget_NextTab' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_JPActionWidget_PreviousTab) == 0x000520, "Member 'UWI_MainShopV2_C::WI_JPActionWidget_PreviousTab' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_JPButton) == 0x000528, "Member 'UWI_MainShopV2_C::WI_JPButton' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopCategoryButtonV2Defense) == 0x000530, "Member 'UWI_MainShopV2_C::WI_ShopCategoryButtonV2Defense' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopCategoryButtonV2Offense) == 0x000538, "Member 'UWI_MainShopV2_C::WI_ShopCategoryButtonV2Offense' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopCategoryButtonV2Support) == 0x000540, "Member 'UWI_MainShopV2_C::WI_ShopCategoryButtonV2Support' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopCategoryButtonVDelivery) == 0x000548, "Member 'UWI_MainShopV2_C::WI_ShopCategoryButtonVDelivery' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopDropItemOverlay) == 0x000550, "Member 'UWI_MainShopV2_C::WI_ShopDropItemOverlay' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopItemDetailsV2) == 0x000558, "Member 'UWI_MainShopV2_C::WI_ShopItemDetailsV2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WI_ShopPlayerResourcesV2) == 0x000560, "Member 'UWI_MainShopV2_C::WI_ShopPlayerResourcesV2' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, WidgetSwitcherCategory) == 0x000568, "Member 'UWI_MainShopV2_C::WidgetSwitcherCategory' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, CurrentSelectedButton) == 0x000570, "Member 'UWI_MainShopV2_C::CurrentSelectedButton' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, CurrentShopItemViewModel) == 0x000578, "Member 'UWI_MainShopV2_C::CurrentShopItemViewModel' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, RoomManagersForTeam) == 0x0005F8, "Member 'UWI_MainShopV2_C::RoomManagersForTeam' has a wrong offset!");
static_assert(offsetof(UWI_MainShopV2_C, FirstTimeActivate) == 0x000608, "Member 'UWI_MainShopV2_C::FirstTimeActivate' has a wrong offset!");

}

