#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MessageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MessageEntry.WI_MessageEntry_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_MessageEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_MessageEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MessageEntry_C">();
	}
	static class UWI_MessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MessageEntry_C>();
	}
};
static_assert(alignof(UWI_MessageEntry_C) == 0x000008, "Wrong alignment on UWI_MessageEntry_C");
static_assert(sizeof(UWI_MessageEntry_C) == 0x000300, "Wrong size on UWI_MessageEntry_C");
static_assert(offsetof(UWI_MessageEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_MessageEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_MessageEntry_C, Text) == 0x0002E8, "Member 'UWI_MessageEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_MessageEntry_C, Message) == 0x0002F0, "Member 'UWI_MessageEntry_C::Message' has a wrong offset!");

}

