#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NewsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WI_BaseScreen_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_NewsScreen.WI_NewsScreen_C
// 0x0018 (0x0448 - 0x0430)
class UWI_NewsScreen_C final : public UWI_BaseScreen_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_News_C*                             WI_News;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_WelcomePassPreview_C*               WI_WelcomePassPreview;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_NewsScreen(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_NewsScreen_C">();
	}
	static class UWI_NewsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_NewsScreen_C>();
	}
};
static_assert(alignof(UWI_NewsScreen_C) == 0x000008, "Wrong alignment on UWI_NewsScreen_C");
static_assert(sizeof(UWI_NewsScreen_C) == 0x000448, "Wrong size on UWI_NewsScreen_C");
static_assert(offsetof(UWI_NewsScreen_C, UberGraphFrame) == 0x000430, "Member 'UWI_NewsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_NewsScreen_C, WI_News) == 0x000438, "Member 'UWI_NewsScreen_C::WI_News' has a wrong offset!");
static_assert(offsetof(UWI_NewsScreen_C, WI_WelcomePassPreview) == 0x000440, "Member 'UWI_NewsScreen_C::WI_WelcomePassPreview' has a wrong offset!");

}

