#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_News

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_News.WI_News_C
// 0x0070 (0x0350 - 0x02E0)
class UWI_News_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BodyLabel;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CaptureClicks_1;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_101;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_DiscordText;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             PlaytestCountdownSLot;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PublishedDateLabel;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleLabel;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_DiscordButton_C*                    WI_DiscordButton;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPSimpleSpinner_C*                  WI_JPSimpleSpinner;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DesignerPreviewShowLoading;                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DecodeNews(class UPlayFabJsonObject* SingleNewsJson, class FString* NewsId, class FString* Timestamp, class FString* Title, class FString* Body);
	void ExecuteUbergraph_WI_News(int32 EntryPoint);
	void GetNews();
	void HandleSuccess(const class UPlayFabJsonObject* ResponseData);
	void OnClientAuthenticationInitialized_F7E4DE494E7EA18A7EACE9B199995A95();
	void OnLoggedIn_58C5640E4BC0F0850A56E29C34034568();
	void OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void PreConstruct(bool IsDesignTime);
	void SetIsLoading(bool IsLoading);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_News_C">();
	}
	static class UWI_News_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_News_C>();
	}
};
static_assert(alignof(UWI_News_C) == 0x000008, "Wrong alignment on UWI_News_C");
static_assert(sizeof(UWI_News_C) == 0x000350, "Wrong size on UWI_News_C");
static_assert(offsetof(UWI_News_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_News_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_News_C, BodyLabel) == 0x0002E8, "Member 'UWI_News_C::BodyLabel' has a wrong offset!");
static_assert(offsetof(UWI_News_C, CaptureClicks_1) == 0x0002F0, "Member 'UWI_News_C::CaptureClicks_1' has a wrong offset!");
static_assert(offsetof(UWI_News_C, Image_101) == 0x0002F8, "Member 'UWI_News_C::Image_101' has a wrong offset!");
static_assert(offsetof(UWI_News_C, Image_112) == 0x000300, "Member 'UWI_News_C::Image_112' has a wrong offset!");
static_assert(offsetof(UWI_News_C, Image_124) == 0x000308, "Member 'UWI_News_C::Image_124' has a wrong offset!");
static_assert(offsetof(UWI_News_C, Image_BG_DiscordText) == 0x000310, "Member 'UWI_News_C::Image_BG_DiscordText' has a wrong offset!");
static_assert(offsetof(UWI_News_C, PlaytestCountdownSLot) == 0x000318, "Member 'UWI_News_C::PlaytestCountdownSLot' has a wrong offset!");
static_assert(offsetof(UWI_News_C, PublishedDateLabel) == 0x000320, "Member 'UWI_News_C::PublishedDateLabel' has a wrong offset!");
static_assert(offsetof(UWI_News_C, TitleLabel) == 0x000328, "Member 'UWI_News_C::TitleLabel' has a wrong offset!");
static_assert(offsetof(UWI_News_C, WI_DiscordButton) == 0x000330, "Member 'UWI_News_C::WI_DiscordButton' has a wrong offset!");
static_assert(offsetof(UWI_News_C, WI_JPSimpleSpinner) == 0x000338, "Member 'UWI_News_C::WI_JPSimpleSpinner' has a wrong offset!");
static_assert(offsetof(UWI_News_C, WidgetSwitcher) == 0x000340, "Member 'UWI_News_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWI_News_C, DesignerPreviewShowLoading) == 0x000348, "Member 'UWI_News_C::DesignerPreviewShowLoading' has a wrong offset!");

}

