#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborFavoriteOrUnlock

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.ExecuteUbergraph_WI_NeighborFavoriteOrUnlock
// 0x0378 (0x0378 - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EOnlineItemUnlockRequirement                  Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemCost                   K2Node_Event_ItemCost;                             // 0x0018(0x000C)(ConstParm, NoDestructor)
	struct FOnlineStoreItemBattlePassRequirement  K2Node_Event_BattlePassInfo;                       // 0x0024(0x0010)(ConstParm, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TSoftObjectPtr<class UBattlePassMetaData>     CallFunc_TryGetBattlePassMetaData_OutSoftBattlePassMetaData; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetBattlePassMetaData_ReturnValue;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBattlePassMetaData*                    K2Node_DynamicCast_AsBattle_Pass_Meta_Data;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_UnlockNeighborConfirmation_C*       K2Node_DynamicCast_AsWI_Unlock_Neighbor_Confirmation; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_1;     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurSpinner_C*               K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner;      // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_GetCurrentNeighborAsStoreItem_ReturnValue; // 0x0188(0x0048)(ConstParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_2;     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_CurrencyPurchaseModal_C*            K2Node_DynamicCast_AsWI_Currency_Purchase_Modal;   // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ErrorMessage;                         // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_3;     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurErrorNotification_C*     K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0220(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemCost                   CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue; // 0x0238(0x000C)(NoDestructor)
	struct FOnlineStoreItemBattlePassRequirement  CallFunc_MakeOnlineStoreItemBattlePassRequirementStruct_ReturnValue; // 0x0244(0x0010)(NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue; // 0x0258(0x0048)()
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemDataBattlePassUnlock_ReturnValue; // 0x02A0(0x0048)()
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue; // 0x02E8(0x0048)()
	struct FOnlineStoreItemData                   K2Node_Select_Default;                             // 0x0330(0x0048)(ConstParm)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock) == 0x000008, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock) == 0x000378, "Wrong size on WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, EntryPoint) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, Temp_byte_Variable) == 0x000014, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_Event_IsDesignTime) == 0x000015, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_Event_ItemCost) == 0x000018, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_Event_ItemCost' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_Event_BattlePassInfo) == 0x000024, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_Event_BattlePassInfo' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_TryGetBattlePassMetaData_OutSoftBattlePassMetaData) == 0x000098, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_TryGetBattlePassMetaData_OutSoftBattlePassMetaData' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_TryGetBattlePassMetaData_ReturnValue) == 0x0000C0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_TryGetBattlePassMetaData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, Temp_object_Variable) == 0x0000C8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_AsBattle_Pass_Meta_Data) == 0x0000D0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_AsBattle_Pass_Meta_Data' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x0000E0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_AsWI_Unlock_Neighbor_Confirmation) == 0x0000E8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_AsWI_Unlock_Neighbor_Confirmation' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_MakeArray_Array) == 0x000140, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_CreateDelegate_OutputDelegate_2) == 0x000160, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_PushWidgetToLayerStack_ReturnValue_1) == 0x000170, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_PushWidgetToLayerStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner) == 0x000178, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_GetCurrentNeighborAsStoreItem_ReturnValue) == 0x000188, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_GetCurrentNeighborAsStoreItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0001D0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_PushWidgetToLayerStack_ReturnValue_2) == 0x0001D8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_PushWidgetToLayerStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_CustomEvent_Loaded) == 0x0001E0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_AsWI_Currency_Purchase_Modal) == 0x0001E8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_AsWI_Currency_Purchase_Modal' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_Event_ErrorMessage) == 0x0001F8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_Event_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_PushWidgetToLayerStack_ReturnValue_3) == 0x000208, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_PushWidgetToLayerStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification) == 0x000210, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_DynamicCast_bSuccess_4) == 0x000218, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_MakeArray_Array_1) == 0x000220, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000230, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue) == 0x000238, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeOnlineStoreItemBattlePassRequirementStruct_ReturnValue) == 0x000244, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeOnlineStoreItemBattlePassRequirementStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue) == 0x000258, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeOnlineStoreItemDataBattlePassUnlock_ReturnValue) == 0x0002A0, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeOnlineStoreItemDataBattlePassUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue) == 0x0002E8, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock, K2Node_Select_Default) == 0x000330, "Member 'WI_NeighborFavoriteOrUnlock_C_ExecuteUbergraph_WI_NeighborFavoriteOrUnlock::K2Node_Select_Default' has a wrong offset!");

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.HandleUnlockError
// 0x0010 (0x0010 - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_HandleUnlockError final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_HandleUnlockError) == 0x000008, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_HandleUnlockError");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_HandleUnlockError) == 0x000010, "Wrong size on WI_NeighborFavoriteOrUnlock_C_HandleUnlockError");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_HandleUnlockError, ErrorMessage) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_HandleUnlockError::ErrorMessage' has a wrong offset!");

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.OnLoaded_96CFF1334659D5FD75162092A80EED23
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23) == 0x000008, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23) == 0x000008, "Wrong size on WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23, Loaded) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_OnLoaded_96CFF1334659D5FD75162092A80EED23::Loaded' has a wrong offset!");

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_PreConstruct) == 0x000001, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_PreConstruct");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_PreConstruct) == 0x000001, "Wrong size on WI_NeighborFavoriteOrUnlock_C_PreConstruct");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.SetBattlePassInfo
// 0x0010 (0x0010 - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo final
{
public:
	struct FOnlineStoreItemBattlePassRequirement  BattlePassInfo;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo) == 0x000004, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo) == 0x000010, "Wrong size on WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo, BattlePassInfo) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_SetBattlePassInfo::BattlePassInfo' has a wrong offset!");

// Function WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C.SetVirtualCurrencyInfo
// 0x000C (0x000C - 0x0000)
struct WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo final
{
public:
	struct FOnlineStoreItemCost                   ItemCost;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo) == 0x000004, "Wrong alignment on WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo");
static_assert(sizeof(WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo) == 0x00000C, "Wrong size on WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo");
static_assert(offsetof(WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo, ItemCost) == 0x000000, "Member 'WI_NeighborFavoriteOrUnlock_C_SetVirtualCurrencyInfo::ItemCost' has a wrong offset!");

}

