#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborDetails

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"
#include "E_DetailsType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_NeighborDetails.WI_NeighborDetails_C
// 0x01E0 (0x0610 - 0x0430)
class UWI_NeighborDetails_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_RectangularButton_C*                BackgroundStoryButton;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGPaper;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PerkDetailsPanel_C*                 GeneralPerkPanel;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_RarityButton_C*                     ItemSkinButton;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LVL_BG;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NeighborDescriptionText;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_NeighborFavoriteOrUnlock_C*         NeighborFavoriteOrUnlock;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NeighborLevelText;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NeighborNameText;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PerkDetailsPanel_C*                 NeighborPerkPanel;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPArrowButton_C*                    NextNeighborSelector;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_RarityButton_C*                     OutfitButton;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_10;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPArrowButton_C*                    PrevNeighborSelector;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RotatorBox;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TopBar_SubMenu_C*                   TopBar_SubMenu;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_BottomBoundActionBar_C*             WI_BottomBoundActionBar;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PlayerRotator_C*                    WI_PlayerRotator;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SpecialAbilityDetailsPanel_C*       WI_SpecialAbilityPanel;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_StartingItemDetailsPanel_C*         WI_StartingItemPanel;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_XPProgressionBar_C*                 WI_XPProgressionBar;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NeighborIndex;                                     // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NeighborID;                                        // 0x04F4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNeighborDefinition*                    NeighborDefinition;                                // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNeighborMetaData*                      NeighborMetaData;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   NeighborName;                                      // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NeighborLevel;                                     // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeighborLoadout                       EquippedNeighborLoadout;                           // 0x0528(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FNeighborLoadout                       PreviewNeighborLoadout;                            // 0x0558(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PreviewActorSpawnTransform;                        // 0x0590(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewActor_C*             PreviewActor;                                      // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CameraZoomTime;                                    // 0x05F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraZoomEasingExp;                               // 0x0600(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              PreviewSlot;                                       // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WI_NeighborDetails_GeneralPerkPanel_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature();
	void BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_NeighborDetails_NeighborPerkPanel_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature();
	void BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BroadcastPlayerRewardChange(const struct FGameplayTag& PlayerRewardID);
	void ClearPreviewActor();
	void ExecuteUbergraph_WI_NeighborDetails(int32 EntryPoint);
	void Get_Item_Skin(const struct FNeighborLoadout& LoadoutLookup, TSoftObjectPtr<class UItemSkinDefinition>* OutSoftItemSkinDefinition, struct FGameplayTag* AssetID, bool* IsDefault);
	struct FGameplayTag GetDefaultItemSkin(TSoftObjectPtr<class UItemSkinDefinition>* OutSoftItemSkinDefinition);
	void GetNeighborIndexFromTag(const struct FGameplayTag& InTag, int32* Array_Index);
	void GetNeighborItemID(struct FGameplayTag* NeighborItemID);
	void GetPreviewSlot(class ABP_NeighborPreviewSlot_C** PreviewSlot_0);
	void HandleTopBarBackButtonClicked(class UCommonButtonBase* Button);
	bool HavePreviewSkinsChanged();
	void InitializePreviewActorTransform();
	void OnBackButtonClickedHandler();
	void OnDefinitionSet();
	void OnDetailsTypeSwitched(E_DetailsType OldDetailsType);
	void OnInitialized();
	void OnLoaded_157C7691435FF1B34C995CAA63AC3EE3(class UObject* Loaded);
	void OnLoaded_6A7983DF44BDD20401299580F4D694DE(class UObject* Loaded);
	void OnMetaDataSet();
	void PlayInitNeighborAnimation();
	void Push_Neighbor_Details_Select_Widget(E_DetailsType DetailsType, bool SelectEquippedGeneralPerk);
	void Set_Perk_Panel(class UWI_PerkDetailsPanel_C* PerkPanel, const struct FGameplayTag& PerkID);
	void SetNeighborDescription(class UNeighborMetaData* NeighborMetaData_0);
	void SetNeighborIndex(int32 Index_0);
	void SetNeighborIndexFromTag(const struct FGameplayTag& InTag);
	void SetNeighborLoadout(const struct FGameplayTag& NeighborID_0);
	void SetNeighborName(class UNeighborDefinition* NeighborDefinition_0);
	void SetNeighborProgression(const struct FGameplayTag& NeighborID_0);
	void UpdateItemInLoadout(const struct FGameplayTag& NewSkin);
	void UpdatePreviewActorItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_NeighborDetails_C">();
	}
	static class UWI_NeighborDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_NeighborDetails_C>();
	}
};
static_assert(alignof(UWI_NeighborDetails_C) == 0x000010, "Wrong alignment on UWI_NeighborDetails_C");
static_assert(sizeof(UWI_NeighborDetails_C) == 0x000610, "Wrong size on UWI_NeighborDetails_C");
static_assert(offsetof(UWI_NeighborDetails_C, UberGraphFrame) == 0x000430, "Member 'UWI_NeighborDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, BackgroundStoryButton) == 0x000438, "Member 'UWI_NeighborDetails_C::BackgroundStoryButton' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, BGPaper) == 0x000440, "Member 'UWI_NeighborDetails_C::BGPaper' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, GeneralPerkPanel) == 0x000448, "Member 'UWI_NeighborDetails_C::GeneralPerkPanel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, Image) == 0x000450, "Member 'UWI_NeighborDetails_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, Image_143) == 0x000458, "Member 'UWI_NeighborDetails_C::Image_143' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, ItemSkinButton) == 0x000460, "Member 'UWI_NeighborDetails_C::ItemSkinButton' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, LVL_BG) == 0x000468, "Member 'UWI_NeighborDetails_C::LVL_BG' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborDescriptionText) == 0x000470, "Member 'UWI_NeighborDetails_C::NeighborDescriptionText' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborFavoriteOrUnlock) == 0x000478, "Member 'UWI_NeighborDetails_C::NeighborFavoriteOrUnlock' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborLevelText) == 0x000480, "Member 'UWI_NeighborDetails_C::NeighborLevelText' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborNameText) == 0x000488, "Member 'UWI_NeighborDetails_C::NeighborNameText' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborPerkPanel) == 0x000490, "Member 'UWI_NeighborDetails_C::NeighborPerkPanel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NextNeighborSelector) == 0x000498, "Member 'UWI_NeighborDetails_C::NextNeighborSelector' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, OutfitButton) == 0x0004A0, "Member 'UWI_NeighborDetails_C::OutfitButton' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, Overlay_10) == 0x0004A8, "Member 'UWI_NeighborDetails_C::Overlay_10' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, PrevNeighborSelector) == 0x0004B0, "Member 'UWI_NeighborDetails_C::PrevNeighborSelector' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, RotatorBox) == 0x0004B8, "Member 'UWI_NeighborDetails_C::RotatorBox' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, TopBar_SubMenu) == 0x0004C0, "Member 'UWI_NeighborDetails_C::TopBar_SubMenu' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, WI_BottomBoundActionBar) == 0x0004C8, "Member 'UWI_NeighborDetails_C::WI_BottomBoundActionBar' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, WI_PlayerRotator) == 0x0004D0, "Member 'UWI_NeighborDetails_C::WI_PlayerRotator' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, WI_SpecialAbilityPanel) == 0x0004D8, "Member 'UWI_NeighborDetails_C::WI_SpecialAbilityPanel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, WI_StartingItemPanel) == 0x0004E0, "Member 'UWI_NeighborDetails_C::WI_StartingItemPanel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, WI_XPProgressionBar) == 0x0004E8, "Member 'UWI_NeighborDetails_C::WI_XPProgressionBar' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborIndex) == 0x0004F0, "Member 'UWI_NeighborDetails_C::NeighborIndex' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborID) == 0x0004F4, "Member 'UWI_NeighborDetails_C::NeighborID' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborDefinition) == 0x000500, "Member 'UWI_NeighborDetails_C::NeighborDefinition' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborMetaData) == 0x000508, "Member 'UWI_NeighborDetails_C::NeighborMetaData' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborName) == 0x000510, "Member 'UWI_NeighborDetails_C::NeighborName' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, NeighborLevel) == 0x000520, "Member 'UWI_NeighborDetails_C::NeighborLevel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, EquippedNeighborLoadout) == 0x000528, "Member 'UWI_NeighborDetails_C::EquippedNeighborLoadout' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, PreviewNeighborLoadout) == 0x000558, "Member 'UWI_NeighborDetails_C::PreviewNeighborLoadout' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, PreviewActorSpawnTransform) == 0x000590, "Member 'UWI_NeighborDetails_C::PreviewActorSpawnTransform' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, PreviewActor) == 0x0005F0, "Member 'UWI_NeighborDetails_C::PreviewActor' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, CameraZoomTime) == 0x0005F8, "Member 'UWI_NeighborDetails_C::CameraZoomTime' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, CameraZoomEasingExp) == 0x000600, "Member 'UWI_NeighborDetails_C::CameraZoomEasingExp' has a wrong offset!");
static_assert(offsetof(UWI_NeighborDetails_C, PreviewSlot) == 0x000608, "Member 'UWI_NeighborDetails_C::PreviewSlot' has a wrong offset!");

}

