#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborFavoriteOrUnlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_NeighborFavoriteOrUnlock.WI_NeighborFavoriteOrUnlock_C
// 0x0058 (0x0398 - 0x0340)
class UWI_NeighborFavoriteOrUnlock_C final : public UNeighborFavoriteOrUnlockWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BattlePassIcon;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlePassText;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SinglePrice_C*                      Price;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_UnlockNeighborConfirmation_C*       UnlockConfirmationModal;                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurSpinner_C*               SpinnerModal;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewIsOwned;                                    // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineItemUnlockRequirement                  PreviewUnlockRequirement;                          // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewCurrencyAmount;                             // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PreviewBattlePassID;                               // 0x0378(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewBattlePassLevel;                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PreviewNeighborID;                                 // 0x0384(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PreviewEquippedNeighborID;                         // 0x038C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_NeighborFavoriteOrUnlock(int32 EntryPoint);
	void HandleInsufficientFunds();
	void HandleUnlockCancel();
	void HandleUnlockError(const class FString& ErrorMessage);
	void HandleUnlockSuccess();
	void OnLoaded_96CFF1334659D5FD75162092A80EED23(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void PushSpinnerModal();
	void PushUnlockConfirmationModal();
	void SetBattlePassInfo(const struct FOnlineStoreItemBattlePassRequirement& BattlePassInfo);
	void SetVirtualCurrencyInfo(const struct FOnlineStoreItemCost& ItemCost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_NeighborFavoriteOrUnlock_C">();
	}
	static class UWI_NeighborFavoriteOrUnlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_NeighborFavoriteOrUnlock_C>();
	}
};
static_assert(alignof(UWI_NeighborFavoriteOrUnlock_C) == 0x000008, "Wrong alignment on UWI_NeighborFavoriteOrUnlock_C");
static_assert(sizeof(UWI_NeighborFavoriteOrUnlock_C) == 0x000398, "Wrong size on UWI_NeighborFavoriteOrUnlock_C");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, UberGraphFrame) == 0x000340, "Member 'UWI_NeighborFavoriteOrUnlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, BattlePassIcon) == 0x000348, "Member 'UWI_NeighborFavoriteOrUnlock_C::BattlePassIcon' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, BattlePassText) == 0x000350, "Member 'UWI_NeighborFavoriteOrUnlock_C::BattlePassText' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, Price) == 0x000358, "Member 'UWI_NeighborFavoriteOrUnlock_C::Price' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, UnlockConfirmationModal) == 0x000360, "Member 'UWI_NeighborFavoriteOrUnlock_C::UnlockConfirmationModal' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, SpinnerModal) == 0x000368, "Member 'UWI_NeighborFavoriteOrUnlock_C::SpinnerModal' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewIsOwned) == 0x000370, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewIsOwned' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewUnlockRequirement) == 0x000371, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewUnlockRequirement' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewCurrencyAmount) == 0x000374, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewCurrencyAmount' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewBattlePassID) == 0x000378, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewBattlePassID' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewBattlePassLevel) == 0x000380, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewBattlePassLevel' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewNeighborID) == 0x000384, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewNeighborID' has a wrong offset!");
static_assert(offsetof(UWI_NeighborFavoriteOrUnlock_C, PreviewEquippedNeighborID) == 0x00038C, "Member 'UWI_NeighborFavoriteOrUnlock_C::PreviewEquippedNeighborID' has a wrong offset!");

}

