#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborDetailsCosmeticsSelect

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "S_EquipPanelSelectionChangedMessage_structs.hpp"
#include "S_PlayerRewardUnlockedMessage_structs.hpp"


namespace SDK::Params
{

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.AllOwnedCosmeticsButtonsReady
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady final
{
public:
	struct FGameplayTag                           OverrideSelectedCosmeticsID;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady) == 0x000004, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady) == 0x000008, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady, OverrideSelectedCosmeticsID) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_AllOwnedCosmeticsButtonsReady::OverrideSelectedCosmeticsID' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.BindCosmeticsButtonEvents
// 0x0028 (0x0028 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents final
{
public:
	class UWI_PlayerRewardButton_C*               CosmeticsButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_PlayerRewardButton_C* PlayerRewardButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_PlayerRewardButton_C* PlayerRewardButton)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents) == 0x000028, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents, CosmeticsButton) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents::CosmeticsButton' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WI_NeighborDetailsCosmeticsSelect_C_BindCosmeticsButtonEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.CachePanelWidgets
// 0x0048 (0x0048 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets) == 0x000048, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, K2Node_DynamicCast_AsPanel_Widget) == 0x000038, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::K2Node_DynamicCast_AsPanel_Widget' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CachePanelWidgets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.CollapseIfEmpty
// 0x0010 (0x0010 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty final
{
public:
	class UPanelWidget*                           Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty) == 0x000010, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, Panel) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::Panel' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, Temp_bool_Variable) == 0x000008, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, CallFunc_HasAnyChildren_ReturnValue) == 0x000009, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, Temp_byte_Variable) == 0x00000A, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, Temp_byte_Variable_1) == 0x00000B, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty, K2Node_Select_Default) == 0x00000C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CollapseIfEmpty::K2Node_Select_Default' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.CreateCosmeticsButtonWidget
// 0x0070 (0x0070 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget final
{
public:
	struct FOnlineStoreItemData                   OnlineStoreItemData;                               // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsEquipped;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PlayerRewardButton_C*               CosmeticsButton;                                   // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPlayerRewardDataAsset* PlayerRewardDataAsset, class UWI_PlayerRewardButton_C* PlayerRewardButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget) == 0x000070, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget, OnlineStoreItemData) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget::OnlineStoreItemData' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget, IsEquipped) == 0x000048, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget::IsEquipped' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget, CosmeticsButton) == 0x000050, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget::CosmeticsButton' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreateCosmeticsButtonWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.CreatePurchaseableCosmeticsButtonWidget
// 0x0068 (0x0068 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget final
{
public:
	struct FOnlineStoreItemData                   OnlineStoreItemData;                               // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWI_PlayerRewardButton_C*               CosmeticsButton;                                   // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPlayerRewardDataAsset* PlayerRewardDataAsset, class UWI_PlayerRewardButton_C* PlayerRewardButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget) == 0x000068, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget, OnlineStoreItemData) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget::OnlineStoreItemData' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget, CosmeticsButton) == 0x000048, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget::CosmeticsButton' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget, CallFunc_Create_ReturnValue) == 0x000060, "Member 'WI_NeighborDetailsCosmeticsSelect_C_CreatePurchaseableCosmeticsButtonWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.EquipSelectedCosmetic
// 0x000C (0x000C - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic final
{
public:
	struct FGameplayTag                           SelectedAssetID;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic) == 0x000004, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic) == 0x00000C, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic, SelectedAssetID) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic::SelectedAssetID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000008, "Member 'WI_NeighborDetailsCosmeticsSelect_C_EquipSelectedCosmetic::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetailsCosmeticsSelect.WI_NeighborDetailsCosmeticsSelect_C.ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect
// 0x04F0 (0x04F0 - 0x0000)
struct WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_EquipPanelSelectionChangedMessage   Temp_struct_Variable;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EquipPanelSelectionChangedMessage   Temp_struct_Variable_2;                            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EquippedCosmeticsID;            // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DefaultCosmeticsID;             // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_OwnedCosmeticsIDs;              // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_StoreCosmeticsData_1;           // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemFromAssetID_OnlineStoreItem; // 0x00E8(0x0048)()
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_OwnedCosmeticsID;               // 0x0138(0x0010)(ConstParm, ReferenceParm)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   CallFunc_Array_Get_Item;                           // 0x0150(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_SetItemToOwned_ReturnValue;               // 0x01A0(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x01EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayerRewardDataAsset*>         CallFunc_Map_Keys_Keys;                            // 0x01F8(0x0010)(ReferenceParm)
	struct FS_EquipPanelSelectionChangedMessage   Temp_struct_Variable_4;                            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerRewardDataAsset*                 K2Node_CustomEvent_CosmeticsDefinition_1;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               K2Node_CustomEvent_CosmeticsButton_1;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_OverrideSelectedCosmeticsID;    // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineStoreItemData>           K2Node_CustomEvent_StoreCosmeticsData;             // 0x0248(0x0010)(ConstParm, ReferenceParm)
	struct FOnlineStoreItemData                   CallFunc_Array_Get_Item_1;                         // 0x0258(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PlayerRewardButton_C*               CallFunc_CreatePurchaseableCosmeticsButtonWidget_CosmeticsButton; // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRewardDataAsset*                 CallFunc_Array_Get_Item_2;                         // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayerRewardDataAsset*>         CallFunc_Map_Keys_Keys_1;                          // 0x02E0(0x0010)(ReferenceParm)
	class UWI_PlayerRewardButton_C*               CallFunc_Map_Find_Value;                           // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRewardDataAsset*                 CallFunc_Array_Get_Item_3;                         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               CallFunc_Map_Find_Value_1;                         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRewardDataAsset*                 K2Node_CustomEvent_CosmeticsDefinition;            // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               K2Node_CustomEvent_CosmeticsButton;                // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EquipPanelSelectionChangedMessage   Temp_struct_Variable_5;                            // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B[0x5];                                      // 0x033B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PlayerRewardButton_C*               CallFunc_CreateCosmeticsButtonWidget_CosmeticsButton; // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PlayerRewardAssetID;            // 0x034C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayerRewardDataAsset*>         CallFunc_Map_Keys_Keys_2;                          // 0x0358(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRewardDataAsset*                 CallFunc_Array_Get_Item_4;                         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0380(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PlayerRewardButton_C*               CallFunc_Map_Find_Value_2;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_SetItemToOwned_ReturnValue_1;             // 0x03A8(0x0048)()
	class UWI_PlayerRewardButton_C*               CallFunc_Create_ReturnValue;                       // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_2;  // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_2;                            // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_6;                            // 0x040C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerRewardUnlockedMessage         Temp_struct_Variable_7;                            // 0x0418(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_2;                  // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_2;                // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x044C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerRewardUnlockedMessage         Temp_struct_Variable_8;                            // 0x0460(0x0018)(HasGetValueTypeHash)
	TArray<class UWI_PlayerRewardButton_C*>       CallFunc_Map_Values_Values;                        // 0x0478(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_PlayerRewardButton_C*               CallFunc_Array_Get_Item_5;                         // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_496[0x2];                                      // 0x0496(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWrapBox*>                       K2Node_MakeArray_Array;                            // 0x0498(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWrapBox*                               CallFunc_Array_Get_Item_6;                         // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBox*                               K2Node_Select_Default_1;                           // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue_1;          // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBox*                               Temp_object_Variable_3;                            // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBox*                               K2Node_Select_Default_2;                           // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue_2;          // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect) == 0x000008, "Wrong alignment on WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect");
static_assert(sizeof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect) == 0x0004F0, "Wrong size on WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, EntryPoint) == 0x000000, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_struct_Variable) == 0x000028, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_struct_Variable_1) == 0x00002C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_object_Variable) == 0x000038, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000040, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_byte_Variable) == 0x000048, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_struct_Variable_2) == 0x00005C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_GetPayload_ReturnValue) == 0x00005D, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Loop_Counter_Variable_1) == 0x000060, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Loop_Counter_Variable_2) == 0x000064, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_bool_True_if_break_was_hit_Variable) == 0x000070, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable_2) == 0x000074, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Variable) == 0x00007C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue_3) == 0x000080, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_byte_Variable_1) == 0x000084, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable_3) == 0x000088, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Loop_Counter_Variable_3) == 0x00008C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue_4) == 0x000090, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable_4) == 0x000094, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Loop_Counter_Variable_4) == 0x000098, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_Add_IntInt_ReturnValue_5) == 0x00009C, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, Temp_int_Array_Index_Variable_5) == 0x0000A0, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0000A8, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect, K2Node_CustomEvent_EquippedCosmeticsID) == 0x0000B4, "Member 'WI_NeighborDetailsCosmeticsSelect_C_ExecuteUbergraph_WI_NeighborDetailsCosmeticsSelect::K2Node_CustomEvent_EquippedCosmeticsID' has a wrong offset!");
