#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborDetailsSelect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_Message_SwitchCamera_structs.hpp"
#include "JP_structs.hpp"
#include "E_DetailsType_structs.hpp"
#include "S_PlayerEquippedItemMessage_structs.hpp"
#include "S_PlayerEquippedNeighborSkinMessage_structs.hpp"
#include "S_PlayerRewardUnlockedMessage_structs.hpp"


namespace SDK::Params
{

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_NextDetailsTypeSelector_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_BndEvt__WI_NeighborDetailsSelect_PrevDetailsTypeSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.EquipCosmeticToLoadout
// 0x0048 (0x0048 - 0x0000)
struct WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout final
{
public:
	struct FGameplayTag                           AssetID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerEquippedNeighborSkinMessage   K2Node_MakeStruct_S_PlayerEquippedNeighborSkinMessage; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerEquippedItemMessage           K2Node_MakeStruct_S_PlayerEquippedItemMessage;     // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetStartingItemID_ReturnValue;            // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout");
static_assert(sizeof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout) == 0x000048, "Wrong size on WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, AssetID) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::AssetID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_MatchesTag_ReturnValue) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, K2Node_MakeStruct_S_PlayerEquippedNeighborSkinMessage) == 0x00000C, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::K2Node_MakeStruct_S_PlayerEquippedNeighborSkinMessage' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_MatchesTag_ReturnValue_1) == 0x000014, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, K2Node_MakeStruct_S_PlayerEquippedItemMessage) == 0x000018, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::K2Node_MakeStruct_S_PlayerEquippedItemMessage' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_GetStartingItemID_ReturnValue) == 0x000028, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_GetStartingItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000038, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000040, "Member 'WI_NeighborDetailsSelect_C_EquipCosmeticToLoadout::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.ExecuteUbergraph_WI_NeighborDetailsSelect
// 0x0360 (0x0360 - 0x0000)
struct WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_NeighborDetailsPerkSelectElement_C* PerkSelectElement)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NeighborID_1;                   // 0x0030(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FCosmeticsOnlineServicesDataContainer  K2Node_CustomEvent_CosmeticsContainer;             // 0x0038(0x0068)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_NeighborID;                     // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayTag& NeighborID, struct FCosmeticsOnlineServicesDataContainer& RewardsContainer)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 Temp_byte_Variable;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_SwitchCamera                K2Node_MakeStruct_S_Message_SwitchCamera;          // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_BackButton_C*                       CallFunc_GetBackButton_BackButton;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_SwitchCamera                K2Node_MakeStruct_S_Message_SwitchCamera_1;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 Temp_byte_Variable_1;                              // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 K2Node_Select_Default;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOnlineStoreItemData& StoreItemData, bool IsEquipped)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FOnlineStoreItemData& StoreItemData, bool IsEquipped)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_UnlockConfirmation_C*               K2Node_DynamicCast_AsWI_Unlock_Confirmation;       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_NeighborDetailsCosmeticsSelect_C*   K2Node_CustomEvent_NeighborDetailsCosmeticsSelect; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   CallFunc_GetSelectedElementUnlockInformation_StoreItemData; // 0x0188(0x0048)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 K2Node_Select_Default_1;                           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrencyAmount_ReturnValue;            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_1;     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurSpinner_C*               K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner;      // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_2;     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CurrencyPurchaseModal_C*            K2Node_DynamicCast_AsWI_Currency_Purchase_Modal;   // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerRewardUnlockedMessage         K2Node_MakeStruct_S_PlayerRewardUnlockedMessage;   // 0x0250(0x0018)(HasGetValueTypeHash)
	class UWI_EquipOrUnlock_C*                    CallFunc_TryGetEquipOrUnlockMatchingAssetID_EquipOrUnlock; // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetEquipOrUnlockMatchingAssetID_ReturnValue; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_NeighborDetailsCosmeticsSelect_C*   CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_NeighborDetailsCosmeticsSelect; // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_ReturnValue; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_3;     // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurErrorNotification_C*     K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData; // 0x02A0(0x0048)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0328(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0338(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect");
static_assert(sizeof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect) == 0x000360, "Wrong size on WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, EntryPoint) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_NeighborID_1) == 0x000030, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_NeighborID_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_CosmeticsContainer) == 0x000038, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_CosmeticsContainer' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_NeighborID) == 0x0000A0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_NeighborID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000A8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000B0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, Temp_byte_Variable) == 0x0000CC, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_MakeStruct_S_Message_SwitchCamera) == 0x0000CD, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_MakeStruct_S_Message_SwitchCamera' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetBackButton_BackButton) == 0x0000E0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetBackButton_BackButton' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_Button) == 0x0000E8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_MakeStruct_S_Message_SwitchCamera_1) == 0x0000F0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_MakeStruct_S_Message_SwitchCamera_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_ComponentBoundEvent_Button_1) == 0x0000F8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_ComponentBoundEvent_Button) == 0x000100, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, Temp_bool_Variable) == 0x000108, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_Add_ByteByte_ReturnValue) == 0x000109, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010A, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetValidValue_ReturnValue) == 0x00010B, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00010C, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_Subtract_ByteByte_ReturnValue) == 0x00010D, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetValidValue_ReturnValue_1) == 0x00010E, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, Temp_byte_Variable_1) == 0x00010F, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_Select_Default) == 0x000110, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x000114, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_5) == 0x000124, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_6) == 0x000134, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_7) == 0x000144, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_8) == 0x000154, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000168, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_AsWI_Unlock_Confirmation) == 0x000170, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_AsWI_Unlock_Confirmation' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_NeighborDetailsCosmeticsSelect) == 0x000180, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_NeighborDetailsCosmeticsSelect' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetSelectedElementUnlockInformation_StoreItemData) == 0x000188, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetSelectedElementUnlockInformation_StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001D0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, Temp_bool_Variable_1) == 0x0001E0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_Select_Default_1) == 0x0001E1, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0001E2, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetCurrencyAmount_ReturnValue) == 0x0001E4, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetCurrencyAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_SwitchEnum_CmpSuccess) == 0x0001E8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001E9, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001EC, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001FC, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CustomEvent_ErrorMessage) == 0x000210, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_PushWidgetToLayerStack_ReturnValue_1) == 0x000220, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_PushWidgetToLayerStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner) == 0x000228, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_PushWidgetToLayerStack_ReturnValue_2) == 0x000238, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_PushWidgetToLayerStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_AsWI_Currency_Purchase_Modal) == 0x000240, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_AsWI_Currency_Purchase_Modal' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_bSuccess_2) == 0x000248, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_MakeStruct_S_PlayerRewardUnlockedMessage) == 0x000250, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_MakeStruct_S_PlayerRewardUnlockedMessage' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_TryGetEquipOrUnlockMatchingAssetID_EquipOrUnlock) == 0x000268, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_TryGetEquipOrUnlockMatchingAssetID_EquipOrUnlock' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_TryGetEquipOrUnlockMatchingAssetID_ReturnValue) == 0x000270, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_TryGetEquipOrUnlockMatchingAssetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_NeighborDetailsCosmeticsSelect) == 0x000278, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_NeighborDetailsCosmeticsSelect' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_ReturnValue) == 0x000280, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_TryGetNeighborDetailsSelectMatchingAssetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_PushWidgetToLayerStack_ReturnValue_3) == 0x000288, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_PushWidgetToLayerStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification) == 0x000290, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_DynamicCast_bSuccess_3) == 0x000298, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData) == 0x0002A0, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_12) == 0x0002E8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_13) == 0x0002F8, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_14) == 0x000308, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_15) == 0x000318, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_16) == 0x000328, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, K2Node_CreateDelegate_OutputDelegate_17) == 0x000338, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000348, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000350, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000358, "Member 'WI_NeighborDetailsSelect_C_ExecuteUbergraph_WI_NeighborDetailsSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetCurrentlyLoadedItemSkin
// 0x0068 (0x0068 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin final
{
public:
	struct FGameplayTag                           ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FNeighborLoadout                       NeighborLoadout;                                   // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           CurrentlyEquipped;                                 // 0x0038(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemLoadout                           CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin) == 0x000068, "Wrong size on WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, ItemId) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::ItemId' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, NeighborLoadout) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::NeighborLoadout' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CurrentlyEquipped) == 0x000038, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CurrentlyEquipped' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CallFunc_Array_Get_Item) == 0x000048, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000064, "Member 'WI_NeighborDetailsSelect_C_GetCurrentlyLoadedItemSkin::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetDefaultOutfitID
// 0x0010 (0x0010 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetDefaultOutfitID final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetDefaultOutfitID) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetDefaultOutfitID");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetDefaultOutfitID) == 0x000010, "Wrong size on WI_NeighborDetailsSelect_C_GetDefaultOutfitID");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetDefaultOutfitID, ReturnValue) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_GetDefaultOutfitID::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetDefaultOutfitID, CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_GetDefaultOutfitID::CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetNeighborDefinitionBlocking
// 0x0050 (0x0050 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking final
{
public:
	class UNeighborDefinition*                    NeighborDefinition;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking) == 0x000050, "Wrong size on WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, NeighborDefinition) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::NeighborDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000010, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000040, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_NeighborDetailsSelect_C_GetNeighborDefinitionBlocking::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetSelectedElementUnlockInformation
// 0x0098 (0x0098 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation final
{
public:
	class UWI_NeighborDetailsCosmeticsSelect_C*   NeighborDetailsCosmeticsSelect;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   StoreItemData;                                     // 0x0008(0x0048)(Parm, OutParm)
	struct FOnlineStoreItemData                   CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData; // 0x0050(0x0048)()
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation) == 0x000098, "Wrong size on WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation, NeighborDetailsCosmeticsSelect) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation::NeighborDetailsCosmeticsSelect' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation, StoreItemData) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation::StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation, CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData) == 0x000050, "Member 'WI_NeighborDetailsSelect_C_GetSelectedElementUnlockInformation::CallFunc_GetSelectedCosmeticsStoreItemData_StoreItemData' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetStartingItemDefaultSkinID
// 0x0018 (0x0018 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_TryGetStartingItemSkinID_ReturnValue;     // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID) == 0x000018, "Wrong size on WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID, ReturnValue) == 0x000000, "Member 'WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID, CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition) == 0x000008, "Member 'WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID::CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID, CallFunc_TryGetStartingItemSkinID_ReturnValue) == 0x000010, "Member 'WI_NeighborDetailsSelect_C_GetStartingItemDefaultSkinID::CallFunc_TryGetStartingItemSkinID_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetailsSelect.WI_NeighborDetailsSelect_C.GetStartingItemID
// 0x0018 (0x0018 - 0x0000)
struct WI_NeighborDetailsSelect_C_GetStartingItemID final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    CallFunc_GetNeighborDefinitionBlocking_NeighborDefinition; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetStartingItemID_ReturnValue;            // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetailsSelect_C_GetStartingItemID) == 0x000008, "Wrong alignment on WI_NeighborDetailsSelect_C_GetStartingItemID");
static_assert(sizeof(WI_NeighborDetailsSelect_C_GetStartingItemID) == 0x000018, "Wrong size on WI_NeighborDetailsSelect_C_GetStartingItemID");
