#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ObjectiveTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ObjectiveTracker.WI_ObjectiveTracker_C.SetPlayer
// 0x0038 (0x0038 - 0x0000)
struct WI_ObjectiveTracker_C_SetPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
};
static_assert(alignof(WI_ObjectiveTracker_C_SetPlayer) == 0x000008, "Wrong alignment on WI_ObjectiveTracker_C_SetPlayer");
static_assert(sizeof(WI_ObjectiveTracker_C_SetPlayer) == 0x000038, "Wrong size on WI_ObjectiveTracker_C_SetPlayer");
static_assert(offsetof(WI_ObjectiveTracker_C_SetPlayer, Player) == 0x000000, "Member 'WI_ObjectiveTracker_C_SetPlayer::Player' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveTracker_C_SetPlayer, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000008, "Member 'WI_ObjectiveTracker_C_SetPlayer::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveTracker_C_SetPlayer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WI_ObjectiveTracker_C_SetPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveTracker_C_SetPlayer, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x000018, "Member 'WI_ObjectiveTracker_C_SetPlayer::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveTracker_C_SetPlayer, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WI_ObjectiveTracker_C_SetPlayer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

