#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ObjectContext

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ObjectContext.WI_ObjectContext_C
// 0x0030 (0x0310 - 0x02E0)
class UWI_ObjectContext_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_117;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 TextToShow;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ForceHidden;                                       // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ObjectContext(int32 EntryPoint);
	void FocusGained();
	void FocusLost();
	class FText GetText();
	void ToggleActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ObjectContext_C">();
	}
	static class UWI_ObjectContext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ObjectContext_C>();
	}
};
static_assert(alignof(UWI_ObjectContext_C) == 0x000008, "Wrong alignment on UWI_ObjectContext_C");
static_assert(sizeof(UWI_ObjectContext_C) == 0x000310, "Wrong size on UWI_ObjectContext_C");
static_assert(offsetof(UWI_ObjectContext_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ObjectContext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ObjectContext_C, Text) == 0x0002E8, "Member 'UWI_ObjectContext_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_ObjectContext_C, WidgetSwitcher_117) == 0x0002F0, "Member 'UWI_ObjectContext_C::WidgetSwitcher_117' has a wrong offset!");
static_assert(offsetof(UWI_ObjectContext_C, TextToShow) == 0x0002F8, "Member 'UWI_ObjectContext_C::TextToShow' has a wrong offset!");
static_assert(offsetof(UWI_ObjectContext_C, ForceHidden) == 0x000308, "Member 'UWI_ObjectContext_C::ForceHidden' has a wrong offset!");

}

