#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_OffscreenIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_OffscreenIndicator.WI_OffscreenIndicator_C.ExecuteUbergraph_WI_OffscreenIndicator
// 0x0038 (0x0038 - 0x0000)
struct WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Image_1;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color_1;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Image;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator) == 0x000008, "Wrong alignment on WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator");
static_assert(sizeof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator) == 0x000038, "Wrong size on WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator");
static_assert(offsetof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator, EntryPoint) == 0x000000, "Member 'WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator, K2Node_CustomEvent_Image_1) == 0x000008, "Member 'WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator::K2Node_CustomEvent_Image_1' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator, K2Node_CustomEvent_Color_1) == 0x000010, "Member 'WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator::K2Node_CustomEvent_Color_1' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator, K2Node_CustomEvent_Image) == 0x000020, "Member 'WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator, K2Node_CustomEvent_Color) == 0x000028, "Member 'WI_OffscreenIndicator_C_ExecuteUbergraph_WI_OffscreenIndicator::K2Node_CustomEvent_Color' has a wrong offset!");

// Function WI_OffscreenIndicator.WI_OffscreenIndicator_C.SetArrowImage
// 0x0018 (0x0018 - 0x0000)
struct WI_OffscreenIndicator_C_SetArrowImage final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OffscreenIndicator_C_SetArrowImage) == 0x000008, "Wrong alignment on WI_OffscreenIndicator_C_SetArrowImage");
static_assert(sizeof(WI_OffscreenIndicator_C_SetArrowImage) == 0x000018, "Wrong size on WI_OffscreenIndicator_C_SetArrowImage");
static_assert(offsetof(WI_OffscreenIndicator_C_SetArrowImage, Image) == 0x000000, "Member 'WI_OffscreenIndicator_C_SetArrowImage::Image' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_SetArrowImage, Color) == 0x000008, "Member 'WI_OffscreenIndicator_C_SetArrowImage::Color' has a wrong offset!");

// Function WI_OffscreenIndicator.WI_OffscreenIndicator_C.SetImage
// 0x0018 (0x0018 - 0x0000)
struct WI_OffscreenIndicator_C_SetImage final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OffscreenIndicator_C_SetImage) == 0x000008, "Wrong alignment on WI_OffscreenIndicator_C_SetImage");
static_assert(sizeof(WI_OffscreenIndicator_C_SetImage) == 0x000018, "Wrong size on WI_OffscreenIndicator_C_SetImage");
static_assert(offsetof(WI_OffscreenIndicator_C_SetImage, Image) == 0x000000, "Member 'WI_OffscreenIndicator_C_SetImage::Image' has a wrong offset!");
static_assert(offsetof(WI_OffscreenIndicator_C_SetImage, Color) == 0x000008, "Member 'WI_OffscreenIndicator_C_SetImage::Color' has a wrong offset!");

}

