#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_OtherLogos

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_OtherLogos.WI_OtherLogos_C
// 0x0030 (0x0460 - 0x0430)
class UWI_OtherLogos_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_101;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_241;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             LogoShowEnded;                                     // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WI_OtherLogos(int32 EntryPoint);
	void InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void LogoShowEnded__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_OtherLogos_C">();
	}
	static class UWI_OtherLogos_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_OtherLogos_C>();
	}
};
static_assert(alignof(UWI_OtherLogos_C) == 0x000008, "Wrong alignment on UWI_OtherLogos_C");
static_assert(sizeof(UWI_OtherLogos_C) == 0x000460, "Wrong size on UWI_OtherLogos_C");
static_assert(offsetof(UWI_OtherLogos_C, UberGraphFrame) == 0x000430, "Member 'UWI_OtherLogos_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_OtherLogos_C, FadeIn) == 0x000438, "Member 'UWI_OtherLogos_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWI_OtherLogos_C, Image_101) == 0x000440, "Member 'UWI_OtherLogos_C::Image_101' has a wrong offset!");
static_assert(offsetof(UWI_OtherLogos_C, Image_241) == 0x000448, "Member 'UWI_OtherLogos_C::Image_241' has a wrong offset!");
static_assert(offsetof(UWI_OtherLogos_C, LogoShowEnded) == 0x000450, "Member 'UWI_OtherLogos_C::LogoShowEnded' has a wrong offset!");

}

