#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Objective

#include "Basic.hpp"

#include "E_TimeOfDay_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_Objective.WI_Objective_C.AddObjectiveTracker
// 0x0028 (0x0028 - 0x0000)
struct WI_Objective_C_AddObjectiveTracker final
{
public:
	class APlayerState*                           TrackingPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ObjectiveTracker_C*                 CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_AddObjectiveTracker) == 0x000008, "Wrong alignment on WI_Objective_C_AddObjectiveTracker");
static_assert(sizeof(WI_Objective_C_AddObjectiveTracker) == 0x000028, "Wrong size on WI_Objective_C_AddObjectiveTracker");
static_assert(offsetof(WI_Objective_C_AddObjectiveTracker, TrackingPlayer) == 0x000000, "Member 'WI_Objective_C_AddObjectiveTracker::TrackingPlayer' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_AddObjectiveTracker, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WI_Objective_C_AddObjectiveTracker::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_AddObjectiveTracker, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WI_Objective_C_AddObjectiveTracker::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_AddObjectiveTracker, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'WI_Objective_C_AddObjectiveTracker::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_AddObjectiveTracker, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WI_Objective_C_AddObjectiveTracker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.CalculateTimeUntilObjectiveEnd
// 0x0158 (0x0158 - 0x0000)
struct WI_Objective_C_CalculateTimeUntilObjectiveEnd final
{
public:
	E_TimeOfDay                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0028(0x0058)(ConstParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASubObjective*                          CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveAction_EndTime*               K2Node_DynamicCast_AsObjective_Action_End_Time;    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndTime_GameplayMessage*               K2Node_DynamicCast_AsEnd_Time_Gameplay_Message;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_WarmupCountdown_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_WarmupCountdown_C*                  CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeLeft_TimeLeft;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_NewEnumerator1_ImplicitCast;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_NewEnumerator2_ImplicitCast;         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_NewEnumerator1_ImplicitCast_1;       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_CalculateTimeUntilObjectiveEnd) == 0x000008, "Wrong alignment on WI_Objective_C_CalculateTimeUntilObjectiveEnd");
static_assert(sizeof(WI_Objective_C_CalculateTimeUntilObjectiveEnd) == 0x000158, "Wrong size on WI_Objective_C_CalculateTimeUntilObjectiveEnd");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_byte_Variable) == 0x000000, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable) == 0x000004, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_1) == 0x000008, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_2) == 0x00000C, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_3) == 0x000010, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_byte_Variable_1) == 0x000014, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_4) == 0x000018, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_5) == 0x00001C, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, Temp_real_Variable_6) == 0x000020, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000028, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000088, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_GetActorOfClass_ReturnValue) == 0x000098, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_FindActionByType_ReturnValue) == 0x0000A8, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_Select_Default) == 0x0000B0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_DynamicCast_AsObjective_Action_End_Time) == 0x0000B8, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_DynamicCast_AsObjective_Action_End_Time' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_DynamicCast_AsEnd_Time_Gameplay_Message) == 0x0000D8, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_DynamicCast_AsEnd_Time_Gameplay_Message' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000E1, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_Select_Default_1) == 0x0000E4, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0000E8, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000F0, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000100, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_GetTimeLeft_TimeLeft) == 0x000110, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_GetTimeLeft_TimeLeft' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000118, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000120, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000130, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_Select_NewEnumerator1_ImplicitCast) == 0x000138, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_Select_NewEnumerator1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_Select_NewEnumerator2_ImplicitCast) == 0x00013C, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_Select_NewEnumerator2_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, K2Node_Select_NewEnumerator1_ImplicitCast_1) == 0x000140, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::K2Node_Select_NewEnumerator1_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_CalculateTimeUntilObjectiveEnd, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'WI_Objective_C_CalculateTimeUntilObjectiveEnd::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.ExecuteUbergraph_WI_Objective
// 0x0120 (0x0120 - 0x0000)
struct WI_Objective_C_ExecuteUbergraph_WI_Objective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASubObjective*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_TimeSinceObjectiveCreated_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction_EndTime*               K2Node_DynamicCast_AsObjective_Action_End_Time;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndTime_GameplayMessage*               K2Node_DynamicCast_AsEnd_Time_Gameplay_Message;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndTime_Timer*                         K2Node_DynamicCast_AsEnd_Time_Timer;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x00C0(0x0010)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_1;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue_1;        // 0x00E0(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast_1;       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_ExecuteUbergraph_WI_Objective) == 0x000008, "Wrong alignment on WI_Objective_C_ExecuteUbergraph_WI_Objective");
static_assert(sizeof(WI_Objective_C_ExecuteUbergraph_WI_Objective) == 0x000120, "Wrong size on WI_Objective_C_ExecuteUbergraph_WI_Objective");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, EntryPoint) == 0x000000, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000030, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_TimeSinceObjectiveCreated_ReturnValue) == 0x000038, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_TimeSinceObjectiveCreated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_FindActionByType_ReturnValue) == 0x000040, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000058, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000060, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_AsObjective_Action_End_Time) == 0x000068, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_AsObjective_Action_End_Time' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_AsEnd_Time_Gameplay_Message) == 0x000078, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_AsEnd_Time_Gameplay_Message' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_AsEnd_Time_Timer) == 0x000088, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_AsEnd_Time_Timer' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_FromSeconds_ReturnValue) == 0x0000B8, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x0000C0, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000D0, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_FromSeconds_ReturnValue_1) == 0x0000D8, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_FromSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_AsTimespan_Timespan_ReturnValue_1) == 0x0000E0, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_AsTimespan_Timespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000F0, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000F8, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000100, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000108, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x000118, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_ExecuteUbergraph_WI_Objective, CallFunc_FromSeconds_Seconds_ImplicitCast_1) == 0x00011C, "Member 'WI_Objective_C_ExecuteUbergraph_WI_Objective::CallFunc_FromSeconds_Seconds_ImplicitCast_1' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_Objective_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_PreConstruct) == 0x000001, "Wrong alignment on WI_Objective_C_PreConstruct");
static_assert(sizeof(WI_Objective_C_PreConstruct) == 0x000001, "Wrong size on WI_Objective_C_PreConstruct");
static_assert(offsetof(WI_Objective_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_Objective_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.Set Visuals
// 0x03D0 (0x03D0 - 0x0000)
struct WI_Objective_C_Set_Visuals final
{
public:
	class UObjectiveDefinition*                   ObjectiveDefinition;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   RewardText;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObjectiveAction*>               CallFunc_FindActionsByType_ReturnValue;            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveAction_Description*           K2Node_DynamicCast_AsObjective_Action_Description; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveAction*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction_Reward*                K2Node_DynamicCast_AsObjective_Action_Reward;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveReward_ItemDelivery*          K2Node_DynamicCast_AsObjective_Reward_Item_Delivery; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveReward_TeamResource*          K2Node_DynamicCast_AsObjective_Reward_Team_Resource; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemTiersDefinition*                   K2Node_DynamicCast_AsItem_Tiers_Definition;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMoneyDisplayNameText_ReturnValue;      // 0x00A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0048)(HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0050)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0010)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0170(0x0048)(HasGetValueTypeHash)
	class ABP_HouseAdditionCrate_C*               K2Node_DynamicCast_AsBP_House_Addition_Crate;      // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01E8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0230(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0240(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0298(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x02F0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0338(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0348(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0358(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0368(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03C0(0x0010)()
};
static_assert(alignof(WI_Objective_C_Set_Visuals) == 0x000008, "Wrong alignment on WI_Objective_C_Set_Visuals");
static_assert(sizeof(WI_Objective_C_Set_Visuals) == 0x0003D0, "Wrong size on WI_Objective_C_Set_Visuals");
static_assert(offsetof(WI_Objective_C_Set_Visuals, ObjectiveDefinition) == 0x000000, "Member 'WI_Objective_C_Set_Visuals::ObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, RewardText) == 0x000008, "Member 'WI_Objective_C_Set_Visuals::RewardText' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_FindActionByType_ReturnValue) == 0x000018, "Member 'WI_Objective_C_Set_Visuals::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_FindActionsByType_ReturnValue) == 0x000020, "Member 'WI_Objective_C_Set_Visuals::CallFunc_FindActionsByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WI_Objective_C_Set_Visuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_FindActionByType_ReturnValue_1) == 0x000038, "Member 'WI_Objective_C_Set_Visuals::CallFunc_FindActionByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WI_Objective_C_Set_Visuals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsObjective_Action_Description) == 0x000048, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsObjective_Action_Description' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Array_Get_Item) == 0x000058, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsObjective_Action_Reward) == 0x000060, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsObjective_Action_Reward' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsObjective_Reward_Item_Delivery) == 0x000070, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsObjective_Reward_Item_Delivery' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsObjective_Reward_Team_Resource) == 0x000080, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsObjective_Reward_Team_Resource' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsItem_Tiers_Definition) == 0x000090, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsItem_Tiers_Definition' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_4) == 0x000098, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_GetMoneyDisplayNameText_ReturnValue) == 0x0000A0, "Member 'WI_Objective_C_Set_Visuals::CallFunc_GetMoneyDisplayNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeArray_Array) == 0x000148, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Format_ReturnValue) == 0x000158, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000168, "Member 'WI_Objective_C_Set_Visuals::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_1) == 0x000170, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsBP_House_Addition_Crate) == 0x0001B8, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsBP_House_Addition_Crate' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_5) == 0x0001C0, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_AsItem_Definition) == 0x0001C8, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_DynamicCast_bSuccess_6) == 0x0001D0, "Member 'WI_Objective_C_Set_Visuals::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Conv_TextToString_ReturnValue) == 0x0001D8, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001E8, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Conv_StringToText_ReturnValue) == 0x000230, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_3) == 0x000240, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, Temp_int_Loop_Counter_Variable) == 0x000288, "Member 'WI_Objective_C_Set_Visuals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_4) == 0x000298, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeArray_Array_1) == 0x0002E0, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_5) == 0x0002F0, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Format_ReturnValue_1) == 0x000338, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeArray_Array_2) == 0x000348, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Format_ReturnValue_2) == 0x000358, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeStruct_FormatArgumentData_6) == 0x000368, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, K2Node_MakeArray_Array_3) == 0x0003B0, "Member 'WI_Objective_C_Set_Visuals::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_Set_Visuals, CallFunc_Format_ReturnValue_3) == 0x0003C0, "Member 'WI_Objective_C_Set_Visuals::CallFunc_Format_ReturnValue_3' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.SetCompletedStatus
// 0x0010 (0x0010 - 0x0000)
struct WI_Objective_C_SetCompletedStatus final
{
public:
	bool                                          IsCompleted;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_SetCompletedStatus) == 0x000008, "Wrong alignment on WI_Objective_C_SetCompletedStatus");
static_assert(sizeof(WI_Objective_C_SetCompletedStatus) == 0x000010, "Wrong size on WI_Objective_C_SetCompletedStatus");
static_assert(offsetof(WI_Objective_C_SetCompletedStatus, IsCompleted) == 0x000000, "Member 'WI_Objective_C_SetCompletedStatus::IsCompleted' has a wrong offset!");
static_assert(offsetof(WI_Objective_C_SetCompletedStatus, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WI_Objective_C_SetCompletedStatus::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.SetObjectiveReward
// 0x0010 (0x0010 - 0x0000)
struct WI_Objective_C_SetObjectiveReward final
{
public:
	class FText                                   ObjectiveReward_0;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_Objective_C_SetObjectiveReward) == 0x000008, "Wrong alignment on WI_Objective_C_SetObjectiveReward");
static_assert(sizeof(WI_Objective_C_SetObjectiveReward) == 0x000010, "Wrong size on WI_Objective_C_SetObjectiveReward");
static_assert(offsetof(WI_Objective_C_SetObjectiveReward, ObjectiveReward_0) == 0x000000, "Member 'WI_Objective_C_SetObjectiveReward::ObjectiveReward_0' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.SetObjectiveTitle
// 0x0010 (0x0010 - 0x0000)
struct WI_Objective_C_SetObjectiveTitle final
{
public:
	class FText                                   ObjectiveTitle_0;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_Objective_C_SetObjectiveTitle) == 0x000008, "Wrong alignment on WI_Objective_C_SetObjectiveTitle");
static_assert(sizeof(WI_Objective_C_SetObjectiveTitle) == 0x000010, "Wrong size on WI_Objective_C_SetObjectiveTitle");
static_assert(offsetof(WI_Objective_C_SetObjectiveTitle, ObjectiveTitle_0) == 0x000000, "Member 'WI_Objective_C_SetObjectiveTitle::ObjectiveTitle_0' has a wrong offset!");

// Function WI_Objective.WI_Objective_C.TimeSinceObjectiveCreated
// 0x0030 (0x0030 - 0x0000)
struct WI_Objective_C_TimeSinceObjectiveCreated final
{
public:
	class ASubObjective*                          SubObjective;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Objective_C_TimeSinceObjectiveCreated) == 0x000008, "Wrong alignment on WI_Objective_C_TimeSinceObjectiveCreated");
static_assert(sizeof(WI_Objective_C_TimeSinceObjectiveCreated) == 0x000030, "Wrong size on WI_Objective_C_TimeSinceObjectiveCreated");
