#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_OverlayBlurSpinner

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_OverlayBlurSpinner.WI_OverlayBlurSpinner_C.ExecuteUbergraph_WI_OverlayBlurSpinner
// 0x0008 (0x0008 - 0x0000)
struct WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner) == 0x000004, "Wrong alignment on WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner");
static_assert(sizeof(WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner) == 0x000008, "Wrong size on WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner");
static_assert(offsetof(WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner, EntryPoint) == 0x000000, "Member 'WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_OverlayBlurSpinner_C_ExecuteUbergraph_WI_OverlayBlurSpinner::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_OverlayBlurSpinner.WI_OverlayBlurSpinner_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_OverlayBlurSpinner_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OverlayBlurSpinner_C_PreConstruct) == 0x000001, "Wrong alignment on WI_OverlayBlurSpinner_C_PreConstruct");
static_assert(sizeof(WI_OverlayBlurSpinner_C_PreConstruct) == 0x000001, "Wrong size on WI_OverlayBlurSpinner_C_PreConstruct");
static_assert(offsetof(WI_OverlayBlurSpinner_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_OverlayBlurSpinner_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_OverlayBlurSpinner.WI_OverlayBlurSpinner_C.SetMessage
// 0x0010 (0x0010 - 0x0000)
struct WI_OverlayBlurSpinner_C_SetMessage final
{
public:
	class FText                                   Message_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_OverlayBlurSpinner_C_SetMessage) == 0x000008, "Wrong alignment on WI_OverlayBlurSpinner_C_SetMessage");
static_assert(sizeof(WI_OverlayBlurSpinner_C_SetMessage) == 0x000010, "Wrong size on WI_OverlayBlurSpinner_C_SetMessage");
static_assert(offsetof(WI_OverlayBlurSpinner_C_SetMessage, Message_0) == 0x000000, "Member 'WI_OverlayBlurSpinner_C_SetMessage::Message_0' has a wrong offset!");

}

