#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_ServerBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PreLobby_ServerBrowser.WI_PreLobby_ServerBrowser_C
// 0x0060 (0x03C0 - 0x0360)
class UWI_PreLobby_ServerBrowser_C final : public UPreLobbyServerBrowserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPCommonSetting_Checkbox_C*         FriendsOnly;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         JoinButton;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Text_C*             NameQuery;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         RefreshButton;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_SingleChoice_C*     Region;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         ShowCustomMatchConfiguration;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_MultiChoice_C*      TeamSizes;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingsPanel_C*            WI_JPCommonSettingsPanel_1;                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PreLobby_ServerList2_C*             WI_PreLobby_ServerList2;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetTransformRandomizer*             WidgetTransformRandomizer;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetTransformRandomizer*             WidgetTransformRandomizer_147;                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FPreLobbyServerBrowserViewModel& InViewModel);
	void BndEvt__WI_PreLobby_ServerBrowser_RefreshButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_PreLobby_ServerBrowser_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WI_PreLobby_ServerBrowser(int32 EntryPoint);
	void OnBoolChanged(class UJPSettingWidget* InWidget);
	void OnEntrySelected(class UPreLobbyServerBrowserEntry* InEntry);
	void OnInitialized();
	void OnMultiChoiceValueChanged(class UJPSettingWidget* InWidget);
	void OnSingleChoiceChanged(class UJPSettingWidget* InWidget);
	void OnTextChanged(class UJPSettingWidget* InWidget);
	void OutputDebugData(int32 Players, int32 Slots, int32 PartySize);
	bool ShouldEnableJoinButton(const class UPreLobbyServerBrowserEntry* InEntry);
	void UpdatePartyState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PreLobby_ServerBrowser_C">();
	}
	static class UWI_PreLobby_ServerBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PreLobby_ServerBrowser_C>();
	}
};
static_assert(alignof(UWI_PreLobby_ServerBrowser_C) == 0x000008, "Wrong alignment on UWI_PreLobby_ServerBrowser_C");
static_assert(sizeof(UWI_PreLobby_ServerBrowser_C) == 0x0003C0, "Wrong size on UWI_PreLobby_ServerBrowser_C");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, UberGraphFrame) == 0x000360, "Member 'UWI_PreLobby_ServerBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, FriendsOnly) == 0x000368, "Member 'UWI_PreLobby_ServerBrowser_C::FriendsOnly' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, JoinButton) == 0x000370, "Member 'UWI_PreLobby_ServerBrowser_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, NameQuery) == 0x000378, "Member 'UWI_PreLobby_ServerBrowser_C::NameQuery' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, RefreshButton) == 0x000380, "Member 'UWI_PreLobby_ServerBrowser_C::RefreshButton' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, Region) == 0x000388, "Member 'UWI_PreLobby_ServerBrowser_C::Region' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, ShowCustomMatchConfiguration) == 0x000390, "Member 'UWI_PreLobby_ServerBrowser_C::ShowCustomMatchConfiguration' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, TeamSizes) == 0x000398, "Member 'UWI_PreLobby_ServerBrowser_C::TeamSizes' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, WI_JPCommonSettingsPanel_1) == 0x0003A0, "Member 'UWI_PreLobby_ServerBrowser_C::WI_JPCommonSettingsPanel_1' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, WI_PreLobby_ServerList2) == 0x0003A8, "Member 'UWI_PreLobby_ServerBrowser_C::WI_PreLobby_ServerList2' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, WidgetTransformRandomizer) == 0x0003B0, "Member 'UWI_PreLobby_ServerBrowser_C::WidgetTransformRandomizer' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerBrowser_C, WidgetTransformRandomizer_147) == 0x0003B8, "Member 'UWI_PreLobby_ServerBrowser_C::WidgetTransformRandomizer_147' has a wrong offset!");

}

