#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayScreen_V2_MatchmakingVisualizer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_PlayScreen_V2_MatchmakingVisualizer.WI_PlayScreen_V2_MatchmakingVisualizer_C.BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_PlayScreen_V2_MatchmakingVisualizer.WI_PlayScreen_V2_MatchmakingVisualizer_C.ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer
// 0x00C0 (0x00C0 - 0x0000)
struct WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineServicesLobbySubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineServicesLobbySubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineServicesLobbySubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0010)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalUserPartyLeader_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInParty_ReturnValue;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer) == 0x000008, "Wrong alignment on WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer");
static_assert(sizeof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer) == 0x0000C0, "Wrong size on WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, EntryPoint) == 0x000000, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, Temp_byte_Variable) == 0x000004, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, Temp_byte_Variable_1) == 0x000005, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000018, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_MakeLiteralText_ReturnValue) == 0x000038, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, Temp_bool_Variable) == 0x000078, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000088, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_IsLocalUserPartyLeader_ReturnValue) == 0x0000A0, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_IsLocalUserPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_IsInParty_ReturnValue) == 0x0000A1, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_IsInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_Select_Default) == 0x0000A2, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A4, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer, CallFunc_SpawnSound2D_ReturnValue) == 0x0000B8, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function WI_PlayScreen_V2_MatchmakingVisualizer.WI_PlayScreen_V2_MatchmakingVisualizer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct");
static_assert(sizeof(WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct) == 0x000001, "Wrong size on WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_PlayScreen_V2_MatchmakingVisualizer.WI_PlayScreen_V2_MatchmakingVisualizer_C.UpdateSearchingDots
// 0x0048 (0x0048 - 0x0000)
struct WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots final
{
public:
	class FString                                 ToDisplay;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots) == 0x000008, "Wrong alignment on WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots");
static_assert(sizeof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots) == 0x000048, "Wrong size on WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, ToDisplay) == 0x000000, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::ToDisplay' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, Temp_int_Variable) == 0x000010, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, Temp_int_Variable_1) == 0x000038, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WI_PlayScreen_V2_MatchmakingVisualizer_C_UpdateSearchingDots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

