#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ProjectVersion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ProjectVersion.WI_ProjectVersion_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_ProjectVersion_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BuildDateTimeText;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BuildVersionText;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionText;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_ProjectVersion(int32 EntryPoint);
	void HideVisibility();
	void OnInitialized();
	void OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0(const struct FServerDebugInformation& DebugInformation);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ProjectVersion_C">();
	}
	static class UWI_ProjectVersion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ProjectVersion_C>();
	}
};
static_assert(alignof(UWI_ProjectVersion_C) == 0x000008, "Wrong alignment on UWI_ProjectVersion_C");
static_assert(sizeof(UWI_ProjectVersion_C) == 0x000300, "Wrong size on UWI_ProjectVersion_C");
static_assert(offsetof(UWI_ProjectVersion_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ProjectVersion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ProjectVersion_C, BuildDateTimeText) == 0x0002E8, "Member 'UWI_ProjectVersion_C::BuildDateTimeText' has a wrong offset!");
static_assert(offsetof(UWI_ProjectVersion_C, BuildVersionText) == 0x0002F0, "Member 'UWI_ProjectVersion_C::BuildVersionText' has a wrong offset!");
static_assert(offsetof(UWI_ProjectVersion_C, RegionText) == 0x0002F8, "Member 'UWI_ProjectVersion_C::RegionText' has a wrong offset!");

}

