#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PerkAbilityContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PerkAbilityContainer.WI_PerkAbilityContainer_C
// 0x0028 (0x0308 - 0x02E0)
class UWI_PerkAbilityContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_38;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWI_PerkAbility_C*>              ExistingPerkWidgets;                               // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          TargetWidgetExists;                                // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddPerkAbility(TSoftClassPtr<class UClass> WidgetToSpawn, class UGameplayAbilityIW* GameplayAbility, double AbilityAddedTimeStamp, class UClass* PerkAbilityClass);
	void Destruct();
	void ExecuteUbergraph_WI_PerkAbilityContainer(int32 EntryPoint);
	void GetPerkAbilityOfType(TSoftClassPtr<class UClass> AbilityPerk, class UWI_PerkAbility_C** ExistingAbilityPerk);
	void OnLoaded_C207974446864F7F015D359C03B77D29(TSubclassOf<class UObject> Loaded);
	void RemovePerkAbility(class UClass* AbilityToRemove);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PerkAbilityContainer_C">();
	}
	static class UWI_PerkAbilityContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PerkAbilityContainer_C>();
	}
};
static_assert(alignof(UWI_PerkAbilityContainer_C) == 0x000008, "Wrong alignment on UWI_PerkAbilityContainer_C");
static_assert(sizeof(UWI_PerkAbilityContainer_C) == 0x000308, "Wrong size on UWI_PerkAbilityContainer_C");
static_assert(offsetof(UWI_PerkAbilityContainer_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PerkAbilityContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PerkAbilityContainer_C, HorizontalBox_38) == 0x0002E8, "Member 'UWI_PerkAbilityContainer_C::HorizontalBox_38' has a wrong offset!");
static_assert(offsetof(UWI_PerkAbilityContainer_C, ExistingPerkWidgets) == 0x0002F0, "Member 'UWI_PerkAbilityContainer_C::ExistingPerkWidgets' has a wrong offset!");
static_assert(offsetof(UWI_PerkAbilityContainer_C, TargetWidgetExists) == 0x000300, "Member 'UWI_PerkAbilityContainer_C::TargetWidgetExists' has a wrong offset!");

}

