#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PanelBackgroundSlim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PanelBackgroundSlim.WI_PanelBackgroundSlim_C
// 0x0030 (0x0310 - 0x02E0)
class UWI_PanelBackgroundSlim_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                ContentPadding;                                    // 0x02FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WI_PanelBackgroundSlim(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PanelBackgroundSlim_C">();
	}
	static class UWI_PanelBackgroundSlim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PanelBackgroundSlim_C>();
	}
};
static_assert(alignof(UWI_PanelBackgroundSlim_C) == 0x000008, "Wrong alignment on UWI_PanelBackgroundSlim_C");
static_assert(sizeof(UWI_PanelBackgroundSlim_C) == 0x000310, "Wrong size on UWI_PanelBackgroundSlim_C");
static_assert(offsetof(UWI_PanelBackgroundSlim_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PanelBackgroundSlim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PanelBackgroundSlim_C, Background) == 0x0002E8, "Member 'UWI_PanelBackgroundSlim_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_PanelBackgroundSlim_C, Content) == 0x0002F0, "Member 'UWI_PanelBackgroundSlim_C::Content' has a wrong offset!");
static_assert(offsetof(UWI_PanelBackgroundSlim_C, Scale) == 0x0002F8, "Member 'UWI_PanelBackgroundSlim_C::Scale' has a wrong offset!");
static_assert(offsetof(UWI_PanelBackgroundSlim_C, ContentPadding) == 0x0002FC, "Member 'UWI_PanelBackgroundSlim_C::ContentPadding' has a wrong offset!");

}

