#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_Configuration2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "CommonGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PreLobby_Configuration2.WI_PreLobby_Configuration2_C
// 0x0078 (0x0390 - 0x0318)
class UWI_PreLobby_Configuration2_C final : public ULobbyConfigurationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPCommonSetting_Checkbox_C*         AllowJoinInProgress;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         CreateButton;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         EnableCustomMatchConfiguration;                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         InviteOnly;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         LANOnly;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Text_C*             LobbyName;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Text_C*             Password;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         PasswordProtectedCheckbox;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_SingleChoice_C*     TeamSize;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingsPanel_C*            WI_JPCommonSettingsPanel;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_LobbyV3_ConfigurationSummary_C*     WI_LobbyV3_ConfigurationSummary_1;                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetTransformRandomizer*             WidgetTransformRandomizer;                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 OldViewTarget;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               LoadingModal;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FLobbyConfigurationViewModel& InModel);
	void BndEvt__WI_PreLobby_Configuration2_PasswordProtectedCheckbox_K2Node_ComponentBoundEvent_1_OnJPSettingWidgetValueChanged__DelegateSignature(class UJPSettingWidget* InWidget);
	void BndEvt__WI_PreLobby_Configuration_WI_JPButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_PreLobby_Configuration2(int32 EntryPoint);
	void FindPreLobbyCamera(class ABP_MainMenuTabCameraController_C** Array_Element);
	void MakeLobbyName(const class FString& PlayerName, class FText* Result);
	void OnBoolChanged(class UJPSettingWidget* InWidget);
	void OnInitialized();
	void OnResult_9255A8384FFA403B687D0A906EE03D23(ECommonMessagingResult Result);
	void OnTeamSizeChanged(class UJPSettingWidget* InWidget);
	void OnTextChanged(class UJPSettingWidget* InWidget);
	void PreConstruct(bool IsDesignTime);
	void ShowCreateLobbyError();
	void ShowCreateLobbyLoading();
	void UpdatePartyState();
	void UpdatePasswordFieldEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PreLobby_Configuration2_C">();
	}
	static class UWI_PreLobby_Configuration2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PreLobby_Configuration2_C>();
	}
};
static_assert(alignof(UWI_PreLobby_Configuration2_C) == 0x000008, "Wrong alignment on UWI_PreLobby_Configuration2_C");
static_assert(sizeof(UWI_PreLobby_Configuration2_C) == 0x000390, "Wrong size on UWI_PreLobby_Configuration2_C");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, UberGraphFrame) == 0x000318, "Member 'UWI_PreLobby_Configuration2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, AllowJoinInProgress) == 0x000320, "Member 'UWI_PreLobby_Configuration2_C::AllowJoinInProgress' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, CreateButton) == 0x000328, "Member 'UWI_PreLobby_Configuration2_C::CreateButton' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, EnableCustomMatchConfiguration) == 0x000330, "Member 'UWI_PreLobby_Configuration2_C::EnableCustomMatchConfiguration' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, InviteOnly) == 0x000338, "Member 'UWI_PreLobby_Configuration2_C::InviteOnly' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, LANOnly) == 0x000340, "Member 'UWI_PreLobby_Configuration2_C::LANOnly' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, LobbyName) == 0x000348, "Member 'UWI_PreLobby_Configuration2_C::LobbyName' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, Password) == 0x000350, "Member 'UWI_PreLobby_Configuration2_C::Password' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, PasswordProtectedCheckbox) == 0x000358, "Member 'UWI_PreLobby_Configuration2_C::PasswordProtectedCheckbox' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, TeamSize) == 0x000360, "Member 'UWI_PreLobby_Configuration2_C::TeamSize' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, WI_JPCommonSettingsPanel) == 0x000368, "Member 'UWI_PreLobby_Configuration2_C::WI_JPCommonSettingsPanel' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, WI_LobbyV3_ConfigurationSummary_1) == 0x000370, "Member 'UWI_PreLobby_Configuration2_C::WI_LobbyV3_ConfigurationSummary_1' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, WidgetTransformRandomizer) == 0x000378, "Member 'UWI_PreLobby_Configuration2_C::WidgetTransformRandomizer' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, OldViewTarget) == 0x000380, "Member 'UWI_PreLobby_Configuration2_C::OldViewTarget' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_Configuration2_C, LoadingModal) == 0x000388, "Member 'UWI_PreLobby_Configuration2_C::LoadingModal' has a wrong offset!");

}

