#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Perk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Perk.WI_Perk_C
// 0x0088 (0x0368 - 0x02E0)
class UWI_Perk_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DarkIconBase;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DarkShadowOutlineBase;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveTint;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LightBase;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            Dark_Color;                                        // 0x0310(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Light_Color;                                       // 0x0324(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              Icon_Soft_Texture;                                 // 0x0338(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_Perk(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetIsActive(bool IsActive_0);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Perk_C">();
	}
	static class UWI_Perk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Perk_C>();
	}
};
static_assert(alignof(UWI_Perk_C) == 0x000008, "Wrong alignment on UWI_Perk_C");
static_assert(sizeof(UWI_Perk_C) == 0x000368, "Wrong size on UWI_Perk_C");
static_assert(offsetof(UWI_Perk_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Perk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, DarkIconBase) == 0x0002E8, "Member 'UWI_Perk_C::DarkIconBase' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, DarkShadowOutlineBase) == 0x0002F0, "Member 'UWI_Perk_C::DarkShadowOutlineBase' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, Icon) == 0x0002F8, "Member 'UWI_Perk_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, InactiveTint) == 0x000300, "Member 'UWI_Perk_C::InactiveTint' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, LightBase) == 0x000308, "Member 'UWI_Perk_C::LightBase' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, Dark_Color) == 0x000310, "Member 'UWI_Perk_C::Dark_Color' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, Light_Color) == 0x000324, "Member 'UWI_Perk_C::Light_Color' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, Icon_Soft_Texture) == 0x000338, "Member 'UWI_Perk_C::Icon_Soft_Texture' has a wrong offset!");
static_assert(offsetof(UWI_Perk_C, IsActive) == 0x000360, "Member 'UWI_Perk_C::IsActive' has a wrong offset!");

}

