#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlatformAvatar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_PlatformAvatar.WI_PlatformAvatar_C.LoadUsingOnlineServicesUser
// 0x0038 (0x0038 - 0x0000)
struct WI_PlatformAvatar_C_LoadUsingOnlineServicesUser final
{
public:
	const class UOnlineServicesUserBase*          User;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraSettingsLocal*                     K2Node_DynamicCast_AsLyra_Settings_Local;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSoftObjectPtr<class UTexture> Avatar)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHidePlayerNames_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser) == 0x000008, "Wrong alignment on WI_PlatformAvatar_C_LoadUsingOnlineServicesUser");
static_assert(sizeof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser) == 0x000038, "Wrong size on WI_PlatformAvatar_C_LoadUsingOnlineServicesUser");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, User) == 0x000000, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::User' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, K2Node_DynamicCast_AsLyra_Settings_Local) == 0x000010, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::K2Node_DynamicCast_AsLyra_Settings_Local' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, CallFunc_GetHidePlayerNames_ReturnValue) == 0x00002C, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::CallFunc_GetHidePlayerNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_LoadUsingOnlineServicesUser, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WI_PlatformAvatar_C_LoadUsingOnlineServicesUser::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WI_PlatformAvatar.WI_PlatformAvatar_C.OnLoadedAvatarFromUser
// 0x0028 (0x0028 - 0x0000)
struct WI_PlatformAvatar_C_OnLoadedAvatarFromUser final
{
public:
	TSoftObjectPtr<class UTexture>                Avatar;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlatformAvatar_C_OnLoadedAvatarFromUser) == 0x000008, "Wrong alignment on WI_PlatformAvatar_C_OnLoadedAvatarFromUser");
static_assert(sizeof(WI_PlatformAvatar_C_OnLoadedAvatarFromUser) == 0x000028, "Wrong size on WI_PlatformAvatar_C_OnLoadedAvatarFromUser");
static_assert(offsetof(WI_PlatformAvatar_C_OnLoadedAvatarFromUser, Avatar) == 0x000000, "Member 'WI_PlatformAvatar_C_OnLoadedAvatarFromUser::Avatar' has a wrong offset!");

// Function WI_PlatformAvatar.WI_PlatformAvatar_C.SetAvatarFromSoftPtr
// 0x0040 (0x0040 - 0x0000)
struct WI_PlatformAvatar_C_SetAvatarFromSoftPtr final
{
public:
	TSoftObjectPtr<class UTexture>                Avatar;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr) == 0x000008, "Wrong alignment on WI_PlatformAvatar_C_SetAvatarFromSoftPtr");
static_assert(sizeof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr) == 0x000040, "Wrong size on WI_PlatformAvatar_C_SetAvatarFromSoftPtr");
static_assert(offsetof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr, Avatar) == 0x000000, "Member 'WI_PlatformAvatar_C_SetAvatarFromSoftPtr::Avatar' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WI_PlatformAvatar_C_SetAvatarFromSoftPtr::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'WI_PlatformAvatar_C_SetAvatarFromSoftPtr::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_PlatformAvatar_C_SetAvatarFromSoftPtr, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WI_PlatformAvatar_C_SetAvatarFromSoftPtr::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

