#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Progressbar_SpecialAbility

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_Progressbar_SpecialAbility.WI_Progressbar_SpecialAbility_C.ExecuteUbergraph_WI_Progressbar_SpecialAbility
// 0x0058 (0x0058 - 0x0000)
struct WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Time;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ChargeTime;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Run_Animation_Time_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility) == 0x000008, "Wrong alignment on WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility");
static_assert(sizeof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility) == 0x000058, "Wrong size on WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, EntryPoint) == 0x000000, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, K2Node_CustomEvent_Time) == 0x000018, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, K2Node_Event_ChargeTime) == 0x000030, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::K2Node_Event_ChargeTime' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000038, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000040, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x00004C, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility, CallFunc_Run_Animation_Time_ImplicitCast) == 0x000050, "Member 'WI_Progressbar_SpecialAbility_C_ExecuteUbergraph_WI_Progressbar_SpecialAbility::CallFunc_Run_Animation_Time_ImplicitCast' has a wrong offset!");

// Function WI_Progressbar_SpecialAbility.WI_Progressbar_SpecialAbility_C.OnStartCharge
// 0x0004 (0x0004 - 0x0000)
struct WI_Progressbar_SpecialAbility_C_OnStartCharge final
{
public:
	float                                         ChargeTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Progressbar_SpecialAbility_C_OnStartCharge) == 0x000004, "Wrong alignment on WI_Progressbar_SpecialAbility_C_OnStartCharge");
static_assert(sizeof(WI_Progressbar_SpecialAbility_C_OnStartCharge) == 0x000004, "Wrong size on WI_Progressbar_SpecialAbility_C_OnStartCharge");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_OnStartCharge, ChargeTime) == 0x000000, "Member 'WI_Progressbar_SpecialAbility_C_OnStartCharge::ChargeTime' has a wrong offset!");

// Function WI_Progressbar_SpecialAbility.WI_Progressbar_SpecialAbility_C.Run Animation
// 0x0008 (0x0008 - 0x0000)
struct WI_Progressbar_SpecialAbility_C_Run_Animation final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Progressbar_SpecialAbility_C_Run_Animation) == 0x000008, "Wrong alignment on WI_Progressbar_SpecialAbility_C_Run_Animation");
static_assert(sizeof(WI_Progressbar_SpecialAbility_C_Run_Animation) == 0x000008, "Wrong size on WI_Progressbar_SpecialAbility_C_Run_Animation");
static_assert(offsetof(WI_Progressbar_SpecialAbility_C_Run_Animation, Time) == 0x000000, "Member 'WI_Progressbar_SpecialAbility_C_Run_Animation::Time' has a wrong offset!");

}

