#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_ServerList_Password

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C
// 0x0080 (0x0360 - 0x02E0)
class UWI_PreLobby_ServerList_Password_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Body;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         EnterPasswordCancel;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         EnterPasswordConfirm;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Header;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_130;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          PasswordEditableText;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PasswordPromptOverlay;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnEnteredPassword;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   HeaderText;                                        // 0x0340(0x0010)(Edit, BlueprintVisible)
	class FText                                   BodyText;                                          // 0x0350(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_PreLobby_ServerList_Password(int32 EntryPoint);
	void OnClose__DelegateSignature();
	void OnEnteredPassword__DelegateSignature(const class FString& Password);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PreLobby_ServerList_Password_C">();
	}
	static class UWI_PreLobby_ServerList_Password_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PreLobby_ServerList_Password_C>();
	}
};
static_assert(alignof(UWI_PreLobby_ServerList_Password_C) == 0x000008, "Wrong alignment on UWI_PreLobby_ServerList_Password_C");
static_assert(sizeof(UWI_PreLobby_ServerList_Password_C) == 0x000360, "Wrong size on UWI_PreLobby_ServerList_Password_C");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PreLobby_ServerList_Password_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, Body) == 0x0002E8, "Member 'UWI_PreLobby_ServerList_Password_C::Body' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, EnterPasswordCancel) == 0x0002F0, "Member 'UWI_PreLobby_ServerList_Password_C::EnterPasswordCancel' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, EnterPasswordConfirm) == 0x0002F8, "Member 'UWI_PreLobby_ServerList_Password_C::EnterPasswordConfirm' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, Header) == 0x000300, "Member 'UWI_PreLobby_ServerList_Password_C::Header' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, Image_130) == 0x000308, "Member 'UWI_PreLobby_ServerList_Password_C::Image_130' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, PasswordEditableText) == 0x000310, "Member 'UWI_PreLobby_ServerList_Password_C::PasswordEditableText' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, PasswordPromptOverlay) == 0x000318, "Member 'UWI_PreLobby_ServerList_Password_C::PasswordPromptOverlay' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, OnEnteredPassword) == 0x000320, "Member 'UWI_PreLobby_ServerList_Password_C::OnEnteredPassword' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, OnClose) == 0x000330, "Member 'UWI_PreLobby_ServerList_Password_C::OnClose' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, HeaderText) == 0x000340, "Member 'UWI_PreLobby_ServerList_Password_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWI_PreLobby_ServerList_Password_C, BodyText) == 0x000350, "Member 'UWI_PreLobby_ServerList_Password_C::BodyText' has a wrong offset!");

}

