#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Perk

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_Perk.WI_Perk_C.ExecuteUbergraph_WI_Perk
// 0x000C (0x000C - 0x0000)
struct WI_Perk_C_ExecuteUbergraph_WI_Perk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Perk_C_ExecuteUbergraph_WI_Perk) == 0x000004, "Wrong alignment on WI_Perk_C_ExecuteUbergraph_WI_Perk");
static_assert(sizeof(WI_Perk_C_ExecuteUbergraph_WI_Perk) == 0x00000C, "Wrong size on WI_Perk_C_ExecuteUbergraph_WI_Perk");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, EntryPoint) == 0x000000, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, Temp_bool_Variable) == 0x000004, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, Temp_byte_Variable) == 0x000005, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, Temp_byte_Variable_1) == 0x000006, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, K2Node_Select_Default) == 0x000008, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Perk_C_ExecuteUbergraph_WI_Perk, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000009, "Member 'WI_Perk_C_ExecuteUbergraph_WI_Perk::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WI_Perk.WI_Perk_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_Perk_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Perk_C_PreConstruct) == 0x000001, "Wrong alignment on WI_Perk_C_PreConstruct");
static_assert(sizeof(WI_Perk_C_PreConstruct) == 0x000001, "Wrong size on WI_Perk_C_PreConstruct");
static_assert(offsetof(WI_Perk_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_Perk_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_Perk.WI_Perk_C.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct WI_Perk_C_SetIsActive final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Perk_C_SetIsActive) == 0x000001, "Wrong alignment on WI_Perk_C_SetIsActive");
static_assert(sizeof(WI_Perk_C_SetIsActive) == 0x000001, "Wrong size on WI_Perk_C_SetIsActive");
static_assert(offsetof(WI_Perk_C_SetIsActive, IsActive_0) == 0x000000, "Member 'WI_Perk_C_SetIsActive::IsActive_0' has a wrong offset!");

}

