#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ProjectVersion

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_ProjectVersion.WI_ProjectVersion_C.ExecuteUbergraph_WI_ProjectVersion
// 0x0310 (0x0310 - 0x0000)
struct WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_K2_GetMasterAccountId_ReturnValue;        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FServerDebugInformation                K2Node_CustomEvent_DebugInformation;               // 0x0080(0x0030)()
	TDelegate<void(const struct FServerDebugInformation& DebugInformation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FServerDebugInformation                Temp_struct_Variable;                              // 0x00C0(0x0030)()
	class UGetServerDebugInformationAsyncAction*  CallFunc_GetServerDebugInformation_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0100(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectVersion_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0168(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0010)()
	class FString                                 CallFunc_GetBuildDateTime_ReturnValue;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01F8(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0210(0x0048)(HasGetValueTypeHash)
	class APlayerControllerJP_MatchBP_C*          K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0268(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0278(0x0010)()
	class FString                                 CallFunc_GetRegionName_ReturnValue;                // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0298(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0300(0x0010)()
};
static_assert(alignof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion) == 0x000008, "Wrong alignment on WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion");
static_assert(sizeof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion) == 0x000310, "Wrong size on WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, EntryPoint) == 0x000000, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_K2_GetMasterAccountId_ReturnValue) == 0x000008, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_K2_GetMasterAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_CustomEvent_DebugInformation) == 0x000080, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_CustomEvent_DebugInformation' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, Temp_struct_Variable) == 0x0000C0, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_GetServerDebugInformation_ReturnValue) == 0x0000F0, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_GetServerDebugInformation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000100, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_GetProjectVersion_ReturnValue) == 0x000158, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_GetProjectVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000168, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_Event_IsDesignTime) == 0x000178, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeStruct_FormatArgumentData_2) == 0x000180, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeArray_Array) == 0x0001C8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_GetBuildDateTime_ReturnValue) == 0x0001E8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_GetBuildDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0001F8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_GetPlayerController_ReturnValue) == 0x000208, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeStruct_FormatArgumentData_3) == 0x000210, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP) == 0x000258, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeArray_Array_1) == 0x000268, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Format_ReturnValue_1) == 0x000278, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_GetRegionName_ReturnValue) == 0x000288, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_GetRegionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000298, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002A8, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, K2Node_MakeArray_Array_2) == 0x0002F0, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion, CallFunc_Format_ReturnValue_2) == 0x000300, "Member 'WI_ProjectVersion_C_ExecuteUbergraph_WI_ProjectVersion::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WI_ProjectVersion.WI_ProjectVersion_C.OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0
// 0x0030 (0x0030 - 0x0000)
struct WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0 final
{
public:
	struct FServerDebugInformation                DebugInformation;                                  // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0) == 0x000008, "Wrong alignment on WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0");
static_assert(sizeof(WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0) == 0x000030, "Wrong size on WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0");
static_assert(offsetof(WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0, DebugInformation) == 0x000000, "Member 'WI_ProjectVersion_C_OnReady_5EB4A6BE48641AD8C7D457AE9A430CE0::DebugInformation' has a wrong offset!");

// Function WI_ProjectVersion.WI_ProjectVersion_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ProjectVersion_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ProjectVersion_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ProjectVersion_C_PreConstruct");
static_assert(sizeof(WI_ProjectVersion_C_PreConstruct) == 0x000001, "Wrong size on WI_ProjectVersion_C_PreConstruct");
static_assert(offsetof(WI_ProjectVersion_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ProjectVersion_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

