#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_POI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_POI.WI_POI_C.ExecuteUbergraph_WI_POI
// 0x0058 (0x0058 - 0x0000)
struct WI_POI_C_ExecuteUbergraph_WI_POI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Image;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0010(0x0010)()
	struct FLinearColor                           K2Node_CustomEvent_ColorImage;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_ColorText;                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0014)()
};
static_assert(alignof(WI_POI_C_ExecuteUbergraph_WI_POI) == 0x000008, "Wrong alignment on WI_POI_C_ExecuteUbergraph_WI_POI");
static_assert(sizeof(WI_POI_C_ExecuteUbergraph_WI_POI) == 0x000058, "Wrong size on WI_POI_C_ExecuteUbergraph_WI_POI");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, EntryPoint) == 0x000000, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, K2Node_CustomEvent_Image) == 0x000008, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, K2Node_CustomEvent_Description) == 0x000010, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, K2Node_CustomEvent_ColorImage) == 0x000020, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::K2Node_CustomEvent_ColorImage' has a wrong offset!");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, K2Node_CustomEvent_ColorText) == 0x000030, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::K2Node_CustomEvent_ColorText' has a wrong offset!");
static_assert(offsetof(WI_POI_C_ExecuteUbergraph_WI_POI, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'WI_POI_C_ExecuteUbergraph_WI_POI::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WI_POI.WI_POI_C.Set Image And Text
// 0x0038 (0x0038 - 0x0000)
struct WI_POI_C_Set_Image_And_Text final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           ColorImage;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorText;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_POI_C_Set_Image_And_Text) == 0x000008, "Wrong alignment on WI_POI_C_Set_Image_And_Text");
static_assert(sizeof(WI_POI_C_Set_Image_And_Text) == 0x000038, "Wrong size on WI_POI_C_Set_Image_And_Text");
static_assert(offsetof(WI_POI_C_Set_Image_And_Text, Image) == 0x000000, "Member 'WI_POI_C_Set_Image_And_Text::Image' has a wrong offset!");
static_assert(offsetof(WI_POI_C_Set_Image_And_Text, Description) == 0x000008, "Member 'WI_POI_C_Set_Image_And_Text::Description' has a wrong offset!");
static_assert(offsetof(WI_POI_C_Set_Image_And_Text, ColorImage) == 0x000018, "Member 'WI_POI_C_Set_Image_And_Text::ColorImage' has a wrong offset!");
static_assert(offsetof(WI_POI_C_Set_Image_And_Text, ColorText) == 0x000028, "Member 'WI_POI_C_Set_Image_And_Text::ColorText' has a wrong offset!");

}

