#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_POI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_POI.WI_POI_C
// 0x0028 (0x0308 - 0x02E0)
class UWI_POI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_POI;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_DeathGrayoutWrapper_C*              WI_DeathGrayoutWrapper;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ForceHidden;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_POI(int32 EntryPoint);
	void Set_Image_And_Text(class UTexture2D* Image, const class FText& Description, const struct FLinearColor& ColorImage, const struct FLinearColor& ColorText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_POI_C">();
	}
	static class UWI_POI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_POI_C>();
	}
};
static_assert(alignof(UWI_POI_C) == 0x000008, "Wrong alignment on UWI_POI_C");
static_assert(sizeof(UWI_POI_C) == 0x000308, "Wrong size on UWI_POI_C");
static_assert(offsetof(UWI_POI_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_POI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_POI_C, Image_POI) == 0x0002E8, "Member 'UWI_POI_C::Image_POI' has a wrong offset!");
static_assert(offsetof(UWI_POI_C, Text_Description) == 0x0002F0, "Member 'UWI_POI_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWI_POI_C, WI_DeathGrayoutWrapper) == 0x0002F8, "Member 'UWI_POI_C::WI_DeathGrayoutWrapper' has a wrong offset!");
static_assert(offsetof(UWI_POI_C, ForceHidden) == 0x000300, "Member 'UWI_POI_C::ForceHidden' has a wrong offset!");

}

