#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ProfileScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_ProfileScreen.WI_ProfileScreen_C.BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_ProfileScreen_C_BndEvt__WI_ProfileScreen_WI_JPHeroButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_ProfileScreen.WI_ProfileScreen_C.ExecuteUbergraph_WI_ProfileScreen
// 0x0048 (0x0048 - 0x0000)
struct WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTwitchApi*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTwitchApi*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTwitchApi*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTwitchAuth*                            CallFunc_GetTwitchAuth_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen) == 0x000008, "Wrong alignment on WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen");
static_assert(sizeof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen) == 0x000048, "Wrong size on WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, EntryPoint) == 0x000000, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000030, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, CallFunc_GetTwitchAuth_ReturnValue) == 0x000038, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::CallFunc_GetTwitchAuth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WI_ProfileScreen_C_ExecuteUbergraph_WI_ProfileScreen::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_ProfileScreen.WI_ProfileScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ProfileScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ProfileScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ProfileScreen_C_PreConstruct");
static_assert(sizeof(WI_ProfileScreen_C_PreConstruct) == 0x000001, "Wrong size on WI_ProfileScreen_C_PreConstruct");
static_assert(offsetof(WI_ProfileScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ProfileScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_ProfileScreen.WI_ProfileScreen_C.SetIsAuthenticated
// 0x0040 (0x0040 - 0x0000)
struct WI_ProfileScreen_C_SetIsAuthenticated final
{
public:
	bool                                          IsAuthenticated_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0030(0x0010)()
};
static_assert(alignof(WI_ProfileScreen_C_SetIsAuthenticated) == 0x000008, "Wrong alignment on WI_ProfileScreen_C_SetIsAuthenticated");
static_assert(sizeof(WI_ProfileScreen_C_SetIsAuthenticated) == 0x000040, "Wrong size on WI_ProfileScreen_C_SetIsAuthenticated");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, IsAuthenticated_0) == 0x000000, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::IsAuthenticated_0' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_bool_Variable) == 0x000001, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_byte_Variable) == 0x000002, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_byte_Variable_1) == 0x000003, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_bool_Variable_1) == 0x000004, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_byte_Variable_2) == 0x000005, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_byte_Variable_3) == 0x000006, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_bool_Variable_2) == 0x000007, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_text_Variable) == 0x000008, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, Temp_text_Variable_1) == 0x000018, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, K2Node_Select_Default) == 0x000028, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, K2Node_Select_Default_1) == 0x000029, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetIsAuthenticated, K2Node_Select_Default_2) == 0x000030, "Member 'WI_ProfileScreen_C_SetIsAuthenticated::K2Node_Select_Default_2' has a wrong offset!");

// Function WI_ProfileScreen.WI_ProfileScreen_C.SetTwitchUsername
// 0x0020 (0x0020 - 0x0000)
struct WI_ProfileScreen_C_SetTwitchUsername final
{
public:
	class FString                                 Username;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WI_ProfileScreen_C_SetTwitchUsername) == 0x000008, "Wrong alignment on WI_ProfileScreen_C_SetTwitchUsername");
static_assert(sizeof(WI_ProfileScreen_C_SetTwitchUsername) == 0x000020, "Wrong size on WI_ProfileScreen_C_SetTwitchUsername");
static_assert(offsetof(WI_ProfileScreen_C_SetTwitchUsername, Username) == 0x000000, "Member 'WI_ProfileScreen_C_SetTwitchUsername::Username' has a wrong offset!");
static_assert(offsetof(WI_ProfileScreen_C_SetTwitchUsername, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WI_ProfileScreen_C_SetTwitchUsername::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

