#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayScreenCardButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_PlayScreenCardButton.WI_PlayScreenCardButton_C.BP_OnLockedChanged
// 0x0001 (0x0001 - 0x0000)
struct WI_PlayScreenCardButton_C_BP_OnLockedChanged final
{
public:
	bool                                          bIsLocked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreenCardButton_C_BP_OnLockedChanged) == 0x000001, "Wrong alignment on WI_PlayScreenCardButton_C_BP_OnLockedChanged");
static_assert(sizeof(WI_PlayScreenCardButton_C_BP_OnLockedChanged) == 0x000001, "Wrong size on WI_PlayScreenCardButton_C_BP_OnLockedChanged");
static_assert(offsetof(WI_PlayScreenCardButton_C_BP_OnLockedChanged, bIsLocked) == 0x000000, "Member 'WI_PlayScreenCardButton_C_BP_OnLockedChanged::bIsLocked' has a wrong offset!");

// Function WI_PlayScreenCardButton.WI_PlayScreenCardButton_C.ExecuteUbergraph_WI_PlayScreenCardButton
// 0x0020 (0x0020 - 0x0000)
struct WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocked_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocked_ReturnValue_1;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLocked;                            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton) == 0x000008, "Wrong alignment on WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton");
static_assert(sizeof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton) == 0x000020, "Wrong size on WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, EntryPoint) == 0x000000, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, Temp_bool_Variable) == 0x000004, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, Temp_byte_Variable) == 0x000005, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, Temp_byte_Variable_1) == 0x000006, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, CallFunc_GetLocked_ReturnValue) == 0x000018, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::CallFunc_GetLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, CallFunc_GetLocked_ReturnValue_1) == 0x000019, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::CallFunc_GetLocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, K2Node_Select_Default) == 0x00001B, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton, K2Node_Event_bIsLocked) == 0x00001C, "Member 'WI_PlayScreenCardButton_C_ExecuteUbergraph_WI_PlayScreenCardButton::K2Node_Event_bIsLocked' has a wrong offset!");

// Function WI_PlayScreenCardButton.WI_PlayScreenCardButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PlayScreenCardButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayScreenCardButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PlayScreenCardButton_C_PreConstruct");
static_assert(sizeof(WI_PlayScreenCardButton_C_PreConstruct) == 0x000001, "Wrong size on WI_PlayScreenCardButton_C_PreConstruct");
static_assert(offsetof(WI_PlayScreenCardButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PlayScreenCardButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

