#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ReturnPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ReturnPanel.WI_ReturnPanel_C
// 0x0018 (0x0448 - 0x0430)
class UWI_ReturnPanel_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_LyraButton_C*                        LeaveLobbyButton;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LyraButton_C*                        PlayAgainButton;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_ReturnPanel(int32 EntryPoint);
	void SetNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ReturnPanel_C">();
	}
	static class UWI_ReturnPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ReturnPanel_C>();
	}
};
static_assert(alignof(UWI_ReturnPanel_C) == 0x000008, "Wrong alignment on UWI_ReturnPanel_C");
static_assert(sizeof(UWI_ReturnPanel_C) == 0x000448, "Wrong size on UWI_ReturnPanel_C");
static_assert(offsetof(UWI_ReturnPanel_C, UberGraphFrame) == 0x000430, "Member 'UWI_ReturnPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ReturnPanel_C, LeaveLobbyButton) == 0x000438, "Member 'UWI_ReturnPanel_C::LeaveLobbyButton' has a wrong offset!");
static_assert(offsetof(UWI_ReturnPanel_C, PlayAgainButton) == 0x000440, "Member 'UWI_ReturnPanel_C::PlayAgainButton' has a wrong offset!");

}

