#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_RespawnAsNeighborDropdownField

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_RespawnAsNeighborDropdownField.WI_RespawnAsNeighborDropdownField_C.GetOptions
// 0x0088 (0x0088 - 0x0000)
struct WI_RespawnAsNeighborDropdownField_C_GetOptions final
{
public:
	TArray<class FString>                         Options;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         SelectedOptions;                                   // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTagChildren_ReturnValue;       // 0x0030(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameplayTagRootName_ReturnValue;       // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RespawnAsNeighborDropdownField_C_GetOptions) == 0x000008, "Wrong alignment on WI_RespawnAsNeighborDropdownField_C_GetOptions");
static_assert(sizeof(WI_RespawnAsNeighborDropdownField_C_GetOptions) == 0x000088, "Wrong size on WI_RespawnAsNeighborDropdownField_C_GetOptions");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, Options) == 0x000000, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::Options' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, SelectedOptions) == 0x000010, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::SelectedOptions' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_GetGameplayTagChildren_ReturnValue) == 0x000030, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_GetGameplayTagChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000050, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_Array_Get_Item) == 0x000064, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_GetGameplayTagRootName_ReturnValue) == 0x000070, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_GetGameplayTagRootName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetOptions, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'WI_RespawnAsNeighborDropdownField_C_GetOptions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_RespawnAsNeighborDropdownField.WI_RespawnAsNeighborDropdownField_C.GetFullCommand
// 0x0050 (0x0050 - 0x0000)
struct WI_RespawnAsNeighborDropdownField_C_GetFullCommand final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand) == 0x000008, "Wrong alignment on WI_RespawnAsNeighborDropdownField_C_GetFullCommand");
static_assert(sizeof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand) == 0x000050, "Wrong size on WI_RespawnAsNeighborDropdownField_C_GetFullCommand");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand, ReturnValue) == 0x000000, "Member 'WI_RespawnAsNeighborDropdownField_C_GetFullCommand::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand, CallFunc_GetSelectedOption_ReturnValue) == 0x000010, "Member 'WI_RespawnAsNeighborDropdownField_C_GetFullCommand::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WI_RespawnAsNeighborDropdownField_C_GetFullCommand::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'WI_RespawnAsNeighborDropdownField_C_GetFullCommand::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RespawnAsNeighborDropdownField_C_GetFullCommand, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'WI_RespawnAsNeighborDropdownField_C_GetFullCommand::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

}

