#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_RectangularButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_RectangularButton.WI_RectangularButton_C.ExecuteUbergraph_WI_RectangularButton
// 0x0050 (0x0050 - 0x0000)
struct WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0018(0x0010)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton) == 0x000008, "Wrong alignment on WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton");
static_assert(sizeof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton) == 0x000050, "Wrong size on WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, EntryPoint) == 0x000000, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, Temp_bool_Variable) == 0x000004, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, Temp_real_Variable) == 0x000008, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, Temp_real_Variable_1) == 0x00000C, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, K2Node_Select_Default) == 0x000014, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, K2Node_Event_InText) == 0x000018, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton, CallFunc_NotEqual_StriStri_ReturnValue) == 0x000048, "Member 'WI_RectangularButton_C_ExecuteUbergraph_WI_RectangularButton::CallFunc_NotEqual_StriStri_ReturnValue' has a wrong offset!");

// Function WI_RectangularButton.WI_RectangularButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_RectangularButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RectangularButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_RectangularButton_C_PreConstruct");
static_assert(sizeof(WI_RectangularButton_C_PreConstruct) == 0x000001, "Wrong size on WI_RectangularButton_C_PreConstruct");
static_assert(offsetof(WI_RectangularButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_RectangularButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_RectangularButton.WI_RectangularButton_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WI_RectangularButton_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RectangularButton_C_SetText) == 0x000008, "Wrong alignment on WI_RectangularButton_C_SetText");
static_assert(sizeof(WI_RectangularButton_C_SetText) == 0x000010, "Wrong size on WI_RectangularButton_C_SetText");
static_assert(offsetof(WI_RectangularButton_C_SetText, InText) == 0x000000, "Member 'WI_RectangularButton_C_SetText::InText' has a wrong offset!");

// Function WI_RectangularButton.WI_RectangularButton_C.SetTextTransformPolicy
// 0x0001 (0x0001 - 0x0000)
struct WI_RectangularButton_C_SetTextTransformPolicy final
{
public:
	ETextTransformPolicy                          InTransformPolicy;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RectangularButton_C_SetTextTransformPolicy) == 0x000001, "Wrong alignment on WI_RectangularButton_C_SetTextTransformPolicy");
static_assert(sizeof(WI_RectangularButton_C_SetTextTransformPolicy) == 0x000001, "Wrong size on WI_RectangularButton_C_SetTextTransformPolicy");
static_assert(offsetof(WI_RectangularButton_C_SetTextTransformPolicy, InTransformPolicy) == 0x000000, "Member 'WI_RectangularButton_C_SetTextTransformPolicy::InTransformPolicy' has a wrong offset!");

// Function WI_RectangularButton.WI_RectangularButton_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct WI_RectangularButton_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_RectangularButton_C_UpdateButtonText) == 0x000008, "Wrong alignment on WI_RectangularButton_C_UpdateButtonText");
static_assert(sizeof(WI_RectangularButton_C_UpdateButtonText) == 0x000010, "Wrong size on WI_RectangularButton_C_UpdateButtonText");
static_assert(offsetof(WI_RectangularButton_C_UpdateButtonText, InText) == 0x000000, "Member 'WI_RectangularButton_C_UpdateButtonText::InText' has a wrong offset!");

}

