#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialBlockedPlayersList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_SocialBlockedPlayersList.WI_SocialBlockedPlayersList_C.BlueprintOnUnblockPlayerFailed
// 0x0018 (0x0018 - 0x0000)
struct WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed final
{
public:
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurErrorNotification_C*     K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed) == 0x000008, "Wrong alignment on WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed");
static_assert(sizeof(WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed) == 0x000018, "Wrong size on WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed");
static_assert(offsetof(WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000000, "Member 'WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed, K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification) == 0x000008, "Member 'WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed::K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification' has a wrong offset!");
static_assert(offsetof(WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WI_SocialBlockedPlayersList_C_BlueprintOnUnblockPlayerFailed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_SocialBlockedPlayersList.WI_SocialBlockedPlayersList_C.ExecuteUbergraph_WI_SocialBlockedPlayersList
// 0x0004 (0x0004 - 0x0000)
struct WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList) == 0x000004, "Wrong alignment on WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList");
static_assert(sizeof(WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList) == 0x000004, "Wrong size on WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList");
static_assert(offsetof(WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList, EntryPoint) == 0x000000, "Member 'WI_SocialBlockedPlayersList_C_ExecuteUbergraph_WI_SocialBlockedPlayersList::EntryPoint' has a wrong offset!");

// Function WI_SocialBlockedPlayersList.WI_SocialBlockedPlayersList_C.OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_SocialBlockedPlayersList_C_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

}

