#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopPurchaseFeedbackV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ShopPurchaseFeedbackV2.WI_ShopPurchaseFeedbackV2_C.ExecuteUbergraph_WI_ShopPurchaseFeedbackV2
// 0x0028 (0x0028 - 0x0000)
struct WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_ItemIcon;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomyDefinition*                     K2Node_CustomEvent_ItemViewModel;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2) == 0x000008, "Wrong alignment on WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2");
static_assert(sizeof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2) == 0x000028, "Wrong size on WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2, EntryPoint) == 0x000000, "Member 'WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2, K2Node_CustomEvent_ItemIcon) == 0x000010, "Member 'WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2::K2Node_CustomEvent_ItemIcon' has a wrong offset!");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2, K2Node_CustomEvent_ItemViewModel) == 0x000018, "Member 'WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2::K2Node_CustomEvent_ItemViewModel' has a wrong offset!");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WI_ShopPurchaseFeedbackV2_C_ExecuteUbergraph_WI_ShopPurchaseFeedbackV2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WI_ShopPurchaseFeedbackV2.WI_ShopPurchaseFeedbackV2_C.Play Purchase Animation
// 0x0010 (0x0010 - 0x0000)
struct WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation final
{
public:
	class UTexture2D*                             ItemIcon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomyDefinition*                     ItemViewModel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation) == 0x000008, "Wrong alignment on WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation");
static_assert(sizeof(WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation) == 0x000010, "Wrong size on WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation, ItemIcon) == 0x000000, "Member 'WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation::ItemIcon' has a wrong offset!");
static_assert(offsetof(WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation, ItemViewModel) == 0x000008, "Member 'WI_ShopPurchaseFeedbackV2_C_Play_Purchase_Animation::ItemViewModel' has a wrong offset!");

}

