#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialPartyMemberEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_SocialPartyMemberEntry.WI_SocialPartyMemberEntry_C.ExecuteUbergraph_WI_SocialPartyMemberEntry
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry) == 0x000004, "Wrong alignment on WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry");
static_assert(sizeof(WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry) == 0x000008, "Wrong size on WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry");
static_assert(offsetof(WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry, EntryPoint) == 0x000000, "Member 'WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_SocialPartyMemberEntry_C_ExecuteUbergraph_WI_SocialPartyMemberEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_SocialPartyMemberEntry.WI_SocialPartyMemberEntry_C.GetLocalizedStatusInfo
// 0x0020 (0x0020 - 0x0000)
struct WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0010)(Parm, OutParm)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo) == 0x000008, "Wrong alignment on WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo");
static_assert(sizeof(WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo) == 0x000020, "Wrong size on WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo");
static_assert(offsetof(WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo, StatusText) == 0x000000, "Member 'WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo::StatusText' has a wrong offset!");
static_assert(offsetof(WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo, Color) == 0x000010, "Member 'WI_SocialPartyMemberEntry_C_GetLocalizedStatusInfo::Color' has a wrong offset!");

// Function WI_SocialPartyMemberEntry.WI_SocialPartyMemberEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_SocialPartyMemberEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialPartyMemberEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WI_SocialPartyMemberEntry_C_PreConstruct");
static_assert(sizeof(WI_SocialPartyMemberEntry_C_PreConstruct) == 0x000001, "Wrong size on WI_SocialPartyMemberEntry_C_PreConstruct");
static_assert(offsetof(WI_SocialPartyMemberEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_SocialPartyMemberEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

