#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialRecentPlayerEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_SocialRecentPlayerEntry.WI_SocialRecentPlayerEntry_C.ExecuteUbergraph_WI_SocialRecentPlayerEntry
// 0x0018 (0x0018 - 0x0000)
struct WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry) == 0x000008, "Wrong alignment on WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry");
static_assert(sizeof(WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry) == 0x000018, "Wrong size on WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry, EntryPoint) == 0x000000, "Member 'WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry, CallFunc_Now_ReturnValue) == 0x000008, "Member 'WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_SocialRecentPlayerEntry_C_ExecuteUbergraph_WI_SocialRecentPlayerEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_SocialRecentPlayerEntry.WI_SocialRecentPlayerEntry_C.GetFormattedLastSeenTimeSpan
// 0x0110 (0x0110 - 0x0000)
struct WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan final
{
public:
	struct FTimespan                              LastSeenTimespan;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0100(0x0010)()
};
static_assert(alignof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan) == 0x000008, "Wrong alignment on WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan");
static_assert(sizeof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan) == 0x000110, "Wrong size on WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, LastSeenTimespan) == 0x000000, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::LastSeenTimespan' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, ReturnValue) == 0x000008, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_GetDays_ReturnValue) == 0x000018, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_Divide_IntInt_ReturnValue) == 0x000070, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, K2Node_MakeArray_Array) == 0x000078, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000088, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan, CallFunc_Format_ReturnValue_1) == 0x000100, "Member 'WI_SocialRecentPlayerEntry_C_GetFormattedLastSeenTimeSpan::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WI_SocialRecentPlayerEntry.WI_SocialRecentPlayerEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_SocialRecentPlayerEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialRecentPlayerEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WI_SocialRecentPlayerEntry_C_PreConstruct");
static_assert(sizeof(WI_SocialRecentPlayerEntry_C_PreConstruct) == 0x000001, "Wrong size on WI_SocialRecentPlayerEntry_C_PreConstruct");
static_assert(offsetof(WI_SocialRecentPlayerEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_SocialRecentPlayerEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

