#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonPassTierWidget_SingleFree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SeasonPassTierWidget_SingleFree.WI_SeasonPassTierWidget_SingleFree_C
// 0x00A8 (0x03B0 - 0x0308)
class UWI_SeasonPassTierWidget_SingleFree_C final : public USeasonPassTierWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CheckmarkImage;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             FreeSlot;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_260;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBorder;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelText;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBorder;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           TierProgressBar;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnlockedOverlay;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                View_Model;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FreeWidget;                                        // 0x0370(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSeasonPassTier                        DesignTimeTier;                                    // 0x0398(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DoApplyViewModel(const struct FSeasonPassTierViewModel& ViewModel);
	void ExecuteUbergraph_WI_SeasonPassTierWidget_SingleFree(int32 EntryPoint);
	void K2_ApplyViewModel(const struct FSeasonPassTierViewModel& ViewModel);
	void UpdateReward();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SeasonPassTierWidget_SingleFree_C">();
	}
	static class UWI_SeasonPassTierWidget_SingleFree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SeasonPassTierWidget_SingleFree_C>();
	}
};
static_assert(alignof(UWI_SeasonPassTierWidget_SingleFree_C) == 0x000008, "Wrong alignment on UWI_SeasonPassTierWidget_SingleFree_C");
static_assert(sizeof(UWI_SeasonPassTierWidget_SingleFree_C) == 0x0003B0, "Wrong size on UWI_SeasonPassTierWidget_SingleFree_C");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, UberGraphFrame) == 0x000308, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, CheckmarkImage) == 0x000310, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::CheckmarkImage' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, Frame) == 0x000318, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::Frame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, FreeSlot) == 0x000320, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::FreeSlot' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, Image) == 0x000328, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, Image_1) == 0x000330, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, Image_260) == 0x000338, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::Image_260' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, LeftBorder) == 0x000340, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::LeftBorder' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, LevelText) == 0x000348, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, RightBorder) == 0x000350, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::RightBorder' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, TierProgressBar) == 0x000358, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::TierProgressBar' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, UnlockedOverlay) == 0x000360, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::UnlockedOverlay' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, View_Model) == 0x000368, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::View_Model' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, FreeWidget) == 0x000370, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::FreeWidget' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_SingleFree_C, DesignTimeTier) == 0x000398, "Member 'UWI_SeasonPassTierWidget_SingleFree_C::DesignTimeTier' has a wrong offset!");

}

