#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialUserEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_SocialUserEntry.WI_SocialUserEntry_C.ExecuteUbergraph_WI_SocialUserEntry
// 0x0038 (0x0038 - 0x0000)
struct WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineServicesUserBase*                K2Node_Event_User;                                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry) == 0x000008, "Wrong alignment on WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry");
static_assert(sizeof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry) == 0x000038, "Wrong size on WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, EntryPoint) == 0x000000, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, Temp_bool_Variable) == 0x000004, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, Temp_struct_Variable) == 0x000008, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, K2Node_Event_User) == 0x000020, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::K2Node_Event_User' has a wrong offset!");
static_assert(offsetof(WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry, K2Node_Select_Default) == 0x000028, "Member 'WI_SocialUserEntry_C_ExecuteUbergraph_WI_SocialUserEntry::K2Node_Select_Default' has a wrong offset!");

// Function WI_SocialUserEntry.WI_SocialUserEntry_C.GetListItemPadding
// 0x0010 (0x0010 - 0x0000)
struct WI_SocialUserEntry_C_GetListItemPadding final
{
public:
	struct FMargin                                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WI_SocialUserEntry_C_GetListItemPadding) == 0x000004, "Wrong alignment on WI_SocialUserEntry_C_GetListItemPadding");
static_assert(sizeof(WI_SocialUserEntry_C_GetListItemPadding) == 0x000010, "Wrong size on WI_SocialUserEntry_C_GetListItemPadding");
static_assert(offsetof(WI_SocialUserEntry_C_GetListItemPadding, ReturnValue) == 0x000000, "Member 'WI_SocialUserEntry_C_GetListItemPadding::ReturnValue' has a wrong offset!");

// Function WI_SocialUserEntry.WI_SocialUserEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_SocialUserEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialUserEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WI_SocialUserEntry_C_PreConstruct");
static_assert(sizeof(WI_SocialUserEntry_C_PreConstruct) == 0x000001, "Wrong size on WI_SocialUserEntry_C_PreConstruct");
static_assert(offsetof(WI_SocialUserEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_SocialUserEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_SocialUserEntry.WI_SocialUserEntry_C.SetAvatar
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialUserEntry_C_SetAvatar final
{
public:
	class UOnlineServicesUserBase*                User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialUserEntry_C_SetAvatar) == 0x000008, "Wrong alignment on WI_SocialUserEntry_C_SetAvatar");
static_assert(sizeof(WI_SocialUserEntry_C_SetAvatar) == 0x000008, "Wrong size on WI_SocialUserEntry_C_SetAvatar");
static_assert(offsetof(WI_SocialUserEntry_C_SetAvatar, User) == 0x000000, "Member 'WI_SocialUserEntry_C_SetAvatar::User' has a wrong offset!");

}

