#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Seagull130_Overlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Seagull130_Overlay.WI_Seagull130_Overlay_C
// 0x00A8 (0x04D8 - 0x0430)
class UWI_Seagull130_Overlay_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LowAmmoFlickerSecondary;                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LowAmmoFlickerPrimary;                             // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_ItemInfo_Single_Center_C*           AbilityInfoLeft;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ItemInfo_Single_Center_C*           AbilityInfoRight;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_50;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crosshair;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crosshair_1;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_35;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPrimary;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySecondary;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBarLifetime;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLowAmmoPrimary;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLowAmmoSecondary;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPrimaryAmmo;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSecondaryAmmo;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherFireMode;                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_Seagull130_ControlUnit_C*           AssociatedSeagull130ControlUnit;                   // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_WindNoise;                                   // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LifetimeCosmeticsTimer;                            // 0x04D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WI_Seagull130_Overlay(int32 EntryPoint);
	void InitAbilityInfo();
	void Initialize_Widget();
	void On_NewPrimaryAmmoSet_Event(int32 Amount);
	void On_NewSecondaryAmmoSet_Event(int32 Amount);
	void Set_Fire_Mode_Cosmetics(bool Primary);
	void SetPrimaryAmmoText(int32 Value);
	void SetSecondaryAmmoText(int32 Value);
	void Try_Play_Low_Ammo_Animation(int32 CurrentAmmo, int32 Threshold, const class UWidgetAnimation* Animation, class UWidget* WidgetObject);
	void Update_Lifetime_Cosmetics();
	void Update_Lifetime_Progressbar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Seagull130_Overlay_C">();
	}
	static class UWI_Seagull130_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Seagull130_Overlay_C>();
	}
};
static_assert(alignof(UWI_Seagull130_Overlay_C) == 0x000008, "Wrong alignment on UWI_Seagull130_Overlay_C");
static_assert(sizeof(UWI_Seagull130_Overlay_C) == 0x0004D8, "Wrong size on UWI_Seagull130_Overlay_C");
static_assert(offsetof(UWI_Seagull130_Overlay_C, UberGraphFrame) == 0x000430, "Member 'UWI_Seagull130_Overlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, LowAmmoFlickerSecondary) == 0x000438, "Member 'UWI_Seagull130_Overlay_C::LowAmmoFlickerSecondary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, LowAmmoFlickerPrimary) == 0x000440, "Member 'UWI_Seagull130_Overlay_C::LowAmmoFlickerPrimary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, AbilityInfoLeft) == 0x000448, "Member 'UWI_Seagull130_Overlay_C::AbilityInfoLeft' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, AbilityInfoRight) == 0x000450, "Member 'UWI_Seagull130_Overlay_C::AbilityInfoRight' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, Image_50) == 0x000458, "Member 'UWI_Seagull130_Overlay_C::Image_50' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, Image_Crosshair) == 0x000460, "Member 'UWI_Seagull130_Overlay_C::Image_Crosshair' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, Image_Crosshair_1) == 0x000468, "Member 'UWI_Seagull130_Overlay_C::Image_Crosshair_1' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, Overlay_35) == 0x000470, "Member 'UWI_Seagull130_Overlay_C::Overlay_35' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, OverlayPrimary) == 0x000478, "Member 'UWI_Seagull130_Overlay_C::OverlayPrimary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, OverlaySecondary) == 0x000480, "Member 'UWI_Seagull130_Overlay_C::OverlaySecondary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, ProgressBarLifetime) == 0x000488, "Member 'UWI_Seagull130_Overlay_C::ProgressBarLifetime' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, TextLowAmmoPrimary) == 0x000490, "Member 'UWI_Seagull130_Overlay_C::TextLowAmmoPrimary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, TextLowAmmoSecondary) == 0x000498, "Member 'UWI_Seagull130_Overlay_C::TextLowAmmoSecondary' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, TextPrimaryAmmo) == 0x0004A0, "Member 'UWI_Seagull130_Overlay_C::TextPrimaryAmmo' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, TextSecondaryAmmo) == 0x0004A8, "Member 'UWI_Seagull130_Overlay_C::TextSecondaryAmmo' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, WI_JPActionWidget) == 0x0004B0, "Member 'UWI_Seagull130_Overlay_C::WI_JPActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, WidgetSwitcherFireMode) == 0x0004B8, "Member 'UWI_Seagull130_Overlay_C::WidgetSwitcherFireMode' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, AssociatedSeagull130ControlUnit) == 0x0004C0, "Member 'UWI_Seagull130_Overlay_C::AssociatedSeagull130ControlUnit' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, Audio_WindNoise) == 0x0004C8, "Member 'UWI_Seagull130_Overlay_C::Audio_WindNoise' has a wrong offset!");
static_assert(offsetof(UWI_Seagull130_Overlay_C, LifetimeCosmeticsTimer) == 0x0004D0, "Member 'UWI_Seagull130_Overlay_C::LifetimeCosmeticsTimer' has a wrong offset!");

}

