#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ScoreboardScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WI_WinscreenSubBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ScoreboardScreen.WI_ScoreboardScreen_C
// 0x0048 (0x0498 - 0x0450)
class UWI_ScoreboardScreen_C final : public UWI_WinscreenSubBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_ScoreboardScreen_C;              // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FallIn;                                            // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TeamOneBox;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TeamTwoBox;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_WinScreen_MatchInfo_C*              WI_WinScreen_MatchInfo;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void CreateScoreboardData(class APlayerStateJP* PlayerState, struct FS_PlayerScoreboardStats* Stats);
	void ExecuteUbergraph_WI_ScoreboardScreen(int32 EntryPoint);
	TSoftObjectPtr<class UTexture2D> GetPortraitFromCharacterID(class APlayerStateJP* PlayerState);
	void GetSlotForTeam(uint8 Team, class UVerticalBox** Slot_0);
	void Populate_Scoreboard_for_Team(uint8 Team);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ScoreboardScreen_C">();
	}
	static class UWI_ScoreboardScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ScoreboardScreen_C>();
	}
};
static_assert(alignof(UWI_ScoreboardScreen_C) == 0x000008, "Wrong alignment on UWI_ScoreboardScreen_C");
static_assert(sizeof(UWI_ScoreboardScreen_C) == 0x000498, "Wrong size on UWI_ScoreboardScreen_C");
static_assert(offsetof(UWI_ScoreboardScreen_C, UberGraphFrame_WI_ScoreboardScreen_C) == 0x000450, "Member 'UWI_ScoreboardScreen_C::UberGraphFrame_WI_ScoreboardScreen_C' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, FallIn) == 0x000458, "Member 'UWI_ScoreboardScreen_C::FallIn' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, Image) == 0x000460, "Member 'UWI_ScoreboardScreen_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, Image_90) == 0x000468, "Member 'UWI_ScoreboardScreen_C::Image_90' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, Image_93) == 0x000470, "Member 'UWI_ScoreboardScreen_C::Image_93' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, Image_132) == 0x000478, "Member 'UWI_ScoreboardScreen_C::Image_132' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, TeamOneBox) == 0x000480, "Member 'UWI_ScoreboardScreen_C::TeamOneBox' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, TeamTwoBox) == 0x000488, "Member 'UWI_ScoreboardScreen_C::TeamTwoBox' has a wrong offset!");
static_assert(offsetof(UWI_ScoreboardScreen_C, WI_WinScreen_MatchInfo) == 0x000490, "Member 'UWI_ScoreboardScreen_C::WI_WinScreen_MatchInfo' has a wrong offset!");

}

