#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Social

#include "Basic.hpp"

#include "CommonGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_Social.WI_Social_C.BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_Social_C_BndEvt__WI_Social_BlockedPlayersList_K2Node_ComponentBoundEvent_3_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

// Function WI_Social.WI_Social_C.BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_Social_C_BndEvt__WI_Social_FriendsList_K2Node_ComponentBoundEvent_1_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

// Function WI_Social.WI_Social_C.BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_Social_C_BndEvt__WI_Social_PartyMembersList_K2Node_ComponentBoundEvent_0_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

// Function WI_Social.WI_Social_C.BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_Social_C_BndEvt__WI_Social_RecentPlayersList_K2Node_ComponentBoundEvent_2_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

// Function WI_Social.WI_Social_C.ExecuteUbergraph_WI_Social
// 0x0098 (0x0098 - 0x0000)
struct WI_Social_C_ExecuteUbergraph_WI_Social final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationOkCancel_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_3;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0060(0x0038)(NoDestructor)
};
static_assert(alignof(WI_Social_C_ExecuteUbergraph_WI_Social) == 0x000008, "Wrong alignment on WI_Social_C_ExecuteUbergraph_WI_Social");
static_assert(sizeof(WI_Social_C_ExecuteUbergraph_WI_Social) == 0x000098, "Wrong size on WI_Social_C_ExecuteUbergraph_WI_Social");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, EntryPoint) == 0x000000, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_CustomEvent_Result) == 0x000004, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, Temp_byte_Variable) == 0x000018, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, CallFunc_ShowConfirmationOkCancel_ReturnValue) == 0x000020, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::CallFunc_ShowConfirmationOkCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_Event_IsDesignTime) == 0x00002A, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_ComponentBoundEvent_Widget_3) == 0x000030, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_ComponentBoundEvent_Widget_2) == 0x000038, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_ComponentBoundEvent_Widget_1) == 0x000040, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_ComponentBoundEvent_Widget) == 0x000048, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Social_C_ExecuteUbergraph_WI_Social, K2Node_MakeStruct_WidgetTransform) == 0x000060, "Member 'WI_Social_C_ExecuteUbergraph_WI_Social::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function WI_Social.WI_Social_C.OnFailedToJoinPartyCallback
// 0x0018 (0x0018 - 0x0000)
struct WI_Social_C_OnFailedToJoinPartyCallback final
{
public:
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurMessageNotification_C*   K2Node_DynamicCast_AsWI_Overlay_Blur_Message_Notification; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_OnFailedToJoinPartyCallback) == 0x000008, "Wrong alignment on WI_Social_C_OnFailedToJoinPartyCallback");
static_assert(sizeof(WI_Social_C_OnFailedToJoinPartyCallback) == 0x000018, "Wrong size on WI_Social_C_OnFailedToJoinPartyCallback");
static_assert(offsetof(WI_Social_C_OnFailedToJoinPartyCallback, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000000, "Member 'WI_Social_C_OnFailedToJoinPartyCallback::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Social_C_OnFailedToJoinPartyCallback, K2Node_DynamicCast_AsWI_Overlay_Blur_Message_Notification) == 0x000008, "Member 'WI_Social_C_OnFailedToJoinPartyCallback::K2Node_DynamicCast_AsWI_Overlay_Blur_Message_Notification' has a wrong offset!");
static_assert(offsetof(WI_Social_C_OnFailedToJoinPartyCallback, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WI_Social_C_OnFailedToJoinPartyCallback::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_Social.WI_Social_C.OnResult_CB31E8DE4272C416CAE4C884188433B2
// 0x0001 (0x0001 - 0x0000)
struct WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2 final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2) == 0x000001, "Wrong alignment on WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2");
static_assert(sizeof(WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2) == 0x000001, "Wrong size on WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2");
static_assert(offsetof(WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2, Result) == 0x000000, "Member 'WI_Social_C_OnResult_CB31E8DE4272C416CAE4C884188433B2::Result' has a wrong offset!");

// Function WI_Social.WI_Social_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_Social_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Social_C_PreConstruct) == 0x000001, "Wrong alignment on WI_Social_C_PreConstruct");
static_assert(sizeof(WI_Social_C_PreConstruct) == 0x000001, "Wrong size on WI_Social_C_PreConstruct");
static_assert(offsetof(WI_Social_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_Social_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

