#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SideBar_CharacterProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WI_WinscreenSubBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C
// 0x0050 (0x04A0 - 0x0450)
class UWI_SideBar_CharacterProgress_C final : public UWI_WinscreenSubBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_SideBar_CharacterProgress_C;     // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ProfileProgressPopIn;                              // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RewardPopupAnim;                                   // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StaggerVisibilityAnim;                             // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_CharacterProgression_Portrait_C*    WI_CharacterProgression_Portrait;                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ExperienceBarPerks_C*               WI_ExperienceBarPerks;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ExperienceBarProfile_C*             WI_ExperienceBarProfile;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ExperiencePanel_C*                  WI_ExperiencePanel;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_NewPerkUnlockedPanel_C*             WI_NewPerkUnlockedPanel;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentlyDisplayedPerkReward;                      // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CharacterLevelUpCosmetics();
	void ExecuteUbergraph_WI_SideBar_CharacterProgress(int32 EntryPoint);
	void GetPerkRewardAtLevel(int32 Level, struct FGameplayTag* Tag);
	void HandleCharacterLevelIncreased(int32 NewLevel);
	void HandleCharacterXPAnimFinished();
	void HandlePerkButtonClicked(class UWI_PerkButton_C* PerkButton);
	void OnInitialized();
	void OnLoaded_A33D0F4547DE387D70BAF7B540B3566A(class UObject* Loaded);
	void OnPerkUpdateFinished();
	void RewardPerk(int32 InLevel);
	void SetCurrentDisplayedPerkReward();
	void StartCharacterUpdate();
	void StartProfileUpdate();
	void UpdateCurrentDisplayedPerkAfterLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SideBar_CharacterProgress_C">();
	}
	static class UWI_SideBar_CharacterProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SideBar_CharacterProgress_C>();
	}
};
static_assert(alignof(UWI_SideBar_CharacterProgress_C) == 0x000008, "Wrong alignment on UWI_SideBar_CharacterProgress_C");
static_assert(sizeof(UWI_SideBar_CharacterProgress_C) == 0x0004A0, "Wrong size on UWI_SideBar_CharacterProgress_C");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, UberGraphFrame_WI_SideBar_CharacterProgress_C) == 0x000450, "Member 'UWI_SideBar_CharacterProgress_C::UberGraphFrame_WI_SideBar_CharacterProgress_C' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, ProfileProgressPopIn) == 0x000458, "Member 'UWI_SideBar_CharacterProgress_C::ProfileProgressPopIn' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, RewardPopupAnim) == 0x000460, "Member 'UWI_SideBar_CharacterProgress_C::RewardPopupAnim' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, StaggerVisibilityAnim) == 0x000468, "Member 'UWI_SideBar_CharacterProgress_C::StaggerVisibilityAnim' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, WI_CharacterProgression_Portrait) == 0x000470, "Member 'UWI_SideBar_CharacterProgress_C::WI_CharacterProgression_Portrait' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, WI_ExperienceBarPerks) == 0x000478, "Member 'UWI_SideBar_CharacterProgress_C::WI_ExperienceBarPerks' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, WI_ExperienceBarProfile) == 0x000480, "Member 'UWI_SideBar_CharacterProgress_C::WI_ExperienceBarProfile' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, WI_ExperiencePanel) == 0x000488, "Member 'UWI_SideBar_CharacterProgress_C::WI_ExperiencePanel' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, WI_NewPerkUnlockedPanel) == 0x000490, "Member 'UWI_SideBar_CharacterProgress_C::WI_NewPerkUnlockedPanel' has a wrong offset!");
static_assert(offsetof(UWI_SideBar_CharacterProgress_C, CurrentlyDisplayedPerkReward) == 0x000498, "Member 'UWI_SideBar_CharacterProgress_C::CurrentlyDisplayedPerkReward' has a wrong offset!");

}

