#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SpectatorCameraControls

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SpectatorCameraControls.WI_SpectatorCameraControls_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_SpectatorCameraControls_C final : public UUserWidget
{
public:
	class UTextBlock*                             FOV_Amount;                                        // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Speed_Amount;                                      // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASpectatorPawnJP_C*                     SpectatorPawn;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SpectatorCameraControls_C">();
	}
	static class UWI_SpectatorCameraControls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SpectatorCameraControls_C>();
	}
};
static_assert(alignof(UWI_SpectatorCameraControls_C) == 0x000008, "Wrong alignment on UWI_SpectatorCameraControls_C");
static_assert(sizeof(UWI_SpectatorCameraControls_C) == 0x0002F8, "Wrong size on UWI_SpectatorCameraControls_C");
static_assert(offsetof(UWI_SpectatorCameraControls_C, FOV_Amount) == 0x0002E0, "Member 'UWI_SpectatorCameraControls_C::FOV_Amount' has a wrong offset!");
static_assert(offsetof(UWI_SpectatorCameraControls_C, Speed_Amount) == 0x0002E8, "Member 'UWI_SpectatorCameraControls_C::Speed_Amount' has a wrong offset!");
static_assert(offsetof(UWI_SpectatorCameraControls_C, SpectatorPawn) == 0x0002F0, "Member 'UWI_SpectatorCameraControls_C::SpectatorPawn' has a wrong offset!");

}

