#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemBuffDetailsV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopItemBuffDetailsV2.WI_ShopItemBuffDetailsV2_C
// 0x0060 (0x0340 - 0x02E0)
class UWI_ShopItemBuffDetailsV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageBuffIcon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlockDescription;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FAppliedBuffInfo                       AppliedBuff;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	class FText                                   DescriptionToUse;                                  // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              IconToUse;                                         // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ShopItemBuffDetailsV2(int32 EntryPoint);
	void Update_Widget(class UClass* Class_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopItemBuffDetailsV2_C">();
	}
	static class UWI_ShopItemBuffDetailsV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopItemBuffDetailsV2_C>();
	}
};
static_assert(alignof(UWI_ShopItemBuffDetailsV2_C) == 0x000008, "Wrong alignment on UWI_ShopItemBuffDetailsV2_C");
static_assert(sizeof(UWI_ShopItemBuffDetailsV2_C) == 0x000340, "Wrong size on UWI_ShopItemBuffDetailsV2_C");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopItemBuffDetailsV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, ImageBuffIcon) == 0x0002E8, "Member 'UWI_ShopItemBuffDetailsV2_C::ImageBuffIcon' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, RichTextBlockDescription) == 0x0002F0, "Member 'UWI_ShopItemBuffDetailsV2_C::RichTextBlockDescription' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, AppliedBuff) == 0x0002F8, "Member 'UWI_ShopItemBuffDetailsV2_C::AppliedBuff' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, DescriptionToUse) == 0x000308, "Member 'UWI_ShopItemBuffDetailsV2_C::DescriptionToUse' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemBuffDetailsV2_C, IconToUse) == 0x000318, "Member 'UWI_ShopItemBuffDetailsV2_C::IconToUse' has a wrong offset!");

}

