#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonPassRewardContent_NeighborSkin

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_SeasonPassRewardContent_NeighborSkin.WI_SeasonPassRewardContent_NeighborSkin_C.ApplyNeighborSkinViewModel
// 0x0028 (0x0028 - 0x0000)
struct WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel final
{
public:
	struct FSeasonPassRewardContent_NeighborSkinViewModel ViewModel;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel) == 0x000008, "Wrong alignment on WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel");
static_assert(sizeof(WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel) == 0x000028, "Wrong size on WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel, ViewModel) == 0x000000, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ApplyNeighborSkinViewModel::ViewModel' has a wrong offset!");

// Function WI_SeasonPassRewardContent_NeighborSkin.WI_SeasonPassRewardContent_NeighborSkin_C.ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin
// 0x0060 (0x0060 - 0x0000)
struct WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSeasonPassRewardContent_NeighborSkinViewModel K2Node_Event_ViewModel;                            // 0x0008(0x0028)(ConstParm)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborSkinDefinition*                K2Node_DynamicCast_AsNeighbor_Skin_Definition;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin) == 0x000008, "Wrong alignment on WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin");
static_assert(sizeof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin) == 0x000060, "Wrong size on WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, EntryPoint) == 0x000000, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, K2Node_Event_ViewModel) == 0x000008, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, Temp_object_Variable) == 0x000048, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, K2Node_DynamicCast_AsNeighbor_Skin_Definition) == 0x000050, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::K2Node_DynamicCast_AsNeighbor_Skin_Definition' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_ExecuteUbergraph_WI_SeasonPassRewardContent_NeighborSkin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_SeasonPassRewardContent_NeighborSkin.WI_SeasonPassRewardContent_NeighborSkin_C.OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF
// 0x0008 (0x0008 - 0x0000)
struct WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF) == 0x000008, "Wrong alignment on WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF");
static_assert(sizeof(WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF) == 0x000008, "Wrong size on WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF");
static_assert(offsetof(WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF, Loaded) == 0x000000, "Member 'WI_SeasonPassRewardContent_NeighborSkin_C_OnLoaded_BDB5639E49A1AC0C2B5125BAA5E854AF::Loaded' has a wrong offset!");

}

