#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ScreenBorder_FuryRush

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ScreenBorder_FuryRush.WI_ScreenBorder_FuryRush_C.Border_Main_Event
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenBorder_FuryRush_C_Border_Main_Event final
{
public:
	class UBorder*                                Border_Main_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenBorder_FuryRush_C_Border_Main_Event) == 0x000008, "Wrong alignment on WI_ScreenBorder_FuryRush_C_Border_Main_Event");
static_assert(sizeof(WI_ScreenBorder_FuryRush_C_Border_Main_Event) == 0x000008, "Wrong size on WI_ScreenBorder_FuryRush_C_Border_Main_Event");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_Border_Main_Event, Border_Main_0) == 0x000000, "Member 'WI_ScreenBorder_FuryRush_C_Border_Main_Event::Border_Main_0' has a wrong offset!");

// Function WI_ScreenBorder_FuryRush.WI_ScreenBorder_FuryRush_C.ExecuteUbergraph_WI_ScreenBorder_FuryRush
// 0x0028 (0x0028 - 0x0000)
struct WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                K2Node_CustomEvent_Border_Main;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush) == 0x000008, "Wrong alignment on WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush");
static_assert(sizeof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush) == 0x000028, "Wrong size on WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush, EntryPoint) == 0x000000, "Member 'WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush, K2Node_CustomEvent_Border_Main) == 0x000010, "Member 'WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush::K2Node_CustomEvent_Border_Main' has a wrong offset!");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WI_ScreenBorder_FuryRush_C_ExecuteUbergraph_WI_ScreenBorder_FuryRush::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WI_ScreenBorder_FuryRush.WI_ScreenBorder_FuryRush_C.SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush final
{
public:
	class UBorder*                                Border_Main_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush) == 0x000008, "Wrong alignment on WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush");
static_assert(sizeof(WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush) == 0x000008, "Wrong size on WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush");
static_assert(offsetof(WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush, Border_Main_0) == 0x000000, "Member 'WI_ScreenBorder_FuryRush_C_SequenceEvent__ENTRYPOINTWI_ScreenBorder_FuryRush::Border_Main_0' has a wrong offset!");

}

