#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Scoreboard_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_PlayerScoreboardStats_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Scoreboard_Entry.WI_Scoreboard_Entry_C
// 0x00A0 (0x03A8 - 0x0308)
class UWI_Scoreboard_Entry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                Assists;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Deaths;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_66;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Kills;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_HorizontalDivider_Dashed_C*         WI_HorizontalDivider_Dashed;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_PlayerScoreboardStats               Stats;                                             // 0x0350(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsOwningPlayer;                                    // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_Scoreboard_Entry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Scoreboard_Entry_C">();
	}
	static class UWI_Scoreboard_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Scoreboard_Entry_C>();
	}
};
static_assert(alignof(UWI_Scoreboard_Entry_C) == 0x000008, "Wrong alignment on UWI_Scoreboard_Entry_C");
static_assert(sizeof(UWI_Scoreboard_Entry_C) == 0x0003A8, "Wrong size on UWI_Scoreboard_Entry_C");
static_assert(offsetof(UWI_Scoreboard_Entry_C, UberGraphFrame) == 0x000308, "Member 'UWI_Scoreboard_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Assists) == 0x000310, "Member 'UWI_Scoreboard_Entry_C::Assists' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Border_0) == 0x000318, "Member 'UWI_Scoreboard_Entry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Deaths) == 0x000320, "Member 'UWI_Scoreboard_Entry_C::Deaths' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, GridPanel_66) == 0x000328, "Member 'UWI_Scoreboard_Entry_C::GridPanel_66' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Kills) == 0x000330, "Member 'UWI_Scoreboard_Entry_C::Kills' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, PlayerName) == 0x000338, "Member 'UWI_Scoreboard_Entry_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Portrait) == 0x000340, "Member 'UWI_Scoreboard_Entry_C::Portrait' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, WI_HorizontalDivider_Dashed) == 0x000348, "Member 'UWI_Scoreboard_Entry_C::WI_HorizontalDivider_Dashed' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Stats) == 0x000350, "Member 'UWI_Scoreboard_Entry_C::Stats' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, Team) == 0x0003A0, "Member 'UWI_Scoreboard_Entry_C::Team' has a wrong offset!");
static_assert(offsetof(UWI_Scoreboard_Entry_C, IsOwningPlayer) == 0x0003A1, "Member 'UWI_Scoreboard_Entry_C::IsOwningPlayer' has a wrong offset!");

}

