#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopDropItemOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopDropItemOverlay.WI_ShopDropItemOverlay_C
// 0x0058 (0x0488 - 0x0430)
class UWI_ShopDropItemOverlay_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPButton_C*                         CancelButton;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Description;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DroppableItems;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_177;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CharacterWheelComponent;                           // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnItemDropChosen;                                  // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTag                           Item_to_Purchase_Tag;                              // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOverlayCloseButtonPressed;                       // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ClosePressed(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WI_ShopDropItemOverlay(int32 EntryPoint);
	class UInventoryComponent* GetPlayerInventoryComponent();
	void OnItemClicked(class UItemInstance* ItemInstance);
	void OnItemDropChosen__DelegateSignature(class UItemInstance* ItemInstance, const struct FGameplayTag& ItemGameplayTag);
	void OnOverlayCloseButtonPressed__DelegateSignature();
	void Open(const struct FGameplayTag& ItemToPurchaseTag);
	void PreConstruct(bool IsDesignTime);
	void SetupControllerNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopDropItemOverlay_C">();
	}
	static class UWI_ShopDropItemOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopDropItemOverlay_C>();
	}
};
static_assert(alignof(UWI_ShopDropItemOverlay_C) == 0x000008, "Wrong alignment on UWI_ShopDropItemOverlay_C");
static_assert(sizeof(UWI_ShopDropItemOverlay_C) == 0x000488, "Wrong size on UWI_ShopDropItemOverlay_C");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, UberGraphFrame) == 0x000430, "Member 'UWI_ShopDropItemOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, CancelButton) == 0x000438, "Member 'UWI_ShopDropItemOverlay_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, Description) == 0x000440, "Member 'UWI_ShopDropItemOverlay_C::Description' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, DroppableItems) == 0x000448, "Member 'UWI_ShopDropItemOverlay_C::DroppableItems' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, Image_177) == 0x000450, "Member 'UWI_ShopDropItemOverlay_C::Image_177' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, CharacterWheelComponent) == 0x000458, "Member 'UWI_ShopDropItemOverlay_C::CharacterWheelComponent' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, OnItemDropChosen) == 0x000460, "Member 'UWI_ShopDropItemOverlay_C::OnItemDropChosen' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, Item_to_Purchase_Tag) == 0x000470, "Member 'UWI_ShopDropItemOverlay_C::Item_to_Purchase_Tag' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemOverlay_C, OnOverlayCloseButtonPressed) == 0x000478, "Member 'UWI_ShopDropItemOverlay_C::OnOverlayCloseButtonPressed' has a wrong offset!");

}

