#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemPropertyDetailsV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ShopItemPropertyDetailsV2.WI_ShopItemPropertyDetailsV2_C.ExecuteUbergraph_WI_ShopItemPropertyDetailsV2
// 0x0040 (0x0040 - 0x0000)
struct WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopItemPropertyDetailsStarV2_C*    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0028(0x0010)()
	int32                                         K2Node_CustomEvent_ActiveStarsAmount;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2) == 0x000008, "Wrong alignment on WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2");
static_assert(sizeof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2) == 0x000040, "Wrong size on WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, EntryPoint) == 0x000000, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, Temp_int_Variable) == 0x000008, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, K2Node_CustomEvent_Text) == 0x000028, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2, K2Node_CustomEvent_ActiveStarsAmount) == 0x000038, "Member 'WI_ShopItemPropertyDetailsV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsV2::K2Node_CustomEvent_ActiveStarsAmount' has a wrong offset!");

// Function WI_ShopItemPropertyDetailsV2.WI_ShopItemPropertyDetailsV2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopItemPropertyDetailsV2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsV2_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ShopItemPropertyDetailsV2_C_PreConstruct");
static_assert(sizeof(WI_ShopItemPropertyDetailsV2_C_PreConstruct) == 0x000001, "Wrong size on WI_ShopItemPropertyDetailsV2_C_PreConstruct");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ShopItemPropertyDetailsV2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_ShopItemPropertyDetailsV2.WI_ShopItemPropertyDetailsV2_C.Update Widget
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopItemPropertyDetailsV2_C_Update_Widget final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         ActiveStarsAmount_0;                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsV2_C_Update_Widget) == 0x000008, "Wrong alignment on WI_ShopItemPropertyDetailsV2_C_Update_Widget");
static_assert(sizeof(WI_ShopItemPropertyDetailsV2_C_Update_Widget) == 0x000018, "Wrong size on WI_ShopItemPropertyDetailsV2_C_Update_Widget");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_Update_Widget, Text_0) == 0x000000, "Member 'WI_ShopItemPropertyDetailsV2_C_Update_Widget::Text_0' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_Update_Widget, ActiveStarsAmount_0) == 0x000010, "Member 'WI_ShopItemPropertyDetailsV2_C_Update_Widget::ActiveStarsAmount_0' has a wrong offset!");

// Function WI_ShopItemPropertyDetailsV2.WI_ShopItemPropertyDetailsV2_C.UpdateActiveStarsAmount
// 0x0098 (0x0098 - 0x0000)
struct WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount final
{
public:
	TArray<class UWI_ShopItemPropertyDetailsStarV2_C*> L_Stars;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         L_Count;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemPropertyDetailsStarV2_C*    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemPropertyDetailsStarV2_C*    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopItemPropertyDetailsStarV2_C*    K2Node_DynamicCast_AsWI_Shop_Item_Property_Details_Star_V2; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount) == 0x000008, "Wrong alignment on WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount");
static_assert(sizeof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount) == 0x000098, "Wrong size on WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, L_Stars) == 0x000000, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::L_Stars' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, L_Count) == 0x000010, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::L_Count' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Variable) == 0x000034, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Add_IntInt_ReturnValue_2) == 0x000038, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, Temp_int_Variable_1) == 0x00003C, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Get_Item) == 0x000040, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Less_IntInt_ReturnValue_1) == 0x000059, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00005B, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Add_IntInt_ReturnValue_3) == 0x00005C, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Less_IntInt_ReturnValue_2) == 0x000080, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, K2Node_DynamicCast_AsWI_Shop_Item_Property_Details_Star_V2) == 0x000088, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::K2Node_DynamicCast_AsWI_Shop_Item_Property_Details_Star_V2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'WI_ShopItemPropertyDetailsV2_C_UpdateActiveStarsAmount::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

