#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Statusbar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Statusbar.WI_Statusbar_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_Statusbar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_0;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_2;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DesignPreviewBuffAmount;                           // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBuff(class UClass* Class_0);
	void ExecuteUbergraph_WI_Statusbar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Statusbar_C">();
	}
	static class UWI_Statusbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Statusbar_C>();
	}
};
static_assert(alignof(UWI_Statusbar_C) == 0x000008, "Wrong alignment on UWI_Statusbar_C");
static_assert(sizeof(UWI_Statusbar_C) == 0x000300, "Wrong size on UWI_Statusbar_C");
static_assert(offsetof(UWI_Statusbar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Statusbar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Statusbar_C, SizeBox_0) == 0x0002E8, "Member 'UWI_Statusbar_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWI_Statusbar_C, WrapBox_2) == 0x0002F0, "Member 'UWI_Statusbar_C::WrapBox_2' has a wrong offset!");
static_assert(offsetof(UWI_Statusbar_C, DesignPreviewBuffAmount) == 0x0002F8, "Member 'UWI_Statusbar_C::DesignPreviewBuffAmount' has a wrong offset!");
static_assert(offsetof(UWI_Statusbar_C, Width) == 0x0002FC, "Member 'UWI_Statusbar_C::Width' has a wrong offset!");

}

