#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Scoreboard_InventoryItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_Scoreboard_InventoryItem.WI_Scoreboard_InventoryItem_C.ExecuteUbergraph_WI_Scoreboard_InventoryItem
// 0x0010 (0x0010 - 0x0000)
struct WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Icon;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem) == 0x000008, "Wrong alignment on WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem");
static_assert(sizeof(WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem) == 0x000010, "Wrong size on WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem");
static_assert(offsetof(WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem, EntryPoint) == 0x000000, "Member 'WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem, K2Node_CustomEvent_Icon) == 0x000008, "Member 'WI_Scoreboard_InventoryItem_C_ExecuteUbergraph_WI_Scoreboard_InventoryItem::K2Node_CustomEvent_Icon' has a wrong offset!");

// Function WI_Scoreboard_InventoryItem.WI_Scoreboard_InventoryItem_C.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct WI_Scoreboard_InventoryItem_C_SetIcon final
{
public:
	class UTexture2D*                             Icon_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Scoreboard_InventoryItem_C_SetIcon) == 0x000008, "Wrong alignment on WI_Scoreboard_InventoryItem_C_SetIcon");
static_assert(sizeof(WI_Scoreboard_InventoryItem_C_SetIcon) == 0x000008, "Wrong size on WI_Scoreboard_InventoryItem_C_SetIcon");
static_assert(offsetof(WI_Scoreboard_InventoryItem_C_SetIcon, Icon_0) == 0x000000, "Member 'WI_Scoreboard_InventoryItem_C_SetIcon::Icon_0' has a wrong offset!");

}

