#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SideBar_CharacterProgress

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.ExecuteUbergraph_WI_SideBar_CharacterProgress
// 0x0300 (0x0300 - 0x0000)
struct WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnWinningTeam_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewLevel)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_PerkButton_C* PerkButton)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PerkButton_C*                       K2Node_CustomEvent_PerkButton;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_InspectRewardPopup_C*               K2Node_DynamicCast_AsWI_Inspect_Reward_Popup;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPlayerRewardDataAsset>  CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset; // 0x0088(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPlayerRewardDataAsset_ReturnValue;  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InLevel;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPerkRewardAtLevel_Tag;                 // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E0(0x0010)()
	struct FGameplayTag                           CallFunc_GetPerkRewardAtLevel_Tag_1;               // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPerkDefinition>         CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition; // 0x0100(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPerkDefinition_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPerkRewardAtLevel_Tag_2;               // 0x0154(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Winscreen_CharacterWorldSlot_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0180(0x0010)(ReferenceParm)
	class ABP_Winscreen_CharacterWorldSlot_C*     CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WinScreenConfetti_Character_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkDefinition*                        K2Node_DynamicCast_AsPerk_Definition;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPerkName_ReturnValue;                  // 0x0298(0x0010)()
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x02A8(0x0010)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIcon_ReturnValue;                      // 0x02B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress) == 0x000010, "Wrong alignment on WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress) == 0x000300, "Wrong size on WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, EntryPoint) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, Temp_bool_Has_Been_Initd_Variable) == 0x000030, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CustomEvent_NewLevel) == 0x000034, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_IsOnWinningTeam_ReturnValue) == 0x000038, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_IsOnWinningTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CustomEvent_PerkButton) == 0x000060, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CustomEvent_PerkButton' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000068, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_AsWI_Inspect_Reward_Popup) == 0x000070, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_AsWI_Inspect_Reward_Popup' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset) == 0x000088, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_TryGetPlayerRewardDataAsset_ReturnValue) == 0x0000B0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_TryGetPlayerRewardDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_AsPlayer_State_JP) == 0x0000B8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x0000C4, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, Temp_bool_IsClosed_Variable) == 0x0000CC, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CustomEvent_InLevel) == 0x0000D4, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CustomEvent_InLevel' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetPerkRewardAtLevel_Tag) == 0x0000D8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetPerkRewardAtLevel_Tag' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetPerkRewardAtLevel_Tag_1) == 0x0000F0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetPerkRewardAtLevel_Tag_1' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetTagName_ReturnValue) == 0x0000F8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition) == 0x000100, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_TryGetPerkDefinition_ReturnValue) == 0x000128, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_TryGetPerkDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Conv_NameToString_ReturnValue) == 0x000130, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Concat_StrStr_ReturnValue) == 0x000140, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Add_IntInt_ReturnValue_2) == 0x000150, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetPerkRewardAtLevel_Tag_2) == 0x000154, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetPerkRewardAtLevel_Tag_2' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate_4) == 0x00015C, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_PlayAnimationForward_ReturnValue) == 0x000170, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetIsPie_ReturnValue) == 0x000178, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetAllActorsOfClass_OutActors) == 0x000180, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Array_Get_Item) == 0x000190, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001A0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001D0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_MakeTransform_ReturnValue) == 0x0001F0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetPlayerState_ReturnValue) == 0x000250, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000258, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000260, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_FinishSpawningActor_ReturnValue) == 0x000268, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, Temp_object_Variable) == 0x000270, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CreateDelegate_OutputDelegate_5) == 0x000278, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_AsPerk_Definition) == 0x000288, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_AsPerk_Definition' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_DynamicCast_bSuccess_2) == 0x000290, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetPerkName_ReturnValue) == 0x000298, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetPerkName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetDescription_ReturnValue) == 0x0002A8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_GetIcon_ReturnValue) == 0x0002B8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, K2Node_CustomEvent_Loaded) == 0x0002E0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0002E8, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0002F0, "Member 'WI_SideBar_CharacterProgress_C_ExecuteUbergraph_WI_SideBar_CharacterProgress::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.GetPerkRewardAtLevel
// 0x00B8 (0x00B8 - 0x0000)
struct WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0004(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USeasonPassGameInstanceSubsystem*       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FGameplayTag>              CallFunc_GetNeighborPerkRewardsByLevel_ReturnValue; // 0x0058(0x0050)()
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel) == 0x000008, "Wrong alignment on WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel) == 0x0000B8, "Wrong size on WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, Level) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::Level' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, Tag) == 0x000004, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::Tag' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000040, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x00004C, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_GetNeighborPerkRewardsByLevel_ReturnValue) == 0x000058, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_GetNeighborPerkRewardsByLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'WI_SideBar_CharacterProgress_C_GetPerkRewardAtLevel::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.HandleCharacterLevelIncreased
// 0x0004 (0x0004 - 0x0000)
struct WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased) == 0x000004, "Wrong alignment on WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased) == 0x000004, "Wrong size on WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased, NewLevel) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_HandleCharacterLevelIncreased::NewLevel' has a wrong offset!");

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.HandlePerkButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked final
{
public:
	class UWI_PerkButton_C*                       PerkButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked) == 0x000008, "Wrong alignment on WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked) == 0x000008, "Wrong size on WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked, PerkButton) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_HandlePerkButtonClicked::PerkButton' has a wrong offset!");

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.OnLoaded_A33D0F4547DE387D70BAF7B540B3566A
// 0x0008 (0x0008 - 0x0000)
struct WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A) == 0x000008, "Wrong alignment on WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A) == 0x000008, "Wrong size on WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A, Loaded) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_OnLoaded_A33D0F4547DE387D70BAF7B540B3566A::Loaded' has a wrong offset!");

// Function WI_SideBar_CharacterProgress.WI_SideBar_CharacterProgress_C.RewardPerk
// 0x0004 (0x0004 - 0x0000)
struct WI_SideBar_CharacterProgress_C_RewardPerk final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SideBar_CharacterProgress_C_RewardPerk) == 0x000004, "Wrong alignment on WI_SideBar_CharacterProgress_C_RewardPerk");
static_assert(sizeof(WI_SideBar_CharacterProgress_C_RewardPerk) == 0x000004, "Wrong size on WI_SideBar_CharacterProgress_C_RewardPerk");
static_assert(offsetof(WI_SideBar_CharacterProgress_C_RewardPerk, InLevel) == 0x000000, "Member 'WI_SideBar_CharacterProgress_C_RewardPerk::InLevel' has a wrong offset!");

}

