#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SubObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SubObjective.WI_SubObjective_C
// 0x0130 (0x0410 - 0x02E0)
class UWI_SubObjective_C final : public UJPActionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         SubObjective_Title;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SubObjectiveTitle;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible)
	struct FSlateColor                            UnlockedColor;                                     // 0x0300(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            LockedColor;                                       // 0x0314(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CompletedStrikeBrush;                              // 0x0330(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UInputAction*>                   InputActions;                                      // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WI_SubObjective(int32 EntryPoint);
	void Get_Input_Tag(class UInputAction* Input, class FString* Text, bool* FoundBoundKey, bool* BindingHasImage);
	class FString GetInputReplacementString(class UInputAction* Input);
	void GetSubObjectiveTitle(class FText* NewParam);
	void PreConstruct(bool IsDesignTime);
	void SetCompletedStatus(bool IsCompleted);
	void SetSubObjectiveTitle(const class FText& SubObjectiveTitle_0, TArray<class UInputAction*>& InputActions_0);
	void SetUnlockedStatus(bool Locked);
	void UpdateVisuals(class ASubObjective* SubObjective);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SubObjective_C">();
	}
	static class UWI_SubObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SubObjective_C>();
	}
};
static_assert(alignof(UWI_SubObjective_C) == 0x000010, "Wrong alignment on UWI_SubObjective_C");
static_assert(sizeof(UWI_SubObjective_C) == 0x000410, "Wrong size on UWI_SubObjective_C");
static_assert(offsetof(UWI_SubObjective_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_SubObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, SubObjective_Title) == 0x0002E8, "Member 'UWI_SubObjective_C::SubObjective_Title' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, SubObjectiveTitle) == 0x0002F0, "Member 'UWI_SubObjective_C::SubObjectiveTitle' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, UnlockedColor) == 0x000300, "Member 'UWI_SubObjective_C::UnlockedColor' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, LockedColor) == 0x000314, "Member 'UWI_SubObjective_C::LockedColor' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, CompletedStrikeBrush) == 0x000330, "Member 'UWI_SubObjective_C::CompletedStrikeBrush' has a wrong offset!");
static_assert(offsetof(UWI_SubObjective_C, InputActions) == 0x000400, "Member 'UWI_SubObjective_C::InputActions' has a wrong offset!");

}

