#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ScreenSplat_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ScreenSplat_Base.WI_ScreenSplat_Base_C.OnAnimateInComplete__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature final
{
public:
	class UWI_ScreenSplat_Base_C*                 SplatEffectWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature) == 0x000008, "Wrong alignment on WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature");
static_assert(sizeof(WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature) == 0x000008, "Wrong size on WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature");
static_assert(offsetof(WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature, SplatEffectWidget) == 0x000000, "Member 'WI_ScreenSplat_Base_C_OnAnimateInComplete__DelegateSignature::SplatEffectWidget' has a wrong offset!");

// Function WI_ScreenSplat_Base.WI_ScreenSplat_Base_C.OnAnimateOutComplete__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature final
{
public:
	class UWI_ScreenSplat_Base_C*                 SplatEffectWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature) == 0x000008, "Wrong alignment on WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature");
static_assert(sizeof(WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature) == 0x000008, "Wrong size on WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature");
static_assert(offsetof(WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature, SplatEffectWidget) == 0x000000, "Member 'WI_ScreenSplat_Base_C_OnAnimateOutComplete__DelegateSignature::SplatEffectWidget' has a wrong offset!");

}

