#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ScoreboardScreen

#include "Basic.hpp"

#include "S_PlayerScoreboardStats_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.CreateScoreboardData
// 0x0178 (0x0178 - 0x0000)
struct WI_ScoreboardScreen_C_CreateScoreboardData final
{
public:
	class APlayerStateJP*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerScoreboardStats               Stats;                                             // 0x0008(0x0050)(Parm, OutParm, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerEconomyAsText_Money;             // 0x0070(0x0010)()
	class FText                                   CallFunc_GetPlayerEconomyAsText_Wood;              // 0x0080(0x0010)()
	class FText                                   CallFunc_GetPlayerEconomyAsText_Perfectness;       // 0x0090(0x0010)()
	class FText                                   CallFunc_GetPlayerEconomyAsText_PerfectnessNormalised; // 0x00A0(0x0010)()
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDeaths_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAssists_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKills_ReturnValue;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetPortraitFromCharacterID_ReturnValue;   // 0x0100(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FS_PlayerScoreboardStats               K2Node_MakeStruct_S_PlayerScoreboardStats;         // 0x0128(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_CreateScoreboardData) == 0x000008, "Wrong alignment on WI_ScoreboardScreen_C_CreateScoreboardData");
static_assert(sizeof(WI_ScoreboardScreen_C_CreateScoreboardData) == 0x000178, "Wrong size on WI_ScoreboardScreen_C_CreateScoreboardData");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, PlayerState) == 0x000000, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, Stats) == 0x000008, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::Stats' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000058, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000060, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPlayerEconomyAsText_Money) == 0x000070, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPlayerEconomyAsText_Money' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPlayerEconomyAsText_Wood) == 0x000080, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPlayerEconomyAsText_Wood' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPlayerEconomyAsText_Perfectness) == 0x000090, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPlayerEconomyAsText_Perfectness' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPlayerEconomyAsText_PerfectnessNormalised) == 0x0000A0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPlayerEconomyAsText_PerfectnessNormalised' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000B0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000D8, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetDeaths_ReturnValue) == 0x0000F0, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetDeaths_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x0000F4, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetAssists_ReturnValue) == 0x0000F8, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetAssists_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetKills_ReturnValue) == 0x0000FC, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetKills_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, CallFunc_GetPortraitFromCharacterID_ReturnValue) == 0x000100, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::CallFunc_GetPortraitFromCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_CreateScoreboardData, K2Node_MakeStruct_S_PlayerScoreboardStats) == 0x000128, "Member 'WI_ScoreboardScreen_C_CreateScoreboardData::K2Node_MakeStruct_S_PlayerScoreboardStats' has a wrong offset!");

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.ExecuteUbergraph_WI_ScoreboardScreen
// 0x0038 (0x0038 - 0x0000)
struct WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Scoreboard_Entry_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_Scoreboard_Entry_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen) == 0x000008, "Wrong alignment on WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen");
static_assert(sizeof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen) == 0x000038, "Wrong size on WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, EntryPoint) == 0x000000, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen, CallFunc_AddChild_ReturnValue_1) == 0x000030, "Member 'WI_ScoreboardScreen_C_ExecuteUbergraph_WI_ScoreboardScreen::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.GetPortraitFromCharacterID
// 0x0080 (0x0080 - 0x0000)
struct WI_ScoreboardScreen_C_GetPortraitFromCharacterID final
{
public:
	class APlayerStateJP*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID) == 0x000008, "Wrong alignment on WI_ScoreboardScreen_C_GetPortraitFromCharacterID");
static_assert(sizeof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID) == 0x000080, "Wrong size on WI_ScoreboardScreen_C_GetPortraitFromCharacterID");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, PlayerState) == 0x000000, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, ReturnValue) == 0x000008, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x000030, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000038, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000040, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000070, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetPortraitFromCharacterID, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WI_ScoreboardScreen_C_GetPortraitFromCharacterID::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.GetSlotForTeam
// 0x0028 (0x0028 - 0x0000)
struct WI_ScoreboardScreen_C_GetSlotForTeam final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           Slot_0;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_GetSlotForTeam) == 0x000008, "Wrong alignment on WI_ScoreboardScreen_C_GetSlotForTeam");
static_assert(sizeof(WI_ScoreboardScreen_C_GetSlotForTeam) == 0x000028, "Wrong size on WI_ScoreboardScreen_C_GetSlotForTeam");
static_assert(offsetof(WI_ScoreboardScreen_C_GetSlotForTeam, Team) == 0x000000, "Member 'WI_ScoreboardScreen_C_GetSlotForTeam::Team' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetSlotForTeam, Slot_0) == 0x000008, "Member 'WI_ScoreboardScreen_C_GetSlotForTeam::Slot_0' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetSlotForTeam, Temp_byte_Variable) == 0x000010, "Member 'WI_ScoreboardScreen_C_GetSlotForTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetSlotForTeam, Temp_object_Variable) == 0x000018, "Member 'WI_ScoreboardScreen_C_GetSlotForTeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_GetSlotForTeam, K2Node_Select_Default) == 0x000020, "Member 'WI_ScoreboardScreen_C_GetSlotForTeam::K2Node_Select_Default' has a wrong offset!");

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.Populate Scoreboard for Team
// 0x00B8 (0x00B8 - 0x0000)
struct WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Scoreboard_Entry_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0020(0x0010)(ReferenceParm)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerScoreboardStats               CallFunc_CreateScoreboardData_Stats;               // 0x0040(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CallFunc_GetSlotForTeam_Slot;                      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team) == 0x000008, "Wrong alignment on WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team");
static_assert(sizeof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team) == 0x0000B8, "Wrong size on WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, Team) == 0x000000, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::Team' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000020, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_CreateScoreboardData_Stats) == 0x000040, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_CreateScoreboardData_Stats' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_GetOwningPlayer_ReturnValue) == 0x000098, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_GetSlotForTeam_Slot) == 0x0000A0, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_GetSlotForTeam_Slot' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B0, "Member 'WI_ScoreboardScreen_C_Populate_Scoreboard_for_Team::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WI_ScoreboardScreen.WI_ScoreboardScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ScoreboardScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScoreboardScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ScoreboardScreen_C_PreConstruct");
static_assert(sizeof(WI_ScoreboardScreen_C_PreConstruct) == 0x000001, "Wrong size on WI_ScoreboardScreen_C_PreConstruct");
static_assert(offsetof(WI_ScoreboardScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ScoreboardScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

