#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopPlayerResourcesV2

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C.ExecuteUbergraph_WI_ShopPlayerResourcesV2
// 0x0060 (0x0060 - 0x0000)
struct WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopViewModel                         K2Node_CustomEvent_ShopViewModel;                  // 0x0008(0x0028)()
	TDelegate<void(const struct FShopViewModel& ShopViewModel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MoneyAmount;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_ResourcesAmount;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     K2Node_DynamicCast_AsGame_State_JP_Match;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2) == 0x000008, "Wrong alignment on WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2");
static_assert(sizeof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2) == 0x000060, "Wrong size on WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, EntryPoint) == 0x000000, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_CustomEvent_ShopViewModel) == 0x000008, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_CustomEvent_ShopViewModel' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_CustomEvent_MoneyAmount) == 0x000040, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_CustomEvent_MoneyAmount' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_CustomEvent_ResourcesAmount) == 0x000044, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_CustomEvent_ResourcesAmount' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_DynamicCast_AsGame_State_JP_Match) == 0x000050, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_DynamicCast_AsGame_State_JP_Match' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WI_ShopPlayerResourcesV2_C_ExecuteUbergraph_WI_ShopPlayerResourcesV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C.SetMoneyAmount
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopPlayerResourcesV2_C_SetMoneyAmount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WI_ShopPlayerResourcesV2_C_SetMoneyAmount) == 0x000008, "Wrong alignment on WI_ShopPlayerResourcesV2_C_SetMoneyAmount");
static_assert(sizeof(WI_ShopPlayerResourcesV2_C_SetMoneyAmount) == 0x000018, "Wrong size on WI_ShopPlayerResourcesV2_C_SetMoneyAmount");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_SetMoneyAmount, Amount) == 0x000000, "Member 'WI_ShopPlayerResourcesV2_C_SetMoneyAmount::Amount' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_SetMoneyAmount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_ShopPlayerResourcesV2_C_SetMoneyAmount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C.SetResourceAmount
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopPlayerResourcesV2_C_SetResourceAmount final
{
public:
	uint8                                         Amount;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0008(0x0010)()
};
static_assert(alignof(WI_ShopPlayerResourcesV2_C_SetResourceAmount) == 0x000008, "Wrong alignment on WI_ShopPlayerResourcesV2_C_SetResourceAmount");
static_assert(sizeof(WI_ShopPlayerResourcesV2_C_SetResourceAmount) == 0x000018, "Wrong size on WI_ShopPlayerResourcesV2_C_SetResourceAmount");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_SetResourceAmount, Amount) == 0x000000, "Member 'WI_ShopPlayerResourcesV2_C_SetResourceAmount::Amount' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_SetResourceAmount, CallFunc_Conv_ByteToText_ReturnValue) == 0x000008, "Member 'WI_ShopPlayerResourcesV2_C_SetResourceAmount::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");

// Function WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C.ShopChanged_Event
// 0x0028 (0x0028 - 0x0000)
struct WI_ShopPlayerResourcesV2_C_ShopChanged_Event final
{
public:
	struct FShopViewModel                         ShopViewModel;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_ShopPlayerResourcesV2_C_ShopChanged_Event) == 0x000008, "Wrong alignment on WI_ShopPlayerResourcesV2_C_ShopChanged_Event");
static_assert(sizeof(WI_ShopPlayerResourcesV2_C_ShopChanged_Event) == 0x000028, "Wrong size on WI_ShopPlayerResourcesV2_C_ShopChanged_Event");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_ShopChanged_Event, ShopViewModel) == 0x000000, "Member 'WI_ShopPlayerResourcesV2_C_ShopChanged_Event::ShopViewModel' has a wrong offset!");

// Function WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C.Update Widget
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopPlayerResourcesV2_C_Update_Widget final
{
public:
	int32                                         MoneyAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ResourcesAmount;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopPlayerResourcesV2_C_Update_Widget) == 0x000004, "Wrong alignment on WI_ShopPlayerResourcesV2_C_Update_Widget");
static_assert(sizeof(WI_ShopPlayerResourcesV2_C_Update_Widget) == 0x000008, "Wrong size on WI_ShopPlayerResourcesV2_C_Update_Widget");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_Update_Widget, MoneyAmount) == 0x000000, "Member 'WI_ShopPlayerResourcesV2_C_Update_Widget::MoneyAmount' has a wrong offset!");
static_assert(offsetof(WI_ShopPlayerResourcesV2_C_Update_Widget, ResourcesAmount) == 0x000004, "Member 'WI_ShopPlayerResourcesV2_C_Update_Widget::ResourcesAmount' has a wrong offset!");

}

