#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemPropertyDetailsStarV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopItemPropertyDetailsStarV2.WI_ShopItemPropertyDetailsStarV2_C.ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2
// 0x003C (0x003C - 0x0000)
struct WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Active;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2) == 0x000004, "Wrong alignment on WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2");
static_assert(sizeof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2) == 0x00003C, "Wrong size on WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, EntryPoint) == 0x000000, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, Temp_bool_Variable) == 0x000004, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, Temp_struct_Variable) == 0x000008, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, Temp_struct_Variable_1) == 0x000018, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, K2Node_CustomEvent_Active) == 0x000028, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2, K2Node_Select_Default) == 0x00002C, "Member 'WI_ShopItemPropertyDetailsStarV2_C_ExecuteUbergraph_WI_ShopItemPropertyDetailsStarV2::K2Node_Select_Default' has a wrong offset!");

// Function WI_ShopItemPropertyDetailsStarV2.WI_ShopItemPropertyDetailsStarV2_C.Set Start Active
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active) == 0x000001, "Wrong alignment on WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active");
static_assert(sizeof(WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active) == 0x000001, "Wrong size on WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active");
static_assert(offsetof(WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active, Active) == 0x000000, "Member 'WI_ShopItemPropertyDetailsStarV2_C_Set_Start_Active::Active' has a wrong offset!");

}

