#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SuddenDeath

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_SuddenDeath.WI_SuddenDeath_C.ExecuteUbergraph_WI_SuddenDeath
// 0x0080 (0x0080 - 0x0000)
struct WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath) == 0x000008, "Wrong alignment on WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath");
static_assert(sizeof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath) == 0x000080, "Wrong size on WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, EntryPoint) == 0x000000, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, K2Node_Event_MyGeometry) == 0x000010, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000050, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_Abs_ReturnValue) == 0x000060, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'WI_SuddenDeath_C_ExecuteUbergraph_WI_SuddenDeath::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WI_SuddenDeath.WI_SuddenDeath_C.Tick
// 0x003C (0x003C - 0x0000)
struct WI_SuddenDeath_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SuddenDeath_C_Tick) == 0x000004, "Wrong alignment on WI_SuddenDeath_C_Tick");
static_assert(sizeof(WI_SuddenDeath_C_Tick) == 0x00003C, "Wrong size on WI_SuddenDeath_C_Tick");
static_assert(offsetof(WI_SuddenDeath_C_Tick, MyGeometry) == 0x000000, "Member 'WI_SuddenDeath_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_SuddenDeath_C_Tick, InDeltaTime) == 0x000038, "Member 'WI_SuddenDeath_C_Tick::InDeltaTime' has a wrong offset!");

}

