#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ScreenSplat_Container

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_HideScreenSplatMessage_structs.hpp"
#include "S_ShowScreenSplatMessage_structs.hpp"


namespace SDK::Params
{

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenSplat_Container_C_CustomEvent final
{
public:
	class UWI_ScreenSplat_Base_C*                 SplatEffectWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_CustomEvent) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_CustomEvent");
static_assert(sizeof(WI_ScreenSplat_Container_C_CustomEvent) == 0x000008, "Wrong size on WI_ScreenSplat_Container_C_CustomEvent");
static_assert(offsetof(WI_ScreenSplat_Container_C_CustomEvent, SplatEffectWidget) == 0x000000, "Member 'WI_ScreenSplat_Container_C_CustomEvent::SplatEffectWidget' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.ExecuteUbergraph_WI_ScreenSplat_Container
// 0x02A8 (0x02A8 - 0x0000)
struct WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_ShowScreenSplatMessage              Temp_struct_Variable;                              // 0x0018(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HideScreenSplatMessage              Temp_struct_Variable_2;                            // 0x0060(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HideScreenSplatMessage              Temp_struct_Variable_3;                            // 0x00A8(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWI_Screen_Splat_Base;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ScreenSplat_Base_C*                 CallFunc_Create_ReturnValue;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_ScreenSplat_Base_C* SplatEffectWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ShowScreenSplatMessage              Temp_struct_Variable_5;                            // 0x0138(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_CustomEvent_EffectClassToAdd;               // 0x0178(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_CustomEvent_EffectClassToRemove;            // 0x01A0(0x0028)(HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ScreenSplat_Base_C*                 CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0200(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ScreenSplat_Base_C*                 K2Node_CustomEvent_SplatEffectWidget;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23E[0x2];                                      // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ScreenSplat_Base_C*                 CallFunc_Array_Get_Item_1;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1; // 0x0278(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue_1; // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container");
static_assert(sizeof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container) == 0x0002A8, "Wrong size on WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, EntryPoint) == 0x000000, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_ProxyObject_1) == 0x000008, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_ActualChannel_1) == 0x000010, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable) == 0x000018, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable_1) == 0x000040, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_object_Variable) == 0x000048, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000050, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable_2) == 0x000060, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_ProxyObject) == 0x000088, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_ActualChannel) == 0x000090, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable_3) == 0x0000A8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable_4) == 0x0000D0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_object_Variable_1) == 0x0000D8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_GetPayload_ReturnValue) == 0x0000E0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0000E8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_Loaded) == 0x0000F0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_class_Variable) == 0x000100, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_ClassDynamicCast_AsWI_Screen_Splat_Base) == 0x000108, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_ClassDynamicCast_AsWI_Screen_Splat_Base' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_ClassDynamicCast_bSuccess) == 0x000110, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Create_ReturnValue) == 0x000118, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_int_Array_Index_Variable) == 0x000120, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CreateDelegate_OutputDelegate_1) == 0x000124, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_struct_Variable_5) == 0x000138, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_GetPayload_ReturnValue_1) == 0x000160, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_int_Loop_Counter_Variable) == 0x000164, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_bool_True_if_break_was_hit_Variable) == 0x00016C, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_int_Array_Index_Variable_1) == 0x000170, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Not_PreBool_ReturnValue) == 0x000174, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_EffectClassToAdd) == 0x000178, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_EffectClassToAdd' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_EffectClassToRemove) == 0x0001A0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_EffectClassToRemove' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_AddChildToOverlay_ReturnValue) == 0x0001C8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_AddUnique_ReturnValue) == 0x0001E0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_GetObjectClass_ReturnValue) == 0x0001F8, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000200, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x000228, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CustomEvent_SplatEffectWidget) == 0x000230, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CustomEvent_SplatEffectWidget' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, Temp_int_Loop_Counter_Variable_1) == 0x000238, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_RemoveItem_ReturnValue) == 0x00023C, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Less_IntInt_ReturnValue) == 0x00023D, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, K2Node_CreateDelegate_OutputDelegate_3) == 0x000244, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_Get_Item_1) == 0x000258, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Array_Length_ReturnValue_1) == 0x000260, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_GetObjectClass_ReturnValue_1) == 0x000268, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Less_IntInt_ReturnValue_1) == 0x000270, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1) == 0x000278, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_BooleanAND_ReturnValue) == 0x0002A0, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_EqualEqual_SoftClassReference_ReturnValue_1) == 0x0002A1, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_EqualEqual_SoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002A2, "Member 'WI_ScreenSplat_Container_C_ExecuteUbergraph_WI_ScreenSplat_Container::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.HideSplat
// 0x0028 (0x0028 - 0x0000)
struct WI_ScreenSplat_Container_C_HideSplat final
{
public:
	TSoftClassPtr<class UClass>                   EffectClassToRemove;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_HideSplat) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_HideSplat");
static_assert(sizeof(WI_ScreenSplat_Container_C_HideSplat) == 0x000028, "Wrong size on WI_ScreenSplat_Container_C_HideSplat");
static_assert(offsetof(WI_ScreenSplat_Container_C_HideSplat, EffectClassToRemove) == 0x000000, "Member 'WI_ScreenSplat_Container_C_HideSplat::EffectClassToRemove' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2
// 0x0008 (0x0008 - 0x0000)
struct WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2");
static_assert(sizeof(WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2) == 0x000008, "Wrong size on WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2");
static_assert(offsetof(WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2, Loaded) == 0x000000, "Member 'WI_ScreenSplat_Container_C_OnLoaded_227F1FBE4C7CAAA52008DDA02EB63EB2::Loaded' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12
// 0x0010 (0x0010 - 0x0000)
struct WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12");
static_assert(sizeof(WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12) == 0x000010, "Wrong size on WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12");
static_assert(offsetof(WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12, ProxyObject) == 0x000000, "Member 'WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12, ActualChannel) == 0x000008, "Member 'WI_ScreenSplat_Container_C_OnMessageReceived_9D50C2334FDDCFCB93E2BF98325C6B12::ActualChannel' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248
// 0x0010 (0x0010 - 0x0000)
struct WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248");
static_assert(sizeof(WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248) == 0x000010, "Wrong size on WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248");
static_assert(offsetof(WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248, ProxyObject) == 0x000000, "Member 'WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248, ActualChannel) == 0x000008, "Member 'WI_ScreenSplat_Container_C_OnMessageReceived_EB37BD1D4EBB2F53BB2EACB29C43A248::ActualChannel' has a wrong offset!");

// Function WI_ScreenSplat_Container.WI_ScreenSplat_Container_C.ShowSplat
// 0x0028 (0x0028 - 0x0000)
struct WI_ScreenSplat_Container_C_ShowSplat final
{
public:
	TSoftClassPtr<class UClass>                   EffectClassToAdd;                                  // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_ScreenSplat_Container_C_ShowSplat) == 0x000008, "Wrong alignment on WI_ScreenSplat_Container_C_ShowSplat");
static_assert(sizeof(WI_ScreenSplat_Container_C_ShowSplat) == 0x000028, "Wrong size on WI_ScreenSplat_Container_C_ShowSplat");
static_assert(offsetof(WI_ScreenSplat_Container_C_ShowSplat, EffectClassToAdd) == 0x000000, "Member 'WI_ScreenSplat_Container_C_ShowSplat::EffectClassToAdd' has a wrong offset!");

}

