#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopDropItemEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopDropItemEntry.WI_ShopDropItemEntry_C.ExecuteUbergraph_WI_ShopDropItemEntry
// 0x0070 (0x0070 - 0x0000)
struct WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemWheelEntryWI_C*                    CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0060(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0068(0x0008)(NoDestructor)
};
static_assert(alignof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry) == 0x000008, "Wrong alignment on WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry");
static_assert(sizeof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry) == 0x000070, "Wrong size on WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, EntryPoint) == 0x000000, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, Temp_text_Variable) == 0x000008, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, K2Node_Event_InFocusEvent_1) == 0x000060, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry, K2Node_Event_InFocusEvent) == 0x000068, "Member 'WI_ShopDropItemEntry_C_ExecuteUbergraph_WI_ShopDropItemEntry::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WI_ShopDropItemEntry.WI_ShopDropItemEntry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopDropItemEntry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_ShopDropItemEntry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WI_ShopDropItemEntry_C_OnAddedToFocusPath");
static_assert(sizeof(WI_ShopDropItemEntry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WI_ShopDropItemEntry_C_OnAddedToFocusPath");
static_assert(offsetof(WI_ShopDropItemEntry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WI_ShopDropItemEntry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WI_ShopDropItemEntry.WI_ShopDropItemEntry_C.OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature final
{
public:
	class UItemInstance*                          ItemInstance_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature");
static_assert(sizeof(WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature");
static_assert(offsetof(WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature, ItemInstance_0) == 0x000000, "Member 'WI_ShopDropItemEntry_C_OnItemClicked__DelegateSignature::ItemInstance_0' has a wrong offset!");

// Function WI_ShopDropItemEntry.WI_ShopDropItemEntry_C.OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature final
{
public:
	class UItemInstance*                          ItemInstance_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature");
static_assert(sizeof(WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature");
static_assert(offsetof(WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature, ItemInstance_0) == 0x000000, "Member 'WI_ShopDropItemEntry_C_OnItemHovered__DelegateSignature::ItemInstance_0' has a wrong offset!");

// Function WI_ShopDropItemEntry.WI_ShopDropItemEntry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopDropItemEntry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_ShopDropItemEntry_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WI_ShopDropItemEntry_C_OnRemovedFromFocusPath");
static_assert(sizeof(WI_ShopDropItemEntry_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WI_ShopDropItemEntry_C_OnRemovedFromFocusPath");
static_assert(offsetof(WI_ShopDropItemEntry_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WI_ShopDropItemEntry_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

}

