#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopPurchaseFeedbackV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopPurchaseFeedbackV2.WI_ShopPurchaseFeedbackV2_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_ShopPurchaseFeedbackV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Purchase;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageItem;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResource;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ShopPurchaseFeedbackV2(int32 EntryPoint);
	void Play_Purchase_Animation(class UTexture2D* ItemIcon, class UEconomyDefinition* ItemViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopPurchaseFeedbackV2_C">();
	}
	static class UWI_ShopPurchaseFeedbackV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopPurchaseFeedbackV2_C>();
	}
};
static_assert(alignof(UWI_ShopPurchaseFeedbackV2_C) == 0x000008, "Wrong alignment on UWI_ShopPurchaseFeedbackV2_C");
static_assert(sizeof(UWI_ShopPurchaseFeedbackV2_C) == 0x000300, "Wrong size on UWI_ShopPurchaseFeedbackV2_C");
static_assert(offsetof(UWI_ShopPurchaseFeedbackV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopPurchaseFeedbackV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopPurchaseFeedbackV2_C, Purchase) == 0x0002E8, "Member 'UWI_ShopPurchaseFeedbackV2_C::Purchase' has a wrong offset!");
static_assert(offsetof(UWI_ShopPurchaseFeedbackV2_C, ImageItem) == 0x0002F0, "Member 'UWI_ShopPurchaseFeedbackV2_C::ImageItem' has a wrong offset!");
static_assert(offsetof(UWI_ShopPurchaseFeedbackV2_C, ImageResource) == 0x0002F8, "Member 'UWI_ShopPurchaseFeedbackV2_C::ImageResource' has a wrong offset!");

}

