#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonPassReward_CatalogItem_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SeasonPassReward_CatalogItem_Default.WI_SeasonPassReward_CatalogItem_Default_C
// 0x0020 (0x0330 - 0x0310)
class UWI_SeasonPassReward_CatalogItem_Default_C final : public USeasonPassRewardWidget_CatalogItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_59;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Content;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Loading;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_SeasonPassReward_CatalogItem_Default(int32 EntryPoint);
	void HideLoadGuard();
	void ShowLoadGuard();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SeasonPassReward_CatalogItem_Default_C">();
	}
	static class UWI_SeasonPassReward_CatalogItem_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SeasonPassReward_CatalogItem_Default_C>();
	}
};
static_assert(alignof(UWI_SeasonPassReward_CatalogItem_Default_C) == 0x000008, "Wrong alignment on UWI_SeasonPassReward_CatalogItem_Default_C");
static_assert(sizeof(UWI_SeasonPassReward_CatalogItem_Default_C) == 0x000330, "Wrong size on UWI_SeasonPassReward_CatalogItem_Default_C");
static_assert(offsetof(UWI_SeasonPassReward_CatalogItem_Default_C, UberGraphFrame) == 0x000310, "Member 'UWI_SeasonPassReward_CatalogItem_Default_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassReward_CatalogItem_Default_C, CircularThrobber_59) == 0x000318, "Member 'UWI_SeasonPassReward_CatalogItem_Default_C::CircularThrobber_59' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassReward_CatalogItem_Default_C, Content) == 0x000320, "Member 'UWI_SeasonPassReward_CatalogItem_Default_C::Content' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassReward_CatalogItem_Default_C, Loading) == 0x000328, "Member 'UWI_SeasonPassReward_CatalogItem_Default_C::Loading' has a wrong offset!");

}

