#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemDetailsV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopItemDetailsV2.WI_ShopItemDetailsV2_C
// 0x0068 (0x0348 - 0x02E0)
class UWI_ShopItemDetailsV2_C final : public UShopWidgetItemDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Update;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDecription;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTitle;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_HorizontalDivider_Dashed_C*         WI_HorizontalDivider_Dashed;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_HorizontalDivider_Dashed_C*         WI_HorizontalDivider_Dashed_1;                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopItemBuffDetailsV2_C*            WI_ShopItemBuffDetailsPlaceholder;                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopItemPropertyDetailsV2_C*        WI_ShopItemPropertyDetailsPlaceholder1;            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopItemPropertyDetailsV2_C*        WI_ShopItemPropertyDetailsPlaceholder2;            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBoxPropertyBuffsDetails;                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBoxPropertyDetails;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDefinition*                        CurrentItemDefinition;                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddItemPropertyDetailsToBuffsWrapBox();
	void AddItemPropertyDetailsToDetailsWrapBox(int32 ActiveStarsAmount, const class FText& Text);
	void ClearWrapBoxes();
	void Construct();
	void ExecuteUbergraph_WI_ShopItemDetailsV2(int32 EntryPoint);
	void OnLoaded_C452177546D4B46DC28AF4AF3442232C(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void SetDescription();
	void SetPropertiesFromTagStacks(TArray<struct FGameplayTagStack>& Shop_Item_View_Model_Gameplay_Tag_Stacks);
	void SetVisibilityBasedOnValidItem(const class UObject* Object);
	void Update_Details(class UWI_ShopItemEntryV2_C* ShopItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopItemDetailsV2_C">();
	}
	static class UWI_ShopItemDetailsV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopItemDetailsV2_C>();
	}
};
static_assert(alignof(UWI_ShopItemDetailsV2_C) == 0x000008, "Wrong alignment on UWI_ShopItemDetailsV2_C");
static_assert(sizeof(UWI_ShopItemDetailsV2_C) == 0x000348, "Wrong size on UWI_ShopItemDetailsV2_C");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopItemDetailsV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, Update) == 0x0002E8, "Member 'UWI_ShopItemDetailsV2_C::Update' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, ImageIcon) == 0x0002F0, "Member 'UWI_ShopItemDetailsV2_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, TextDecription) == 0x0002F8, "Member 'UWI_ShopItemDetailsV2_C::TextDecription' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, TextTitle) == 0x000300, "Member 'UWI_ShopItemDetailsV2_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WI_HorizontalDivider_Dashed) == 0x000308, "Member 'UWI_ShopItemDetailsV2_C::WI_HorizontalDivider_Dashed' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WI_HorizontalDivider_Dashed_1) == 0x000310, "Member 'UWI_ShopItemDetailsV2_C::WI_HorizontalDivider_Dashed_1' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WI_ShopItemBuffDetailsPlaceholder) == 0x000318, "Member 'UWI_ShopItemDetailsV2_C::WI_ShopItemBuffDetailsPlaceholder' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WI_ShopItemPropertyDetailsPlaceholder1) == 0x000320, "Member 'UWI_ShopItemDetailsV2_C::WI_ShopItemPropertyDetailsPlaceholder1' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WI_ShopItemPropertyDetailsPlaceholder2) == 0x000328, "Member 'UWI_ShopItemDetailsV2_C::WI_ShopItemPropertyDetailsPlaceholder2' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WrapBoxPropertyBuffsDetails) == 0x000330, "Member 'UWI_ShopItemDetailsV2_C::WrapBoxPropertyBuffsDetails' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, WrapBoxPropertyDetails) == 0x000338, "Member 'UWI_ShopItemDetailsV2_C::WrapBoxPropertyDetails' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemDetailsV2_C, CurrentItemDefinition) == 0x000340, "Member 'UWI_ShopItemDetailsV2_C::CurrentItemDefinition' has a wrong offset!");

}

