#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team_HouseEssentialsList

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_TeamStatusBar_Team_HouseEssentialsList.WI_TeamStatusBar_Team_HouseEssentialsList_C.ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList
// 0x0008 (0x0008 - 0x0000)
struct WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList) == 0x000004, "Wrong alignment on WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList");
static_assert(sizeof(WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList) == 0x000008, "Wrong size on WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList, EntryPoint) == 0x000000, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_TeamStatusBar_Team_HouseEssentialsList.WI_TeamStatusBar_Team_HouseEssentialsList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct) == 0x000001, "Wrong alignment on WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct");
static_assert(sizeof(WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct) == 0x000001, "Wrong size on WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_TeamStatusBar_Team_HouseEssentialsList.WI_TeamStatusBar_Team_HouseEssentialsList_C.UpdateInnerBackground
// 0x0048 (0x0048 - 0x0000)
struct WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground final
{
public:
	ETeamType                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground");
static_assert(sizeof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground) == 0x000048, "Wrong size on WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground, Temp_byte_Variable) == 0x000000, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground, K2Node_Select_Default) == 0x000008, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground, K2Node_DynamicCast_AsTexture_2D) == 0x000038, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateInnerBackground::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_TeamStatusBar_Team_HouseEssentialsList.WI_TeamStatusBar_Team_HouseEssentialsList_C.UpdateSpawnedWidgets
// 0x0108 (0x0108 - 0x0000)
struct WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0010(0x0058)(ConstParm)
	struct FHouseEssentialId                      K2Node_MakeStruct_HouseEssentialId;                // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHouseEssentialId                      K2Node_MakeStruct_HouseEssentialId_1;              // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C* CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C* CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C* CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C* CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets");
static_assert(sizeof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets) == 0x000108, "Wrong size on WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Array_Index_Variable_1) == 0x000004, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Variable) == 0x000008, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000010, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, K2Node_MakeStruct_HouseEssentialId) == 0x000068, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::K2Node_MakeStruct_HouseEssentialId' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, K2Node_MakeStruct_HouseEssentialId_1) == 0x00007C, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::K2Node_MakeStruct_HouseEssentialId_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Array_Index_Variable_2) == 0x00008C, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue_2) == 0x000094, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, K2Node_MathExpression_ReturnValue) == 0x000098, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00009C, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00009D, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x00009E, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue_3) == 0x0000A8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000AC, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Max_ReturnValue) == 0x0000B0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue_4) == 0x0000C4, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000D4, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, Temp_int_Loop_Counter_Variable_2) == 0x0000DC, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Get_Item_2) == 0x0000E0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000EC, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Length_ReturnValue_5) == 0x0000F0, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'WI_TeamStatusBar_Team_HouseEssentialsList_C_UpdateSpawnedWidgets::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

