#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TopBar_RightSection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TopBar_RightSection.WI_TopBar_RightSection_C
// 0x0048 (0x0328 - 0x02E0)
class UWI_TopBar_RightSection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPButton_C*                         GiveFeedbackButton;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        PartySlot1;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        PartySlot2;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        PartySlot3;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        PartySlot4;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SettingsButton_C*                   SettingsButton;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SocialsButton_C*                    ToggleSocialsButton;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Currencies_C*                       WI_Currencies;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_TopBar_RightSection(int32 EntryPoint);
	void GetLocalPlayerPartySlotWidget(class UWI_PartySlot_C** LocalPlayerPartySlotWidget);
	void GetRemotePlayerPartySlotWidgets(TArray<class UWI_PartySlot_C*>* RemotePlayerPartySlotWidgets);
	void OnInitialized();
	void OnLoggedIn_4A819B5B43F1DCA28E02769EC6EEC618();
	void UpdatePlayerLevel();
	void UpdatePlayerName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TopBar_RightSection_C">();
	}
	static class UWI_TopBar_RightSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TopBar_RightSection_C>();
	}
};
static_assert(alignof(UWI_TopBar_RightSection_C) == 0x000008, "Wrong alignment on UWI_TopBar_RightSection_C");
static_assert(sizeof(UWI_TopBar_RightSection_C) == 0x000328, "Wrong size on UWI_TopBar_RightSection_C");
static_assert(offsetof(UWI_TopBar_RightSection_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_TopBar_RightSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, GiveFeedbackButton) == 0x0002E8, "Member 'UWI_TopBar_RightSection_C::GiveFeedbackButton' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, PartySlot1) == 0x0002F0, "Member 'UWI_TopBar_RightSection_C::PartySlot1' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, PartySlot2) == 0x0002F8, "Member 'UWI_TopBar_RightSection_C::PartySlot2' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, PartySlot3) == 0x000300, "Member 'UWI_TopBar_RightSection_C::PartySlot3' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, PartySlot4) == 0x000308, "Member 'UWI_TopBar_RightSection_C::PartySlot4' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, SettingsButton) == 0x000310, "Member 'UWI_TopBar_RightSection_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, ToggleSocialsButton) == 0x000318, "Member 'UWI_TopBar_RightSection_C::ToggleSocialsButton' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_RightSection_C, WI_Currencies) == 0x000320, "Member 'UWI_TopBar_RightSection_C::WI_Currencies' has a wrong offset!");

}

