#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TopBar_RootMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_TopBar_RootMenu.WI_TopBar_RootMenu_C.GetJPTabs
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RootMenu_C_GetJPTabs final
{
public:
	class UWI_JPHorizontalTabList_C*              JPTabs;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RootMenu_C_GetJPTabs) == 0x000008, "Wrong alignment on WI_TopBar_RootMenu_C_GetJPTabs");
static_assert(sizeof(WI_TopBar_RootMenu_C_GetJPTabs) == 0x000008, "Wrong size on WI_TopBar_RootMenu_C_GetJPTabs");
static_assert(offsetof(WI_TopBar_RootMenu_C_GetJPTabs, JPTabs) == 0x000000, "Member 'WI_TopBar_RootMenu_C_GetJPTabs::JPTabs' has a wrong offset!");

// Function WI_TopBar_RootMenu.WI_TopBar_RootMenu_C.GetSettingsButton
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RootMenu_C_GetSettingsButton final
{
public:
	class UWI_SettingsButton_C*                   SettingsButton;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RootMenu_C_GetSettingsButton) == 0x000008, "Wrong alignment on WI_TopBar_RootMenu_C_GetSettingsButton");
static_assert(sizeof(WI_TopBar_RootMenu_C_GetSettingsButton) == 0x000008, "Wrong size on WI_TopBar_RootMenu_C_GetSettingsButton");
static_assert(offsetof(WI_TopBar_RootMenu_C_GetSettingsButton, SettingsButton) == 0x000000, "Member 'WI_TopBar_RootMenu_C_GetSettingsButton::SettingsButton' has a wrong offset!");

// Function WI_TopBar_RootMenu.WI_TopBar_RootMenu_C.PlayAnimateIn
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RootMenu_C_PlayAnimateIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RootMenu_C_PlayAnimateIn) == 0x000008, "Wrong alignment on WI_TopBar_RootMenu_C_PlayAnimateIn");
static_assert(sizeof(WI_TopBar_RootMenu_C_PlayAnimateIn) == 0x000008, "Wrong size on WI_TopBar_RootMenu_C_PlayAnimateIn");
static_assert(offsetof(WI_TopBar_RootMenu_C_PlayAnimateIn, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WI_TopBar_RootMenu_C_PlayAnimateIn::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_TopBar_RootMenu.WI_TopBar_RootMenu_C.PlayAnimateOut
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RootMenu_C_PlayAnimateOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RootMenu_C_PlayAnimateOut) == 0x000008, "Wrong alignment on WI_TopBar_RootMenu_C_PlayAnimateOut");
static_assert(sizeof(WI_TopBar_RootMenu_C_PlayAnimateOut) == 0x000008, "Wrong size on WI_TopBar_RootMenu_C_PlayAnimateOut");
static_assert(offsetof(WI_TopBar_RootMenu_C_PlayAnimateOut, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WI_TopBar_RootMenu_C_PlayAnimateOut::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

