#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TimeOfDay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_TimeOfDay_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TimeOfDay.WI_TimeOfDay_C
// 0x00A8 (0x0388 - 0x02E0)
class UWI_TimeOfDay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IncomingResources;                                 // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IncomingMoney;                                     // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Indicator;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InnerShadowOverlay;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TimeOfDay;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_MoneyIncome_C*                      WI_MoneyIncome;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_MoneyIncomeNotification_C*          WI_NewMoneyIncome;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ResourceIncome_C*                   WI_NewResourceIncome;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ResourceIncome_C*                   WI_ResourceIncome;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ADowntimeManager_C*                     DowntimeManager;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DurationMax;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RotationAnimationTimer;                            // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DurationTimer;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        NewMoneyAmount;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewResourcesAmount;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateRotationTimer;                               // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Display_Time_of_Day_Message();
	void ExecuteUbergraph_WI_TimeOfDay(int32 EntryPoint);
	void On_Duration_Timer_Elapsed();
	void OnIncomingMoneyAnimationFinished();
	void OnIncomingResourcesAnimationFinished();
	void OnInitialized();
	void OnMoneyChangedHandler(double DeltaAmount, double NewAmount);
	void OnNotificationUpdated(double DeltaAmount, double NewAmount);
	void OnResourcesChangedHandler(double DeltaAmount, double NewAmount);
	void Start_Updating_Image_Rotation();
	void Update_Objects(E_TimeOfDay TimeOfDay_0, double Duration_0);
	void Update_Rotation();
	void UpdateImageProperties();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TimeOfDay_C">();
	}
	static class UWI_TimeOfDay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TimeOfDay_C>();
	}
};
static_assert(alignof(UWI_TimeOfDay_C) == 0x000008, "Wrong alignment on UWI_TimeOfDay_C");
static_assert(sizeof(UWI_TimeOfDay_C) == 0x000388, "Wrong size on UWI_TimeOfDay_C");
static_assert(offsetof(UWI_TimeOfDay_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_TimeOfDay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, IncomingResources) == 0x0002E8, "Member 'UWI_TimeOfDay_C::IncomingResources' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, IncomingMoney) == 0x0002F0, "Member 'UWI_TimeOfDay_C::IncomingMoney' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Image_BG) == 0x0002F8, "Member 'UWI_TimeOfDay_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Image_Border) == 0x000300, "Member 'UWI_TimeOfDay_C::Image_Border' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Image_Indicator) == 0x000308, "Member 'UWI_TimeOfDay_C::Image_Indicator' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Image_InnerShadowOverlay) == 0x000310, "Member 'UWI_TimeOfDay_C::Image_InnerShadowOverlay' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Image_TimeOfDay) == 0x000318, "Member 'UWI_TimeOfDay_C::Image_TimeOfDay' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, WI_MoneyIncome) == 0x000320, "Member 'UWI_TimeOfDay_C::WI_MoneyIncome' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, WI_NewMoneyIncome) == 0x000328, "Member 'UWI_TimeOfDay_C::WI_NewMoneyIncome' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, WI_NewResourceIncome) == 0x000330, "Member 'UWI_TimeOfDay_C::WI_NewResourceIncome' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, WI_ResourceIncome) == 0x000338, "Member 'UWI_TimeOfDay_C::WI_ResourceIncome' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, DowntimeManager) == 0x000340, "Member 'UWI_TimeOfDay_C::DowntimeManager' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, TimeOfDay) == 0x000348, "Member 'UWI_TimeOfDay_C::TimeOfDay' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, Duration) == 0x000350, "Member 'UWI_TimeOfDay_C::Duration' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, DurationMax) == 0x000358, "Member 'UWI_TimeOfDay_C::DurationMax' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, RotationAnimationTimer) == 0x000360, "Member 'UWI_TimeOfDay_C::RotationAnimationTimer' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, DurationTimer) == 0x000368, "Member 'UWI_TimeOfDay_C::DurationTimer' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, NewMoneyAmount) == 0x000370, "Member 'UWI_TimeOfDay_C::NewMoneyAmount' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, NewResourcesAmount) == 0x000378, "Member 'UWI_TimeOfDay_C::NewResourcesAmount' has a wrong offset!");
static_assert(offsetof(UWI_TimeOfDay_C, UpdateRotationTimer) == 0x000380, "Member 'UWI_TimeOfDay_C::UpdateRotationTimer' has a wrong offset!");

}

