#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team_HouseEssentialsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamStatusBar_Team_HouseEssentialsList.WI_TeamStatusBar_Team_HouseEssentialsList_C
// 0x0098 (0x04C8 - 0x0430)
class UWI_TeamStatusBar_Team_HouseEssentialsList_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HouseEssentials_HorizontalBox;                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InnerBackground_HouseEssentials;                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETeamType                                     Team;                                              // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count_House_Essentials;                            // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHouseEssentialId>              Destroyed_House_Essentials;                        // 0x0450(0x0010)(Edit, BlueprintVisible)
	TArray<class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C*> Spawned_Widgets;                                   // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSoftObjectPtr<class UTexture2D>              Blue_Team_Inner_Background;                        // 0x0470(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Red_Team_Inner_Background;                         // 0x0498(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 EntryWidgetClass;                                  // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_TeamStatusBar_Team_HouseEssentialsList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update();
	void UpdateInnerBackground();
	void UpdateSpawnedWidgets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamStatusBar_Team_HouseEssentialsList_C">();
	}
	static class UWI_TeamStatusBar_Team_HouseEssentialsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamStatusBar_Team_HouseEssentialsList_C>();
	}
};
static_assert(alignof(UWI_TeamStatusBar_Team_HouseEssentialsList_C) == 0x000008, "Wrong alignment on UWI_TeamStatusBar_Team_HouseEssentialsList_C");
static_assert(sizeof(UWI_TeamStatusBar_Team_HouseEssentialsList_C) == 0x0004C8, "Wrong size on UWI_TeamStatusBar_Team_HouseEssentialsList_C");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, UberGraphFrame) == 0x000430, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, HouseEssentials_HorizontalBox) == 0x000438, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::HouseEssentials_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, InnerBackground_HouseEssentials) == 0x000440, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::InnerBackground_HouseEssentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Team) == 0x000448, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Team' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Count_House_Essentials) == 0x00044C, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Count_House_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Destroyed_House_Essentials) == 0x000450, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Spawned_Widgets) == 0x000460, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Spawned_Widgets' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Blue_Team_Inner_Background) == 0x000470, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Blue_Team_Inner_Background' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, Red_Team_Inner_Background) == 0x000498, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::Red_Team_Inner_Background' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_HouseEssentialsList_C, EntryWidgetClass) == 0x0004C0, "Member 'UWI_TeamStatusBar_Team_HouseEssentialsList_C::EntryWidgetClass' has a wrong offset!");

}

