#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamIncome

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamIncome.WI_TeamIncome_C
// 0x00D8 (0x03B8 - 0x02E0)
class UWI_TeamIncome_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IncomeIncreasedAnim;                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ImageSizeBox;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Layout;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           PayloadChannel;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor;                                         // 0x0318(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ImageIconTexture;                                  // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateColor                            ImageSize;                                         // 0x0358(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SizeOverride;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreConstructDebugValue;                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                IconPadding;                                       // 0x0384(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAmountChanged;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        AmountNotificationThreshold;                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentAmount;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool DoesNewResourceBelongToLocalPlayer(const struct FResourcePayload& ResourcePayload);
	void ExecuteUbergraph_WI_TeamIncome(int32 EntryPoint);
	void OnAmountChanged__DelegateSignature(double DeltaAmount, double NewAmount);
	void OnEnded_D29B951C489B88C85710B78966E234F8();
	void OnHandlePayload(const struct FResourcePayload& NewPayload);
	void OnIncomeNotify(double DeltaAmount, double NewAmount);
	void OnInitialized();
	void OnMessageReceived_8084A20A4CC5B5559F0BA2B94C5CB89C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnStarted_95F2331447D8552E3B50AB8F01A7CB14();
	void PlayIncomeAnimation(double NewAmount);
	void PreConstruct(bool IsDesignTime);
	void SetDisplayValue(double Value);
	void SetText(int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamIncome_C">();
	}
	static class UWI_TeamIncome_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamIncome_C>();
	}
};
static_assert(alignof(UWI_TeamIncome_C) == 0x000008, "Wrong alignment on UWI_TeamIncome_C");
static_assert(sizeof(UWI_TeamIncome_C) == 0x0003B8, "Wrong size on UWI_TeamIncome_C");
static_assert(offsetof(UWI_TeamIncome_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_TeamIncome_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, IncomeIncreasedAnim) == 0x0002E8, "Member 'UWI_TeamIncome_C::IncomeIncreasedAnim' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, ImageIcon) == 0x0002F0, "Member 'UWI_TeamIncome_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, ImageSizeBox) == 0x0002F8, "Member 'UWI_TeamIncome_C::ImageSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, Layout) == 0x000300, "Member 'UWI_TeamIncome_C::Layout' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, Text) == 0x000308, "Member 'UWI_TeamIncome_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, PayloadChannel) == 0x000310, "Member 'UWI_TeamIncome_C::PayloadChannel' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, TextColor) == 0x000318, "Member 'UWI_TeamIncome_C::TextColor' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, ImageIconTexture) == 0x000330, "Member 'UWI_TeamIncome_C::ImageIconTexture' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, ImageSize) == 0x000358, "Member 'UWI_TeamIncome_C::ImageSize' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, SizeOverride) == 0x000370, "Member 'UWI_TeamIncome_C::SizeOverride' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, PreConstructDebugValue) == 0x000380, "Member 'UWI_TeamIncome_C::PreConstructDebugValue' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, IconPadding) == 0x000384, "Member 'UWI_TeamIncome_C::IconPadding' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, OnAmountChanged) == 0x000398, "Member 'UWI_TeamIncome_C::OnAmountChanged' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, AmountNotificationThreshold) == 0x0003A8, "Member 'UWI_TeamIncome_C::AmountNotificationThreshold' has a wrong offset!");
static_assert(offsetof(UWI_TeamIncome_C, CurrentAmount) == 0x0003B0, "Member 'UWI_TeamIncome_C::CurrentAmount' has a wrong offset!");

}

