#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team_Score

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamStatusBar_Team_Score.WI_TeamStatusBar_Team_Score_C
// 0x0070 (0x04A0 - 0x0430)
class UWI_TeamStatusBar_Team_Score_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                InnerBackground_Score;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TeamScore_C*                        TeamScoreWidget;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETeamType                                     Team;                                              // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Blue_Team_Background;                              // 0x0450(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Red_Team_Background;                               // 0x0478(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_TeamStatusBar_Team_Score(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update();
	void UpdateBackground();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamStatusBar_Team_Score_C">();
	}
	static class UWI_TeamStatusBar_Team_Score_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamStatusBar_Team_Score_C>();
	}
};
static_assert(alignof(UWI_TeamStatusBar_Team_Score_C) == 0x000008, "Wrong alignment on UWI_TeamStatusBar_Team_Score_C");
static_assert(sizeof(UWI_TeamStatusBar_Team_Score_C) == 0x0004A0, "Wrong size on UWI_TeamStatusBar_Team_Score_C");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, UberGraphFrame) == 0x000430, "Member 'UWI_TeamStatusBar_Team_Score_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, InnerBackground_Score) == 0x000438, "Member 'UWI_TeamStatusBar_Team_Score_C::InnerBackground_Score' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, TeamScoreWidget) == 0x000440, "Member 'UWI_TeamStatusBar_Team_Score_C::TeamScoreWidget' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, Team) == 0x000448, "Member 'UWI_TeamStatusBar_Team_Score_C::Team' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, Blue_Team_Background) == 0x000450, "Member 'UWI_TeamStatusBar_Team_Score_C::Blue_Team_Background' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Score_C, Red_Team_Background) == 0x000478, "Member 'UWI_TeamStatusBar_Team_Score_C::Red_Team_Background' has a wrong offset!");

}

