#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TopBar_SubMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_TopBar_SubMenu.WI_TopBar_SubMenu_C.GetBackButton
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_SubMenu_C_GetBackButton final
{
public:
	class UWI_BackButton_C*                       BackButton;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_SubMenu_C_GetBackButton) == 0x000008, "Wrong alignment on WI_TopBar_SubMenu_C_GetBackButton");
static_assert(sizeof(WI_TopBar_SubMenu_C_GetBackButton) == 0x000008, "Wrong size on WI_TopBar_SubMenu_C_GetBackButton");
static_assert(offsetof(WI_TopBar_SubMenu_C_GetBackButton, BackButton) == 0x000000, "Member 'WI_TopBar_SubMenu_C_GetBackButton::BackButton' has a wrong offset!");

// Function WI_TopBar_SubMenu.WI_TopBar_SubMenu_C.GetSettingsButton
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_SubMenu_C_GetSettingsButton final
{
public:
	class UWI_SettingsButton_C*                   SettingsButton;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_SubMenu_C_GetSettingsButton) == 0x000008, "Wrong alignment on WI_TopBar_SubMenu_C_GetSettingsButton");
static_assert(sizeof(WI_TopBar_SubMenu_C_GetSettingsButton) == 0x000008, "Wrong size on WI_TopBar_SubMenu_C_GetSettingsButton");
static_assert(offsetof(WI_TopBar_SubMenu_C_GetSettingsButton, SettingsButton) == 0x000000, "Member 'WI_TopBar_SubMenu_C_GetSettingsButton::SettingsButton' has a wrong offset!");

}

