#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TopBar_RightSection

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_GiveFeedbackButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_SettingsButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_TopBar_RightSection_C_BndEvt__WI_TopBar_RightSection_ToggleSocialsButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.ExecuteUbergraph_WI_TopBar_RightSection
// 0x0050 (0x0050 - 0x0000)
struct WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_WaitForLoggedIn*           CallFunc_WaitForLoggedIn_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          K2Node_MakeStruct_EmptyPayload;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection");
static_assert(sizeof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection) == 0x000050, "Wrong size on WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, EntryPoint) == 0x000000, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, CallFunc_WaitForLoggedIn_ReturnValue) == 0x000018, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::CallFunc_WaitForLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, K2Node_MakeStruct_EmptyPayload) == 0x000029, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::K2Node_MakeStruct_EmptyPayload' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, K2Node_ComponentBoundEvent_Button_2) == 0x000030, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000038, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'WI_TopBar_RightSection_C_ExecuteUbergraph_WI_TopBar_RightSection::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.GetLocalPlayerPartySlotWidget
// 0x0008 (0x0008 - 0x0000)
struct WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget final
{
public:
	class UWI_PartySlot_C*                        LocalPlayerPartySlotWidget;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget");
static_assert(sizeof(WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget) == 0x000008, "Wrong size on WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget");
static_assert(offsetof(WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget, LocalPlayerPartySlotWidget) == 0x000000, "Member 'WI_TopBar_RightSection_C_GetLocalPlayerPartySlotWidget::LocalPlayerPartySlotWidget' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.GetRemotePlayerPartySlotWidgets
// 0x0020 (0x0020 - 0x0000)
struct WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets final
{
public:
	TArray<class UWI_PartySlot_C*>                RemotePlayerPartySlotWidgets;                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWI_PartySlot_C*>                K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets");
static_assert(sizeof(WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets) == 0x000020, "Wrong size on WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets");
static_assert(offsetof(WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets, RemotePlayerPartySlotWidgets) == 0x000000, "Member 'WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets::RemotePlayerPartySlotWidgets' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WI_TopBar_RightSection_C_GetRemotePlayerPartySlotWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.UpdatePlayerLevel
// 0x0038 (0x0038 - 0x0000)
struct WI_TopBar_RightSection_C_UpdatePlayerLevel final
{
public:
	class UWI_PartySlot_C*                        CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsLoggedIn_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetProfileXP_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetProfileLevel_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
};
static_assert(alignof(WI_TopBar_RightSection_C_UpdatePlayerLevel) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_UpdatePlayerLevel");
static_assert(sizeof(WI_TopBar_RightSection_C_UpdatePlayerLevel) == 0x000038, "Wrong size on WI_TopBar_RightSection_C_UpdatePlayerLevel");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget) == 0x000000, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1) == 0x000008, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_K2_IsLoggedIn_ReturnValue) == 0x000010, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_K2_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_GetProfileXP_ReturnValue) == 0x000020, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_GetProfileXP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_GetProfileLevel_ReturnValue) == 0x000024, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_GetProfileLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WI_TopBar_RightSection_C_UpdatePlayerLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WI_TopBar_RightSection.WI_TopBar_RightSection_C.UpdatePlayerName
// 0x0040 (0x0040 - 0x0000)
struct WI_TopBar_RightSection_C_UpdatePlayerName final
{
public:
	class UWI_PartySlot_C*                        CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsLoggedIn_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
};
static_assert(alignof(WI_TopBar_RightSection_C_UpdatePlayerName) == 0x000008, "Wrong alignment on WI_TopBar_RightSection_C_UpdatePlayerName");
static_assert(sizeof(WI_TopBar_RightSection_C_UpdatePlayerName) == 0x000040, "Wrong size on WI_TopBar_RightSection_C_UpdatePlayerName");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget) == 0x000000, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1) == 0x000008, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget_1' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_K2_IsLoggedIn_ReturnValue) == 0x000010, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_K2_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TopBar_RightSection_C_UpdatePlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WI_TopBar_RightSection_C_UpdatePlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

