#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar

#include "Basic.hpp"

#include "S_HouseEssentialWasDamagedMessage_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_HouseEssential_structs.hpp"


namespace SDK::Params
{

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.AddDestroyedHouseEssential
// 0x0048 (0x0048 - 0x0000)
struct WI_TeamStatusBar_C_AddDestroyedHouseEssential final
{
public:
	ETeamType                                     Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHouseEssentialId                      HouseEssentialId;                                  // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHouseEssentialId>              Temp_struct_Variable;                              // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FHouseEssentialId>              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ReferenceParm)
	TArray<struct FHouseEssentialId>              K2Node_Select_Default;                             // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_C_AddDestroyedHouseEssential) == 0x000008, "Wrong alignment on WI_TeamStatusBar_C_AddDestroyedHouseEssential");
static_assert(sizeof(WI_TeamStatusBar_C_AddDestroyedHouseEssential) == 0x000048, "Wrong size on WI_TeamStatusBar_C_AddDestroyedHouseEssential");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, Team) == 0x000000, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::Team' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, HouseEssentialId) == 0x000004, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::HouseEssentialId' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, Temp_byte_Variable) == 0x00000C, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, Temp_struct_Variable) == 0x000010, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, Temp_struct_Variable_1) == 0x000020, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, K2Node_Select_Default) == 0x000030, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_AddDestroyedHouseEssential, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'WI_TeamStatusBar_C_AddDestroyedHouseEssential::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.ClearDestroyedHouseEssentials
// 0x0018 (0x0018 - 0x0000)
struct WI_TeamStatusBar_C_ClearDestroyedHouseEssentials final
{
public:
	ETeamType                                     Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHouseEssentialId>              CallFunc_GetDestroyedHouseEssentials_Destroyed_House_Essentials; // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WI_TeamStatusBar_C_ClearDestroyedHouseEssentials) == 0x000008, "Wrong alignment on WI_TeamStatusBar_C_ClearDestroyedHouseEssentials");
static_assert(sizeof(WI_TeamStatusBar_C_ClearDestroyedHouseEssentials) == 0x000018, "Wrong size on WI_TeamStatusBar_C_ClearDestroyedHouseEssentials");
static_assert(offsetof(WI_TeamStatusBar_C_ClearDestroyedHouseEssentials, Team) == 0x000000, "Member 'WI_TeamStatusBar_C_ClearDestroyedHouseEssentials::Team' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ClearDestroyedHouseEssentials, CallFunc_GetDestroyedHouseEssentials_Destroyed_House_Essentials) == 0x000008, "Member 'WI_TeamStatusBar_C_ClearDestroyedHouseEssentials::CallFunc_GetDestroyedHouseEssentials_Destroyed_House_Essentials' has a wrong offset!");

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.ExecuteUbergraph_WI_TeamStatusBar
// 0x0580 (0x0580 - 0x0000)
struct WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HouseEssentialWasDamagedMessage     Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HouseEssentialWasDamagedMessage     Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_TeamStatusBar_Team_C*               Temp_object_Variable_2;                            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerStateJPFullyReplicatedMessage   Temp_struct_Variable_3;                            // 0x00B8(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackPlayerState_Was_Added;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFullyReplicatedForHUD_ReturnValue;      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue_1;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* RemovedPlayerState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APlayerState*                     K2Node_CustomEvent_RemovedPlayerState;             // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0130(0x0010)()
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0148(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ReferenceParm)
	ETeamType                                     Temp_byte_Variable;                                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0010)()
	struct FHouseEssentialId                      K2Node_CustomEvent_DestroyedHouseEssentialId;      // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	ETeamType                                     K2Node_CustomEvent_TeamType;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0240(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0260(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02A8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02B8(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1; // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0320(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0330(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0340(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0388(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x03D0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03F0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0400(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               Temp_object_Variable_3;                            // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_TeamStatusBar_Team_C*               K2Node_Select_Default;                             // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_HouseEssentialsEntry_C* CallFunc_Array_Get_Item_1;                         // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetLocalPlayerTeamId_ReturnValue;         // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue_1;      // 0x0476(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0477(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               Temp_object_Variable_4;                            // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_HouseEssential_Cube_C*              K2Node_CustomEvent_DamagedHouseEssential;          // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetLocalPlayerTeamId_ReturnValue_1;       // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue_2;      // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               CallFunc_GetTeamWidget_TeamWidget;                 // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue_3;      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               CallFunc_GetTeamWidget_TeamWidget_1;               // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     Temp_byte_Variable_1;                              // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_TeamStatusBar_Team_C*               K2Node_Select_Default_1;                           // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemovePlayerState_Success;                // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D3[0x5];                                      // 0x04D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_5;                            // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x04F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name_2;                 // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerStateJPFullyReplicatedMessage   Temp_struct_Variable_5;                            // 0x0510(0x0008)(NoDestructor)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0518(0x0058)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x0574(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar) == 0x000008, "Wrong alignment on WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar");
static_assert(sizeof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar) == 0x000580, "Wrong size on WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, EntryPoint) == 0x000000, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable) == 0x000008, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable_1) == 0x000038, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable_2) == 0x000048, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable) == 0x000050, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetPayload_ReturnValue) == 0x000058, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000060, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_ProxyObject_1) == 0x000068, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_ActualChannel_1) == 0x000070, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_int_Array_Index_Variable) == 0x000084, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_int_Array_Index_Variable_1) == 0x000088, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable_1) == 0x0000A0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable_2) == 0x0000A8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000B1, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable_3) == 0x0000B8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_Event_IsDesignTime) == 0x0000C0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x0000C8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_DynamicCast_AsPlayer_State_JP) == 0x0000E0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_TrackPlayerState_Was_Added) == 0x0000E9, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_TrackPlayerState_Was_Added' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsFullyReplicatedForHUD_ReturnValue) == 0x0000EA, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsFullyReplicatedForHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetGameStateJP_Match_ReturnValue_1) == 0x000100, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetGameStateJP_Match_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_RemovedPlayerState) == 0x000118, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_RemovedPlayerState' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000120, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000130, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamID_ReturnValue) == 0x000140, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData) == 0x000148, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000190, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamTypeFromTeamId_ReturnValue) == 0x000198, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamTypeFromTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_byte_Variable) == 0x0001F8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Format_ReturnValue) == 0x000200, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_DestroyedHouseEssentialId) == 0x000210, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_DestroyedHouseEssentialId' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_TeamType) == 0x000218, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_TeamType' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_TextToString_ReturnValue) == 0x000220, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000230, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_StringToText_ReturnValue) == 0x000240, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000250, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData_2) == 0x000260, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002A8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002B8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000300, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1) == 0x000310, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000320, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000330, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData_4) == 0x000340, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeStruct_FormatArgumentData_5) == 0x000388, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeArray_Array_2) == 0x0003D0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_MakeArray_Array_3) == 0x0003E0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Format_ReturnValue_1) == 0x0003F0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Format_ReturnValue_2) == 0x000400, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000410, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000420, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Get_ClassLog_Name_name) == 0x000430, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_int_Loop_Counter_Variable_1) == 0x000440, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Less_IntInt_ReturnValue) == 0x000444, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Add_IntInt_ReturnValue_1) == 0x000448, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable_3) == 0x000450, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_Select_Default) == 0x000458, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsValid_ReturnValue_1) == 0x000460, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Array_Get_Item_1) == 0x000468, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Array_Length_ReturnValue_1) == 0x000470, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Less_IntInt_ReturnValue_1) == 0x000474, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetLocalPlayerTeamId_ReturnValue) == 0x000475, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetLocalPlayerTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamTypeFromTeamId_ReturnValue_1) == 0x000476, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamTypeFromTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000477, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000478, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable_4) == 0x000480, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_CustomEvent_DamagedHouseEssential) == 0x000488, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_CustomEvent_DamagedHouseEssential' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetLocalPlayerTeamId_ReturnValue_1) == 0x000490, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetLocalPlayerTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamID_ReturnValue_1) == 0x000491, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000492, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamTypeFromTeamId_ReturnValue_2) == 0x000493, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamTypeFromTeamId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamWidget_TeamWidget) == 0x000498, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamWidget_TeamWidget' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamTypeFromTeamId_ReturnValue_3) == 0x0004A0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamTypeFromTeamId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetTeamWidget_TeamWidget_1) == 0x0004A8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetTeamWidget_TeamWidget_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_PlayAnimationForward_ReturnValue) == 0x0004B0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_byte_Variable_1) == 0x0004B8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, K2Node_Select_Default_1) == 0x0004C0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0004C8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsValid_ReturnValue_2) == 0x0004D0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsValid_ReturnValue_3) == 0x0004D1, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_RemovePlayerState_Success) == 0x0004D2, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_RemovePlayerState_Success' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_object_Variable_5) == 0x0004D8, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Get_ClassLog_Name_name_1) == 0x0004E0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetPayload_ReturnValue_1) == 0x0004F0, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable_4) == 0x0004F4, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_Get_ClassLog_Name_name_2) == 0x000500, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_Get_ClassLog_Name_name_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, Temp_struct_Variable_5) == 0x000510, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000518, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsValid_ReturnValue_4) == 0x000570, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x000574, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar, CallFunc_IsGameplayTagValid_ReturnValue) == 0x00057C, "Member 'WI_TeamStatusBar_C_ExecuteUbergraph_WI_TeamStatusBar::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.FindNewlyDestroyedHouseEssentials
// 0x00E0 (0x00E0 - 0x0000)
struct WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials final
{
public:
	TArray<struct FHouseEssentialId>              Current_Destroyed_House_Essentials;                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FHouseEssentialId>              Previous_Destroyed_House_Essentials;               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FHouseEssentialId>              Newly_Destroyed_House_Essentials;                  // 0x0020(0x0010)(Parm, OutParm)
	TSet<struct FHouseEssentialId>                TempSet;                                           // 0x0030(0x0050)(Edit, BlueprintVisible)
	TArray<struct FHouseEssentialId>              CallFunc_Set_ToArray_Result;                       // 0x0080(0x0010)(ReferenceParm)
	TSet<struct FHouseEssentialId>                K2Node_MakeSet_Set;                                // 0x0090(0x0050)()
};
static_assert(alignof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials) == 0x000008, "Wrong alignment on WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials");
static_assert(sizeof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials) == 0x0000E0, "Wrong size on WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, Current_Destroyed_House_Essentials) == 0x000000, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::Current_Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, Previous_Destroyed_House_Essentials) == 0x000010, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::Previous_Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, Newly_Destroyed_House_Essentials) == 0x000020, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::Newly_Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, TempSet) == 0x000030, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::TempSet' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, CallFunc_Set_ToArray_Result) == 0x000080, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials, K2Node_MakeSet_Set) == 0x000090, "Member 'WI_TeamStatusBar_C_FindNewlyDestroyedHouseEssentials::K2Node_MakeSet_Set' has a wrong offset!");

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.GetDestroyedHouseEssentials
// 0x0050 (0x0050 - 0x0000)
struct WI_TeamStatusBar_C_GetDestroyedHouseEssentials final
{
public:
	ETeamType                                     Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHouseEssentialId>              Destroyed_House_Essentials;                        // 0x0008(0x0010)(Parm, OutParm)
	ETeamType                                     Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHouseEssentialId>              Temp_struct_Variable;                              // 0x0020(0x0010)(ReferenceParm)
	TArray<struct FHouseEssentialId>              Temp_struct_Variable_1;                            // 0x0030(0x0010)(ReferenceParm)
	TArray<struct FHouseEssentialId>              K2Node_Select_Default;                             // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials) == 0x000008, "Wrong alignment on WI_TeamStatusBar_C_GetDestroyedHouseEssentials");
static_assert(sizeof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials) == 0x000050, "Wrong size on WI_TeamStatusBar_C_GetDestroyedHouseEssentials");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, Team) == 0x000000, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::Team' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, Destroyed_House_Essentials) == 0x000008, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, Temp_byte_Variable) == 0x000018, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, Temp_struct_Variable) == 0x000020, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, Temp_struct_Variable_1) == 0x000030, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_C_GetDestroyedHouseEssentials, K2Node_Select_Default) == 0x000040, "Member 'WI_TeamStatusBar_C_GetDestroyedHouseEssentials::K2Node_Select_Default' has a wrong offset!");

// Function WI_TeamStatusBar.WI_TeamStatusBar_C.GetTeamWidget
// 0x0020 (0x0020 - 0x0000)
struct WI_TeamStatusBar_C_GetTeamWidget final
{
public:
