#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ToolTipImage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ToolTipImage.WI_ToolTipImage_C
// 0x0038 (0x0318 - 0x02E0)
class UWI_ToolTipImage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x02F0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ToolTipImage(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetToolTipImage(TSoftObjectPtr<class UTexture2D> Image_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ToolTipImage_C">();
	}
	static class UWI_ToolTipImage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ToolTipImage_C>();
	}
};
static_assert(alignof(UWI_ToolTipImage_C) == 0x000008, "Wrong alignment on UWI_ToolTipImage_C");
static_assert(sizeof(UWI_ToolTipImage_C) == 0x000318, "Wrong size on UWI_ToolTipImage_C");
static_assert(offsetof(UWI_ToolTipImage_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ToolTipImage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ToolTipImage_C, Image) == 0x0002E8, "Member 'UWI_ToolTipImage_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_ToolTipImage_C, Texture) == 0x0002F0, "Member 'UWI_ToolTipImage_C::Texture' has a wrong offset!");

}

