#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TabPanel

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_TabPanel.WI_TabPanel_C.ApplyViewModel
// 0x0018 (0x0018 - 0x0000)
struct WI_TabPanel_C_ApplyViewModel final
{
public:
	struct FJPTabPanelViewModel                   InViewModel;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_TabPanel_C_ApplyViewModel) == 0x000008, "Wrong alignment on WI_TabPanel_C_ApplyViewModel");
static_assert(sizeof(WI_TabPanel_C_ApplyViewModel) == 0x000018, "Wrong size on WI_TabPanel_C_ApplyViewModel");
static_assert(offsetof(WI_TabPanel_C_ApplyViewModel, InViewModel) == 0x000000, "Member 'WI_TabPanel_C_ApplyViewModel::InViewModel' has a wrong offset!");

// Function WI_TabPanel.WI_TabPanel_C.BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_TabPanel_C_BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_TabPanel.WI_TabPanel_C.BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_TabPanel_C_BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_TabPanel.WI_TabPanel_C.ExecuteUbergraph_WI_TabPanel
// 0x0038 (0x0038 - 0x0000)
struct WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJPTabPanelViewModel                   K2Node_Event_InViewModel;                          // 0x0008(0x0018)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel) == 0x000008, "Wrong alignment on WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel");
static_assert(sizeof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel) == 0x000038, "Wrong size on WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel");
static_assert(offsetof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel, EntryPoint) == 0x000000, "Member 'WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel, K2Node_Event_InViewModel) == 0x000008, "Member 'WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel::K2Node_Event_InViewModel' has a wrong offset!");
static_assert(offsetof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WI_TabPanel_C_ExecuteUbergraph_WI_TabPanel::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_TabPanel.WI_TabPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_TabPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WI_TabPanel_C_PreConstruct");
static_assert(sizeof(WI_TabPanel_C_PreConstruct) == 0x000001, "Wrong size on WI_TabPanel_C_PreConstruct");
static_assert(offsetof(WI_TabPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_TabPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

