#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamScore

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_TeamScore.WI_TeamScore_C.ExecuteUbergraph_WI_TeamScore
// 0x00C0 (0x00C0 - 0x0000)
struct WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0008(0x0058)(ConstParm)
	class UInitializationStateStarted*            CallFunc_ListenToInitializationStateStarted_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EndCondition_TeamDeathmatch_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	class ABP_EndCondition_TeamDeathmatch_C*      CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore) == 0x000008, "Wrong alignment on WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore");
static_assert(sizeof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore) == 0x0000C0, "Wrong size on WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, EntryPoint) == 0x000000, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000008, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_ListenToInitializationStateStarted_ReturnValue) == 0x000060, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_ListenToInitializationStateStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, K2Node_Event_IsDesignTime) == 0x00007C, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_GetAllActorsOfClass_OutActors) == 0x000080, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_Array_Get_Item) == 0x000090, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000099, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00009A, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000AC, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000B8, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000BC, "Member 'WI_TeamScore_C_ExecuteUbergraph_WI_TeamScore::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function WI_TeamScore.WI_TeamScore_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_TeamScore_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamScore_C_PreConstruct) == 0x000001, "Wrong alignment on WI_TeamScore_C_PreConstruct");
static_assert(sizeof(WI_TeamScore_C_PreConstruct) == 0x000001, "Wrong size on WI_TeamScore_C_PreConstruct");
static_assert(offsetof(WI_TeamScore_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_TeamScore_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_TeamScore.WI_TeamScore_C.SetScore
// 0x0080 (0x0080 - 0x0000)
struct WI_TeamScore_C_SetScore final
{
public:
	int32                                         HouseLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0018(0x0058)(ConstParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0010)()
};
static_assert(alignof(WI_TeamScore_C_SetScore) == 0x000008, "Wrong alignment on WI_TeamScore_C_SetScore");
static_assert(sizeof(WI_TeamScore_C_SetScore) == 0x000080, "Wrong size on WI_TeamScore_C_SetScore");
static_assert(offsetof(WI_TeamScore_C_SetScore, HouseLevel) == 0x000000, "Member 'WI_TeamScore_C_SetScore::HouseLevel' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetScore, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_TeamScore_C_SetScore::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetScore, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000018, "Member 'WI_TeamScore_C_SetScore::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetScore, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'WI_TeamScore_C_SetScore::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WI_TeamScore.WI_TeamScore_C.SetTeamType
// 0x0018 (0x0018 - 0x0000)
struct WI_TeamScore_C_SetTeamType final
{
public:
	ETeamType                                     TeamType_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamScore_C_SetTeamType) == 0x000008, "Wrong alignment on WI_TeamScore_C_SetTeamType");
static_assert(sizeof(WI_TeamScore_C_SetTeamType) == 0x000018, "Wrong size on WI_TeamScore_C_SetTeamType");
static_assert(offsetof(WI_TeamScore_C_SetTeamType, TeamType_0) == 0x000000, "Member 'WI_TeamScore_C_SetTeamType::TeamType_0' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetTeamType, Temp_byte_Variable) == 0x000001, "Member 'WI_TeamScore_C_SetTeamType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetTeamType, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WI_TeamScore_C_SetTeamType::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamScore_C_SetTeamType, K2Node_Select_Default) == 0x000010, "Member 'WI_TeamScore_C_SetTeamType::K2Node_Select_Default' has a wrong offset!");

}

