#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.AddPlayerState
// 0x0010 (0x0010 - 0x0000)
struct WI_TeamStatusBar_Team_C_AddPlayerState final
{
public:
	const class APlayerStateJP*                   PlayerState;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdatePlayersCount;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Was_Added;                                         // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPlayerState_Was_Added;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_AddPlayerState) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_AddPlayerState");
static_assert(sizeof(WI_TeamStatusBar_Team_C_AddPlayerState) == 0x000010, "Wrong size on WI_TeamStatusBar_Team_C_AddPlayerState");
static_assert(offsetof(WI_TeamStatusBar_Team_C_AddPlayerState, PlayerState) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_AddPlayerState::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_AddPlayerState, UpdatePlayersCount) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_AddPlayerState::UpdatePlayersCount' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_AddPlayerState, Was_Added) == 0x000009, "Member 'WI_TeamStatusBar_Team_C_AddPlayerState::Was_Added' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_AddPlayerState, CallFunc_AddPlayerState_Was_Added) == 0x00000A, "Member 'WI_TeamStatusBar_Team_C_AddPlayerState::CallFunc_AddPlayerState_Was_Added' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.ExecuteUbergraph_WI_TeamStatusBar_Team
// 0x0008 (0x0008 - 0x0000)
struct WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team) == 0x000004, "Wrong alignment on WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team");
static_assert(sizeof(WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team) == 0x000008, "Wrong size on WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team");
static_assert(offsetof(WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team, EntryPoint) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_TeamStatusBar_Team_C_ExecuteUbergraph_WI_TeamStatusBar_Team::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_TeamStatusBar_Team_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_PreConstruct) == 0x000001, "Wrong alignment on WI_TeamStatusBar_Team_C_PreConstruct");
static_assert(sizeof(WI_TeamStatusBar_Team_C_PreConstruct) == 0x000001, "Wrong size on WI_TeamStatusBar_Team_C_PreConstruct");
static_assert(offsetof(WI_TeamStatusBar_Team_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.RemovePlayerState
// 0x0010 (0x0010 - 0x0000)
struct WI_TeamStatusBar_Team_C_RemovePlayerState final
{
public:
	const class APlayerStateJP*                   PlayerState;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Update_Players_Count;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemovePlayerState_Success;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_RemovePlayerState) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_RemovePlayerState");
static_assert(sizeof(WI_TeamStatusBar_Team_C_RemovePlayerState) == 0x000010, "Wrong size on WI_TeamStatusBar_Team_C_RemovePlayerState");
static_assert(offsetof(WI_TeamStatusBar_Team_C_RemovePlayerState, PlayerState) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_RemovePlayerState::PlayerState' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_RemovePlayerState, Update_Players_Count) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_RemovePlayerState::Update_Players_Count' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_RemovePlayerState, Success) == 0x000009, "Member 'WI_TeamStatusBar_Team_C_RemovePlayerState::Success' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_RemovePlayerState, CallFunc_RemovePlayerState_Success) == 0x00000A, "Member 'WI_TeamStatusBar_Team_C_RemovePlayerState::CallFunc_RemovePlayerState_Success' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.SetPlayerStates
// 0x0010 (0x0010 - 0x0000)
struct WI_TeamStatusBar_Team_C_SetPlayerStates final
{
public:
	TArray<class APlayerStateJP*>                 PlayerStates;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_SetPlayerStates) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_SetPlayerStates");
static_assert(sizeof(WI_TeamStatusBar_Team_C_SetPlayerStates) == 0x000010, "Wrong size on WI_TeamStatusBar_Team_C_SetPlayerStates");
static_assert(offsetof(WI_TeamStatusBar_Team_C_SetPlayerStates, PlayerStates) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_SetPlayerStates::PlayerStates' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.Update HouseEssentialsList Widget
// 0x0068 (0x0068 - 0x0000)
struct WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0008(0x0058)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget");
static_assert(sizeof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget) == 0x000068, "Wrong size on WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget");
static_assert(offsetof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget, Temp_byte_Variable) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget, Temp_byte_Variable_1) == 0x000001, "Member 'WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget, Temp_bool_Variable) == 0x000060, "Member 'WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget, K2Node_Select_Default) == 0x000061, "Member 'WI_TeamStatusBar_Team_C_Update_HouseEssentialsList_Widget::K2Node_Select_Default' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.UpdateBackground
// 0x0048 (0x0048 - 0x0000)
struct WI_TeamStatusBar_Team_C_UpdateBackground final
{
public:
	ETeamType                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_UpdateBackground) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_UpdateBackground");
static_assert(sizeof(WI_TeamStatusBar_Team_C_UpdateBackground) == 0x000048, "Wrong size on WI_TeamStatusBar_Team_C_UpdateBackground");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateBackground, Temp_byte_Variable) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_UpdateBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateBackground, K2Node_Select_Default) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_UpdateBackground::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateBackground, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'WI_TeamStatusBar_Team_C_UpdateBackground::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateBackground, K2Node_DynamicCast_AsTexture_2D) == 0x000038, "Member 'WI_TeamStatusBar_Team_C_UpdateBackground::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateBackground, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WI_TeamStatusBar_Team_C_UpdateBackground::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.UpdateGlowMask
// 0x0048 (0x0048 - 0x0000)
struct WI_TeamStatusBar_Team_C_UpdateGlowMask final
{
public:
	ETeamType                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_UpdateGlowMask) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_UpdateGlowMask");
static_assert(sizeof(WI_TeamStatusBar_Team_C_UpdateGlowMask) == 0x000048, "Wrong size on WI_TeamStatusBar_Team_C_UpdateGlowMask");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateGlowMask, Temp_byte_Variable) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_UpdateGlowMask::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateGlowMask, K2Node_Select_Default) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_UpdateGlowMask::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateGlowMask, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'WI_TeamStatusBar_Team_C_UpdateGlowMask::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateGlowMask, K2Node_DynamicCast_AsTexture) == 0x000038, "Member 'WI_TeamStatusBar_Team_C_UpdateGlowMask::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateGlowMask, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WI_TeamStatusBar_Team_C_UpdateGlowMask::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.UpdatePortraitsList
// 0x0018 (0x0018 - 0x0000)
struct WI_TeamStatusBar_Team_C_UpdatePortraitsList final
{
public:
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_UpdatePortraitsList) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_UpdatePortraitsList");
static_assert(sizeof(WI_TeamStatusBar_Team_C_UpdatePortraitsList) == 0x000018, "Wrong size on WI_TeamStatusBar_Team_C_UpdatePortraitsList");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdatePortraitsList, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_UpdatePortraitsList::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdatePortraitsList, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_UpdatePortraitsList::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdatePortraitsList, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2) == 0x000010, "Member 'WI_TeamStatusBar_Team_C_UpdatePortraitsList::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.UpdateTeamResourceCount
// 0x0004 (0x0004 - 0x0000)
struct WI_TeamStatusBar_Team_C_UpdateTeamResourceCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_UpdateTeamResourceCount) == 0x000004, "Wrong alignment on WI_TeamStatusBar_Team_C_UpdateTeamResourceCount");
static_assert(sizeof(WI_TeamStatusBar_Team_C_UpdateTeamResourceCount) == 0x000004, "Wrong size on WI_TeamStatusBar_Team_C_UpdateTeamResourceCount");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateTeamResourceCount, Count) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_UpdateTeamResourceCount::Count' has a wrong offset!");

// Function WI_TeamStatusBar_Team.WI_TeamStatusBar_Team_C.UpdateWidgetDisplayOrder
// 0x0038 (0x0038 - 0x0000)
struct WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder final
{
public:
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_RemoveChild_ReturnValue_2;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_3;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_4;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_5;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder) == 0x000008, "Wrong alignment on WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder");
static_assert(sizeof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder) == 0x000038, "Wrong size on WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue) == 0x000000, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue_1) == 0x000001, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, K2Node_MakeArray_Array) == 0x000008, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue_2) == 0x000018, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, K2Node_MakeArray_Array_1) == 0x000020, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue_3) == 0x000031, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue_4) == 0x000032, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder, CallFunc_RemoveChild_ReturnValue_5) == 0x000033, "Member 'WI_TeamStatusBar_Team_C_UpdateWidgetDisplayOrder::CallFunc_RemoveChild_ReturnValue_5' has a wrong offset!");

}

