#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TopBar_BaseLayout

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TopBar_BaseLayout.WI_TopBar_BaseLayout_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_TopBar_BaseLayout_C final : public UUserWidget
{
public:
	class UNamedSlot*                             LeftSlot;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             MatchmakingVisualizer;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightSlot;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TopBar_BaseLayout_C">();
	}
	static class UWI_TopBar_BaseLayout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TopBar_BaseLayout_C>();
	}
};
static_assert(alignof(UWI_TopBar_BaseLayout_C) == 0x000008, "Wrong alignment on UWI_TopBar_BaseLayout_C");
static_assert(sizeof(UWI_TopBar_BaseLayout_C) == 0x0002F8, "Wrong size on UWI_TopBar_BaseLayout_C");
static_assert(offsetof(UWI_TopBar_BaseLayout_C, LeftSlot) == 0x0002E0, "Member 'UWI_TopBar_BaseLayout_C::LeftSlot' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_BaseLayout_C, MatchmakingVisualizer) == 0x0002E8, "Member 'UWI_TopBar_BaseLayout_C::MatchmakingVisualizer' has a wrong offset!");
static_assert(offsetof(UWI_TopBar_BaseLayout_C, RightSlot) == 0x0002F0, "Member 'UWI_TopBar_BaseLayout_C::RightSlot' has a wrong offset!");

}

