#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Tut_TutorialEndMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Tut_TutorialEndMenu.WI_Tut_TutorialEndMenu_C
// 0x0020 (0x0450 - 0x0430)
class UWI_Tut_TutorialEndMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPHeroButton_C*                     BackToMenu;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackgroundDarken;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PanelWithBlur_C*                    WI_PanelWithBlur;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WI_Tut_TutorialEndMenu_CloseGameButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_Tut_TutorialEndMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Tut_TutorialEndMenu_C">();
	}
	static class UWI_Tut_TutorialEndMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Tut_TutorialEndMenu_C>();
	}
};
static_assert(alignof(UWI_Tut_TutorialEndMenu_C) == 0x000008, "Wrong alignment on UWI_Tut_TutorialEndMenu_C");
static_assert(sizeof(UWI_Tut_TutorialEndMenu_C) == 0x000450, "Wrong size on UWI_Tut_TutorialEndMenu_C");
static_assert(offsetof(UWI_Tut_TutorialEndMenu_C, UberGraphFrame) == 0x000430, "Member 'UWI_Tut_TutorialEndMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Tut_TutorialEndMenu_C, BackToMenu) == 0x000438, "Member 'UWI_Tut_TutorialEndMenu_C::BackToMenu' has a wrong offset!");
static_assert(offsetof(UWI_Tut_TutorialEndMenu_C, ImageBackgroundDarken) == 0x000440, "Member 'UWI_Tut_TutorialEndMenu_C::ImageBackgroundDarken' has a wrong offset!");
static_assert(offsetof(UWI_Tut_TutorialEndMenu_C, WI_PanelWithBlur) == 0x000448, "Member 'UWI_Tut_TutorialEndMenu_C::WI_PanelWithBlur' has a wrong offset!");

}

