#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamStatusBar.WI_TeamStatusBar_C
// 0x0060 (0x0340 - 0x02E0)
class UWI_TeamStatusBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_TeamStatusBar_Team_C*               BlueTeam;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TeamStatusBar_Team_C*               RedTeam;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Count_House_Essentials;                            // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHouseEssentialId>              Red_Destroyed_House_Essentials;                    // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FHouseEssentialId>              Blue_Destroyed_House_Essentials;                   // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             HouseEssentialDestroyedUISound;                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayPulseAnimationOnHouseEssentialDamaged;         // 0x0328(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayBreathingAnimationOnHouseEssentialDamaged;     // 0x0329(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> AsyncActions;                                      // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddDestroyedHouseEssential(ETeamType Team, const struct FHouseEssentialId& HouseEssentialId);
	void ClearDestroyedHouseEssentials(ETeamType Team);
	void ExecuteUbergraph_WI_TeamStatusBar(int32 EntryPoint);
	void FindNewlyDestroyedHouseEssentials(TArray<struct FHouseEssentialId>& Current_Destroyed_House_Essentials, TArray<struct FHouseEssentialId>& Previous_Destroyed_House_Essentials, TArray<struct FHouseEssentialId>* Newly_Destroyed_House_Essentials);
	void GetDestroyedHouseEssentials(ETeamType Team, TArray<struct FHouseEssentialId>* Destroyed_House_Essentials);
	void GetTeamWidget(ETeamType Team, class UWI_TeamStatusBar_Team_C** TeamWidget);
	void HandleHouseEssentialDestroyed(const struct FHouseEssentialId& DestroyedHouseEssentialId, ETeamType TeamType);
	void HandleHouseEssentialWasDamaged(class ABP_HouseEssential_Cube_C* DamagedHouseEssential);
	void HandlePlayerStateRemoved(const class APlayerState* RemovedPlayerState);
	void IsHouseEssentialDestroyed(ETeamType Team, const struct FHouseEssentialId& House_Essential_Id, bool* Destroyed);
	void OnInitialized();
	void OnMessageReceived_2FA94CAD4222B03001F30E9A71F2451D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_BCF7C3E24A6DA511FB8BBB966404E0DA(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void PreConstruct(bool IsDesignTime);
	void Read_State_from_House_Essentials(TArray<struct FS_HouseEssential>& House_Essentials);
	void ReadGameState();
	void SendMessageToOwner(class ABP_HouseEssential_Cube_C* HouseEssential);
	void SetHouseEssentialsToDestroy(int32 House_Essentials_To_Destroy);
	void TrackPlayerState(class APlayerStateJP* PlayerStateJP, bool UpdatePlayersCount, bool* Was_Added);
	void Update();
	void UpdateTeam(class UWI_TeamStatusBar_Team_C* TeamWidget, TArray<struct FHouseEssentialId>& Destroyed_House_Essentials);
	void UpdateTeams();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamStatusBar_C">();
	}
	static class UWI_TeamStatusBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamStatusBar_C>();
	}
};
static_assert(alignof(UWI_TeamStatusBar_C) == 0x000008, "Wrong alignment on UWI_TeamStatusBar_C");
static_assert(sizeof(UWI_TeamStatusBar_C) == 0x000340, "Wrong size on UWI_TeamStatusBar_C");
static_assert(offsetof(UWI_TeamStatusBar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_TeamStatusBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, BlueTeam) == 0x0002E8, "Member 'UWI_TeamStatusBar_C::BlueTeam' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, RedTeam) == 0x0002F0, "Member 'UWI_TeamStatusBar_C::RedTeam' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, Count_House_Essentials) == 0x0002F8, "Member 'UWI_TeamStatusBar_C::Count_House_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, Red_Destroyed_House_Essentials) == 0x000300, "Member 'UWI_TeamStatusBar_C::Red_Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, Blue_Destroyed_House_Essentials) == 0x000310, "Member 'UWI_TeamStatusBar_C::Blue_Destroyed_House_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, HouseEssentialDestroyedUISound) == 0x000320, "Member 'UWI_TeamStatusBar_C::HouseEssentialDestroyedUISound' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, PlayPulseAnimationOnHouseEssentialDamaged) == 0x000328, "Member 'UWI_TeamStatusBar_C::PlayPulseAnimationOnHouseEssentialDamaged' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, PlayBreathingAnimationOnHouseEssentialDamaged) == 0x000329, "Member 'UWI_TeamStatusBar_C::PlayBreathingAnimationOnHouseEssentialDamaged' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_C, AsyncActions) == 0x000330, "Member 'UWI_TeamStatusBar_C::AsyncActions' has a wrong offset!");

}

