#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team_PortraitsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamStatusBar_Team_PortraitsList.WI_TeamStatusBar_Team_PortraitsList_C
// 0x0058 (0x0488 - 0x0430)
class UWI_TeamStatusBar_Team_PortraitsList_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HouseEssentials_HorizontalBox;                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETeamType                                     Team;                                              // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Players_Count;                                     // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_TeamStatusBar_Team_Portrait_C*> Spawned_Widgets;                                   // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UClass*                                 EntryWidgetClass;                                  // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 PlayerStates;                                      // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FMargin                                PortraitPadding;                                   // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           DesignPreviewNeighborId;                           // 0x0480(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void AddPlayerState(const class APlayerStateJP*& PlayerState, bool UpdatePlayersCount, bool* Was_Added);
	void Construct();
	void ExecuteUbergraph_WI_TeamStatusBar_Team_PortraitsList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshSpeakingState();
	void RemovePlayerState(const class APlayerStateJP*& PlayerState, bool Update_Players_Count, bool* Success);
	void Set_Players_Count(int32 Players_Count_0);
	void SetPlayerStates(const TArray<class APlayerStateJP*>& NewPlayerStates);
	void SetTeam(ETeamType Team_0);
	void UpdatePlayersCountToMatchPlayerStatesCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamStatusBar_Team_PortraitsList_C">();
	}
	static class UWI_TeamStatusBar_Team_PortraitsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamStatusBar_Team_PortraitsList_C>();
	}
};
static_assert(alignof(UWI_TeamStatusBar_Team_PortraitsList_C) == 0x000008, "Wrong alignment on UWI_TeamStatusBar_Team_PortraitsList_C");
static_assert(sizeof(UWI_TeamStatusBar_Team_PortraitsList_C) == 0x000488, "Wrong size on UWI_TeamStatusBar_Team_PortraitsList_C");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, UberGraphFrame) == 0x000430, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, HouseEssentials_HorizontalBox) == 0x000438, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::HouseEssentials_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, Team) == 0x000440, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::Team' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, Players_Count) == 0x000444, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::Players_Count' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, Spawned_Widgets) == 0x000448, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::Spawned_Widgets' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, EntryWidgetClass) == 0x000458, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::EntryWidgetClass' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, PlayerStates) == 0x000460, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::PlayerStates' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, PortraitPadding) == 0x000470, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::PortraitPadding' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_PortraitsList_C, DesignPreviewNeighborId) == 0x000480, "Member 'UWI_TeamStatusBar_Team_PortraitsList_C::DesignPreviewNeighborId' has a wrong offset!");

}

