#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UpgradeRoomButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.CanAffordUpgrade
// 0x0040 (0x0040 - 0x0000)
struct WI_UpgradeRoomButton_C_CanAffordUpgrade final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomyDefinition*                     CallFunc_GetNextLevelEconomyCost_EconomyCost;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_groundskeeper_C*                    CallFunc_GetGroundsKeeperBP_AsBp_Groundskeeper;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAmountOfRoomLevelsMet_Return;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAfford_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_CanAffordUpgrade) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_CanAffordUpgrade");
static_assert(sizeof(WI_UpgradeRoomButton_C_CanAffordUpgrade) == 0x000040, "Wrong size on WI_UpgradeRoomButton_C_CanAffordUpgrade");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_GetNextLevelEconomyCost_EconomyCost) == 0x000008, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_GetNextLevelEconomyCost_EconomyCost' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_GetGroundsKeeperBP_AsBp_Groundskeeper) == 0x000020, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_GetGroundsKeeperBP_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_IsAmountOfRoomLevelsMet_Return) == 0x000028, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_IsAmountOfRoomLevelsMet_Return' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000030, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_CanAfford_ReturnValue) == 0x000038, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_CanAfford_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_CanAffordUpgrade, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WI_UpgradeRoomButton_C_CanAffordUpgrade::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.ExecuteUbergraph_WI_UpgradeRoomButton
// 0x0128 (0x0128 - 0x0000)
struct WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_RoomManager_C*                      K2Node_CustomEvent_RoomManager;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ERooms, int32>                           CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel; // 0x0028(0x0050)()
	TArray<ERooms>                                CallFunc_Map_Keys_Keys;                            // 0x0078(0x0010)(ReferenceParm)
	ERooms                                        CallFunc_Array_Get_Item;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordUpgrade_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_UpgradeRoomPromptRoomEntry_C*       CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
};
static_assert(alignof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton");
static_assert(sizeof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton) == 0x000128, "Wrong size on WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, EntryPoint) == 0x000000, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, K2Node_CustomEvent_RoomManager) == 0x000020, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::K2Node_CustomEvent_RoomManager' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel) == 0x000028, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Map_Keys_Keys) == 0x000078, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Array_Get_Item) == 0x000088, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Map_Find_Value) == 0x000090, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Map_Find_ReturnValue) == 0x000094, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000098, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_CanAffordUpgrade_ReturnValue) == 0x0000A0, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_CanAffordUpgrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, K2Node_MakeArray_Array) == 0x000100, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_AddChild_ReturnValue) == 0x000110, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WI_UpgradeRoomButton_C_ExecuteUbergraph_WI_UpgradeRoomButton::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_Button_Upgrade_ColorAndOpacity
// 0x0014 (0x0014 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordUpgrade_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity) == 0x000004, "Wrong alignment on WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity) == 0x000014, "Wrong size on WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity, CallFunc_CanAffordUpgrade_ReturnValue) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_Button_Upgrade_ColorAndOpacity::CallFunc_CanAffordUpgrade_ReturnValue' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_Text_TimeRemaining
// 0x0010 (0x0010 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_Text_TimeRemaining final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_Text_TimeRemaining) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_Text_TimeRemaining");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_Text_TimeRemaining) == 0x000010, "Wrong size on WI_UpgradeRoomButton_C_Get_Text_TimeRemaining");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_Text_TimeRemaining, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_Text_TimeRemaining::ReturnValue' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_TextBlock_RoomType
// 0x01C0 (0x01C0 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_TextBlock_RoomType final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	ERooms                                        Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0058(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0068(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0078(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x0088(0x0010)()
	class FText                                   Temp_text_Variable_8;                              // 0x0098(0x0010)()
	class FText                                   Temp_text_Variable_9;                              // 0x00A8(0x0010)()
	class FText                                   Temp_text_Variable_10;                             // 0x00B8(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0128(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0158(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B0(0x0010)()
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_TextBlock_RoomType");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType) == 0x0001C0, "Wrong size on WI_UpgradeRoomButton_C_Get_TextBlock_RoomType");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_byte_Variable) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable) == 0x000018, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_1) == 0x000028, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_2) == 0x000038, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_3) == 0x000048, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_4) == 0x000058, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_5) == 0x000068, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_6) == 0x000078, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_7) == 0x000088, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_8) == 0x000098, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_9) == 0x0000A8, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, Temp_text_Variable_10) == 0x0000B8, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000C8, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, K2Node_Select_Default) == 0x0000D0, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, CallFunc_MakeLiteralText_ReturnValue) == 0x000128, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, CallFunc_Conv_TextToString_ReturnValue) == 0x000138, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, CallFunc_Conv_StringToText_ReturnValue) == 0x000148, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, K2Node_MakeStruct_FormatArgumentData_1) == 0x000158, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, K2Node_MakeArray_Array) == 0x0001A0, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextBlock_RoomType, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'WI_UpgradeRoomButton_C_Get_TextBlock_RoomType::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_TextCostTitle
// 0x00F0 (0x00F0 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_TextCostTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0010)()
	double                                        Temp_real_Variable_3;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00CC(0x0014)()
	class FText                                   K2Node_Select_Default_4;                           // 0x00E0(0x0010)()
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_TextCostTitle) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_TextCostTitle");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_TextCostTitle) == 0x0000F0, "Wrong size on WI_UpgradeRoomButton_C_Get_TextCostTitle");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_real_Variable) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_bool_Variable) == 0x000018, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_real_Variable_1) == 0x000020, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_real_Variable_2) == 0x000028, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_bool_Variable_1) == 0x000030, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_struct_Variable) == 0x000034, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_struct_Variable_1) == 0x000044, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_bool_Variable_2) == 0x000054, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_byte_Variable) == 0x000055, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_byte_Variable_1) == 0x000056, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_bool_Variable_3) == 0x000057, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_text_Variable) == 0x000058, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_text_Variable_1) == 0x000068, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_real_Variable_3) == 0x000078, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, Temp_bool_Variable_4) == 0x000080, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_Select_Default) == 0x000088, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_Select_Default_1) == 0x000090, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000A8, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_Select_Default_2) == 0x0000B8, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_Select_Default_3) == 0x0000C8, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_MakeStruct_SlateColor) == 0x0000CC, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextCostTitle, K2Node_Select_Default_4) == 0x0000E0, "Member 'WI_UpgradeRoomButton_C_Get_TextCostTitle::K2Node_Select_Default_4' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_TextMoneyCostAmount
// 0x0088 (0x0088 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0010)()
	class UEconomyDefinition*                     CallFunc_GetNextLevelEconomyCost_EconomyCost;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMoneyDisplayNameText_ReturnValue;      // 0x0058(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0078(0x0010)()
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount) == 0x000088, "Wrong size on WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, Temp_bool_Variable) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, Temp_text_Variable) == 0x000018, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, Temp_text_Variable_1) == 0x000028, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, Temp_bool_Variable_1) == 0x000038, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, Temp_text_Variable_2) == 0x000040, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, CallFunc_GetNextLevelEconomyCost_EconomyCost) == 0x000050, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::CallFunc_GetNextLevelEconomyCost_EconomyCost' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, CallFunc_GetMoneyDisplayNameText_ReturnValue) == 0x000058, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::CallFunc_GetMoneyDisplayNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, K2Node_Select_Default) == 0x000068, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount, K2Node_Select_Default_1) == 0x000078, "Member 'WI_UpgradeRoomButton_C_Get_TextMoneyCostAmount::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_TextResourceCostAmount
// 0x0088 (0x0088 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_TextResourceCostAmount final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0010)()
	class UEconomyDefinition*                     CallFunc_GetNextLevelEconomyCost_EconomyCost;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetWoodDisplayNameText_ReturnValue;       // 0x0068(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0078(0x0010)()
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_TextResourceCostAmount");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount) == 0x000088, "Wrong size on WI_UpgradeRoomButton_C_Get_TextResourceCostAmount");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, Temp_bool_Variable) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, Temp_text_Variable) == 0x000018, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, Temp_text_Variable_1) == 0x000028, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, Temp_bool_Variable_1) == 0x000038, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, Temp_text_Variable_2) == 0x000040, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, K2Node_Select_Default) == 0x000050, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, CallFunc_GetNextLevelEconomyCost_EconomyCost) == 0x000060, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::CallFunc_GetNextLevelEconomyCost_EconomyCost' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, CallFunc_GetWoodDisplayNameText_ReturnValue) == 0x000068, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::CallFunc_GetWoodDisplayNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextResourceCostAmount, K2Node_Select_Default_1) == 0x000078, "Member 'WI_UpgradeRoomButton_C_Get_TextResourceCostAmount::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Get_TextRoomsRequired
// 0x00B8 (0x00B8 - 0x0000)
struct WI_UpgradeRoomButton_C_Get_TextRoomsRequired final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	TMap<ERooms, int32>                           CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel; // 0x0038(0x0050)()
	TArray<ERooms>                                CallFunc_Map_Keys_Keys;                            // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0010)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_Get_TextRoomsRequired");
static_assert(sizeof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired) == 0x0000B8, "Wrong size on WI_UpgradeRoomButton_C_Get_TextRoomsRequired");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_bool_Variable) == 0x000010, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_byte_Variable) == 0x000011, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_byte_Variable_1) == 0x000012, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_bool_Variable_1) == 0x000013, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_text_Variable) == 0x000018, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, Temp_text_Variable_1) == 0x000028, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel) == 0x000038, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::CallFunc_GetNextLevelRequiredRooms_RoomTypeAndLevel' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, CallFunc_Map_Keys_Keys) == 0x000088, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000098, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, K2Node_Select_Default) == 0x0000A0, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_Get_TextRoomsRequired, K2Node_Select_Default_1) == 0x0000B0, "Member 'WI_UpgradeRoomButton_C_Get_TextRoomsRequired::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.GetGroundsKeeperBP
// 0x0020 (0x0020 - 0x0000)
struct WI_UpgradeRoomButton_C_GetGroundsKeeperBP final
{
public:
	class Abp_groundskeeper_C*                    AsBp_Groundskeeper;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_GetGroundsKeeperBP");
static_assert(sizeof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP) == 0x000020, "Wrong size on WI_UpgradeRoomButton_C_GetGroundsKeeperBP");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP, AsBp_Groundskeeper) == 0x000000, "Member 'WI_UpgradeRoomButton_C_GetGroundsKeeperBP::AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000008, "Member 'WI_UpgradeRoomButton_C_GetGroundsKeeperBP::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000010, "Member 'WI_UpgradeRoomButton_C_GetGroundsKeeperBP::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetGroundsKeeperBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WI_UpgradeRoomButton_C_GetGroundsKeeperBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.GetPercent
// 0x0038 (0x0038 - 0x0000)
struct WI_UpgradeRoomButton_C_GetPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_GetPercent) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_GetPercent");
static_assert(sizeof(WI_UpgradeRoomButton_C_GetPercent) == 0x000038, "Wrong size on WI_UpgradeRoomButton_C_GetPercent");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, ReturnValue) == 0x000000, "Member 'WI_UpgradeRoomButton_C_GetPercent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000008, "Member 'WI_UpgradeRoomButton_C_GetPercent::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000010, "Member 'WI_UpgradeRoomButton_C_GetPercent::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, CallFunc_SafeDivide_ReturnValue) == 0x000018, "Member 'WI_UpgradeRoomButton_C_GetPercent::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WI_UpgradeRoomButton_C_GetPercent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000028, "Member 'WI_UpgradeRoomButton_C_GetPercent::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_GetPercent, CallFunc_SafeDivide_A_ImplicitCast) == 0x000030, "Member 'WI_UpgradeRoomButton_C_GetPercent::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.IsAmountOfRoomLevelsMet
// 0x0018 (0x0018 - 0x0000)
struct WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet final
{
public:
	class Abp_groundskeeper_C*                    GroundskeeperBP;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNextLevelHouseLevelRequirement_RoomTypeAndLevel; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet) == 0x000008, "Wrong alignment on WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet");
static_assert(sizeof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet) == 0x000018, "Wrong size on WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet");
static_assert(offsetof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet, GroundskeeperBP) == 0x000000, "Member 'WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet::GroundskeeperBP' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet, Return) == 0x000008, "Member 'WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet::Return' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet, CallFunc_GetNextLevelHouseLevelRequirement_RoomTypeAndLevel) == 0x00000C, "Member 'WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet::CallFunc_GetNextLevelHouseLevelRequirement_RoomTypeAndLevel' has a wrong offset!");
static_assert(offsetof(WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WI_UpgradeRoomButton_C_IsAmountOfRoomLevelsMet::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_UpgradeRoomButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UpgradeRoomButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_UpgradeRoomButton_C_PreConstruct");
static_assert(sizeof(WI_UpgradeRoomButton_C_PreConstruct) == 0x000001, "Wrong size on WI_UpgradeRoomButton_C_PreConstruct");
static_assert(offsetof(WI_UpgradeRoomButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_UpgradeRoomButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_UpgradeRoomButton.WI_UpgradeRoomButton_C.Set Rooms Required
// 0x0008 (0x0008 - 0x0000)
struct WI_UpgradeRoomButton_C_Set_Rooms_Required final
{
public:
