#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UIFlashEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.ExecuteUbergraph_WI_UIFlashEffect
// 0x0018 (0x0018 - 0x0000)
struct WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect) == 0x000008, "Wrong alignment on WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect");
static_assert(sizeof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect) == 0x000018, "Wrong size on WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, EntryPoint) == 0x000000, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, Temp_bool_Variable) == 0x000004, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, Temp_byte_Variable) == 0x000005, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, Temp_byte_Variable_1) == 0x000006, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect, K2Node_Select_Default) == 0x000010, "Member 'WI_UIFlashEffect_C_ExecuteUbergraph_WI_UIFlashEffect::K2Node_Select_Default' has a wrong offset!");

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.GetOrCreateDynamicMaterial
// 0x0018 (0x0018 - 0x0000)
struct WI_UIFlashEffect_C_GetOrCreateDynamicMaterial final
{
public:
	class UMaterialInstanceDynamic*               DynamicMaterial_0;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_GetOrCreateDynamicMaterial) == 0x000008, "Wrong alignment on WI_UIFlashEffect_C_GetOrCreateDynamicMaterial");
static_assert(sizeof(WI_UIFlashEffect_C_GetOrCreateDynamicMaterial) == 0x000018, "Wrong size on WI_UIFlashEffect_C_GetOrCreateDynamicMaterial");
static_assert(offsetof(WI_UIFlashEffect_C_GetOrCreateDynamicMaterial, DynamicMaterial_0) == 0x000000, "Member 'WI_UIFlashEffect_C_GetOrCreateDynamicMaterial::DynamicMaterial_0' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_GetOrCreateDynamicMaterial, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WI_UIFlashEffect_C_GetOrCreateDynamicMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_GetOrCreateDynamicMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WI_UIFlashEffect_C_GetOrCreateDynamicMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_UIFlashEffect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_PreConstruct) == 0x000001, "Wrong alignment on WI_UIFlashEffect_C_PreConstruct");
static_assert(sizeof(WI_UIFlashEffect_C_PreConstruct) == 0x000001, "Wrong size on WI_UIFlashEffect_C_PreConstruct");
static_assert(offsetof(WI_UIFlashEffect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_UIFlashEffect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.SetAccentColor
// 0x0018 (0x0018 - 0x0000)
struct WI_UIFlashEffect_C_SetAccentColor final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_SetAccentColor) == 0x000008, "Wrong alignment on WI_UIFlashEffect_C_SetAccentColor");
static_assert(sizeof(WI_UIFlashEffect_C_SetAccentColor) == 0x000018, "Wrong size on WI_UIFlashEffect_C_SetAccentColor");
static_assert(offsetof(WI_UIFlashEffect_C_SetAccentColor, Value) == 0x000000, "Member 'WI_UIFlashEffect_C_SetAccentColor::Value' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_SetAccentColor, CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial) == 0x000010, "Member 'WI_UIFlashEffect_C_SetAccentColor::CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial' has a wrong offset!");

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.SetBaseColor
// 0x0018 (0x0018 - 0x0000)
struct WI_UIFlashEffect_C_SetBaseColor final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_SetBaseColor) == 0x000008, "Wrong alignment on WI_UIFlashEffect_C_SetBaseColor");
static_assert(sizeof(WI_UIFlashEffect_C_SetBaseColor) == 0x000018, "Wrong size on WI_UIFlashEffect_C_SetBaseColor");
static_assert(offsetof(WI_UIFlashEffect_C_SetBaseColor, Value) == 0x000000, "Member 'WI_UIFlashEffect_C_SetBaseColor::Value' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_SetBaseColor, CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial) == 0x000010, "Member 'WI_UIFlashEffect_C_SetBaseColor::CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial' has a wrong offset!");

// Function WI_UIFlashEffect.WI_UIFlashEffect_C.SetRevealFraction
// 0x0010 (0x0010 - 0x0000)
struct WI_UIFlashEffect_C_SetRevealFraction final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UIFlashEffect_C_SetRevealFraction) == 0x000008, "Wrong alignment on WI_UIFlashEffect_C_SetRevealFraction");
static_assert(sizeof(WI_UIFlashEffect_C_SetRevealFraction) == 0x000010, "Wrong size on WI_UIFlashEffect_C_SetRevealFraction");
static_assert(offsetof(WI_UIFlashEffect_C_SetRevealFraction, Value) == 0x000000, "Member 'WI_UIFlashEffect_C_SetRevealFraction::Value' has a wrong offset!");
static_assert(offsetof(WI_UIFlashEffect_C_SetRevealFraction, CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial) == 0x000008, "Member 'WI_UIFlashEffect_C_SetRevealFraction::CallFunc_GetOrCreateDynamicMaterial_DynamicMaterial' has a wrong offset!");

}

