#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UnlockConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_UnlockConfirmation.WI_UnlockConfirmation_C
// 0x0060 (0x0490 - 0x0430)
class UWI_UnlockConfirmation_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ButtonsContainer;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         CancelButton;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         ConfirmButton;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PromptText;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_RarityButton_C*                     RarityButton;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Currencies_C*                       WI_Currencies;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCancel;                                          // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTag                           PreviewAssetID;                                    // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddButtons(const TArray<struct FOnlineStoreItemCost>& Costs);
	void BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_UnlockConfirmation(int32 EntryPoint);
	void OnCancel__DelegateSignature();
	void OnConfirm__DelegateSignature();
	void OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void SetConfirmButtonInfo(const struct FOnlineStoreItemCost& StoreItemCost);
	void SetIcon(class UPlayerRewardDataAsset* PlayerRewardDataAsset);
	void SetInfo(const struct FOnlineStoreItemData& StoreItemData);
	void SetPromptText(const class FText& ItemName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_UnlockConfirmation_C">();
	}
	static class UWI_UnlockConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_UnlockConfirmation_C>();
	}
};
static_assert(alignof(UWI_UnlockConfirmation_C) == 0x000008, "Wrong alignment on UWI_UnlockConfirmation_C");
static_assert(sizeof(UWI_UnlockConfirmation_C) == 0x000490, "Wrong size on UWI_UnlockConfirmation_C");
static_assert(offsetof(UWI_UnlockConfirmation_C, UberGraphFrame) == 0x000430, "Member 'UWI_UnlockConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, ButtonsContainer) == 0x000438, "Member 'UWI_UnlockConfirmation_C::ButtonsContainer' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, CancelButton) == 0x000440, "Member 'UWI_UnlockConfirmation_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, ConfirmButton) == 0x000448, "Member 'UWI_UnlockConfirmation_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, PromptText) == 0x000450, "Member 'UWI_UnlockConfirmation_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, RarityButton) == 0x000458, "Member 'UWI_UnlockConfirmation_C::RarityButton' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, WI_Currencies) == 0x000460, "Member 'UWI_UnlockConfirmation_C::WI_Currencies' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, OnCancel) == 0x000468, "Member 'UWI_UnlockConfirmation_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, OnConfirm) == 0x000478, "Member 'UWI_UnlockConfirmation_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWI_UnlockConfirmation_C, PreviewAssetID) == 0x000488, "Member 'UWI_UnlockConfirmation_C::PreviewAssetID' has a wrong offset!");

}

