#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_VoiceChat

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_VoiceChatTeamGameplayMessage_structs.hpp"
#include "S_VoiceChatGameplayMessage_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_VoiceChat.WI_VoiceChat_C.ExecuteUbergraph_WI_VoiceChat
// 0x00B0 (0x00B0 - 0x0000)
struct WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_VoiceChatGameplayMessage            Temp_struct_Variable;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_VoiceChatGameplayMessage            Temp_struct_Variable_1;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_VoiceChatTeamGameplayMessage        Temp_struct_Variable_3;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FS_VoiceChatTeamGameplayMessage        Temp_struct_Variable_4;                            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat) == 0x000008, "Wrong alignment on WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat");
static_assert(sizeof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat) == 0x0000B0, "Wrong size on WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, EntryPoint) == 0x000000, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable) == 0x000004, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CustomEvent_ProxyObject_1) == 0x000008, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CustomEvent_ActualChannel_1) == 0x000010, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable_1) == 0x000028, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable_2) == 0x00002C, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_object_Variable) == 0x000038, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_GetPayload_ReturnValue) == 0x000040, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000048, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable_3) == 0x000050, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CustomEvent_ProxyObject) == 0x000068, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_CustomEvent_ActualChannel) == 0x000070, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable_4) == 0x000078, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_struct_Variable_5) == 0x00007C, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_object_Variable_1) == 0x000088, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_GetPayload_ReturnValue_1) == 0x000090, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000098, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_bool_Variable) == 0x0000A0, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_byte_Variable) == 0x0000A2, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_byte_Variable_1) == 0x0000A3, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_bool_Variable_1) == 0x0000A4, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_Select_Default) == 0x0000A5, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_byte_Variable_2) == 0x0000A6, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, Temp_byte_Variable_3) == 0x0000A7, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat, K2Node_Select_Default_1) == 0x0000A8, "Member 'WI_VoiceChat_C_ExecuteUbergraph_WI_VoiceChat::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_VoiceChat.WI_VoiceChat_C.OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9
// 0x0010 (0x0010 - 0x0000)
struct WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9) == 0x000008, "Wrong alignment on WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9");
static_assert(sizeof(WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9) == 0x000010, "Wrong size on WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9");
static_assert(offsetof(WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9, ProxyObject) == 0x000000, "Member 'WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9, ActualChannel) == 0x000008, "Member 'WI_VoiceChat_C_OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9::ActualChannel' has a wrong offset!");

// Function WI_VoiceChat.WI_VoiceChat_C.OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A
// 0x0010 (0x0010 - 0x0000)
struct WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A) == 0x000008, "Wrong alignment on WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A");
static_assert(sizeof(WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A) == 0x000010, "Wrong size on WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A");
static_assert(offsetof(WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A, ProxyObject) == 0x000000, "Member 'WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A, ActualChannel) == 0x000008, "Member 'WI_VoiceChat_C_OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A::ActualChannel' has a wrong offset!");

}

