#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Vignette

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_Vignette.WI_Vignette_C.GetColorAndOpacity_0
// 0x0068 (0x0068 - 0x0000)
struct WI_Vignette_C_GetColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Vignette_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on WI_Vignette_C_GetColorAndOpacity_0");
static_assert(sizeof(WI_Vignette_C_GetColorAndOpacity_0) == 0x000068, "Wrong size on WI_Vignette_C_GetColorAndOpacity_0");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WI_Vignette_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000018, "Member 'WI_Vignette_C_GetColorAndOpacity_0::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WI_Vignette_C_GetColorAndOpacity_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000024, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'WI_Vignette_C_GetColorAndOpacity_0::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, K2Node_MakeStruct_LinearColor) == 0x000050, "Member 'WI_Vignette_C_GetColorAndOpacity_0::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WI_Vignette_C_GetColorAndOpacity_0, K2Node_MakeStruct_A_ImplicitCast) == 0x000060, "Member 'WI_Vignette_C_GetColorAndOpacity_0::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

}

