#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WinscreenEmotes

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_WinscreenEmotes.WI_WinscreenEmotes_C.ExecuteUbergraph_WI_WinscreenEmotes
// 0x00C8 (0x00C8 - 0x0000)
struct WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnWinningTeam_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0010)()
	bool                                          CallFunc_IsOnWinningTeam_ReturnValue_1;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0084(0x0014)()
	bool                                          CallFunc_IsOnWinningTeam_ReturnValue_2;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x00A0(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes) == 0x000008, "Wrong alignment on WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes");
static_assert(sizeof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes) == 0x0000C8, "Wrong size on WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, EntryPoint) == 0x000000, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_bool_Variable) == 0x000020, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_text_Variable) == 0x000028, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_text_Variable_1) == 0x000038, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_bool_Variable_1) == 0x000048, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_bool_Variable_2) == 0x000049, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_CustomEvent_Loaded) == 0x000050, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, Temp_object_Variable) == 0x000058, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_DynamicCast_AsTexture_2D) == 0x000060, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, CallFunc_IsOnWinningTeam_ReturnValue) == 0x000069, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::CallFunc_IsOnWinningTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_Select_Default) == 0x000070, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, CallFunc_IsOnWinningTeam_ReturnValue_1) == 0x000080, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::CallFunc_IsOnWinningTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_Select_Default_1) == 0x000084, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, CallFunc_IsOnWinningTeam_ReturnValue_2) == 0x000098, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::CallFunc_IsOnWinningTeam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes, K2Node_Select_Default_2) == 0x0000A0, "Member 'WI_WinscreenEmotes_C_ExecuteUbergraph_WI_WinscreenEmotes::K2Node_Select_Default_2' has a wrong offset!");

// Function WI_WinscreenEmotes.WI_WinscreenEmotes_C.OnLoaded_2F9F62B249262153A599A9AFA434E9E4
// 0x0008 (0x0008 - 0x0000)
struct WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4) == 0x000008, "Wrong alignment on WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4");
static_assert(sizeof(WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4) == 0x000008, "Wrong size on WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4");
static_assert(offsetof(WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4, Loaded) == 0x000000, "Member 'WI_WinscreenEmotes_C_OnLoaded_2F9F62B249262153A599A9AFA434E9E4::Loaded' has a wrong offset!");

}

