#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WinScreen_MatchInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_WinScreen_MatchInfo.WI_WinScreen_MatchInfo_C
// 0x0018 (0x0320 - 0x0308)
class UWI_WinScreen_MatchInfo_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                CommonNumericTextBlock_333;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MapText;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_WinScreen_MatchInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_WinScreen_MatchInfo_C">();
	}
	static class UWI_WinScreen_MatchInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_WinScreen_MatchInfo_C>();
	}
};
static_assert(alignof(UWI_WinScreen_MatchInfo_C) == 0x000008, "Wrong alignment on UWI_WinScreen_MatchInfo_C");
static_assert(sizeof(UWI_WinScreen_MatchInfo_C) == 0x000320, "Wrong size on UWI_WinScreen_MatchInfo_C");
static_assert(offsetof(UWI_WinScreen_MatchInfo_C, UberGraphFrame) == 0x000308, "Member 'UWI_WinScreen_MatchInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_WinScreen_MatchInfo_C, CommonNumericTextBlock_333) == 0x000310, "Member 'UWI_WinScreen_MatchInfo_C::CommonNumericTextBlock_333' has a wrong offset!");
static_assert(offsetof(UWI_WinScreen_MatchInfo_C, MapText) == 0x000318, "Member 'UWI_WinScreen_MatchInfo_C::MapText' has a wrong offset!");

}

