#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WinScreen_MatchInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_WinScreen_MatchInfo.WI_WinScreen_MatchInfo_C.ExecuteUbergraph_WI_WinScreen_MatchInfo
// 0x0040 (0x0040 - 0x0000)
struct WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP*                           CallFunc_GetGameStateJP_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ConvertLevelNameToFriendlyName_Return;    // 0x0028(0x0010)()
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo) == 0x000008, "Wrong alignment on WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo");
static_assert(sizeof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo) == 0x000040, "Wrong size on WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, EntryPoint) == 0x000000, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, CallFunc_GetGameStateJP_ReturnValue) == 0x000008, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::CallFunc_GetGameStateJP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000018, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, CallFunc_ConvertLevelNameToFriendlyName_Return) == 0x000028, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::CallFunc_ConvertLevelNameToFriendlyName_Return' has a wrong offset!");
static_assert(offsetof(WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x000038, "Member 'WI_WinScreen_MatchInfo_C_ExecuteUbergraph_WI_WinScreen_MatchInfo::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");

}

