#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WinscreenSubBase

#include "Basic.hpp"

#include "E_WinscreenState_structs.hpp"


namespace SDK::Params
{

// Function WI_WinscreenSubBase.WI_WinscreenSubBase_C.ExecuteUbergraph_WI_WinscreenSubBase
// 0x0004 (0x0004 - 0x0000)
struct WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase) == 0x000004, "Wrong alignment on WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase");
static_assert(sizeof(WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase) == 0x000004, "Wrong size on WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase");
static_assert(offsetof(WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase, EntryPoint) == 0x000000, "Member 'WI_WinscreenSubBase_C_ExecuteUbergraph_WI_WinscreenSubBase::EntryPoint' has a wrong offset!");

// Function WI_WinscreenSubBase.WI_WinscreenSubBase_C.IsOnWinningTeam
// 0x0070 (0x0070 - 0x0000)
struct WI_WinscreenSubBase_C_IsOnWinningTeam final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetLocalPlayerTeamId_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP*                           CallFunc_GetGameStateJP_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetWinningTeam_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_WinscreenSubBase_C_IsOnWinningTeam) == 0x000008, "Wrong alignment on WI_WinscreenSubBase_C_IsOnWinningTeam");
static_assert(sizeof(WI_WinscreenSubBase_C_IsOnWinningTeam) == 0x000070, "Wrong size on WI_WinscreenSubBase_C_IsOnWinningTeam");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, ReturnValue) == 0x000000, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_GetLocalPlayerTeamId_ReturnValue) == 0x000001, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_GetLocalPlayerTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_GetGameStateJP_ReturnValue) == 0x000008, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_GetGameStateJP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_Conv_ByteToString_ReturnValue) == 0x000010, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_GetWinningTeam_ReturnValue) == 0x000020, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_GetWinningTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_Conv_ByteToString_ReturnValue_1) == 0x000050, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_Conv_ByteToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_WinscreenSubBase_C_IsOnWinningTeam, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'WI_WinscreenSubBase_C_IsOnWinningTeam::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function WI_WinscreenSubBase.WI_WinscreenSubBase_C.StateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WI_WinscreenSubBase_C_StateChanged__DelegateSignature final
{
public:
	E_WinscreenState                              NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_WinscreenSubBase_C_StateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WI_WinscreenSubBase_C_StateChanged__DelegateSignature");
static_assert(sizeof(WI_WinscreenSubBase_C_StateChanged__DelegateSignature) == 0x000001, "Wrong size on WI_WinscreenSubBase_C_StateChanged__DelegateSignature");
static_assert(offsetof(WI_WinscreenSubBase_C_StateChanged__DelegateSignature, NewState) == 0x000000, "Member 'WI_WinscreenSubBase_C_StateChanged__DelegateSignature::NewState' has a wrong offset!");

}

