#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WelcomePassPreview

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_WelcomePassPreview.WI_WelcomePassPreview_C
// 0x0028 (0x0360 - 0x0338)
class UWI_WelcomePassPreview_C final : public USeasonPassPreviewContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSeasonPassTierViewModel>       DesignTiers;                                       // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSeasonPassContainerViewModel          View_Model;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ApplyViewModel(const struct FSeasonPassContainerViewModel& ViewModel);
	void Construct();
	void ExecuteUbergraph_WI_WelcomePassPreview(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_WelcomePassPreview_C">();
	}
	static class UWI_WelcomePassPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_WelcomePassPreview_C>();
	}
};
static_assert(alignof(UWI_WelcomePassPreview_C) == 0x000008, "Wrong alignment on UWI_WelcomePassPreview_C");
static_assert(sizeof(UWI_WelcomePassPreview_C) == 0x000360, "Wrong size on UWI_WelcomePassPreview_C");
static_assert(offsetof(UWI_WelcomePassPreview_C, UberGraphFrame) == 0x000338, "Member 'UWI_WelcomePassPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassPreview_C, Image_BG) == 0x000340, "Member 'UWI_WelcomePassPreview_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassPreview_C, DesignTiers) == 0x000348, "Member 'UWI_WelcomePassPreview_C::DesignTiers' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassPreview_C, View_Model) == 0x000358, "Member 'UWI_WelcomePassPreview_C::View_Model' has a wrong offset!");

}

