#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_JP_TPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_VelocityBlend_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_CharacterIKOffset_TPP_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function ABP_JP_TPP.ABP_JP_TPP_C.ADS
// 0x0001 (0x0001 - 0x0000)
struct ABP_JP_TPP_C_ADS final
{
public:
	bool                                          bADS_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_ADS) == 0x000001, "Wrong alignment on ABP_JP_TPP_C_ADS");
static_assert(sizeof(ABP_JP_TPP_C_ADS) == 0x000001, "Wrong size on ABP_JP_TPP_C_ADS");
static_assert(offsetof(ABP_JP_TPP_C_ADS, bADS_0) == 0x000000, "Member 'ABP_JP_TPP_C_ADS::bADS_0' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_JP_TPP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_JP_TPP_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_AnimGraph");
static_assert(sizeof(ABP_JP_TPP_C_AnimGraph) == 0x000010, "Wrong size on ABP_JP_TPP_C_AnimGraph");
static_assert(offsetof(ABP_JP_TPP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_JP_TPP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.Attacking
// 0x0010 (0x0010 - 0x0000)
struct ABP_JP_TPP_C_Attacking final
{
public:
	bool                                          Attacking_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Heavy;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Error_Tolerance;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_Attacking) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_Attacking");
static_assert(sizeof(ABP_JP_TPP_C_Attacking) == 0x000010, "Wrong size on ABP_JP_TPP_C_Attacking");
static_assert(offsetof(ABP_JP_TPP_C_Attacking, Attacking_0) == 0x000000, "Member 'ABP_JP_TPP_C_Attacking::Attacking_0' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Attacking, Heavy) == 0x000001, "Member 'ABP_JP_TPP_C_Attacking::Heavy' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Attacking, Error_Tolerance) == 0x000008, "Member 'ABP_JP_TPP_C_Attacking::Error_Tolerance' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.base
// 0x0010 (0x0010 - 0x0000)
struct ABP_JP_TPP_C_base final
{
public:
	struct FPoseLink                              base_0;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_JP_TPP_C_base) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_base");
static_assert(sizeof(ABP_JP_TPP_C_base) == 0x000010, "Wrong size on ABP_JP_TPP_C_base");
static_assert(offsetof(ABP_JP_TPP_C_base, base_0) == 0x000000, "Member 'ABP_JP_TPP_C_base::base_0' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.BasePose
// 0x0010 (0x0010 - 0x0000)
struct ABP_JP_TPP_C_BasePose final
{
public:
	struct FPoseLink                              BasePose_0;                                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_JP_TPP_C_BasePose) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_BasePose");
static_assert(sizeof(ABP_JP_TPP_C_BasePose) == 0x000010, "Wrong size on ABP_JP_TPP_C_BasePose");
static_assert(offsetof(ABP_JP_TPP_C_BasePose, BasePose_0) == 0x000000, "Member 'ABP_JP_TPP_C_BasePose::BasePose_0' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.BlendLayers
// 0x0040 (0x0040 - 0x0000)
struct ABP_JP_TPP_C_BlendLayers final
{
public:
	struct FPoseLink                              BaseLayer;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              OverlayLayer;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BasePoseLayer;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BlendLayers_0;                                     // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_JP_TPP_C_BlendLayers) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_BlendLayers");
static_assert(sizeof(ABP_JP_TPP_C_BlendLayers) == 0x000040, "Wrong size on ABP_JP_TPP_C_BlendLayers");
static_assert(offsetof(ABP_JP_TPP_C_BlendLayers, BaseLayer) == 0x000000, "Member 'ABP_JP_TPP_C_BlendLayers::BaseLayer' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_BlendLayers, OverlayLayer) == 0x000010, "Member 'ABP_JP_TPP_C_BlendLayers::OverlayLayer' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_BlendLayers, BasePoseLayer) == 0x000020, "Member 'ABP_JP_TPP_C_BlendLayers::BasePoseLayer' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_BlendLayers, BlendLayers_0) == 0x000030, "Member 'ABP_JP_TPP_C_BlendLayers::BlendLayers_0' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.Blocking
// 0x0001 (0x0001 - 0x0000)
struct ABP_JP_TPP_C_Blocking final
{
public:
	bool                                          Blocked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_Blocking) == 0x000001, "Wrong alignment on ABP_JP_TPP_C_Blocking");
static_assert(sizeof(ABP_JP_TPP_C_Blocking) == 0x000001, "Wrong size on ABP_JP_TPP_C_Blocking");
static_assert(offsetof(ABP_JP_TPP_C_Blocking, Blocked) == 0x000000, "Member 'ABP_JP_TPP_C_Blocking::Blocked' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.BlueprintThreadSafeUpdateAnimation
// 0x0018 (0x0018 - 0x0000)
struct ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateBlendWeightData_DeltaTime_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateAccelerationData_DeltaTime_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation) == 0x000018, "Wrong size on ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateBlendWeightData_DeltaTime_ImplicitCast) == 0x000008, "Member 'ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateBlendWeightData_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateAccelerationData_DeltaTime_ImplicitCast) == 0x000010, "Member 'ABP_JP_TPP_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateAccelerationData_DeltaTime_ImplicitCast' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_JP_TPP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_JP_TPP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_JP_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_JP_TPP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_JP_TPP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_JP_TPP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.CalculateAcceleration
// 0x0098 (0x0098 - 0x0000)
struct ABP_JP_TPP_C_CalculateAcceleration final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDeltaSeconds_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_2;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_2;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_CalculateAcceleration) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_CalculateAcceleration");
static_assert(sizeof(ABP_JP_TPP_C_CalculateAcceleration) == 0x000098, "Wrong size on ABP_JP_TPP_C_CalculateAcceleration");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, ReturnValue) == 0x000000, "Member 'ABP_JP_TPP_C_CalculateAcceleration::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_GetDeltaSeconds_ReturnValue) == 0x000018, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_GetDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_BreakVector_X) == 0x000038, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_BreakVector_Y) == 0x000040, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_BreakVector_Z) == 0x000048, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_ReturnValue) == 0x000050, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_ReturnValue_1) == 0x000058, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_ReturnValue_2) == 0x000060, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_B_ImplicitCast) == 0x000080, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_B_ImplicitCast_1) == 0x000088, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateAcceleration, CallFunc_SafeDivide_B_ImplicitCast_2) == 0x000090, "Member 'ABP_JP_TPP_C_CalculateAcceleration::CallFunc_SafeDivide_B_ImplicitCast_2' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.CalculateRelativeAccelerationAmount
// 0x0158 (0x0158 - 0x0000)
struct ABP_JP_TPP_C_CalculateRelativeAccelerationAmount final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ClampSizeMax_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_2;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ClampSizeMax_ReturnValue_1;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_3;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_4;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_5;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue_1;     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_ClampSizeMax_Max_ImplicitCast;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_1;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_2;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_ClampSizeMax_Max_ImplicitCast_1;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_3;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_4;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_5;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_CalculateRelativeAccelerationAmount");
static_assert(sizeof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount) == 0x000158, "Wrong size on ABP_JP_TPP_C_CalculateRelativeAccelerationAmount");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, ReturnValue) == 0x000000, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Dot_VectorVector_ReturnValue) == 0x000018, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Vector_ClampSizeMax_ReturnValue) == 0x000020, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Vector_ClampSizeMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_X) == 0x000040, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_Y) == 0x000048, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_Z) == 0x000050, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue) == 0x000058, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue_1) == 0x000060, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue_2) == 0x000068, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Vector_ClampSizeMax_ReturnValue_1) == 0x000088, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Vector_ClampSizeMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_X_1) == 0x0000A0, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_Y_1) == 0x0000A8, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_BreakVector_Z_1) == 0x0000B0, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue_3) == 0x0000B8, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0000C0, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue_4) == 0x0000D8, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_ReturnValue_5) == 0x0000E0, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_LessLess_VectorRotator_ReturnValue_1) == 0x000100, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_LessLess_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Vector_ClampSizeMax_Max_ImplicitCast) == 0x000118, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Vector_ClampSizeMax_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast) == 0x000120, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast_1) == 0x000128, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast_2) == 0x000130, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_Vector_ClampSizeMax_Max_ImplicitCast_1) == 0x000138, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_Vector_ClampSizeMax_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast_3) == 0x000140, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast_4) == 0x000148, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateRelativeAccelerationAmount, CallFunc_SafeDivide_B_ImplicitCast_5) == 0x000150, "Member 'ABP_JP_TPP_C_CalculateRelativeAccelerationAmount::CallFunc_SafeDivide_B_ImplicitCast_5' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.CalculateVelocityBlend
// 0x0160 (0x0160 - 0x0000)
struct ABP_JP_TPP_C_CalculateVelocityBlend final
{
public:
	struct FS_VelocityBlend                       VelocityBlend_0;                                   // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocRelativeVelocityDir;                            // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sum;                                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_2;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_3;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_4;                        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_VelocityBlend                       K2Node_MakeStruct_S_VelocityBlend;                 // 0x0128(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_CalculateVelocityBlend) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_CalculateVelocityBlend");
static_assert(sizeof(ABP_JP_TPP_C_CalculateVelocityBlend) == 0x000160, "Wrong size on ABP_JP_TPP_C_CalculateVelocityBlend");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, VelocityBlend_0) == 0x000000, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::VelocityBlend_0' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, LocRelativeVelocityDir) == 0x000020, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::LocRelativeVelocityDir' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, Sum) == 0x000038, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::Sum' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_X) == 0x000040, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Y) == 0x000048, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Z) == 0x000050, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_SafeDivide_ReturnValue) == 0x000058, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_X_1) == 0x000060, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_SafeDivide_ReturnValue_1) == 0x000078, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Abs_ReturnValue) == 0x000080, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Abs_ReturnValue_1) == 0x000088, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Abs_ReturnValue_2) == 0x000090, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_SafeDivide_ReturnValue_2) == 0x000098, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_SafeDivide_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_X_2) == 0x0000C8, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Y_2) == 0x0000D0, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_BreakVector_Z_2) == 0x0000D8, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Normal_ReturnValue) == 0x0000E0, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_FClamp_ReturnValue_1) == 0x000100, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_FClamp_ReturnValue_2) == 0x000108, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Abs_ReturnValue_3) == 0x000110, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_Abs_ReturnValue_4) == 0x000118, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_Abs_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_FClamp_ReturnValue_3) == 0x000120, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, K2Node_MakeStruct_S_VelocityBlend) == 0x000128, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::K2Node_MakeStruct_S_VelocityBlend' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_CalculateVelocityBlend, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000148, "Member 'ABP_JP_TPP_C_CalculateVelocityBlend::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.DynamicTransitionCheck
// 0x0038 (0x0038 - 0x0000)
struct ABP_JP_TPP_C_DynamicTransitionCheck final
{
public:
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_DynamicTransitionCheck) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_DynamicTransitionCheck");
static_assert(sizeof(ABP_JP_TPP_C_DynamicTransitionCheck) == 0x000038, "Wrong size on ABP_JP_TPP_C_DynamicTransitionCheck");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_GetOwningComponent_ReturnValue) == 0x000000, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue) == 0x000008, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_GetOwningComponent_ReturnValue_1) == 0x000010, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_GetOwningComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue_1) == 0x00001C, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_DynamicTransitionCheck, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000030, "Member 'ABP_JP_TPP_C_DynamicTransitionCheck::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.Event PlayDynamicTransition
// 0x0020 (0x0020 - 0x0000)
struct ABP_JP_TPP_C_Event_PlayDynamicTransition final
{
public:
	double                                        ReTriggerDelay;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTime;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendOutTime;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InPlayRate;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InTimeToStartMontageAt;                            // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_JP_TPP_C_Event_PlayDynamicTransition) == 0x000008, "Wrong alignment on ABP_JP_TPP_C_Event_PlayDynamicTransition");
static_assert(sizeof(ABP_JP_TPP_C_Event_PlayDynamicTransition) == 0x000020, "Wrong size on ABP_JP_TPP_C_Event_PlayDynamicTransition");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, ReTriggerDelay) == 0x000000, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::ReTriggerDelay' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, Animation) == 0x000008, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::Animation' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, BlendInTime) == 0x000010, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::BlendInTime' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, BlendOutTime) == 0x000014, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::BlendOutTime' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, InPlayRate) == 0x000018, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::InPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_JP_TPP_C_Event_PlayDynamicTransition, InTimeToStartMontageAt) == 0x00001C, "Member 'ABP_JP_TPP_C_Event_PlayDynamicTransition::InTimeToStartMontageAt' has a wrong offset!");

// Function ABP_JP_TPP.ABP_JP_TPP_C.ExecuteUbergraph_ABP_JP_TPP
// 0x05D0 (0x05D0 - 0x0000)
struct ABP_JP_TPP_C_ExecuteUbergraph_ABP_JP_TPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bReady;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_Quat_MakeFromEuler_ReturnValue;           // 0x0110(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_6;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_7;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_8;          // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bADS;                                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_9;          // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_10;         // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Blocked;                              // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_11;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_12;         // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Time;                                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_PlayRate_1;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
