#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SeagulMinus130_PP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Seagul-130_PP.ABP_Seagul-130_PP_C
// 0x0AA0 (0x0E10 - 0x0370)
class UABP_SeagulMinus130_PP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0460(0x0970)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DD0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DF0(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_SeagulMinus130_PP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Seagul-130_PP_C">();
	}
	static class UABP_SeagulMinus130_PP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SeagulMinus130_PP_C>();
	}
};
static_assert(alignof(UABP_SeagulMinus130_PP_C) == 0x000010, "Wrong alignment on UABP_SeagulMinus130_PP_C");
static_assert(sizeof(UABP_SeagulMinus130_PP_C) == 0x000E10, "Wrong size on UABP_SeagulMinus130_PP_C");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, UberGraphFrame) == 0x000370, "Member 'UABP_SeagulMinus130_PP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_SeagulMinus130_PP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_SeagulMinus130_PP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_SeagulMinus130_PP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UABP_SeagulMinus130_PP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimGraphNode_RigidBody) == 0x000460, "Member 'UABP_SeagulMinus130_PP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimGraphNode_LocalToComponentSpace) == 0x000DD0, "Member 'UABP_SeagulMinus130_PP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SeagulMinus130_PP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DF0, "Member 'UABP_SeagulMinus130_PP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

