#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Kim_Default_PP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Kim_Default_PP.ABP_Kim_Default_PP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Kim_Default_PP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Kim_Default_PP_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Kim_Default_PP_C_AnimGraph");
static_assert(sizeof(ABP_Kim_Default_PP_C_AnimGraph) == 0x000020, "Wrong size on ABP_Kim_Default_PP_C_AnimGraph");
static_assert(offsetof(ABP_Kim_Default_PP_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Kim_Default_PP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Kim_Default_PP_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Kim_Default_PP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Kim_Default_PP.ABP_Kim_Default_PP_C.ExecuteUbergraph_ABP_Kim_Default_PP
// 0x0004 (0x0004 - 0x0000)
struct ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP) == 0x000004, "Wrong alignment on ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP");
static_assert(sizeof(ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP) == 0x000004, "Wrong size on ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP");
static_assert(offsetof(ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP, EntryPoint) == 0x000000, "Member 'ABP_Kim_Default_PP_C_ExecuteUbergraph_ABP_Kim_Default_PP::EntryPoint' has a wrong offset!");

}

