#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Boxing_GlovesLeft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GASIW_structs.hpp"


namespace SDK::Params
{

// Function ABP_Boxing_GlovesLeft.ABP_Boxing_GlovesLeft_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Boxing_GlovesLeft_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Boxing_GlovesLeft_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Boxing_GlovesLeft_C_AnimGraph");
static_assert(sizeof(ABP_Boxing_GlovesLeft_C_AnimGraph) == 0x000020, "Wrong size on ABP_Boxing_GlovesLeft_C_AnimGraph");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Boxing_GlovesLeft_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Boxing_GlovesLeft_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Boxing_GlovesLeft.ABP_Boxing_GlovesLeft_C.ExecuteUbergraph_ABP_Boxing_GlovesLeft
// 0x0050 (0x0050 - 0x0000)
struct ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UEquipmentInstance*>             CallFunc_GetEquipmentInstancesOfType_ReturnValue;  // 0x0030(0x0010)(ReferenceParm)
	class UEquipmentInstance*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentViewMode                            CallFunc_GetViewMode_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft) == 0x000008, "Wrong alignment on ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft");
static_assert(sizeof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft) == 0x000050, "Wrong size on ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, EntryPoint) == 0x000000, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_GetEquipmentInstancesOfType_ReturnValue) == 0x000030, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_GetEquipmentInstancesOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_Array_Get_Item) == 0x000040, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_GetViewMode_ReturnValue) == 0x00004C, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_GetViewMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004E, "Member 'ABP_Boxing_GlovesLeft_C_ExecuteUbergraph_ABP_Boxing_GlovesLeft::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

