#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_AmmoGranter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EAmmoState_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AC_AmmoGranter.AC_AmmoGranter_C.AddAmmoGameplayEffectToTarget
// 0x0050 (0x0050 - 0x0000)
struct AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetGameplayEffectFromTag_GameplayEffect;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0018(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0030(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget");
static_assert(sizeof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget) == 0x000050, "Wrong size on AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, Target) == 0x000000, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::Target' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_GetGameplayEffectFromTag_GameplayEffect) == 0x000010, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_GetGameplayEffectFromTag_GameplayEffect' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000018, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000030, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000040, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000048, "Member 'AC_AmmoGranter_C_AddAmmoGameplayEffectToTarget::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.AddAmmoTagStackToItem
// 0x0010 (0x0010 - 0x0000)
struct AC_AmmoGranter_C_AddAmmoTagStackToItem final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_AddAmmoTagStackToItem) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_AddAmmoTagStackToItem");
static_assert(sizeof(AC_AmmoGranter_C_AddAmmoTagStackToItem) == 0x000010, "Wrong size on AC_AmmoGranter_C_AddAmmoTagStackToItem");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoTagStackToItem, Amount) == 0x000000, "Member 'AC_AmmoGranter_C_AddAmmoTagStackToItem::Amount' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddAmmoTagStackToItem, Item) == 0x000008, "Member 'AC_AmmoGranter_C_AddAmmoTagStackToItem::Item' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.AddCharge
// 0x0020 (0x0020 - 0x0000)
struct AC_AmmoGranter_C_AddCharge final
{
public:
	bool                                          L_Incremented;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_AddCharge) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_AddCharge");
static_assert(sizeof(AC_AmmoGranter_C_AddCharge) == 0x000020, "Wrong size on AC_AmmoGranter_C_AddCharge");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, L_Incremented) == 0x000000, "Member 'AC_AmmoGranter_C_AddCharge::L_Incremented' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'AC_AmmoGranter_C_AddCharge::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_AddCharge::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'AC_AmmoGranter_C_AddCharge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AC_AmmoGranter_C_AddCharge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddCharge, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'AC_AmmoGranter_C_AddCharge::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.AddItemToInventory
// 0x0040 (0x0040 - 0x0000)
struct AC_AmmoGranter_C_AddItemToInventory final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_AddItemDefinition_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_AddItemToInventory) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_AddItemToInventory");
static_assert(sizeof(AC_AmmoGranter_C_AddItemToInventory) == 0x000040, "Wrong size on AC_AmmoGranter_C_AddItemToInventory");
static_assert(offsetof(AC_AmmoGranter_C_AddItemToInventory, TargetActor) == 0x000000, "Member 'AC_AmmoGranter_C_AddItemToInventory::TargetActor' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddItemToInventory, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'AC_AmmoGranter_C_AddItemToInventory::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddItemToInventory, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_AddItemToInventory::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_AddItemToInventory, CallFunc_AddItemDefinition_ReturnValue) == 0x000038, "Member 'AC_AmmoGranter_C_AddItemToInventory::CallFunc_AddItemDefinition_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.CheckAmmoGrantingState
// 0x0090 (0x0090 - 0x0000)
struct AC_AmmoGranter_C_CheckAmmoGrantingState final
{
public:
	class AActor*                                 InterractingActor;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAmmoState                                    State;                                             // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTeam_CanUse;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsingAmmo_Return_Value;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_UsingAmmo_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_Return;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxAmmo_Return_Value;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckStackToAdd_Allowed;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CheckStackToAdd_StacksAllowedToAdd;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_CheckAmmoGrantingState) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_CheckAmmoGrantingState");
static_assert(sizeof(AC_AmmoGranter_C_CheckAmmoGrantingState) == 0x000090, "Wrong size on AC_AmmoGranter_C_CheckAmmoGrantingState");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, InterractingActor) == 0x000000, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::InterractingActor' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, Success) == 0x000008, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::Success' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, State) == 0x000009, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::State' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_CheckTeam_CanUse) == 0x00000A, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_CheckTeam_CanUse' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000038, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000068, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_UsingAmmo_Return_Value) == 0x000070, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_UsingAmmo_Return_Value' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_UsingAmmo_Item) == 0x000078, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_UsingAmmo_Item' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_HasItem_Return) == 0x000080, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_HasItem_Return' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_HasMaxAmmo_Return_Value) == 0x000081, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_HasMaxAmmo_Return_Value' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_CheckStackToAdd_Allowed) == 0x000083, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_CheckStackToAdd_Allowed' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_CheckStackToAdd_StacksAllowedToAdd) == 0x000084, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_CheckStackToAdd_StacksAllowedToAdd' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckAmmoGrantingState, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'AC_AmmoGranter_C_CheckAmmoGrantingState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.CheckStackToAdd
// 0x0070 (0x0070 - 0x0000)
struct AC_AmmoGranter_C_CheckStackToAdd final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Allowed;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StacksAllowedToAdd;                                // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_2;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_3;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_2;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_3;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_CheckStackToAdd) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_CheckStackToAdd");
static_assert(sizeof(AC_AmmoGranter_C_CheckStackToAdd) == 0x000070, "Wrong size on AC_AmmoGranter_C_CheckStackToAdd");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, Actor) == 0x000000, "Member 'AC_AmmoGranter_C_CheckStackToAdd::Actor' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, Allowed) == 0x000008, "Member 'AC_AmmoGranter_C_CheckStackToAdd::Allowed' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, StacksAllowedToAdd) == 0x00000C, "Member 'AC_AmmoGranter_C_CheckStackToAdd::StacksAllowedToAdd' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000010, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_ReturnValue) == 0x000014, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000018, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00001C, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_ReturnValue_1) == 0x000024, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2) == 0x000028, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_ReturnValue_2) == 0x00002C, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3) == 0x000030, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_GetFloatAttribute_ReturnValue_3) == 0x000034, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_GetFloatAttribute_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_ReturnValue_2) == 0x000038, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_ReturnValue_3) == 0x00003C, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_A_ImplicitCast) == 0x000050, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000058, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_A_ImplicitCast_2) == 0x000060, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckStackToAdd, CallFunc_FTrunc_A_ImplicitCast_3) == 0x000068, "Member 'AC_AmmoGranter_C_CheckStackToAdd::CallFunc_FTrunc_A_ImplicitCast_3' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.CheckTeam
// 0x0098 (0x0098 - 0x0000)
struct AC_AmmoGranter_C_CheckTeam final
{
public:
	class AActor*                                 InterractingCharacter;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUse;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamAtPoint_bFoundTeam;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag;     // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeamAtPoint_ReturnValue;               // 0x0058(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_CheckTeam) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_CheckTeam");
static_assert(sizeof(AC_AmmoGranter_C_CheckTeam) == 0x000098, "Wrong size on AC_AmmoGranter_C_CheckTeam");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, InterractingCharacter) == 0x000000, "Member 'AC_AmmoGranter_C_CheckTeam::InterractingCharacter' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CanUse) == 0x000008, "Member 'AC_AmmoGranter_C_CheckTeam::CanUse' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, Temp_byte_Variable) == 0x000009, "Member 'AC_AmmoGranter_C_CheckTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, K2Node_DynamicCast_AsTeamable_Interface) == 0x000010, "Member 'AC_AmmoGranter_C_CheckTeam::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AC_AmmoGranter_C_CheckTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_GetTeamID_ReturnValue) == 0x000021, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_GetTeamAtPoint_bFoundTeam) == 0x000048, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_GetTeamAtPoint_bFoundTeam' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag) == 0x00004C, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_GetTeamAtPoint_TeamVolumeGameplayTag' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_GetTeamAtPoint_ReturnValue) == 0x000058, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_GetTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CheckTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'AC_AmmoGranter_C_CheckTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.CreateWidget
// 0x00C0 (0x00C0 - 0x0000)
struct AC_AmmoGranter_C_CreateWidget final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoCountToDisplay;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class APlayerControllerJP*                    CallFunc_GetJPPlayerController_PlayerController;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)()
	class UWI_AmmoCollected_C*                    CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_CreateWidget) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_CreateWidget");
static_assert(sizeof(AC_AmmoGranter_C_CreateWidget) == 0x0000C0, "Wrong size on AC_AmmoGranter_C_CreateWidget");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, Character) == 0x000000, "Member 'AC_AmmoGranter_C_CreateWidget::Character' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, AmmoCountToDisplay) == 0x000008, "Member 'AC_AmmoGranter_C_CreateWidget::AmmoCountToDisplay' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'AC_AmmoGranter_C_CreateWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, K2Node_DynamicCast_AsI_Character) == 0x000068, "Member 'AC_AmmoGranter_C_CreateWidget::K2Node_DynamicCast_AsI_Character' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AC_AmmoGranter_C_CreateWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, K2Node_MakeArray_Array) == 0x000080, "Member 'AC_AmmoGranter_C_CreateWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_GetJPPlayerController_PlayerController) == 0x000090, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_GetJPPlayerController_PlayerController' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_Format_ReturnValue) == 0x000098, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_CreateWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'AC_AmmoGranter_C_CreateWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.ExecuteUbergraph_AC_AmmoGranter
// 0x0070 (0x0070 - 0x0000)
struct AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Character;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Ammo;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter");
static_assert(sizeof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter) == 0x000070, "Wrong size on AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, EntryPoint) == 0x000000, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, Temp_object_Variable) == 0x000008, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_DynamicCast_AsItem_Definition) == 0x000010, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_CustomEvent_Character) == 0x000020, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_CustomEvent_Ammo) == 0x000028, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_CustomEvent_Ammo' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000048, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_CustomEvent_Loaded) == 0x000050, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000068, "Member 'AC_AmmoGranter_C_ExecuteUbergraph_AC_AmmoGranter::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.GetGameplayEffectFromTag
// 0x0018 (0x0018 - 0x0000)
struct AC_AmmoGranter_C_GetGameplayEffectFromTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GameplayEffect;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_GetGameplayEffectFromTag) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_GetGameplayEffectFromTag");
static_assert(sizeof(AC_AmmoGranter_C_GetGameplayEffectFromTag) == 0x000018, "Wrong size on AC_AmmoGranter_C_GetGameplayEffectFromTag");
static_assert(offsetof(AC_AmmoGranter_C_GetGameplayEffectFromTag, Tag) == 0x000000, "Member 'AC_AmmoGranter_C_GetGameplayEffectFromTag::Tag' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetGameplayEffectFromTag, GameplayEffect) == 0x000008, "Member 'AC_AmmoGranter_C_GetGameplayEffectFromTag::GameplayEffect' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetGameplayEffectFromTag, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_GetGameplayEffectFromTag::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetGameplayEffectFromTag, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000011, "Member 'AC_AmmoGranter_C_GetGameplayEffectFromTag::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.GetOrLoadCachedItemToReceiveAmmo
// 0x0020 (0x0020 - 0x0000)
struct AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo");
static_assert(sizeof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo) == 0x000020, "Wrong size on AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo");
static_assert(offsetof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo, K2Node_DynamicCast_AsItem_Definition) == 0x000010, "Member 'AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_AmmoGranter_C_GetOrLoadCachedItemToReceiveAmmo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.HasItem
// 0x0048 (0x0048 - 0x0000)
struct AC_AmmoGranter_C_HasItem final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_Return;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_HasItem) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_HasItem");
static_assert(sizeof(AC_AmmoGranter_C_HasItem) == 0x000048, "Wrong size on AC_AmmoGranter_C_HasItem");
static_assert(offsetof(AC_AmmoGranter_C_HasItem, TargetActor) == 0x000000, "Member 'AC_AmmoGranter_C_HasItem::TargetActor' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_HasItem, Return) == 0x000008, "Member 'AC_AmmoGranter_C_HasItem::Return' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_HasItem, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'AC_AmmoGranter_C_HasItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_HasItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'AC_AmmoGranter_C_HasItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_HasItem, CallFunc_HasItem_Return) == 0x000040, "Member 'AC_AmmoGranter_C_HasItem::CallFunc_HasItem_Return' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.IsInventoryNotFull
// 0x0040 (0x0040 - 0x0000)
struct AC_AmmoGranter_C_IsInventoryNotFull final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetInventorySize_ModifiedSize;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_IsInventoryNotFull) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_IsInventoryNotFull");
static_assert(sizeof(AC_AmmoGranter_C_IsInventoryNotFull) == 0x000040, "Wrong size on AC_AmmoGranter_C_IsInventoryNotFull");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, InteractingActor) == 0x000000, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::InteractingActor' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, ReturnValue) == 0x000008, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000010, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000020, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, CallFunc_GetInventorySize_ModifiedSize) == 0x000030, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::CallFunc_GetInventorySize_ModifiedSize' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_IsInventoryNotFull, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'AC_AmmoGranter_C_IsInventoryNotFull::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.LoadNewItemToReceive
// 0x0040 (0x0040 - 0x0000)
struct AC_AmmoGranter_C_LoadNewItemToReceive final
{
public:
	TSoftObjectPtr<class UItemDefinition>         NewItemDefinition;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_LoadNewItemToReceive) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_LoadNewItemToReceive");
static_assert(sizeof(AC_AmmoGranter_C_LoadNewItemToReceive) == 0x000040, "Wrong size on AC_AmmoGranter_C_LoadNewItemToReceive");
static_assert(offsetof(AC_AmmoGranter_C_LoadNewItemToReceive, NewItemDefinition) == 0x000000, "Member 'AC_AmmoGranter_C_LoadNewItemToReceive::NewItemDefinition' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_LoadNewItemToReceive, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'AC_AmmoGranter_C_LoadNewItemToReceive::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_LoadNewItemToReceive, K2Node_DynamicCast_AsItem_Definition) == 0x000030, "Member 'AC_AmmoGranter_C_LoadNewItemToReceive::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_LoadNewItemToReceive, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AC_AmmoGranter_C_LoadNewItemToReceive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.MultiSpawnWidget
// 0x0010 (0x0010 - 0x0000)
struct AC_AmmoGranter_C_MultiSpawnWidget final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Ammo;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_AmmoGranter_C_MultiSpawnWidget) == 0x000008, "Wrong alignment on AC_AmmoGranter_C_MultiSpawnWidget");
static_assert(sizeof(AC_AmmoGranter_C_MultiSpawnWidget) == 0x000010, "Wrong size on AC_AmmoGranter_C_MultiSpawnWidget");
static_assert(offsetof(AC_AmmoGranter_C_MultiSpawnWidget, Character) == 0x000000, "Member 'AC_AmmoGranter_C_MultiSpawnWidget::Character' has a wrong offset!");
static_assert(offsetof(AC_AmmoGranter_C_MultiSpawnWidget, Ammo) == 0x000008, "Member 'AC_AmmoGranter_C_MultiSpawnWidget::Ammo' has a wrong offset!");

// Function AC_AmmoGranter.AC_AmmoGranter_C.On_ChargesUpdated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AC_AmmoGranter_C_On_ChargesUpdated__DelegateSignature final
{
public:
	int32                                         NewChargeAmount;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Increment;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
