#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BearTrap_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BearTrap_AnimBP.BearTrap_AnimBP_C
// 0x0390 (0x0700 - 0x0370)
class UBearTrap_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0420(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0448(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0490(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x04B0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0510(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0558(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0578(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05B8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05D8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x06A0(0x0048)()
	bool                                          bStep;                                             // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDeployed;                                         // 0x06E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA[0x6];                                      // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Sequence;                                          // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Active(bool Condition, class UAnimSequence* Sequence_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BearTrap_AnimBP_AnimGraphNode_TransitionResult_589CCE3B47DC92E0A682A198C6DF0E86();
	void ExecuteUbergraph_BearTrap_AnimBP(int32 EntryPoint);
	void Hit();
	void Step(bool Condition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BearTrap_AnimBP_C">();
	}
	static class UBearTrap_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBearTrap_AnimBP_C>();
	}
};
static_assert(alignof(UBearTrap_AnimBP_C) == 0x000010, "Wrong alignment on UBearTrap_AnimBP_C");
static_assert(sizeof(UBearTrap_AnimBP_C) == 0x000700, "Wrong size on UBearTrap_AnimBP_C");
static_assert(offsetof(UBearTrap_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UBearTrap_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UBearTrap_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UBearTrap_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0003A8, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0003D0, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0003F8, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000420, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000448, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_StateResult_3) == 0x000490, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_SequenceEvaluator_1) == 0x0004B0, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0004F0, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000510, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000558, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x000578, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_StateResult) == 0x0005B8, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_StateMachine) == 0x0005D8, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, AnimGraphNode_Slot) == 0x0006A0, "Member 'UBearTrap_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, bStep) == 0x0006E8, "Member 'UBearTrap_AnimBP_C::bStep' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, bDeployed) == 0x0006E9, "Member 'UBearTrap_AnimBP_C::bDeployed' has a wrong offset!");
static_assert(offsetof(UBearTrap_AnimBP_C, Sequence) == 0x0006F0, "Member 'UBearTrap_AnimBP_C::Sequence' has a wrong offset!");

}

