#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintFunctionLibraryJP

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "S_EventMessageParams_structs.hpp"
#include "S_HighlightParameters_structs.hpp"
#include "E_Tools_structs.hpp"


namespace SDK::Params
{

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Add Tutorial
// 0x0028 (0x0028 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Add_Tutorial final
{
public:
	class APlayerControllerJP_MatchBP_C*          Owning_PlayerController;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Tutorial;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemTutorial_Base_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTutorialSeen_Already_Seen;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Add_Tutorial) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Add_Tutorial");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Add_Tutorial) == 0x000028, "Wrong size on BlueprintFunctionLibraryJP_C_Add_Tutorial");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Add_Tutorial, Owning_PlayerController) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Add_Tutorial::Owning_PlayerController' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Add_Tutorial, Tutorial) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Add_Tutorial::Tutorial' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Add_Tutorial, __WorldContext) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Add_Tutorial::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Add_Tutorial, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_Add_Tutorial::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Add_Tutorial, CallFunc_IsTutorialSeen_Already_Seen) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_Add_Tutorial::CallFunc_IsTutorialSeen_Already_Seen' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.AddTextChatMapping
// 0x0050 (0x0050 - 0x0000)
struct BlueprintFunctionLibraryJP_C_AddTextChatMapping final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Add;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0018(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable_1;                            // 0x0028(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_RemoveMappingContext_self_CastInput;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_AddTextChatMapping) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_AddTextChatMapping");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_AddTextChatMapping) == 0x000050, "Wrong size on BlueprintFunctionLibraryJP_C_AddTextChatMapping");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, PlayerController) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::PlayerController' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, Add) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::Add' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, __WorldContext) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, Temp_struct_Variable) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, Temp_struct_Variable_1) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, CallFunc_RemoveMappingContext_self_CastInput) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::CallFunc_RemoveMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_AddTextChatMapping, CallFunc_AddMappingContext_self_CastInput) == 0x000040, "Member 'BlueprintFunctionLibraryJP_C_AddTextChatMapping::CallFunc_AddMappingContext_self_CastInput' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.ApplyGameplayEffectToSelfByDuration
// 0x0050 (0x0050 - 0x0000)
struct BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration final
{
public:
	class UGameplayAbility*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0028(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0038(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration) == 0x000050, "Wrong size on BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, Target) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::Target' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, Duration) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::Duration' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, GameplayEffectClass) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, __WorldContext) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, CallFunc_SetDuration_ReturnValue) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::CallFunc_SetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000048, "Member 'BlueprintFunctionLibraryJP_C_ApplyGameplayEffectToSelfByDuration::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Auth_SendEventMessage
// 0x0040 (0x0040 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Auth_SendEventMessage final
{
public:
	struct FS_EventMessageParams                  Message;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMessengerManager_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Auth_SendEventMessage");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage) == 0x000040, "Wrong size on BlueprintFunctionLibraryJP_C_Auth_SendEventMessage");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage, Message) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendEventMessage::Message' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage, __WorldContext) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendEventMessage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage, CallFunc_GetActorOfClass_ReturnValue) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendEventMessage::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendEventMessage, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendEventMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Auth_SendMessage
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Auth_SendMessage final
{
public:
	class APlayerController*                      Controller_Reference;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMessageRecipient                             Recipients;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EMessageCategory                              Category;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Translate_Using_String_Table;                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   String_Table_ID;                                   // 0x0024(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0048(0x0058)()
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Auth_SendMessage) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Auth_SendMessage");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Auth_SendMessage) == 0x0000A0, "Wrong size on BlueprintFunctionLibraryJP_C_Auth_SendMessage");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, Controller_Reference) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::Controller_Reference' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, Recipients) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::Recipients' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, Message) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::Message' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, Category) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::Category' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, Translate_Using_String_Table) == 0x000021, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::Translate_Using_String_Table' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, String_Table_ID) == 0x000024, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::String_Table_ID' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, __WorldContext) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, K2Node_MakeStruct_LinearColor) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessage, K2Node_MakeStruct_PlayerMessage) == 0x000048, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessage::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Auth_SendMessageVerbose
// 0x0070 (0x0070 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose final
{
public:
	struct FPlayerMessage                         Message_Specification;                             // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMessengerManager_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose) == 0x000070, "Wrong size on BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose, Message_Specification) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose::Message_Specification' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose, __WorldContext) == 0x000058, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose, CallFunc_GetActorOfClass_ReturnValue) == 0x000060, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BlueprintFunctionLibraryJP_C_Auth_SendMessageVerbose::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Get BP Tweakable Data
// 0x0028 (0x0028 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TweakableData_C*                    AsBP_Tweakable_Data;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue;             // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TweakableData_C*                    K2Node_DynamicCast_AsBP_Tweakable_Data;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data) == 0x000028, "Wrong size on BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data, __WorldContext) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data, AsBP_Tweakable_Data) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data::AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data, CallFunc_GetTweakableData_ReturnValue) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data::CallFunc_GetTweakableData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data, K2Node_DynamicCast_AsBP_Tweakable_Data) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data::K2Node_DynamicCast_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_Get_BP_Tweakable_Data::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Get ClassLog Name
// 0x0048 (0x0048 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Get_ClassLog_Name final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Get_ClassLog_Name");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name) == 0x000048, "Wrong size on BlueprintFunctionLibraryJP_C_Get_ClassLog_Name");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, Object) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::Object' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, __WorldContext) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, Name_0) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::Name_0' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, CallFunc_GetClassDisplayName_ReturnValue) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_ClassLog_Name, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_Get_ClassLog_Name::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Get Groundskeeper from Team
// 0x0080 (0x0080 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    GroundsKeeper;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Abp_groundskeeper_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Abp_groundskeeper_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0038(0x0038)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team) == 0x000080, "Wrong size on BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, TeamId) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::TeamId' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, __WorldContext) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, GroundsKeeper) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::GroundsKeeper' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_Array_Get_Item) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_GetTeam_ReturnValue) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007C, "Member 'BlueprintFunctionLibraryJP_C_Get_Groundskeeper_from_Team::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Get Relative Team Color as Text Clientside
// 0x0080 (0x0080 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContext;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   TeamColor;                                         // 0x0018(0x0010)(Parm, OutParm)
	ETeamType                                     Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamId_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0010)()
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside) == 0x000080, "Wrong size on BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, TeamId) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::TeamId' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, WorldContext) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, __WorldContext) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, TeamColor) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::TeamColor' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, Temp_byte_Variable) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, CallFunc_GetTeamTypeFromTeamId_ReturnValue) == 0x000029, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::CallFunc_GetTeamTypeFromTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, Temp_text_Variable) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, Temp_text_Variable_1) == 0x000040, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, Temp_text_Variable_2) == 0x000050, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, Temp_text_Variable_3) == 0x000060, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside, K2Node_Select_Default) == 0x000070, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Clientside::K2Node_Select_Default' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.Get Relative Team Color as Text Serverside
// 0x0080 (0x0080 - 0x0000)
struct BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   TeamColor;                                         // 0x0018(0x0010)(Parm, OutParm)
	ETeamType                                     Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamType                                     CallFunc_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0010)()
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside) == 0x000080, "Wrong size on BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, TeamId) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::TeamId' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, PlayerController) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::PlayerController' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, __WorldContext) == 0x000010, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, TeamColor) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::TeamColor' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, Temp_byte_Variable) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, CallFunc_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView_ReturnValue) == 0x000029, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::CallFunc_GetTeamTypeFromTeamIdFromSpecificPlayerPointOfView_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, Temp_text_Variable) == 0x000030, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, Temp_text_Variable_1) == 0x000040, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, Temp_text_Variable_2) == 0x000050, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, Temp_text_Variable_3) == 0x000060, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside, K2Node_Select_Default) == 0x000070, "Member 'BlueprintFunctionLibraryJP_C_Get_Relative_Team_Color_as_Text_Serverside::K2Node_Select_Default' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.GetAllPlayerMasterIds
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         PlayerIdsTeam1;                                    // 0x0008(0x0010)(Parm, OutParm)
	TArray<class FString>                         PlayerIdsTeam2;                                    // 0x0018(0x0010)(Parm, OutParm)
	TArray<class FString>                         PlayerIdsTeam2_L;                                  // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerIdsTeam1_L;                                  // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMasterPlayerAccountId_ReturnValue;     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds) == 0x0000A0, "Wrong size on BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, __WorldContext) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, PlayerIdsTeam1) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::PlayerIdsTeam1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, PlayerIdsTeam2) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::PlayerIdsTeam2' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, PlayerIdsTeam2_L) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::PlayerIdsTeam2_L' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, PlayerIdsTeam1_L) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::PlayerIdsTeam1_L' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Array_Get_Item) == 0x000060, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000068, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_GetMasterPlayerAccountId_ReturnValue) == 0x000078, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_GetMasterPlayerAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_IsEmpty_ReturnValue) == 0x000089, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_GetTeamID_ReturnValue) == 0x000090, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000091, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_Array_Add_ReturnValue_1) == 0x000094, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000098, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerMasterIds::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BlueprintFunctionLibraryJP.BlueprintFunctionLibraryJP_C.GetAllPlayerTitleIds
// 0x00A8 (0x00A8 - 0x0000)
struct BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         PlayerIdsTeam1;                                    // 0x0008(0x0010)(Parm, OutParm)
	TArray<class FString>                         PlayerIdsTeam2;                                    // 0x0018(0x0010)(Parm, OutParm)
	TArray<class FString>                         PlayerIdsTeam2_L;                                  // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlayerIdsTeam1_L;                                  // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTitlePlayerAccountId_ReturnValue;      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds) == 0x000008, "Wrong alignment on BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds");
static_assert(sizeof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds) == 0x0000A8, "Wrong size on BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, __WorldContext) == 0x000000, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, PlayerIdsTeam1) == 0x000008, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::PlayerIdsTeam1' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, PlayerIdsTeam2) == 0x000018, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::PlayerIdsTeam2' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, PlayerIdsTeam2_L) == 0x000028, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::PlayerIdsTeam2_L' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, PlayerIdsTeam1_L) == 0x000038, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::PlayerIdsTeam1_L' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds, CallFunc_Array_Get_Item) == 0x000068, "Member 'BlueprintFunctionLibraryJP_C_GetAllPlayerTitleIds::CallFunc_Array_Get_Item' has a wrong offset!");
