#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AutoEquipHandsComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AutoEquipHandsComponent.BP_AutoEquipHandsComponent_C
// 0x0018 (0x00B8 - 0x00A0)
class UBP_AutoEquipHandsComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentManagerComponent*             EquipmentManager;                                  // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              AbilitySystemComponent;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EquipHands();
	void ExecuteUbergraph_BP_AutoEquipHandsComponent(int32 EntryPoint);
	void OnRemoved(class UEquipmentInstance* Instance);
	void QueryEquipHands();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AutoEquipHandsComponent_C">();
	}
	static class UBP_AutoEquipHandsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AutoEquipHandsComponent_C>();
	}
};
static_assert(alignof(UBP_AutoEquipHandsComponent_C) == 0x000008, "Wrong alignment on UBP_AutoEquipHandsComponent_C");
static_assert(sizeof(UBP_AutoEquipHandsComponent_C) == 0x0000B8, "Wrong size on UBP_AutoEquipHandsComponent_C");
static_assert(offsetof(UBP_AutoEquipHandsComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_AutoEquipHandsComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AutoEquipHandsComponent_C, EquipmentManager) == 0x0000A8, "Member 'UBP_AutoEquipHandsComponent_C::EquipmentManager' has a wrong offset!");
static_assert(offsetof(UBP_AutoEquipHandsComponent_C, AbilitySystemComponent) == 0x0000B0, "Member 'UBP_AutoEquipHandsComponent_C::AbilitySystemComponent' has a wrong offset!");

}

