#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AimAssistDelegateTester

#include "Basic.hpp"

#include "AimAssistScripts_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.CreateTargetFoundMsg
// 0x0120 (0x0120 - 0x0000)
struct BP_AimAssistDelegateTester_C_CreateTargetFoundMsg final
{
public:
	class UAimAssistComponent*                    AimAssistComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FAimAssistTarget                       AimAssistTarget;                                   // 0x0008(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FString                                 Message;                                           // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_CreateTargetFoundMsg");
static_assert(sizeof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg) == 0x000120, "Wrong size on BP_AimAssistDelegateTester_C_CreateTargetFoundMsg");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, AimAssistComponent) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::AimAssistComponent' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, AimAssistTarget) == 0x000008, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::AimAssistTarget' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, Message) == 0x000068, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::Message' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, Result) == 0x000078, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::Result' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_GetObjectClass_ReturnValue) == 0x000088, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_Conv_NameToString_ReturnValue) == 0x000090, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_GetClassDisplayName_ReturnValue) == 0x0000A0, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_GetObjectClass_ReturnValue_1) == 0x0000D0, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x0000E8, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, K2Node_SwitchEnum_CmpSuccess) == 0x0000F8, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000100, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetFoundMsg, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000110, "Member 'BP_AimAssistDelegateTester_C_CreateTargetFoundMsg::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.CreateTargetLostMsg
// 0x0040 (0x0040 - 0x0000)
struct BP_AimAssistDelegateTester_C_CreateTargetLostMsg final
{
public:
	class UAimAssistComponent*                    AimAssistComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_CreateTargetLostMsg");
static_assert(sizeof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg) == 0x000040, "Wrong size on BP_AimAssistDelegateTester_C_CreateTargetLostMsg");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg, AimAssistComponent) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_CreateTargetLostMsg::AimAssistComponent' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg, Message) == 0x000008, "Member 'BP_AimAssistDelegateTester_C_CreateTargetLostMsg::Message' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_AimAssistDelegateTester_C_CreateTargetLostMsg::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg, CallFunc_GetClassDisplayName_ReturnValue) == 0x000020, "Member 'BP_AimAssistDelegateTester_C_CreateTargetLostMsg::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_CreateTargetLostMsg, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_AimAssistDelegateTester_C_CreateTargetLostMsg::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.Event Target Found
// 0x0068 (0x0068 - 0x0000)
struct BP_AimAssistDelegateTester_C_Event_Target_Found final
{
public:
	const class UAimAssistComponent*              Sender;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAimAssistTarget                       AimAssistTarget;                                   // 0x0008(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_Event_Target_Found) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_Event_Target_Found");
static_assert(sizeof(BP_AimAssistDelegateTester_C_Event_Target_Found) == 0x000068, "Wrong size on BP_AimAssistDelegateTester_C_Event_Target_Found");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Event_Target_Found, Sender) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_Event_Target_Found::Sender' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Event_Target_Found, AimAssistTarget) == 0x000008, "Member 'BP_AimAssistDelegateTester_C_Event_Target_Found::AimAssistTarget' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.Event Target Lost
// 0x0068 (0x0068 - 0x0000)
struct BP_AimAssistDelegateTester_C_Event_Target_Lost final
{
public:
	const class UAimAssistComponent*              Sender;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAimAssistTarget                       AimAssistTarget;                                   // 0x0008(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_Event_Target_Lost) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_Event_Target_Lost");
static_assert(sizeof(BP_AimAssistDelegateTester_C_Event_Target_Lost) == 0x000068, "Wrong size on BP_AimAssistDelegateTester_C_Event_Target_Lost");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Event_Target_Lost, Sender) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_Event_Target_Lost::Sender' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Event_Target_Lost, AimAssistTarget) == 0x000008, "Member 'BP_AimAssistDelegateTester_C_Event_Target_Lost::AimAssistTarget' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.ExecuteUbergraph_BP_AimAssistDelegateTester
// 0x0170 (0x0170 - 0x0000)
struct BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAimAssistComponent* Sender, const struct FAimAssistTarget& AimAssistTarget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAimAssistComponent* Sender, const struct FAimAssistTarget& AimAssistTarget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAimAssistComponent*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAimAssistComponent*              K2Node_CustomEvent_Sender_1;                       // 0x0050(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAimAssistTarget                       K2Node_CustomEvent_AimAssistTarget_1;              // 0x0058(0x0060)(NoDestructor)
	const class UAimAssistComponent*              K2Node_CustomEvent_Sender;                         // 0x00B8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAimAssistTarget                       K2Node_CustomEvent_AimAssistTarget;                // 0x00C0(0x0060)(NoDestructor)
	class FString                                 CallFunc_CreateTargetFoundMsg_Message;             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateTargetLostMsg_Message;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UAimAssistComponent*>            CallFunc_Get_Aim_Assists_Aim_Assists;              // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Get_Aim_Assists_Is_Init;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAimAssistComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PrintString_Duration_ImplicitCast;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PrintString_Duration_ImplicitCast_1;      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester");
static_assert(sizeof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester) == 0x000170, "Wrong size on BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, EntryPoint) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_Event_EndPlayReason) == 0x000024, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CustomEvent_Sender_1) == 0x000050, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CustomEvent_Sender_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CustomEvent_AimAssistTarget_1) == 0x000058, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CustomEvent_AimAssistTarget_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CustomEvent_Sender) == 0x0000B8, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, K2Node_CustomEvent_AimAssistTarget) == 0x0000C0, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::K2Node_CustomEvent_AimAssistTarget' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_CreateTargetFoundMsg_Message) == 0x000120, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_CreateTargetFoundMsg_Message' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_CreateTargetLostMsg_Message) == 0x000130, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_CreateTargetLostMsg_Message' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Get_Aim_Assists_Aim_Assists) == 0x000140, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Get_Aim_Assists_Aim_Assists' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Get_Aim_Assists_Is_Init) == 0x000150, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Get_Aim_Assists_Is_Init' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Array_Length_ReturnValue_1) == 0x000160, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_Less_IntInt_ReturnValue_1) == 0x000164, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_PrintString_Duration_ImplicitCast) == 0x000168, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_PrintString_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester, CallFunc_PrintString_Duration_ImplicitCast_1) == 0x00016C, "Member 'BP_AimAssistDelegateTester_C_ExecuteUbergraph_BP_AimAssistDelegateTester::CallFunc_PrintString_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.Get Aim Assists
// 0x0038 (0x0038 - 0x0000)
struct BP_AimAssistDelegateTester_C_Get_Aim_Assists final
{
public:
	TArray<class UAimAssistComponent*>            Aim_Assists;                                       // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          Is_Init;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UAimAssistComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_Get_Aim_Assists) == 0x000008, "Wrong alignment on BP_AimAssistDelegateTester_C_Get_Aim_Assists");
static_assert(sizeof(BP_AimAssistDelegateTester_C_Get_Aim_Assists) == 0x000038, "Wrong size on BP_AimAssistDelegateTester_C_Get_Aim_Assists");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Get_Aim_Assists, Aim_Assists) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_Get_Aim_Assists::Aim_Assists' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Get_Aim_Assists, Is_Init) == 0x000010, "Member 'BP_AimAssistDelegateTester_C_Get_Aim_Assists::Is_Init' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Get_Aim_Assists, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_AimAssistDelegateTester_C_Get_Aim_Assists::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Get_Aim_Assists, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000020, "Member 'BP_AimAssistDelegateTester_C_Get_Aim_Assists::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AimAssistDelegateTester_C_Get_Aim_Assists, CallFunc_Array_IsEmpty_ReturnValue) == 0x000030, "Member 'BP_AimAssistDelegateTester_C_Get_Aim_Assists::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_AimAssistDelegateTester.BP_AimAssistDelegateTester_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AimAssistDelegateTester_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AimAssistDelegateTester_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AimAssistDelegateTester_C_ReceiveEndPlay");
static_assert(sizeof(BP_AimAssistDelegateTester_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AimAssistDelegateTester_C_ReceiveEndPlay");
static_assert(offsetof(BP_AimAssistDelegateTester_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AimAssistDelegateTester_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

