#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BenchmarkChicken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BenchmarkChicken.BP_BenchmarkChicken_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_BenchmarkChicken_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Chicken;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowDrop;                                         // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Benchmark_Egg_Drop();
	void ExecuteUbergraph_BP_BenchmarkChicken(int32 EntryPoint);
	void Start_Egg_Drop();
	void Stop_Egg_Drop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BenchmarkChicken_C">();
	}
	static class ABP_BenchmarkChicken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BenchmarkChicken_C>();
	}
};
static_assert(alignof(ABP_BenchmarkChicken_C) == 0x000008, "Wrong alignment on ABP_BenchmarkChicken_C");
static_assert(sizeof(ABP_BenchmarkChicken_C) == 0x0002B0, "Wrong size on ABP_BenchmarkChicken_C");
static_assert(offsetof(ABP_BenchmarkChicken_C, UberGraphFrame) == 0x000290, "Member 'ABP_BenchmarkChicken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BenchmarkChicken_C, SK_Chicken) == 0x000298, "Member 'ABP_BenchmarkChicken_C::SK_Chicken' has a wrong offset!");
static_assert(offsetof(ABP_BenchmarkChicken_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_BenchmarkChicken_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BenchmarkChicken_C, AllowDrop) == 0x0002A8, "Member 'ABP_BenchmarkChicken_C::AllowDrop' has a wrong offset!");

}

