#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonDropManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_WeightedDropStructure_structs.hpp"
#include "Engine_structs.hpp"
#include "E_TimeOfDay_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.Determine Index
// 0x0060 (0x0060 - 0x0000)
struct BP_BalloonDropManager_C_Determine_Index final
{
public:
	double                                        RandomValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Values;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         FoundIndex;                                        // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalSum;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_Determine_Index) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_Determine_Index");
static_assert(sizeof(BP_BalloonDropManager_C_Determine_Index) == 0x000060, "Wrong size on BP_BalloonDropManager_C_Determine_Index");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, RandomValue) == 0x000000, "Member 'BP_BalloonDropManager_C_Determine_Index::RandomValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, Values) == 0x000008, "Member 'BP_BalloonDropManager_C_Determine_Index::Values' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, FoundIndex) == 0x000018, "Member 'BP_BalloonDropManager_C_Determine_Index::FoundIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, LocalSum) == 0x000020, "Member 'BP_BalloonDropManager_C_Determine_Index::LocalSum' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BP_BalloonDropManager_C_Determine_Index::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_BalloonDropManager_C_Determine_Index::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_BalloonDropManager_C_Determine_Index::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000051, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_Determine_Index, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_BalloonDropManager_C_Determine_Index::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.ExecuteUbergraph_BP_BalloonDropManager
// 0x0148 (0x0148 - 0x0000)
struct BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UItemAction_Droppable*            CallFunc_FindActionByType_ReturnValue;             // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_TryRandomiseTrapSpawn_SpawnOut;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   K2Node_CustomEvent_TimeOfDay;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_TimeOfDay TimeOfDay)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_TriggerLootSelection_ReturnValue;         // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_FindCrateVariantToUse_CrateToSpawn;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTagLookupPrimaryDataAsset> CallFunc_GetTaggedAsset_ReturnValue;               // 0x00B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRandomSpawnDelay_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTierDuration_Duration;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LastTierReached_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropSpawn_C*                 CallFunc_GetSpawnPoint_Spawn;                      // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropSpawn_C*                 CallFunc_GetSpawnPoint_Spawn_1;                    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager");
static_assert(sizeof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager) == 0x000148, "Wrong size on BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, EntryPoint) == 0x000000, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, Temp_object_Variable) == 0x000018, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, Temp_int_Variable) == 0x000020, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_DynamicCast_AsItem_Definition) == 0x000028, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_FindActionByType_ReturnValue) == 0x000038, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_HasAuthority_ReturnValue_1) == 0x000040, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_TryRandomiseTrapSpawn_SpawnOut) == 0x000048, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_TryRandomiseTrapSpawn_SpawnOut' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_IsServer_ReturnValue) == 0x000050, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetActorOfClass_ReturnValue) == 0x000058, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CustomEvent_TimeOfDay) == 0x000060, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CustomEvent_TimeOfDay' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CustomEvent_Loaded) == 0x000068, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_TriggerLootSelection_ReturnValue) == 0x0000A4, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_TriggerLootSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_FindCrateVariantToUse_CrateToSpawn) == 0x0000B0, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_FindCrateVariantToUse_CrateToSpawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetTaggedAsset_ReturnValue) == 0x0000B8, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetTaggedAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000E0, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x0000E8, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetRandomSpawnDelay_ReturnValue) == 0x0000F8, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetRandomSpawnDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetTierDuration_Duration) == 0x000108, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetTierDuration_Duration' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_LastTierReached_ReturnValue) == 0x000110, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_LastTierReached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000114, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_Not_PreBool_ReturnValue) == 0x000124, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000128, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetSpawnPoint_Spawn) == 0x000130, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetSpawnPoint_Spawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_GetSpawnPoint_Spawn_1) == 0x000138, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_GetSpawnPoint_Spawn_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000140, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000144, "Member 'BP_BalloonDropManager_C_ExecuteUbergraph_BP_BalloonDropManager::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.FindAndSaveAllSpawns
// 0x0018 (0x0018 - 0x0000)
struct BP_BalloonDropManager_C_FindAndSaveAllSpawns final
{
public:
	TArray<class ABP_BalloonDropSpawn_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_FindAndSaveAllSpawns) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_FindAndSaveAllSpawns");
static_assert(sizeof(BP_BalloonDropManager_C_FindAndSaveAllSpawns) == 0x000018, "Wrong size on BP_BalloonDropManager_C_FindAndSaveAllSpawns");
static_assert(offsetof(BP_BalloonDropManager_C_FindAndSaveAllSpawns, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BP_BalloonDropManager_C_FindAndSaveAllSpawns::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindAndSaveAllSpawns, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_BalloonDropManager_C_FindAndSaveAllSpawns::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.FindCrateVariantToUse
// 0x0018 (0x0018 - 0x0000)
struct BP_BalloonDropManager_C_FindCrateVariantToUse final
{
public:
	struct FGameplayTag                           ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CrateToSpawn;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_FindCrateVariantToUse) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_FindCrateVariantToUse");
static_assert(sizeof(BP_BalloonDropManager_C_FindCrateVariantToUse) == 0x000018, "Wrong size on BP_BalloonDropManager_C_FindCrateVariantToUse");
static_assert(offsetof(BP_BalloonDropManager_C_FindCrateVariantToUse, ItemId) == 0x000000, "Member 'BP_BalloonDropManager_C_FindCrateVariantToUse::ItemId' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindCrateVariantToUse, CrateToSpawn) == 0x000008, "Member 'BP_BalloonDropManager_C_FindCrateVariantToUse::CrateToSpawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindCrateVariantToUse, CallFunc_HasTag_ReturnValue) == 0x000010, "Member 'BP_BalloonDropManager_C_FindCrateVariantToUse::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindCrateVariantToUse, CallFunc_HasTag_ReturnValue_1) == 0x000011, "Member 'BP_BalloonDropManager_C_FindCrateVariantToUse::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindCrateVariantToUse, CallFunc_HasTag_ReturnValue_2) == 0x000012, "Member 'BP_BalloonDropManager_C_FindCrateVariantToUse::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.FindWeightedIndex
// 0x0078 (0x0078 - 0x0000)
struct BP_BalloonDropManager_C_FindWeightedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        SumOfValues;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Determine_Index_FoundIndex;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeightedDropStructure               CallFunc_Array_Get_Item_1;                         // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_FindWeightedIndex) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_FindWeightedIndex");
static_assert(sizeof(BP_BalloonDropManager_C_FindWeightedIndex) == 0x000078, "Wrong size on BP_BalloonDropManager_C_FindWeightedIndex");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Index_0) == 0x000000, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Index_0' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Values) == 0x000008, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Values' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, SumOfValues) == 0x000018, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::SumOfValues' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Determine_Index_FoundIndex) == 0x000040, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Determine_Index_FoundIndex' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_FindWeightedIndex, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_BalloonDropManager_C_FindWeightedIndex::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.GetRandomSpawnDelay
// 0x0020 (0x0020 - 0x0000)
struct BP_BalloonDropManager_C_GetRandomSpawnDelay final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_GetRandomSpawnDelay) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_GetRandomSpawnDelay");
static_assert(sizeof(BP_BalloonDropManager_C_GetRandomSpawnDelay) == 0x000020, "Wrong size on BP_BalloonDropManager_C_GetRandomSpawnDelay");
static_assert(offsetof(BP_BalloonDropManager_C_GetRandomSpawnDelay, ReturnValue) == 0x000000, "Member 'BP_BalloonDropManager_C_GetRandomSpawnDelay::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetRandomSpawnDelay, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_BalloonDropManager_C_GetRandomSpawnDelay::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetRandomSpawnDelay, CallFunc_RandomFloatInRange_Min_ImplicitCast) == 0x000010, "Member 'BP_BalloonDropManager_C_GetRandomSpawnDelay::CallFunc_RandomFloatInRange_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetRandomSpawnDelay, CallFunc_RandomFloatInRange_Max_ImplicitCast) == 0x000018, "Member 'BP_BalloonDropManager_C_GetRandomSpawnDelay::CallFunc_RandomFloatInRange_Max_ImplicitCast' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.GetSpawnPoint
// 0x0148 (0x0148 - 0x0000)
struct BP_BalloonDropManager_C_GetSpawnPoint final
{
public:
	class ABP_BalloonDropSpawn_C*                 Spawn;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropSpawn_C*                 SpawnToReturn;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BalloonDropSpawn_C*                 CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_GetSpawnPoint) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_GetSpawnPoint");
static_assert(sizeof(BP_BalloonDropManager_C_GetSpawnPoint) == 0x000148, "Wrong size on BP_BalloonDropManager_C_GetSpawnPoint");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, Spawn) == 0x000000, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::Spawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, SpawnToReturn) == 0x000008, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::SpawnToReturn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, Temp_int_Variable) == 0x000038, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x000040, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000138, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_Add_IntInt_ReturnValue) == 0x00013C, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetSpawnPoint, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_BalloonDropManager_C_GetSpawnPoint::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.GetTierDuration
// 0x0020 (0x0020 - 0x0000)
struct BP_BalloonDropManager_C_GetTierDuration final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_GetTierDuration) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_GetTierDuration");
static_assert(sizeof(BP_BalloonDropManager_C_GetTierDuration) == 0x000020, "Wrong size on BP_BalloonDropManager_C_GetTierDuration");
static_assert(offsetof(BP_BalloonDropManager_C_GetTierDuration, Duration) == 0x000000, "Member 'BP_BalloonDropManager_C_GetTierDuration::Duration' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetTierDuration, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_BalloonDropManager_C_GetTierDuration::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetTierDuration, CallFunc_RandomFloatInRange_Min_ImplicitCast) == 0x000010, "Member 'BP_BalloonDropManager_C_GetTierDuration::CallFunc_RandomFloatInRange_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_GetTierDuration, CallFunc_RandomFloatInRange_Max_ImplicitCast) == 0x000018, "Member 'BP_BalloonDropManager_C_GetTierDuration::CallFunc_RandomFloatInRange_Max_ImplicitCast' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.LastTierReached
// 0x0010 (0x0010 - 0x0000)
struct BP_BalloonDropManager_C_LastTierReached final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_LastTierReached) == 0x000004, "Wrong alignment on BP_BalloonDropManager_C_LastTierReached");
static_assert(sizeof(BP_BalloonDropManager_C_LastTierReached) == 0x000010, "Wrong size on BP_BalloonDropManager_C_LastTierReached");
static_assert(offsetof(BP_BalloonDropManager_C_LastTierReached, ReturnValue) == 0x000000, "Member 'BP_BalloonDropManager_C_LastTierReached::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_LastTierReached, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_BalloonDropManager_C_LastTierReached::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_LastTierReached, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_BalloonDropManager_C_LastTierReached::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_LastTierReached, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BalloonDropManager_C_LastTierReached::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3
// 0x0008 (0x0008 - 0x0000)
struct BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3");
static_assert(sizeof(BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3) == 0x000008, "Wrong size on BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3");
static_assert(offsetof(BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3, Loaded) == 0x000000, "Member 'BP_BalloonDropManager_C_OnLoaded_CF06CFC34CA7E6F21477C7A8E87C58C3::Loaded' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.OnTimeOfDayChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_BalloonDropManager_C_OnTimeOfDayChanged final
{
public:
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_OnTimeOfDayChanged) == 0x000001, "Wrong alignment on BP_BalloonDropManager_C_OnTimeOfDayChanged");
static_assert(sizeof(BP_BalloonDropManager_C_OnTimeOfDayChanged) == 0x000001, "Wrong size on BP_BalloonDropManager_C_OnTimeOfDayChanged");
static_assert(offsetof(BP_BalloonDropManager_C_OnTimeOfDayChanged, TimeOfDay) == 0x000000, "Member 'BP_BalloonDropManager_C_OnTimeOfDayChanged::TimeOfDay' has a wrong offset!");

// Function BP_BalloonDropManager.BP_BalloonDropManager_C.TryRandomiseTrapSpawn
// 0x0040 (0x0040 - 0x0000)
struct BP_BalloonDropManager_C_TryRandomiseTrapSpawn final
{
public:
	class UClass*                                 OriginalSpawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SpawnOut;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonDropManager_C_TryRandomiseTrapSpawn) == 0x000008, "Wrong alignment on BP_BalloonDropManager_C_TryRandomiseTrapSpawn");
static_assert(sizeof(BP_BalloonDropManager_C_TryRandomiseTrapSpawn) == 0x000040, "Wrong size on BP_BalloonDropManager_C_TryRandomiseTrapSpawn");
static_assert(offsetof(BP_BalloonDropManager_C_TryRandomiseTrapSpawn, OriginalSpawn) == 0x000000, "Member 'BP_BalloonDropManager_C_TryRandomiseTrapSpawn::OriginalSpawn' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_TryRandomiseTrapSpawn, SpawnOut) == 0x000008, "Member 'BP_BalloonDropManager_C_TryRandomiseTrapSpawn::SpawnOut' has a wrong offset!");
static_assert(offsetof(BP_BalloonDropManager_C_TryRandomiseTrapSpawn, Temp_class_Variable) == 0x000010, "Member 'BP_BalloonDropManager_C_TryRandomiseTrapSpawn::Temp_class_Variable' has a wrong offset!");
