#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonCrate_Trap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BalloonCrate_Trap.BP_BalloonCrate_Trap_C
// 0x0040 (0x02D0 - 0x0290)
class ABP_BalloonCrate_Trap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AlarmAudio;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        TickAudio;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FuseTime;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RingTime;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BalloonCrate_Trap(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Server_Detonate();
	void StartRing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BalloonCrate_Trap_C">();
	}
	static class ABP_BalloonCrate_Trap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BalloonCrate_Trap_C>();
	}
};
static_assert(alignof(ABP_BalloonCrate_Trap_C) == 0x000008, "Wrong alignment on ABP_BalloonCrate_Trap_C");
static_assert(sizeof(ABP_BalloonCrate_Trap_C) == 0x0002D0, "Wrong size on ABP_BalloonCrate_Trap_C");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, UberGraphFrame) == 0x000290, "Member 'ABP_BalloonCrate_Trap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, Box) == 0x000298, "Member 'ABP_BalloonCrate_Trap_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, ProjectileMovement) == 0x0002A0, "Member 'ABP_BalloonCrate_Trap_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, AlarmAudio) == 0x0002A8, "Member 'ABP_BalloonCrate_Trap_C::AlarmAudio' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, TickAudio) == 0x0002B0, "Member 'ABP_BalloonCrate_Trap_C::TickAudio' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, StaticMesh) == 0x0002B8, "Member 'ABP_BalloonCrate_Trap_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, FuseTime) == 0x0002C0, "Member 'ABP_BalloonCrate_Trap_C::FuseTime' has a wrong offset!");
static_assert(offsetof(ABP_BalloonCrate_Trap_C, RingTime) == 0x0002C8, "Member 'ABP_BalloonCrate_Trap_C::RingTime' has a wrong offset!");

}

