#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BoxingGlove_Default_Right_Equipable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Equipable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BoxingGlove_Default_Right_Equipable.BP_BoxingGlove_Default_Right_Equipable_C
// 0x0018 (0x02D8 - 0x02C0)
class ABP_BoxingGlove_Default_Right_Equipable_C final : public ABP_Equipable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BoxingGlove_Default_Right_Equipable_C; // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Trail;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void EnableTrail(bool Enable, double Duration);
	void ExecuteUbergraph_BP_BoxingGlove_Default_Right_Equipable(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BoxingGlove_Default_Right_Equipable_C">();
	}
	static class ABP_BoxingGlove_Default_Right_Equipable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BoxingGlove_Default_Right_Equipable_C>();
	}
};
static_assert(alignof(ABP_BoxingGlove_Default_Right_Equipable_C) == 0x000008, "Wrong alignment on ABP_BoxingGlove_Default_Right_Equipable_C");
static_assert(sizeof(ABP_BoxingGlove_Default_Right_Equipable_C) == 0x0002D8, "Wrong size on ABP_BoxingGlove_Default_Right_Equipable_C");
static_assert(offsetof(ABP_BoxingGlove_Default_Right_Equipable_C, UberGraphFrame_BP_BoxingGlove_Default_Right_Equipable_C) == 0x0002C0, "Member 'ABP_BoxingGlove_Default_Right_Equipable_C::UberGraphFrame_BP_BoxingGlove_Default_Right_Equipable_C' has a wrong offset!");
static_assert(offsetof(ABP_BoxingGlove_Default_Right_Equipable_C, Trail) == 0x0002C8, "Member 'ABP_BoxingGlove_Default_Right_Equipable_C::Trail' has a wrong offset!");
static_assert(offsetof(ABP_BoxingGlove_Default_Right_Equipable_C, SkeletalMesh) == 0x0002D0, "Member 'ABP_BoxingGlove_Default_Right_Equipable_C::SkeletalMesh' has a wrong offset!");

}

