#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonDropSpawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BalloonDropSpawn.BP_BalloonDropSpawn_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_BalloonDropSpawn_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HorizontalOffset;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GroundLocation;                                    // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenUsed;                                       // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddSegmentsToSpline(double Distance);
	void AddSwayToSpline();
	void CreateSpline();
	void ExecuteUbergraph_BP_BalloonDropSpawn(int32 EntryPoint);
	void Server_SpawnCrate(class UClass* BoxVariantToSpawn, class UClass* ItemInside);
	void StraightenEndPoint();
	bool TraceForGround(struct FHitResult* OutHit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BalloonDropSpawn_C">();
	}
	static class ABP_BalloonDropSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BalloonDropSpawn_C>();
	}
};
static_assert(alignof(ABP_BalloonDropSpawn_C) == 0x000008, "Wrong alignment on ABP_BalloonDropSpawn_C");
static_assert(sizeof(ABP_BalloonDropSpawn_C) == 0x0002E0, "Wrong size on ABP_BalloonDropSpawn_C");
static_assert(offsetof(ABP_BalloonDropSpawn_C, UberGraphFrame) == 0x000290, "Member 'ABP_BalloonDropSpawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, Spline) == 0x000298, "Member 'ABP_BalloonDropSpawn_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, Billboard) == 0x0002A0, "Member 'ABP_BalloonDropSpawn_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_BalloonDropSpawn_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, Segments) == 0x0002B0, "Member 'ABP_BalloonDropSpawn_C::Segments' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, HorizontalOffset) == 0x0002B8, "Member 'ABP_BalloonDropSpawn_C::HorizontalOffset' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, GroundLocation) == 0x0002C0, "Member 'ABP_BalloonDropSpawn_C::GroundLocation' has a wrong offset!");
static_assert(offsetof(ABP_BalloonDropSpawn_C, HasBeenUsed) == 0x0002D8, "Member 'ABP_BalloonDropSpawn_C::HasBeenUsed' has a wrong offset!");

}

