#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BalloonCrate_BeartrapLauncher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BalloonCrate_BeartrapLauncher.BP_BalloonCrate_BeartrapLauncher_C.ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher
// 0x0120 (0x0120 - 0x0000)
struct BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NeutralBearTrap_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Direction;                      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher) == 0x000010, "Wrong alignment on BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher");
static_assert(sizeof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher) == 0x000120, "Wrong size on BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, EntryPoint) == 0x000000, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, Temp_int_Variable) == 0x000008, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_GetActorUpVector_ReturnValue) == 0x000010, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B8, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, K2Node_CustomEvent_Direction) == 0x0000C8, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_Normal_ReturnValue) == 0x0000F8, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000118, "Member 'BP_BalloonCrate_BeartrapLauncher_C_ExecuteUbergraph_BP_BalloonCrate_BeartrapLauncher::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BalloonCrate_BeartrapLauncher.BP_BalloonCrate_BeartrapLauncher_C.Server_LaunchTraps
// 0x0018 (0x0018 - 0x0000)
struct BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps) == 0x000008, "Wrong alignment on BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps");
static_assert(sizeof(BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps) == 0x000018, "Wrong size on BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps, Direction) == 0x000000, "Member 'BP_BalloonCrate_BeartrapLauncher_C_Server_LaunchTraps::Direction' has a wrong offset!");

// Function BP_BalloonCrate_BeartrapLauncher.BP_BalloonCrate_BeartrapLauncher_C.SetDirections
// 0x0160 (0x0160 - 0x0000)
struct BP_BalloonCrate_BeartrapLauncher_C_SetDirections final
{
public:
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections) == 0x000008, "Wrong alignment on BP_BalloonCrate_BeartrapLauncher_C_SetDirections");
static_assert(sizeof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections) == 0x000160, "Wrong size on BP_BalloonCrate_BeartrapLauncher_C_SetDirections");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000000, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000040, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Normal_ReturnValue) == 0x000058, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Normal_ReturnValue_1) == 0x000070, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000088, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000A0, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0000B8, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Normal_ReturnValue_2) == 0x0000D0, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Normal_ReturnValue_3) == 0x0000E8, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Normal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_GetActorForwardVector_ReturnValue) == 0x000100, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_GetActorRightVector_ReturnValue) == 0x000118, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000130, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BalloonCrate_BeartrapLauncher_C_SetDirections, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000148, "Member 'BP_BalloonCrate_BeartrapLauncher_C_SetDirections::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");

}

