#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CosmeticFirecracker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CosmeticFirecracker.BP_CosmeticFirecracker_C.BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x00F8 (0x00F8 - 0x0000)
struct BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x0000F8, "Wrong size on BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_CosmeticFirecracker_C_BndEvt__BP_CosmeticFirecracker_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BP_CosmeticFirecracker.BP_CosmeticFirecracker_C.ExecuteUbergraph_BP_CosmeticFirecracker
// 0x0108 (0x0108 - 0x0000)
struct BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0010(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker) == 0x000008, "Wrong alignment on BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker");
static_assert(sizeof(BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker) == 0x000108, "Wrong size on BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker");
static_assert(offsetof(BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker, EntryPoint) == 0x000000, "Member 'BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker, K2Node_ComponentBoundEvent_ImpactResult) == 0x000010, "Member 'BP_CosmeticFirecracker_C_ExecuteUbergraph_BP_CosmeticFirecracker::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");

// Function BP_CosmeticFirecracker.BP_CosmeticFirecracker_C.SetCollisionEnabled
// 0x0010 (0x0010 - 0x0000)
struct BP_CosmeticFirecracker_C_SetCollisionEnabled final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Ignore;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticFirecracker_C_SetCollisionEnabled) == 0x000008, "Wrong alignment on BP_CosmeticFirecracker_C_SetCollisionEnabled");
static_assert(sizeof(BP_CosmeticFirecracker_C_SetCollisionEnabled) == 0x000010, "Wrong size on BP_CosmeticFirecracker_C_SetCollisionEnabled");
static_assert(offsetof(BP_CosmeticFirecracker_C_SetCollisionEnabled, Target) == 0x000000, "Member 'BP_CosmeticFirecracker_C_SetCollisionEnabled::Target' has a wrong offset!");
static_assert(offsetof(BP_CosmeticFirecracker_C_SetCollisionEnabled, Ignore) == 0x000008, "Member 'BP_CosmeticFirecracker_C_SetCollisionEnabled::Ignore' has a wrong offset!");

// Function BP_CosmeticFirecracker.BP_CosmeticFirecracker_C.SetSpeed
// 0x0008 (0x0008 - 0x0000)
struct BP_CosmeticFirecracker_C_SetSpeed final
{
public:
	float                                         K2Node_VariableSet_ProjectileGravityScale_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSpeed_ImplicitCast;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CosmeticFirecracker_C_SetSpeed) == 0x000004, "Wrong alignment on BP_CosmeticFirecracker_C_SetSpeed");
static_assert(sizeof(BP_CosmeticFirecracker_C_SetSpeed) == 0x000008, "Wrong size on BP_CosmeticFirecracker_C_SetSpeed");
static_assert(offsetof(BP_CosmeticFirecracker_C_SetSpeed, K2Node_VariableSet_ProjectileGravityScale_ImplicitCast) == 0x000000, "Member 'BP_CosmeticFirecracker_C_SetSpeed::K2Node_VariableSet_ProjectileGravityScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CosmeticFirecracker_C_SetSpeed, K2Node_VariableSet_MaxSpeed_ImplicitCast) == 0x000004, "Member 'BP_CosmeticFirecracker_C_SetSpeed::K2Node_VariableSet_MaxSpeed_ImplicitCast' has a wrong offset!");

}

