#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ClosetStore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_StoreBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ClosetStore.BP_ClosetStore_C
// 0x01A0 (0x0618 - 0x0478)
class ABP_ClosetStore_C final : public ABP_StoreBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ClosetStore_C;                   // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent8;            // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent7;            // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent6;            // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent5;            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent4;            // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent9;                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent8;                      // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent7;                      // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent6;                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent5;                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent4;                      // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent3;                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent2;                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Nail_StaticMeshComponent1;                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CansInstancedStaticMesh;                           // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          NailsBackInstancedStaticMesh;                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent3;            // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent2;            // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_SeedpackCarrot_StaticMeshComponent1;            // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          TrapInstancedStaticMesh;                           // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioDoor;                                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxOpen;                                           // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Carrot3_StaticMeshComponent2;                   // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rake;                                              // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LadderB;                                           // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LadderA;                                           // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AlarmClockBomb2_StaticMeshComponent0;           // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Carrot2_StaticMeshComponent0;                   // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lockpick_Standert2_StaticMeshComponent0;        // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Apple2_StaticMeshComponent0;                    // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Pie3_StaticMeshComponent0;                      // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_mop_stylized3_StaticMeshComponent0;             // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tincan_Box_Empty4_StaticMeshComponent0;         // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_CardboardBox2_StaticMeshComponent0;             // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RC_Plane_Gunbird2_StaticMeshComponent0;         // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hedgeTrimmer_a_StaticMeshComponent0;            // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_golfClub3_StaticMeshComponent0;                 // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Spade_StaticMeshComponent0;                     // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BaseBallBat2_StaticMeshComponent0;              // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BaseBallBat3_StaticMeshComponent0;              // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antique_Handsaw4_StaticMeshComponent0;          // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Sledgehammer2_StaticMeshComponent0;             // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antique_Handsaw3_StaticMeshComponent0;          // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_OrangeCannon2_StaticMeshComponent0;             // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Generator_MasterVibrator2_StaticMeshComponent0; // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_WoodCrateA2_StaticMeshComponent0;               // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_5_StaticMeshComponent0;         // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Plank_Barricade_6_StaticMeshComponent0;         // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Closet;                                            // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Open;                                              // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ClosetStore_BoxOpen_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_ClosetStore_BoxOpen_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Close_Closet();
	void Cosmetic_Collect(class AActor* Target);
	void ExecuteUbergraph_BP_ClosetStore(int32 EntryPoint);
	void HideInterior();
	void MeshesToHide(TArray<class UPrimitiveComponent*>* TargetMeshes);
	void Open_Closet();
	void PlayDoorSound(class USoundBase* NewSound);
	void SetTeamMaterial(bool SameTeam, class UMaterialInterface* Red, class UMaterialInterface* Blue);
	bool ShouldClose();
	bool ShouldOpen(class UObject* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ClosetStore_C">();
	}
	static class ABP_ClosetStore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ClosetStore_C>();
	}
};
static_assert(alignof(ABP_ClosetStore_C) == 0x000008, "Wrong alignment on ABP_ClosetStore_C");
static_assert(sizeof(ABP_ClosetStore_C) == 0x000618, "Wrong size on ABP_ClosetStore_C");
static_assert(offsetof(ABP_ClosetStore_C, UberGraphFrame_BP_ClosetStore_C) == 0x000478, "Member 'ABP_ClosetStore_C::UberGraphFrame_BP_ClosetStore_C' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent8) == 0x000480, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent7) == 0x000488, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent6) == 0x000490, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent5) == 0x000498, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent4) == 0x0004A0, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent9) == 0x0004A8, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent8) == 0x0004B0, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent7) == 0x0004B8, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent6) == 0x0004C0, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent5) == 0x0004C8, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent4) == 0x0004D0, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent3) == 0x0004D8, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent2) == 0x0004E0, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Nail_StaticMeshComponent1) == 0x0004E8, "Member 'ABP_ClosetStore_C::Sm_Nail_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, CansInstancedStaticMesh) == 0x0004F0, "Member 'ABP_ClosetStore_C::CansInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, NailsBackInstancedStaticMesh) == 0x0004F8, "Member 'ABP_ClosetStore_C::NailsBackInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent3) == 0x000500, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent2) == 0x000508, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_SeedpackCarrot_StaticMeshComponent1) == 0x000510, "Member 'ABP_ClosetStore_C::Sm_SeedpackCarrot_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, TrapInstancedStaticMesh) == 0x000518, "Member 'ABP_ClosetStore_C::TrapInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, AudioDoor) == 0x000520, "Member 'ABP_ClosetStore_C::AudioDoor' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, BoxOpen) == 0x000528, "Member 'ABP_ClosetStore_C::BoxOpen' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Carrot3_StaticMeshComponent2) == 0x000530, "Member 'ABP_ClosetStore_C::Sm_Carrot3_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Rake) == 0x000538, "Member 'ABP_ClosetStore_C::Rake' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, LadderB) == 0x000540, "Member 'ABP_ClosetStore_C::LadderB' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, LadderA) == 0x000548, "Member 'ABP_ClosetStore_C::LadderA' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_AlarmClockBomb2_StaticMeshComponent0) == 0x000550, "Member 'ABP_ClosetStore_C::SM_AlarmClockBomb2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Carrot2_StaticMeshComponent0) == 0x000558, "Member 'ABP_ClosetStore_C::Sm_Carrot2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Lockpick_Standert2_StaticMeshComponent0) == 0x000560, "Member 'ABP_ClosetStore_C::SM_Lockpick_Standert2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Apple2_StaticMeshComponent0) == 0x000568, "Member 'ABP_ClosetStore_C::Sm_Apple2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_Pie3_StaticMeshComponent0) == 0x000570, "Member 'ABP_ClosetStore_C::Sm_Pie3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_mop_stylized3_StaticMeshComponent0) == 0x000578, "Member 'ABP_ClosetStore_C::SM_mop_stylized3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Tincan_Box_Empty4_StaticMeshComponent0) == 0x000580, "Member 'ABP_ClosetStore_C::SM_Tincan_Box_Empty4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_CardboardBox2_StaticMeshComponent0) == 0x000588, "Member 'ABP_ClosetStore_C::Sm_CardboardBox2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_RC_Plane_Gunbird2_StaticMeshComponent0) == 0x000590, "Member 'ABP_ClosetStore_C::SM_RC_Plane_Gunbird2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_hedgeTrimmer_a_StaticMeshComponent0) == 0x000598, "Member 'ABP_ClosetStore_C::SM_hedgeTrimmer_a_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_golfClub3_StaticMeshComponent0) == 0x0005A0, "Member 'ABP_ClosetStore_C::SM_golfClub3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Spade_StaticMeshComponent0) == 0x0005A8, "Member 'ABP_ClosetStore_C::SM_Spade_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_BaseBallBat2_StaticMeshComponent0) == 0x0005B0, "Member 'ABP_ClosetStore_C::SM_BaseBallBat2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_BaseBallBat3_StaticMeshComponent0) == 0x0005B8, "Member 'ABP_ClosetStore_C::SM_BaseBallBat3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Antique_Handsaw4_StaticMeshComponent0) == 0x0005C0, "Member 'ABP_ClosetStore_C::SM_Antique_Handsaw4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Sledgehammer2_StaticMeshComponent0) == 0x0005C8, "Member 'ABP_ClosetStore_C::SM_Sledgehammer2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Antique_Handsaw3_StaticMeshComponent0) == 0x0005D0, "Member 'ABP_ClosetStore_C::SM_Antique_Handsaw3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_OrangeCannon2_StaticMeshComponent0) == 0x0005D8, "Member 'ABP_ClosetStore_C::SM_OrangeCannon2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Generator_MasterVibrator2_StaticMeshComponent0) == 0x0005E0, "Member 'ABP_ClosetStore_C::SM_Generator_MasterVibrator2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Sm_WoodCrateA2_StaticMeshComponent0) == 0x0005E8, "Member 'ABP_ClosetStore_C::Sm_WoodCrateA2_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Plank_Barricade_5_StaticMeshComponent0) == 0x0005F0, "Member 'ABP_ClosetStore_C::SM_Plank_Barricade_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SM_Plank_Barricade_6_StaticMeshComponent0) == 0x0005F8, "Member 'ABP_ClosetStore_C::SM_Plank_Barricade_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Closet) == 0x000600, "Member 'ABP_ClosetStore_C::Closet' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, SharedRoot) == 0x000608, "Member 'ABP_ClosetStore_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ABP_ClosetStore_C, Open) == 0x000610, "Member 'ABP_ClosetStore_C::Open' has a wrong offset!");

}

