#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureTheFlagDeedSafe

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.ExecuteUbergraph_BP_CaptureTheFlagDeedSafe
// 0x0550 (0x0550 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SabotagingActor;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpectatorPawn_ReturnValue;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PickerController_1;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpectatorPawn_ReturnValue_1;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PickerController;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_InResponsibleController;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0120(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0140(0x0058)()
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Deed_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLockPickDuration_Return;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage_1;                 // 0x0248(0x0058)()
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x02A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0398(0x0058)(ConstParm)
	class APlayerState*                           K2Node_CustomEvent_PlayerState;                    // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration_1;                     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_BlendTime;                      // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0420(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0430(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Time_ImplicitCast;               // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe) == 0x000010, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe) == 0x000550, "Wrong size on BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, EntryPoint) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000028, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, Temp_bool_IsClosed_Variable) == 0x00005C, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, Temp_bool_Has_Been_Initd_Variable) == 0x00005D, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_HasAuthority_ReturnValue) == 0x00005E, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, Temp_bool_IsClosed_Variable_1) == 0x00005F, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, Temp_bool_Has_Been_Initd_Variable_1) == 0x000060, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_HasAuthority_ReturnValue_1) == 0x000061, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_Event_SabotagingActor) == 0x000068, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_Event_SabotagingActor' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_DynamicCast_AsCharacter) == 0x000070, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_DynamicCast_AsPlayer_Controller) == 0x000088, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_IsSpectatorPawn_ReturnValue) == 0x000091, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_IsSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_SpawnSound2D_ReturnValue) == 0x000098, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_Event_PickerController_1) == 0x0000A0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_Event_PickerController_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000D8, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_IsSpectatorPawn_ReturnValue_1) == 0x0000E0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_IsSpectatorPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_Event_PickerController) == 0x0000E8, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_Event_PickerController' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CustomEvent_InResponsibleController) == 0x000118, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CustomEvent_InResponsibleController' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000120, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000130, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_MakeStruct_PlayerMessage) == 0x000140, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0001A0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000200, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_FinishSpawningActor_ReturnValue) == 0x000208, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetLockPickDuration_Return) == 0x000210, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetLockPickDuration_Return' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000218, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Lerp_ReturnValue) == 0x000220, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000228, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_MakeRotator_ReturnValue_1) == 0x000230, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_MakeStruct_PlayerMessage_1) == 0x000248, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_MakeStruct_PlayerMessage_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0002A0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000398, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CustomEvent_PlayerState) == 0x0003F0, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CustomEvent_Duration_1) == 0x0003F8, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CustomEvent_Duration_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000400, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetPawn_ReturnValue) == 0x000408, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_IsLocallyControlled_ReturnValue) == 0x000410, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CustomEvent_BlendTime) == 0x000414, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CustomEvent_BlendTime' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_CustomEvent_Duration) == 0x000418, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000420, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetPlayerController_ReturnValue) == 0x000428, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000430, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_GetOwner_ReturnValue) == 0x000528, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000530, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000538, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_Delay_Duration_ImplicitCast) == 0x00053C, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, K2Node_MakeStruct_Time_ImplicitCast) == 0x000540, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::K2Node_MakeStruct_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000544, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000548, "Member 'BP_CaptureTheFlagDeedSafe_C_ExecuteUbergraph_BP_CaptureTheFlagDeedSafe::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.GetLockPickDuration
// 0x0018 (0x0018 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration final
{
public:
	int32                                         Return;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPie_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration) == 0x000004, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration) == 0x000018, "Wrong size on BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, Return) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::Return' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, Temp_bool_Variable) == 0x000004, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, Temp_int_Variable) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, Temp_int_Variable_1) == 0x00000C, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, CallFunc_GetIsPie_ReturnValue) == 0x000010, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::CallFunc_GetIsPie_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration, K2Node_Select_Default) == 0x000014, "Member 'BP_CaptureTheFlagDeedSafe_C_GetLockPickDuration::K2Node_Select_Default' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.IsClosed
// 0x0001 (0x0001 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_IsClosed final
{
public:
	bool                                          Open_0;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_IsClosed) == 0x000001, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_IsClosed");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_IsClosed) == 0x000001, "Wrong size on BP_CaptureTheFlagDeedSafe_C_IsClosed");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsClosed, Open_0) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_IsClosed::Open_0' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.IsNotLockpickable
// 0x0001 (0x0001 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable final
{
public:
	bool                                          IsNotLockpickable_0;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable) == 0x000001, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable) == 0x000001, "Wrong size on BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable, IsNotLockpickable_0) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_IsNotLockpickable::IsNotLockpickable_0' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.IsSameTeamAsPlayer0
// 0x0038 (0x0038 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0) == 0x000038, "Wrong size on BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, ReturnValue) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, Temp_byte_Variable) == 0x000001, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, CallFunc_GetTeamID_ReturnValue) == 0x000018, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, K2Node_DynamicCast_AsTeamable_Interface) == 0x000020, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0, CallFunc_GetTeamID_ReturnValue_1) == 0x000032, "Member 'BP_CaptureTheFlagDeedSafe_C_IsSameTeamAsPlayer0::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.LockpickBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_LockpickBegin final
{
public:
	class APlayerController*                      PickerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_LockpickBegin) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_LockpickBegin");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_LockpickBegin) == 0x000008, "Wrong size on BP_CaptureTheFlagDeedSafe_C_LockpickBegin");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_LockpickBegin, PickerController) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_LockpickBegin::PickerController' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.LockpickSuccess
// 0x0008 (0x0008 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_LockpickSuccess final
{
public:
	class APlayerController*                      PickerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_LockpickSuccess) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_LockpickSuccess");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_LockpickSuccess) == 0x000008, "Wrong size on BP_CaptureTheFlagDeedSafe_C_LockpickSuccess");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_LockpickSuccess, PickerController) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_LockpickSuccess::PickerController' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.OpenSafe
// 0x0008 (0x0008 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_OpenSafe final
{
public:
	class APlayerController*                      InResponsibleController;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_OpenSafe) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_OpenSafe");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_OpenSafe) == 0x000008, "Wrong size on BP_CaptureTheFlagDeedSafe_C_OpenSafe");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_OpenSafe, InResponsibleController) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_OpenSafe::InResponsibleController' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.ReceivedDeed
// 0x0020 (0x0020 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_ReceivedDeed final
{
public:
	uint8                                         TeamWhoHandedIn;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         DeedTeamID;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCondition*                          CallFunc_GetEndCondition_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACaptureTheFlagEndCondition_C*          K2Node_DynamicCast_AsCapture_the_Flag_End_Condition; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_ReceivedDeed");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed) == 0x000020, "Wrong size on BP_CaptureTheFlagDeedSafe_C_ReceivedDeed");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, TeamWhoHandedIn) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::TeamWhoHandedIn' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, DeedTeamID) == 0x000001, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::DeedTeamID' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, CallFunc_HasAuthority_ReturnValue) == 0x000002, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, CallFunc_GetEndCondition_ReturnValue) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::CallFunc_GetEndCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, K2Node_DynamicCast_AsCapture_the_Flag_End_Condition) == 0x000010, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::K2Node_DynamicCast_AsCapture_the_Flag_End_Condition' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_ReceivedDeed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CaptureTheFlagDeedSafe_C_ReceivedDeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.SetMaterialBasedOnTeam
// 0x0028 (0x0028 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSameTeamAsPlayer0_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam) == 0x000028, "Wrong size on BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam, Temp_bool_Variable) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam, Temp_object_Variable) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam, Temp_object_Variable_1) == 0x000010, "Member 'BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam, CallFunc_IsSameTeamAsPlayer0_ReturnValue) == 0x000018, "Member 'BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam::CallFunc_IsSameTeamAsPlayer0_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam, K2Node_Select_Default) == 0x000020, "Member 'BP_CaptureTheFlagDeedSafe_C_SetMaterialBasedOnTeam::K2Node_Select_Default' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.StartTutorialPOI
// 0x0010 (0x0010 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI) == 0x000010, "Wrong size on BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI, PlayerState) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI::PlayerState' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI, Duration) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_StartTutorialPOI::Duration' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.SwitchToObjectCamera
// 0x0010 (0x0010 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera) == 0x000010, "Wrong size on BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera, BlendTime) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera, Duration) == 0x000008, "Member 'BP_CaptureTheFlagDeedSafe_C_SwitchToObjectCamera::Duration' has a wrong offset!");

// Function BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C.Sabotage
// 0x0008 (0x0008 - 0x0000)
struct BP_CaptureTheFlagDeedSafe_C_Sabotage final
{
public:
	class AActor*                                 SabotagingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagDeedSafe_C_Sabotage) == 0x000008, "Wrong alignment on BP_CaptureTheFlagDeedSafe_C_Sabotage");
static_assert(sizeof(BP_CaptureTheFlagDeedSafe_C_Sabotage) == 0x000008, "Wrong size on BP_CaptureTheFlagDeedSafe_C_Sabotage");
static_assert(offsetof(BP_CaptureTheFlagDeedSafe_C_Sabotage, SabotagingActor) == 0x000000, "Member 'BP_CaptureTheFlagDeedSafe_C_Sabotage::SabotagingActor' has a wrong offset!");

}

