#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureTheFlagDeedSafe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HouseActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CaptureTheFlagDeedSafe.BP_CaptureTheFlagDeedSafe_C
// 0x00A8 (0x0498 - 0x03F0)
class ABP_CaptureTheFlagDeedSafe_C final : public AHouseActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CaptureTheFlagDeedSafe_C;        // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CameraRotator;                                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PingableComponent_C*                BP_PingableComponent;                              // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_POI_C*                              LockpickPOI;                                       // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioAlarm;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_POI_C*                              TeamPOI;                                           // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxSafe;                                           // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneDeedSpawnLocation;                            // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxLockPick;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Door;                                           // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Safe;                                           // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotation_BBB75B954B9FD0BA08E84BA0EFC35B71; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_BBB75B954B9FD0BA08E84BA0EFC35B71; // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DoorRotation_Alpha_074738E642AE91485CB113ABC67D3BD7; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DoorRotation__Direction_074738E642AE91485CB113ABC67D3BD7; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DoorRotation;                                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Open;                                              // 0x0480(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CameraEventFinished;                               // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CameraEventFinished__DelegateSignature();
	void Close_Door();
	void DoorRotation__FinishedFunc();
	void DoorRotation__UpdateFunc();
	void ExecuteUbergraph_BP_CaptureTheFlagDeedSafe(int32 EntryPoint);
	void GetLockPickDuration(int32* Return);
	void IntroFinished();
	void IsClosed(bool* Open_0);
	void IsNotLockpickable(bool* IsNotLockpickable_0);
	bool IsSameTeamAsPlayer0();
	void LockpickBegin(class APlayerController* PickerController);
	void LockpickSuccess(class APlayerController* PickerController);
	void Multi_Received_Deed();
	void OnEnded_0DEC67474BFED95DB200D0B8E365F46B();
	void OnRep_Open();
	void Open_Door();
	void OpenSafe(class APlayerController* InResponsibleController);
	void ReceivedDeed(uint8 TeamWhoHandedIn, uint8 DeedTeamID);
	void RemoveTutorialPOI();
	void Reset_Open_Do_Once();
	void SetMaterialBasedOnTeam();
	void StartTutorialPOI(class APlayerState* PlayerState, double Duration);
	void SwitchToObjectCamera(float BlendTime, double Duration);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void Repair();
	void Sabotage(class AActor* SabotagingActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CaptureTheFlagDeedSafe_C">();
	}
	static class ABP_CaptureTheFlagDeedSafe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CaptureTheFlagDeedSafe_C>();
	}
};
static_assert(alignof(ABP_CaptureTheFlagDeedSafe_C) == 0x000008, "Wrong alignment on ABP_CaptureTheFlagDeedSafe_C");
static_assert(sizeof(ABP_CaptureTheFlagDeedSafe_C) == 0x000498, "Wrong size on ABP_CaptureTheFlagDeedSafe_C");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, UberGraphFrame_BP_CaptureTheFlagDeedSafe_C) == 0x0003F0, "Member 'ABP_CaptureTheFlagDeedSafe_C::UberGraphFrame_BP_CaptureTheFlagDeedSafe_C' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Camera) == 0x0003F8, "Member 'ABP_CaptureTheFlagDeedSafe_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, CameraRotator) == 0x000400, "Member 'ABP_CaptureTheFlagDeedSafe_C::CameraRotator' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, BP_PingableComponent) == 0x000408, "Member 'ABP_CaptureTheFlagDeedSafe_C::BP_PingableComponent' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, LockpickPOI) == 0x000410, "Member 'ABP_CaptureTheFlagDeedSafe_C::LockpickPOI' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, AudioAlarm) == 0x000418, "Member 'ABP_CaptureTheFlagDeedSafe_C::AudioAlarm' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Plane) == 0x000420, "Member 'ABP_CaptureTheFlagDeedSafe_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, TeamPOI) == 0x000428, "Member 'ABP_CaptureTheFlagDeedSafe_C::TeamPOI' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, BoxSafe) == 0x000430, "Member 'ABP_CaptureTheFlagDeedSafe_C::BoxSafe' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, SceneDeedSpawnLocation) == 0x000438, "Member 'ABP_CaptureTheFlagDeedSafe_C::SceneDeedSpawnLocation' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, BoxLockPick) == 0x000440, "Member 'ABP_CaptureTheFlagDeedSafe_C::BoxLockPick' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, SM_Door) == 0x000448, "Member 'ABP_CaptureTheFlagDeedSafe_C::SM_Door' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, SM_Safe) == 0x000450, "Member 'ABP_CaptureTheFlagDeedSafe_C::SM_Safe' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, SceneRoot) == 0x000458, "Member 'ABP_CaptureTheFlagDeedSafe_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Timeline_Rotation_BBB75B954B9FD0BA08E84BA0EFC35B71) == 0x000460, "Member 'ABP_CaptureTheFlagDeedSafe_C::Timeline_Rotation_BBB75B954B9FD0BA08E84BA0EFC35B71' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Timeline__Direction_BBB75B954B9FD0BA08E84BA0EFC35B71) == 0x000464, "Member 'ABP_CaptureTheFlagDeedSafe_C::Timeline__Direction_BBB75B954B9FD0BA08E84BA0EFC35B71' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Timeline) == 0x000468, "Member 'ABP_CaptureTheFlagDeedSafe_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, DoorRotation_Alpha_074738E642AE91485CB113ABC67D3BD7) == 0x000470, "Member 'ABP_CaptureTheFlagDeedSafe_C::DoorRotation_Alpha_074738E642AE91485CB113ABC67D3BD7' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, DoorRotation__Direction_074738E642AE91485CB113ABC67D3BD7) == 0x000474, "Member 'ABP_CaptureTheFlagDeedSafe_C::DoorRotation__Direction_074738E642AE91485CB113ABC67D3BD7' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, DoorRotation) == 0x000478, "Member 'ABP_CaptureTheFlagDeedSafe_C::DoorRotation' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, Open) == 0x000480, "Member 'ABP_CaptureTheFlagDeedSafe_C::Open' has a wrong offset!");
static_assert(offsetof(ABP_CaptureTheFlagDeedSafe_C, CameraEventFinished) == 0x000488, "Member 'ABP_CaptureTheFlagDeedSafe_C::CameraEventFinished' has a wrong offset!");

}

