#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureTheFlagObjective

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CaptureTheFlagObjective.BP_CaptureTheFlagObjective_C.ExecuteUbergraph_BP_CaptureTheFlagObjective
// 0x00B0 (0x00B0 - 0x0000)
struct BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0008(0x0058)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SpawnTasks_ReturnValue;                   // 0x0068(0x0010)(ReferenceParm)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CaptureTheFlagDeedSafe_C*           K2Node_DynamicCast_AsBP_Capture_the_Flag_Deed_Safe; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective) == 0x000008, "Wrong alignment on BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective");
static_assert(sizeof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective) == 0x0000B0, "Wrong size on BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, EntryPoint) == 0x000000, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000008, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_SpawnTasks_ReturnValue) == 0x000068, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_SpawnTasks_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000078, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_GetTeamID_ReturnValue) == 0x000088, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, K2Node_DynamicCast_AsBP_Capture_the_Flag_Deed_Safe) == 0x000090, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::K2Node_DynamicCast_AsBP_Capture_the_Flag_Deed_Safe' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_HasAuthority_ReturnValue) == 0x0000A4, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_CaptureTheFlagObjective_C_ExecuteUbergraph_BP_CaptureTheFlagObjective::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CaptureTheFlagObjective.BP_CaptureTheFlagObjective_C.GetProgressionText
// 0x0098 (0x0098 - 0x0000)
struct BP_CaptureTheFlagObjective_C_GetProgressionText final
{
public:
	class FText                                   RowData;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
};
static_assert(alignof(BP_CaptureTheFlagObjective_C_GetProgressionText) == 0x000008, "Wrong alignment on BP_CaptureTheFlagObjective_C_GetProgressionText");
static_assert(sizeof(BP_CaptureTheFlagObjective_C_GetProgressionText) == 0x000098, "Wrong size on BP_CaptureTheFlagObjective_C_GetProgressionText");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, RowData) == 0x000000, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::RowData' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, ReturnValue) == 0x000010, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetProgressionText, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_CaptureTheFlagObjective_C_GetProgressionText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_CaptureTheFlagObjective.BP_CaptureTheFlagObjective_C.GetState
// 0x0001 (0x0001 - 0x0000)
struct BP_CaptureTheFlagObjective_C_GetState final
{
public:
	EObjectiveState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureTheFlagObjective_C_GetState) == 0x000001, "Wrong alignment on BP_CaptureTheFlagObjective_C_GetState");
static_assert(sizeof(BP_CaptureTheFlagObjective_C_GetState) == 0x000001, "Wrong size on BP_CaptureTheFlagObjective_C_GetState");
static_assert(offsetof(BP_CaptureTheFlagObjective_C_GetState, ReturnValue) == 0x000000, "Member 'BP_CaptureTheFlagObjective_C_GetState::ReturnValue' has a wrong offset!");

}

