#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Deployable_Magpie_Nest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_MagpieTargetPair_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.AbilitySystemComponentIsPlayer
// 0x0030 (0x0030 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                ResidentCharacter;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer) == 0x000030, "Wrong size on BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, TargetASC) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, IsPlayer) == 0x000008, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::IsPlayer' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, ResidentCharacter) == 0x000010, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::ResidentCharacter' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000020, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Deployable_Magpie_Nest_C_AbilitySystemComponentIsPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.BelongsToEnemyTeam
// 0x0028 (0x0028 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam final
{
public:
	class AActor*                                 TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnemy;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam) == 0x000028, "Wrong size on BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, TargetASC) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, IsEnemy) == 0x000008, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::IsEnemy' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, Temp_byte_Variable) == 0x000009, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, K2Node_DynamicCast_AsTeamable_Interface) == 0x000010, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, CallFunc_GetTeamID_ReturnValue) == 0x000021, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'BP_Deployable_Magpie_Nest_C_BelongsToEnemyTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.CleanPairFollowingState
// 0x0070 (0x0070 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_CleanPairFollowingState final
{
public:
	class ABP_Magpie_Projectile_C*                Bird;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item;                           // 0x0020(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    K2Node_MakeStruct_S_MagpieTargetPair;              // 0x0048(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_CleanPairFollowingState");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState) == 0x000070, "Wrong size on BP_Deployable_Magpie_Nest_C_CleanPairFollowingState");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, Bird) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::Bird' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, K2Node_MakeStruct_S_MagpieTargetPair) == 0x000048, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::K2Node_MakeStruct_S_MagpieTargetPair' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CleanPairFollowingState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_Deployable_Magpie_Nest_C_CleanPairFollowingState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.Contains Bird
// 0x0078 (0x0078 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_Contains_Bird final
{
public:
	class ABP_Magpie_Projectile_C*                Bird;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_MagpieTargetPair>            List;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    MagpieTargetPair;                                  // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item;                           // 0x0050(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_Contains_Bird) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_Contains_Bird");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_Contains_Bird) == 0x000078, "Wrong size on BP_Deployable_Magpie_Nest_C_Contains_Bird");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, Bird) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::Bird' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, List) == 0x000008, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::List' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, Return) == 0x000018, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::Return' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, MagpieTargetPair) == 0x000020, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::MagpieTargetPair' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_Contains_Bird, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_Deployable_Magpie_Nest_C_Contains_Bird::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.ContainsTarget
// 0x0078 (0x0078 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_ContainsTarget final
{
public:
	TArray<struct FS_MagpieTargetPair>            List;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 TargetASC;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    MagpieTargetPair;                                  // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item;                           // 0x0050(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_ContainsTarget) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_ContainsTarget");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_ContainsTarget) == 0x000078, "Wrong size on BP_Deployable_Magpie_Nest_C_ContainsTarget");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, List) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::List' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, TargetASC) == 0x000010, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, Return) == 0x000018, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::Return' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, MagpieTargetPair) == 0x000020, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::MagpieTargetPair' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ContainsTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_Deployable_Magpie_Nest_C_ContainsTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.CreateNewBird
// 0x0010 (0x0010 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_CreateNewBird final
{
public:
	class AActor*                                 TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StartPosition;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_CreateNewBird) == 0x000008, "Wrong alignment on BP_Deployable_Magpie_Nest_C_CreateNewBird");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_CreateNewBird) == 0x000010, "Wrong size on BP_Deployable_Magpie_Nest_C_CreateNewBird");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CreateNewBird, TargetASC) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_CreateNewBird::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_CreateNewBird, StartPosition) == 0x000008, "Member 'BP_Deployable_Magpie_Nest_C_CreateNewBird::StartPosition' has a wrong offset!");

// Function BP_Deployable_Magpie_Nest.BP_Deployable_Magpie_Nest_C.ExecuteUbergraph_BP_Deployable_Magpie_Nest
// 0x0750 (0x0750 - 0x0000)
struct BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetASC_1;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_StartPosition_2;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Magpie_Projectile_C*                K2Node_CustomEvent_ReturningBird;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0010)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0048)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)()
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHomingTarget_FoundTarget;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetHomingTarget_HomingTarget;             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_SpawnTransform;                 // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ProjectileSpeed;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Owner;                          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_HomingTarget;                   // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_TargetASC;                      // 0x0248(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_StartPosition_1;                // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Damage;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Magpie_Projectile_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    K2Node_MakeStruct_S_MagpieTargetPair;              // 0x0280(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class ABP_Magpie_Projectile_C*                K2Node_CustomEvent_BirdToReturn;                   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPairFromBird_FoundMatch;               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_GetPairFromBird_Pair;                     // 0x02B8(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target_ASC;                     // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Magpie_Projectile_C*                K2Node_CustomEvent_Bird;                           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_MagpieTargetPair                    CallFunc_GetNextAvailableBird_Pair;                // 0x02F0(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextAvailableBird_FoundAvailableBird;  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHomingTarget_FoundTarget_1;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetHomingTarget_HomingTarget_1;           // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPairFromBird_FoundMatch_1;             // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_GetPairFromBird_Pair_1;                   // 0x0338(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_Bird_Return;                     // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_Contains_Bird_MagpieTargetPair;           // 0x0370(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item;                           // 0x0390(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamIDFromPawn_ReturnValue;            // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array_1;                          // 0x03C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x03E8(0x0010)(ConstParm, ReferenceParm)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombatParticipant                     CallFunc_CreateCombatParticipantFromPlayer_ReturnValue; // 0x0408(0x0060)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0480(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0490(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetCharacter_1;              // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPriorityTarget;               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetCharacter;                // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x04B0(0x0010)(ConstParm, ReferenceParm)
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item_2;                         // 0x04C0(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTarget_Return;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_ContainsTarget_MagpieTargetPair;          // 0x04E8(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A[0x2];                                      // 0x050A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveBirdCount_Amount;                // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x051E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F[0x1];                                      // 0x051F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0528(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0540(0x0010)()
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x055D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E[0x2];                                      // 0x055E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_3;                          // 0x0560(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0570(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item_4;                         // 0x0588(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x05B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3[0x1];                                      // 0x05B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_5;                         // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLineOfSightOver_HasLineOfSite;         // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BelongsToEnemyTeam_IsEnemy;               // 0x05C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x05C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C7[0x1];                                      // 0x05C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x05D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDead_Dead;                           // 0x05EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinTriggerZone_toReturn;             // 0x05EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_7;                         // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_4;                          // 0x0618(0x0010)(ConstParm, ReferenceParm)
	class USceneComponent*                        K2Node_CustomEvent_StartPosition;                  // 0x0628(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visibility;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x0638(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_8;                         // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLineOfSightOver_HasLineOfSite_1;       // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BelongsToEnemyTeam_IsEnemy_1;             // 0x0662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663[0x1];                                      // 0x0663(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MagpieTargetPair                    CallFunc_Array_Get_Item_9;                         // 0x0670(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MagpieTargetPair                    K2Node_MakeStruct_S_MagpieTargetPair_1;            // 0x0698(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x06D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MagpieNest_Destroyed_C*             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest) == 0x000010, "Wrong alignment on BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest");
static_assert(sizeof(BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest) == 0x000750, "Wrong size on BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest, EntryPoint) == 0x000000, "Member 'BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Deployable_Magpie_Nest_C_ExecuteUbergraph_BP_Deployable_Magpie_Nest::Temp_int_Array_Index_Variable' has a wrong offset!");
