#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecalTaskSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DecalTaskSpawner.BP_DecalTaskSpawner_C.ExecuteUbergraph_BP_DecalTaskSpawner
// 0x0004 (0x0004 - 0x0000)
struct BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner) == 0x000004, "Wrong alignment on BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner");
static_assert(sizeof(BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner) == 0x000004, "Wrong size on BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner");
static_assert(offsetof(BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner, EntryPoint) == 0x000000, "Member 'BP_DecalTaskSpawner_C_ExecuteUbergraph_BP_DecalTaskSpawner::EntryPoint' has a wrong offset!");

// Function BP_DecalTaskSpawner.BP_DecalTaskSpawner_C.GetTaskTransform
// 0x0060 (0x0060 - 0x0000)
struct BP_DecalTaskSpawner_C_GetTaskTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DecalTaskSpawner_C_GetTaskTransform) == 0x000010, "Wrong alignment on BP_DecalTaskSpawner_C_GetTaskTransform");
static_assert(sizeof(BP_DecalTaskSpawner_C_GetTaskTransform) == 0x000060, "Wrong size on BP_DecalTaskSpawner_C_GetTaskTransform");
static_assert(offsetof(BP_DecalTaskSpawner_C_GetTaskTransform, ReturnValue) == 0x000000, "Member 'BP_DecalTaskSpawner_C_GetTaskTransform::ReturnValue' has a wrong offset!");

}

