#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryDropZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DeliveryDropZone.BP_DeliveryDropZone_C.BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DeliveryDropZone_C_BndEvt__BP_DeliveryDropZone_DeliverTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DeliveryDropZone.BP_DeliveryDropZone_C.ExecuteUbergraph_BP_DeliveryDropZone
// 0x0150 (0x0150 - 0x0000)
struct BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue_1;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DriveByVan_C*                       K2Node_DynamicCast_AsBP_Drive_by_Van;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone) == 0x000008, "Wrong alignment on BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone");
static_assert(sizeof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone) == 0x000150, "Wrong size on BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, EntryPoint) == 0x000000, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000120, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, CallFunc_ComponentHasTag_ReturnValue) == 0x000138, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, CallFunc_ComponentHasTag_ReturnValue_1) == 0x000139, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::CallFunc_ComponentHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_DynamicCast_AsBP_Drive_by_Van) == 0x000140, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_DynamicCast_AsBP_Drive_by_Van' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_DeliveryDropZone_C_ExecuteUbergraph_BP_DeliveryDropZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DeliveryDropZone.BP_DeliveryDropZone_C.GetRandomLocationInBox
// 0x0048 (0x0048 - 0x0000)
struct BP_DeliveryDropZone_C_GetRandomLocationInBox final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryDropZone_C_GetRandomLocationInBox) == 0x000008, "Wrong alignment on BP_DeliveryDropZone_C_GetRandomLocationInBox");
static_assert(sizeof(BP_DeliveryDropZone_C_GetRandomLocationInBox) == 0x000048, "Wrong size on BP_DeliveryDropZone_C_GetRandomLocationInBox");
static_assert(offsetof(BP_DeliveryDropZone_C_GetRandomLocationInBox, ReturnValue) == 0x000000, "Member 'BP_DeliveryDropZone_C_GetRandomLocationInBox::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_GetRandomLocationInBox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_DeliveryDropZone_C_GetRandomLocationInBox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeliveryDropZone_C_GetRandomLocationInBox, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000030, "Member 'BP_DeliveryDropZone_C_GetRandomLocationInBox::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");

// Function BP_DeliveryDropZone.BP_DeliveryDropZone_C.On_DeliveryTruckCollision__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature final
{
public:
	class ABP_DeliveryDropZone_C*                 DeliveryDropZone;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature) == 0x000008, "Wrong alignment on BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature");
static_assert(sizeof(BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature) == 0x000008, "Wrong size on BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature");
static_assert(offsetof(BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature, DeliveryDropZone) == 0x000000, "Member 'BP_DeliveryDropZone_C_On_DeliveryTruckCollision__DelegateSignature::DeliveryDropZone' has a wrong offset!");

}

