#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructableFence

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructableFence.BP_DestructableFence_C.CallOnClients
// 0x0008 (0x0008 - 0x0000)
struct BP_DestructableFence_C_CallOnClients final
{
public:
	class ASubObjective*                          SubObjective;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_CallOnClients) == 0x000008, "Wrong alignment on BP_DestructableFence_C_CallOnClients");
static_assert(sizeof(BP_DestructableFence_C_CallOnClients) == 0x000008, "Wrong size on BP_DestructableFence_C_CallOnClients");
static_assert(offsetof(BP_DestructableFence_C_CallOnClients, SubObjective) == 0x000000, "Member 'BP_DestructableFence_C_CallOnClients::SubObjective' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.Event On Team Replicated Cosmetic
// 0x0038 (0x0038 - 0x0000)
struct BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic final
{
public:
	struct FTeam                                  New_Team;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic) == 0x000008, "Wrong alignment on BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic");
static_assert(sizeof(BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic) == 0x000038, "Wrong size on BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic");
static_assert(offsetof(BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic, New_Team) == 0x000000, "Member 'BP_DestructableFence_C_Event_On_Team_Replicated_Cosmetic::New_Team' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.ExecuteUbergraph_BP_DestructableFence
// 0x0510 (0x0510 - 0x0000)
struct BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateStarted*            CallFunc_ListenToInitializationStateStarted_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable;                              // 0x0020(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable_1;                            // 0x0050(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location_1;                           // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitImpulse;                           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                K2Node_Event_ImpactEffect;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  K2Node_Event_New_Team;                             // 0x00D0(0x0038)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x0128(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x0188(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x0470(0x0018)(NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_CustomEvent_PlayerState;                    // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_Match*                   CallFunc_GetFirstPlayerStateJP_Match_ReturnValue;  // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASubObjective*                          K2Node_CustomEvent_SubObjective;                   // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast;        // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence) == 0x000008, "Wrong alignment on BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence");
static_assert(sizeof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence) == 0x000510, "Wrong size on BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, EntryPoint) == 0x000000, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_ListenToInitializationStateStarted_ReturnValue) == 0x000018, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_ListenToInitializationStateStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_struct_Variable) == 0x000020, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CustomEvent_ProxyObject) == 0x000040, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CustomEvent_ActualChannel) == 0x000048, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_struct_Variable_1) == 0x000050, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_struct_Variable_2) == 0x000058, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_object_Variable) == 0x000060, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000068, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetPayload_ReturnValue) == 0x000070, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_bool_IsClosed_Variable) == 0x000072, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000078, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_Location_1) == 0x000080, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_HitImpulse) == 0x000098, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_HitImpulse' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_ImpactEffect) == 0x0000B0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_ImpactEffect' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_IsValid_ReturnValue_2) == 0x0000B2, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x0000B3, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x0000B4, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x0000B8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x0000BC, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_New_Team) == 0x0000D0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_New_Team' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_Delta) == 0x000118, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_Causer) == 0x000120, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_CombatParticipant) == 0x000128, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_KillMethod) == 0x000188, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_KillMethod' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_Event_Location) == 0x000470, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CustomEvent_PlayerState) == 0x000488, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetPawn_ReturnValue) == 0x000490, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_IsLocallyControlled_ReturnValue) == 0x000498, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_HasAuthority_ReturnValue) == 0x000499, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_GetFirstPlayerStateJP_Match_ReturnValue) == 0x0004A0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_GetFirstPlayerStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, Temp_bool_Has_Been_Initd_Variable) == 0x0004A8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, K2Node_CustomEvent_SubObjective) == 0x0004B0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::K2Node_CustomEvent_SubObjective' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0004B8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0004D0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0004D8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_IsValid_ReturnValue_3) == 0x0004F0, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0004F8, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000500, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence, CallFunc_SetMorphTarget_Value_ImplicitCast) == 0x000508, "Member 'BP_DestructableFence_C_ExecuteUbergraph_BP_DestructableFence::CallFunc_SetMorphTarget_Value_ImplicitCast' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.FenceIndicators 
// 0x0008 (0x0008 - 0x0000)
struct BP_DestructableFence_C_FenceIndicators_ final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_FenceIndicators_) == 0x000008, "Wrong alignment on BP_DestructableFence_C_FenceIndicators_");
static_assert(sizeof(BP_DestructableFence_C_FenceIndicators_) == 0x000008, "Wrong size on BP_DestructableFence_C_FenceIndicators_");
static_assert(offsetof(BP_DestructableFence_C_FenceIndicators_, PlayerState) == 0x000000, "Member 'BP_DestructableFence_C_FenceIndicators_::PlayerState' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.FenceSabotaged
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructableFence_C_FenceSabotaged final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_FenceSabotaged) == 0x000001, "Wrong alignment on BP_DestructableFence_C_FenceSabotaged");
static_assert(sizeof(BP_DestructableFence_C_FenceSabotaged) == 0x000001, "Wrong size on BP_DestructableFence_C_FenceSabotaged");
static_assert(offsetof(BP_DestructableFence_C_FenceSabotaged, TURR) == 0x000000, "Member 'BP_DestructableFence_C_FenceSabotaged::TURR' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.GetWidgetLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_DestructableFence_C_GetWidgetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_GetWidgetLocation) == 0x000008, "Wrong alignment on BP_DestructableFence_C_GetWidgetLocation");
static_assert(sizeof(BP_DestructableFence_C_GetWidgetLocation) == 0x000030, "Wrong size on BP_DestructableFence_C_GetWidgetLocation");
static_assert(offsetof(BP_DestructableFence_C_GetWidgetLocation, Location) == 0x000000, "Member 'BP_DestructableFence_C_GetWidgetLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_GetWidgetLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_DestructableFence_C_GetWidgetLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.House Actor Impact Cosmetics
// 0x0038 (0x0038 - 0x0000)
struct BP_DestructableFence_C_House_Actor_Impact_Cosmetics final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                ImpactEffect;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_House_Actor_Impact_Cosmetics) == 0x000008, "Wrong alignment on BP_DestructableFence_C_House_Actor_Impact_Cosmetics");
static_assert(sizeof(BP_DestructableFence_C_House_Actor_Impact_Cosmetics) == 0x000038, "Wrong size on BP_DestructableFence_C_House_Actor_Impact_Cosmetics");
static_assert(offsetof(BP_DestructableFence_C_House_Actor_Impact_Cosmetics, Location) == 0x000000, "Member 'BP_DestructableFence_C_House_Actor_Impact_Cosmetics::Location' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_House_Actor_Impact_Cosmetics, HitImpulse) == 0x000018, "Member 'BP_DestructableFence_C_House_Actor_Impact_Cosmetics::HitImpulse' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_House_Actor_Impact_Cosmetics, ImpactEffect) == 0x000030, "Member 'BP_DestructableFence_C_House_Actor_Impact_Cosmetics::ImpactEffect' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.IsInteractable
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructableFence_C_IsInteractable final
{
public:
	bool                                          Interactable;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_IsInteractable) == 0x000001, "Wrong alignment on BP_DestructableFence_C_IsInteractable");
static_assert(sizeof(BP_DestructableFence_C_IsInteractable) == 0x000001, "Wrong size on BP_DestructableFence_C_IsInteractable");
static_assert(offsetof(BP_DestructableFence_C_IsInteractable, Interactable) == 0x000000, "Member 'BP_DestructableFence_C_IsInteractable::Interactable' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.IsInteractingActorATeamMember
// 0x0068 (0x0068 - 0x0000)
struct BP_DestructableFence_C_IsInteractingActorATeamMember final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0020(0x0038)(ConstParm, NoDestructor)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_IsInteractingActorATeamMember) == 0x000008, "Wrong alignment on BP_DestructableFence_C_IsInteractingActorATeamMember");
static_assert(sizeof(BP_DestructableFence_C_IsInteractingActorATeamMember) == 0x000068, "Wrong size on BP_DestructableFence_C_IsInteractingActorATeamMember");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, Actor) == 0x000000, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::Actor' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, Return) == 0x000008, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::Return' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, CallFunc_GetTeam_ReturnValue) == 0x000020, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000058, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, CallFunc_GetTeamID_ReturnValue) == 0x000061, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsInteractingActorATeamMember, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000062, "Member 'BP_DestructableFence_C_IsInteractingActorATeamMember::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.OnDamaged
// 0x0370 (0x0370 - 0x0000)
struct BP_DestructableFence_C_OnDamaged final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     CombatParticipant;                                 // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            KillMethod;                                        // 0x0070(0x02E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector_NetQuantize                    Location;                                          // 0x0358(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_OnDamaged) == 0x000008, "Wrong alignment on BP_DestructableFence_C_OnDamaged");
static_assert(sizeof(BP_DestructableFence_C_OnDamaged) == 0x000370, "Wrong size on BP_DestructableFence_C_OnDamaged");
static_assert(offsetof(BP_DestructableFence_C_OnDamaged, Delta) == 0x000000, "Member 'BP_DestructableFence_C_OnDamaged::Delta' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_OnDamaged, Causer) == 0x000008, "Member 'BP_DestructableFence_C_OnDamaged::Causer' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_OnDamaged, CombatParticipant) == 0x000010, "Member 'BP_DestructableFence_C_OnDamaged::CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_OnDamaged, KillMethod) == 0x000070, "Member 'BP_DestructableFence_C_OnDamaged::KillMethod' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_OnDamaged, Location) == 0x000358, "Member 'BP_DestructableFence_C_OnDamaged::Location' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38
// 0x0010 (0x0010 - 0x0000)
struct BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38) == 0x000008, "Wrong alignment on BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38");
static_assert(sizeof(BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38) == 0x000010, "Wrong size on BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38");
static_assert(offsetof(BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38, ProxyObject) == 0x000000, "Member 'BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38, ActualChannel) == 0x000008, "Member 'BP_DestructableFence_C_OnMessageReceived_9377B0E041382A2E0D15619C22ADBB38::ActualChannel' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.SetInitialFenceHealth
// 0x0040 (0x0040 - 0x0000)
struct BP_DestructableFence_C_SetInitialFenceHealth final
{
public:
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0008(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0020(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LastSetHealth_ImplicitCast;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_SetInitialFenceHealth) == 0x000008, "Wrong alignment on BP_DestructableFence_C_SetInitialFenceHealth");
static_assert(sizeof(BP_DestructableFence_C_SetInitialFenceHealth) == 0x000040, "Wrong size on BP_DestructableFence_C_SetInitialFenceHealth");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000000, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000008, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000020, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000030, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SetInitialFenceHealth, K2Node_VariableSet_LastSetHealth_ImplicitCast) == 0x000038, "Member 'BP_DestructableFence_C_SetInitialFenceHealth::K2Node_VariableSet_LastSetHealth_ImplicitCast' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.SpawnDestroyedMesh
// 0x0090 (0x0090 - 0x0000)
struct BP_DestructableFence_C_SpawnDestroyedMesh final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Fence_High_Destroyed_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_SpawnDestroyedMesh) == 0x000010, "Wrong alignment on BP_DestructableFence_C_SpawnDestroyedMesh");
static_assert(sizeof(BP_DestructableFence_C_SpawnDestroyedMesh) == 0x000090, "Wrong size on BP_DestructableFence_C_SpawnDestroyedMesh");
static_assert(offsetof(BP_DestructableFence_C_SpawnDestroyedMesh, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_DestructableFence_C_SpawnDestroyedMesh::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SpawnDestroyedMesh, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_DestructableFence_C_SpawnDestroyedMesh::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SpawnDestroyedMesh, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BP_DestructableFence_C_SpawnDestroyedMesh::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_SpawnDestroyedMesh, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_DestructableFence_C_SpawnDestroyedMesh::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.UpdateTeamAndID
// 0x0040 (0x0040 - 0x0000)
struct BP_DestructableFence_C_UpdateTeamAndID final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0008(0x0038)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_DestructableFence_C_UpdateTeamAndID) == 0x000008, "Wrong alignment on BP_DestructableFence_C_UpdateTeamAndID");
static_assert(sizeof(BP_DestructableFence_C_UpdateTeamAndID) == 0x000040, "Wrong size on BP_DestructableFence_C_UpdateTeamAndID");
static_assert(offsetof(BP_DestructableFence_C_UpdateTeamAndID, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_DestructableFence_C_UpdateTeamAndID::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_UpdateTeamAndID, CallFunc_GetTeam_ReturnValue) == 0x000008, "Member 'BP_DestructableFence_C_UpdateTeamAndID::CallFunc_GetTeam_ReturnValue' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_DestructableFence_C_UserConstructionScript final
{
public:
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructableFence_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DestructableFence_C_UserConstructionScript");
static_assert(sizeof(BP_DestructableFence_C_UserConstructionScript) == 0x000010, "Wrong size on BP_DestructableFence_C_UserConstructionScript");
static_assert(offsetof(BP_DestructableFence_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_DestructableFence_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_DestructableFence.BP_DestructableFence_C.IsAvailableForInteraction
// 0x0018 (0x0018 - 0x0000)
struct BP_DestructableFence_C_IsAvailableForInteraction final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructableFence_C_IsAvailableForInteraction) == 0x000008, "Wrong alignment on BP_DestructableFence_C_IsAvailableForInteraction");
static_assert(sizeof(BP_DestructableFence_C_IsAvailableForInteraction) == 0x000018, "Wrong size on BP_DestructableFence_C_IsAvailableForInteraction");
static_assert(offsetof(BP_DestructableFence_C_IsAvailableForInteraction, InteractingActor) == 0x000000, "Member 'BP_DestructableFence_C_IsAvailableForInteraction::InteractingActor' has a wrong offset!");
static_assert(offsetof(BP_DestructableFence_C_IsAvailableForInteraction, InteractionComponent) == 0x000008, "Member 'BP_DestructableFence_C_IsAvailableForInteraction::InteractionComponent' has a wrong offset!");
