#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecoyFirecracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DecoyFirecracker.BP_DecoyFirecracker_C
// 0x0138 (0x03C8 - 0x0290)
class ABP_DecoyFirecracker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Active;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ActiveAudio;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FuseAudio;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SoundLocation;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DamageSphere;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Fuse;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Firecracker;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageTimer;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           InstigatorPlayerState;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        StructureMultiplier;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     Killer;                                            // 0x0300(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UItemDefinition>         ItemDef;                                           // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Ability;                                           // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             HitCharacter;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ForceStartFuseTimer;                               // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DamageActor(class AActor* Actor);
	void DamageActorsInDamageSphere();
	void ExecuteUbergraph_BP_DecoyFirecracker(int32 EntryPoint);
	struct FVector GetSoundSpawnLocation();
	bool HitValidTarget(class AActor* Target);
	void On_Damage_Timer_Elapsed();
	void On_Decoy_Firecrtacker_Damage_Timer_Elapsed();
	void On_Force_Start_Fuse_Timer_Elapsed();
	void On_Fuse_Timer_Elapsed();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Start_Active_Cosmetics();
	void TryAttachToNearbyTarget(bool* Return_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DecoyFirecracker_C">();
	}
	static class ABP_DecoyFirecracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DecoyFirecracker_C>();
	}
};
static_assert(alignof(ABP_DecoyFirecracker_C) == 0x000008, "Wrong alignment on ABP_DecoyFirecracker_C");
static_assert(sizeof(ABP_DecoyFirecracker_C) == 0x0003C8, "Wrong size on ABP_DecoyFirecracker_C");
static_assert(offsetof(ABP_DecoyFirecracker_C, UberGraphFrame) == 0x000290, "Member 'ABP_DecoyFirecracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Niagara_Active) == 0x000298, "Member 'ABP_DecoyFirecracker_C::Niagara_Active' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, RotatingMovement) == 0x0002A0, "Member 'ABP_DecoyFirecracker_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, ActiveAudio) == 0x0002A8, "Member 'ABP_DecoyFirecracker_C::ActiveAudio' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, FuseAudio) == 0x0002B0, "Member 'ABP_DecoyFirecracker_C::FuseAudio' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, SoundLocation) == 0x0002B8, "Member 'ABP_DecoyFirecracker_C::SoundLocation' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, DamageSphere) == 0x0002C0, "Member 'ABP_DecoyFirecracker_C::DamageSphere' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Niagara_Fuse) == 0x0002C8, "Member 'ABP_DecoyFirecracker_C::Niagara_Fuse' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, SM_Firecracker) == 0x0002D0, "Member 'ABP_DecoyFirecracker_C::SM_Firecracker' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_DecoyFirecracker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, DamageTimer) == 0x0002E0, "Member 'ABP_DecoyFirecracker_C::DamageTimer' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, InstigatorPlayerState) == 0x0002E8, "Member 'ABP_DecoyFirecracker_C::InstigatorPlayerState' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, StructureMultiplier) == 0x0002F0, "Member 'ABP_DecoyFirecracker_C::StructureMultiplier' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Damage) == 0x0002F8, "Member 'ABP_DecoyFirecracker_C::Damage' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Killer) == 0x000300, "Member 'ABP_DecoyFirecracker_C::Killer' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, ItemDef) == 0x000360, "Member 'ABP_DecoyFirecracker_C::ItemDef' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Ability) == 0x000388, "Member 'ABP_DecoyFirecracker_C::Ability' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, Return) == 0x0003B0, "Member 'ABP_DecoyFirecracker_C::Return' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, HitCharacter) == 0x0003B8, "Member 'ABP_DecoyFirecracker_C::HitCharacter' has a wrong offset!");
static_assert(offsetof(ABP_DecoyFirecracker_C, ForceStartFuseTimer) == 0x0003C0, "Member 'ABP_DecoyFirecracker_C::ForceStartFuseTimer' has a wrong offset!");

}

