#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_GardenGate_Small_Level2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.ExecuteUbergraph_BP_Door_GardenGate_Small_Level2
// 0x0190 (0x0190 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PickerController_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Alpha;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_UpgradePlanBase_C*                  K2Node_DynamicCast_AsBP_Upgrade_Plan_Base;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PickerController;                     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SabotagingActor;                      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2) == 0x000190, "Wrong size on BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, EntryPoint) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_Event_PickerController_1) == 0x000010, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_Event_PickerController_1' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_Event_Alpha) == 0x000018, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_DynamicCast_AsBP_Upgrade_Plan_Base) == 0x000140, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_DynamicCast_AsBP_Upgrade_Plan_Base' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_GetGroundsKeeper_ReturnValue) == 0x000150, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_Event_PickerController) == 0x000158, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_Event_PickerController' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_GetMaterial_ReturnValue) == 0x000160, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000168, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000170, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, K2Node_Event_SabotagingActor) == 0x000178, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::K2Node_Event_SabotagingActor' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000180, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000188, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x00018C, "Member 'BP_Door_GardenGate_Small_Level2_C_ExecuteUbergraph_BP_Door_GardenGate_Small_Level2::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.GetLockPickDuration
// 0x0004 (0x0004 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration final
{
public:
	int32                                         Return;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration) == 0x000004, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration) == 0x000004, "Wrong size on BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration, Return) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_GetLockPickDuration::Return' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.GetOptionalText
// 0x0020 (0x0020 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_GetOptionalText final
{
public:
	class FText                                   Return;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   Optional_Second_Line;                              // 0x0010(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_GetOptionalText) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_GetOptionalText");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_GetOptionalText) == 0x000020, "Wrong size on BP_Door_GardenGate_Small_Level2_C_GetOptionalText");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_GetOptionalText, Return) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_GetOptionalText::Return' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_GetOptionalText, Optional_Second_Line) == 0x000010, "Member 'BP_Door_GardenGate_Small_Level2_C_GetOptionalText::Optional_Second_Line' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.GetPriority
// 0x0004 (0x0004 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_GetPriority final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_GetPriority) == 0x000004, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_GetPriority");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_GetPriority) == 0x000004, "Wrong size on BP_Door_GardenGate_Small_Level2_C_GetPriority");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_GetPriority, Priority) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_GetPriority::Priority' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.IsClosed
// 0x0001 (0x0001 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_IsClosed final
{
public:
	bool                                          Open_0;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_IsClosed) == 0x000001, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_IsClosed");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_IsClosed) == 0x000001, "Wrong size on BP_Door_GardenGate_Small_Level2_C_IsClosed");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_IsClosed, Open_0) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_IsClosed::Open_0' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.IsNotLockpickable
// 0x0001 (0x0001 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable final
{
public:
	bool                                          IsNotLockpickable_0;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable) == 0x000001, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable) == 0x000001, "Wrong size on BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable, IsNotLockpickable_0) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_IsNotLockpickable::IsNotLockpickable_0' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.LockpickBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_LockpickBegin final
{
public:
	class APlayerController*                      PickerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_LockpickBegin) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_LockpickBegin");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_LockpickBegin) == 0x000008, "Wrong size on BP_Door_GardenGate_Small_Level2_C_LockpickBegin");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_LockpickBegin, PickerController) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_LockpickBegin::PickerController' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.LockpickSuccess
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_LockpickSuccess final
{
public:
	class APlayerController*                      PickerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_LockpickSuccess) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_LockpickSuccess");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_LockpickSuccess) == 0x000008, "Wrong size on BP_Door_GardenGate_Small_Level2_C_LockpickSuccess");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_LockpickSuccess, PickerController) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_LockpickSuccess::PickerController' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.Sabotage
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_Sabotage final
{
public:
	class AActor*                                 SabotagingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_Sabotage) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_Sabotage");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_Sabotage) == 0x000008, "Wrong size on BP_Door_GardenGate_Small_Level2_C_Sabotage");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_Sabotage, SabotagingActor) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_Sabotage::SabotagingActor' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.SetMaterialBasedOnLevel
// 0x0018 (0x0018 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel final
{
public:
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel) == 0x000018, "Wrong size on BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel, K2Node_SwitchString_CmpSuccess) == 0x000010, "Member 'BP_Door_GardenGate_Small_Level2_C_SetMaterialBasedOnLevel::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.SpawnDestroyedDoor
// 0x0090 (0x0090 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FenceGate_Destroyed_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor) == 0x000010, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor) == 0x000090, "Wrong size on BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_Door_GardenGate_Small_Level2_C_SpawnDestroyedDoor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_Door_GardenGate_Small_Level2.BP_Door_GardenGate_Small_Level2_C.Update Alpha
// 0x0008 (0x0008 - 0x0000)
struct BP_Door_GardenGate_Small_Level2_C_Update_Alpha final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_GardenGate_Small_Level2_C_Update_Alpha) == 0x000008, "Wrong alignment on BP_Door_GardenGate_Small_Level2_C_Update_Alpha");
static_assert(sizeof(BP_Door_GardenGate_Small_Level2_C_Update_Alpha) == 0x000008, "Wrong size on BP_Door_GardenGate_Small_Level2_C_Update_Alpha");
static_assert(offsetof(BP_Door_GardenGate_Small_Level2_C_Update_Alpha, Alpha) == 0x000000, "Member 'BP_Door_GardenGate_Small_Level2_C_Update_Alpha::Alpha' has a wrong offset!");

}

