#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DeathComponent.BP_DeathComponent_C.ExecuteUbergraph_BP_DeathComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetSpectatorPawn_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpectatorPawnStinna_C*                 K2Node_DynamicCast_AsSpectator_Pawn_Stinna;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent) == 0x000008, "Wrong alignment on BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent");
static_assert(sizeof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent) == 0x000048, "Wrong size on BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, EntryPoint) == 0x000000, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, K2Node_DynamicCast_AsI_Character) == 0x000018, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::K2Node_DynamicCast_AsI_Character' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, CallFunc_GetSpectatorPawn_ReturnValue) == 0x000030, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::CallFunc_GetSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, K2Node_DynamicCast_AsSpectator_Pawn_Stinna) == 0x000038, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::K2Node_DynamicCast_AsSpectator_Pawn_Stinna' has a wrong offset!");
static_assert(offsetof(BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_DeathComponent_C_ExecuteUbergraph_BP_DeathComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

