#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_GardenGate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door_GardenGate.BP_Door_GardenGate_C
// 0x0028 (0x0540 - 0x0518)
class ABP_Door_GardenGate_C : public ADoorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Door_GardenGate_C;               // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BoxNavModifier;                                    // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractCollider;                                  // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Door_GardenGate(int32 EntryPoint);
	void GetLockPickDuration(int32* Return);
	void GetOptionalText(class FText* Return, class FText* Optional_Second_Line);
	void GetPriority(int32* Priority);
	void IsClosed(bool* Open_0);
	void IsNotLockpickable(bool* IsNotLockpickable_0);
	void LockpickBegin(class APlayerController* PickerController);
	void LockpickSuccess(class APlayerController* PickerController);
	void ReceiveBeginPlay();
	void SpawnDestroyedDoor();
	void Update_Alpha(double Alpha);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Door_GardenGate_C">();
	}
	static class ABP_Door_GardenGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_GardenGate_C>();
	}
};
static_assert(alignof(ABP_Door_GardenGate_C) == 0x000008, "Wrong alignment on ABP_Door_GardenGate_C");
static_assert(sizeof(ABP_Door_GardenGate_C) == 0x000540, "Wrong size on ABP_Door_GardenGate_C");
static_assert(offsetof(ABP_Door_GardenGate_C, UberGraphFrame_BP_Door_GardenGate_C) == 0x000518, "Member 'ABP_Door_GardenGate_C::UberGraphFrame_BP_Door_GardenGate_C' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_C, BoxNavModifier) == 0x000520, "Member 'ABP_Door_GardenGate_C::BoxNavModifier' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_C, InteractCollider) == 0x000528, "Member 'ABP_Door_GardenGate_C::InteractCollider' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_C, Door) == 0x000530, "Member 'ABP_Door_GardenGate_C::Door' has a wrong offset!");
static_assert(offsetof(ABP_Door_GardenGate_C, Material) == 0x000538, "Member 'ABP_Door_GardenGate_C::Material' has a wrong offset!");

}

