#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Explosion_Seagull_Large

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Explosion_Seagull_Large.BP_Explosion_Seagull_Large_C.Deal Damage
// 0x0210 (0x0210 - 0x0000)
struct BP_Explosion_Seagull_Large_C_Deal_Damage final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CustomCenterLocation_C> K2Node_DynamicCast_AsI_Custom_Center_Location;     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterLocation_Location;               // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0068(0x0010)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalculateDamageBasedOnDistance_Damage;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00B0(0x0010)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x01B8(0x0018)()
	class UAbilitySystemComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0204(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Explosion_Seagull_Large_C_Deal_Damage) == 0x000008, "Wrong alignment on BP_Explosion_Seagull_Large_C_Deal_Damage");
static_assert(sizeof(BP_Explosion_Seagull_Large_C_Deal_Damage) == 0x000210, "Wrong size on BP_Explosion_Seagull_Large_C_Deal_Damage");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, Actors) == 0x000000, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::Actors' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetInstigator_ReturnValue) == 0x000018, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, K2Node_DynamicCast_AsI_Custom_Center_Location) == 0x000030, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::K2Node_DynamicCast_AsI_Custom_Center_Location' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetCenterLocation_Location) == 0x000048, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetCenterLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000068, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_CalculateDamageBasedOnDistance_Damage) == 0x000090, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_CalculateDamageBasedOnDistance_Damage' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_SelectVector_ReturnValue) == 0x000098, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000B0, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_MakeHitResult_ReturnValue) == 0x0000C0, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetEffectContext_ReturnValue) == 0x0001B8, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetComponentByClass_ReturnValue) == 0x0001D0, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_IsValid_ReturnValue_1) == 0x0001D8, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, Temp_int_Loop_Counter_Variable) == 0x0001DC, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_Less_IntInt_ReturnValue) == 0x0001E0, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_Add_IntInt_ReturnValue) == 0x0001E4, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetInstigator_ReturnValue_1) == 0x0001E8, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0001F0, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x0001F8, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000204, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_Deal_Damage, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x00020C, "Member 'BP_Explosion_Seagull_Large_C_Deal_Damage::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_Explosion_Seagull_Large.BP_Explosion_Seagull_Large_C.DoExplode
// 0x0010 (0x0010 - 0x0000)
struct BP_Explosion_Seagull_Large_C_DoExplode final
{
public:
	TArray<class AActor*>                         ActorsInLineOfSight_0;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Explosion_Seagull_Large_C_DoExplode) == 0x000008, "Wrong alignment on BP_Explosion_Seagull_Large_C_DoExplode");
static_assert(sizeof(BP_Explosion_Seagull_Large_C_DoExplode) == 0x000010, "Wrong size on BP_Explosion_Seagull_Large_C_DoExplode");
static_assert(offsetof(BP_Explosion_Seagull_Large_C_DoExplode, ActorsInLineOfSight_0) == 0x000000, "Member 'BP_Explosion_Seagull_Large_C_DoExplode::ActorsInLineOfSight_0' has a wrong offset!");

}

