#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EndCondition_TeamDeathmatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_EndCondition_TeamDeathmatch.BP_EndCondition_TeamDeathmatch_C.CalculateNewTeamKillCounts
// 0x0048 (0x0048 - 0x0000)
struct BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts final
{
public:
	uint8                                         TempTeam2Kills;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TempTeam1Kills;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP_Match*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class APlayerStateJP_Match*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKills_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts) == 0x000008, "Wrong alignment on BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts");
static_assert(sizeof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts) == 0x000048, "Wrong size on BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, TempTeam2Kills) == 0x000000, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::TempTeam2Kills' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, TempTeam1Kills) == 0x000001, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::TempTeam1Kills' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_GetTeamID_ReturnValue) == 0x00002C, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002F, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_GetKills_ReturnValue) == 0x000030, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_GetKills_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000038, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Conv_IntToByte_ReturnValue) == 0x000044, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000045, "Member 'BP_EndCondition_TeamDeathmatch_C_CalculateNewTeamKillCounts::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");

// Function BP_EndCondition_TeamDeathmatch.BP_EndCondition_TeamDeathmatch_C.ExecuteUbergraph_BP_EndCondition_TeamDeathmatch
// 0x08C0 (0x08C0 - 0x0000)
struct BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKillGameplayMessage                   Temp_struct_Variable;                              // 0x0028(0x03D8)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0428(0x0058)(ConstParm)
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue_1;      // 0x0480(0x0058)(ConstParm)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB[0x5];                                      // 0x04DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKillGameplayMessage                   Temp_struct_Variable_2;                            // 0x04E0(0x03D8)()
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue_1;      // 0x08B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch) == 0x000008, "Wrong alignment on BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch");
static_assert(sizeof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch) == 0x0008C0, "Wrong size on BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, EntryPoint) == 0x000000, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, Temp_struct_Variable) == 0x000028, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, Temp_struct_Variable_1) == 0x000400, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, Temp_object_Variable) == 0x000408, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000410, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000418, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_IsValid_ReturnValue) == 0x000420, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_HasAuthority_ReturnValue) == 0x000421, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_GetMatchConfiguration_ReturnValue) == 0x000428, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_GetMatchConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_GetMatchConfiguration_ReturnValue_1) == 0x000480, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_GetMatchConfiguration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_Conv_IntToByte_ReturnValue) == 0x0004D8, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0004D9, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x0004DA, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, Temp_struct_Variable_2) == 0x0004E0, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_GetPayload_ReturnValue) == 0x0008B8, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch, CallFunc_GreaterEqual_ByteByte_ReturnValue_1) == 0x0008B9, "Member 'BP_EndCondition_TeamDeathmatch_C_ExecuteUbergraph_BP_EndCondition_TeamDeathmatch::CallFunc_GreaterEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_EndCondition_TeamDeathmatch.BP_EndCondition_TeamDeathmatch_C.OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C
// 0x0010 (0x0010 - 0x0000)
struct BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C) == 0x000008, "Wrong alignment on BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C");
static_assert(sizeof(BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C) == 0x000010, "Wrong size on BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C, ProxyObject) == 0x000000, "Member 'BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C, ActualChannel) == 0x000008, "Member 'BP_EndCondition_TeamDeathmatch_C_OnMessageReceived_06E65DD94BEFE3F732E8DA8E94BB133C::ActualChannel' has a wrong offset!");

// Function BP_EndCondition_TeamDeathmatch.BP_EndCondition_TeamDeathmatch_C.PostEliminateTeam
// 0x01A8 (0x01A8 - 0x0000)
struct BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam final
{
public:
	uint8                                         EliminatedTeamID;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfiguration                    CallFunc_GetMatchConfiguration_ReturnValue;        // 0x0090(0x0058)(ConstParm)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0048)(HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam) == 0x000008, "Wrong alignment on BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam");
static_assert(sizeof(BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam) == 0x0001A8, "Wrong size on BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam, EliminatedTeamID) == 0x000000, "Member 'BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam::EliminatedTeamID' has a wrong offset!");
static_assert(offsetof(BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam, CallFunc_Conv_ByteToString_ReturnValue) == 0x000008, "Member 'BP_EndCondition_TeamDeathmatch_C_PostEliminateTeam::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
