#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ForSaleSign

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ForSaleSign.BP_ForSaleSign_C.GetIsSold
// 0x0001 (0x0001 - 0x0000)
struct BP_ForSaleSign_C_GetIsSold final
{
public:
	bool                                          IsSold_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForSaleSign_C_GetIsSold) == 0x000001, "Wrong alignment on BP_ForSaleSign_C_GetIsSold");
static_assert(sizeof(BP_ForSaleSign_C_GetIsSold) == 0x000001, "Wrong size on BP_ForSaleSign_C_GetIsSold");
static_assert(offsetof(BP_ForSaleSign_C_GetIsSold, IsSold_0) == 0x000000, "Member 'BP_ForSaleSign_C_GetIsSold::IsSold_0' has a wrong offset!");

// Function BP_ForSaleSign.BP_ForSaleSign_C.OnIsSoldChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature final
{
public:
	class ABP_ForSaleSign_C*                      ForSaleSign;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature");
static_assert(sizeof(BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature) == 0x000008, "Wrong size on BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature");
static_assert(offsetof(BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature, ForSaleSign) == 0x000000, "Member 'BP_ForSaleSign_C_OnIsSoldChanged__DelegateSignature::ForSaleSign' has a wrong offset!");

// Function BP_ForSaleSign.BP_ForSaleSign_C.SetIsSold
// 0x0002 (0x0002 - 0x0000)
struct BP_ForSaleSign_C_SetIsSold final
{
public:
	bool                                          IsSold_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayAnimation;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForSaleSign_C_SetIsSold) == 0x000001, "Wrong alignment on BP_ForSaleSign_C_SetIsSold");
static_assert(sizeof(BP_ForSaleSign_C_SetIsSold) == 0x000002, "Wrong size on BP_ForSaleSign_C_SetIsSold");
static_assert(offsetof(BP_ForSaleSign_C_SetIsSold, IsSold_0) == 0x000000, "Member 'BP_ForSaleSign_C_SetIsSold::IsSold_0' has a wrong offset!");
static_assert(offsetof(BP_ForSaleSign_C_SetIsSold, PlayAnimation) == 0x000001, "Member 'BP_ForSaleSign_C_SetIsSold::PlayAnimation' has a wrong offset!");

}

