#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireSpot.BP_FireSpot_C
// 0x0108 (0x0398 - 0x0290)
class ABP_FireSpot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FireAudio;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Fire;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           InstigatorPlayerState;                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         ItemDef;                                           // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Ability;                                           // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FCombatParticipant                     Killer;                                            // 0x0310(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        Damage;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DotDuration;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        StructureMultiplier;                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Lifetime;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UNiagaraComponent*                      ExplosionVFX;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_FireSpot_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_FireSpot(int32 EntryPoint);
	void GetBaseDuration(bool HitPawn, double* Duration);
	bool HitValidTarget(class AActor* Target);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void SetTargetOnFire(class AActor* Actor, double Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireSpot_C">();
	}
	static class ABP_FireSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireSpot_C>();
	}
};
static_assert(alignof(ABP_FireSpot_C) == 0x000008, "Wrong alignment on ABP_FireSpot_C");
static_assert(sizeof(ABP_FireSpot_C) == 0x000398, "Wrong size on ABP_FireSpot_C");
static_assert(offsetof(ABP_FireSpot_C, UberGraphFrame) == 0x000290, "Member 'ABP_FireSpot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, FireAudio) == 0x000298, "Member 'ABP_FireSpot_C::FireAudio' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Box) == 0x0002A0, "Member 'ABP_FireSpot_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Fire) == 0x0002A8, "Member 'ABP_FireSpot_C::Fire' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_FireSpot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, InstigatorPlayerState) == 0x0002B8, "Member 'ABP_FireSpot_C::InstigatorPlayerState' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, ItemDef) == 0x0002C0, "Member 'ABP_FireSpot_C::ItemDef' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Ability) == 0x0002E8, "Member 'ABP_FireSpot_C::Ability' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Killer) == 0x000310, "Member 'ABP_FireSpot_C::Killer' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Damage) == 0x000370, "Member 'ABP_FireSpot_C::Damage' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, DotDuration) == 0x000378, "Member 'ABP_FireSpot_C::DotDuration' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, StructureMultiplier) == 0x000380, "Member 'ABP_FireSpot_C::StructureMultiplier' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, Lifetime) == 0x000388, "Member 'ABP_FireSpot_C::Lifetime' has a wrong offset!");
static_assert(offsetof(ABP_FireSpot_C, ExplosionVFX) == 0x000390, "Member 'ABP_FireSpot_C::ExplosionVFX' has a wrong offset!");

}

