#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GuardDog_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "E_TimeOfDay_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GuardDog_V2.BP_GuardDog_V2_C
// 0x0090 (0x0700 - 0x0670)
class ABP_GuardDog_V2_C final : public ACharacter
{
public:
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AudioBark;                                         // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioGrowl;                                        // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioBite;                                         // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Footstep_2;                                  // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Footstep_1;                                  // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioPant;                                         // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              AbilitySystemComponentIW;                          // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxInteract;                                       // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_TeamVolume_C*                       AssociatedTeamVolume;                              // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ADowntimeManager_C*                     DowntimeManager;                                   // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Awake;                                             // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DogHouse_V2_C*                      DogHouse;                                          // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           RoamingTimer;                                      // 0x06E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShouldHuntTimer;                                   // 0x06E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                HuntedCharacter;                                   // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBetweenAttacks;                               // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hunting;                                           // 0x06FC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_Footstep();
	void Bark(float Duration);
	void BndEvt__BP_GuardDog_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_GuardDog_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CancelInteraction(class UPrimitiveComponent* InteractionComponent);
	void DealDamage(class AActor* Target);
	void DoesHitOverlapWithTeamVolume(const struct FHitResult& Hit, bool* Return);
	void EatTarget(class ABP_ResidentCharacter_C* TargetCharacter);
	void ExecuteUbergraph_BP_GuardDog_V2(int32 EntryPoint);
	void GetDogHouse(class AActor** Actor);
	void GetEQSPropertyBlocker(class AActor** Actor);
	void GetInteractSound();
	void GetNewWidgetColor(struct FSlateColor* NewColor);
	void GetOptionalText(class FText* Return, class FText* Optional_Second_Line);
	void GetPriority(int32* Priority);
	struct FVector GetTraceFromLocation();
	void GetWidgetLocation(struct FVector* Location);
	void HideInteractionWidget(bool* Return);
	void Hunt_Character();
	void InteractableCancelInteraction(class UPrimitiveComponent* InteractionComponent);
	void InteractPressed(class AActor* InteractingActor);
	void InteractReleased(class AActor* InteractingActor);
	void IsHuntedCharacterOverlappingTeamVolume(bool* Return);
	void IsInFocus(class AActor* Focusing_Actor);
	void IsInteractable(bool* Interactable);
	void Move_To_Random_Location();
	void Multi_Audio_Bite();
	void Multi_Dog_Montage();
	void On_Should_Hunt_Timer_Elapsed();
	void On_CharacterEntered_Event(class ABP_ResidentCharacter_C* Character);
	void On_CharacterLeft_Event(class ABP_ResidentCharacter_C* Character);
	void On_TimeOfDayChange_Event(E_TimeOfDay TimeOfDay);
	void OnFail_24B5D5D94B35C85455AFD29724B47C0E(EPathFollowingResult MovementResult);
	void OnFail_D130E6B846B45C41B6376295ED3A67D7(EPathFollowingResult MovementResult);
	void OnRep_Hunting();
	void OnSuccess_24B5D5D94B35C85455AFD29724B47C0E(EPathFollowingResult MovementResult);
	void OnSuccess_D130E6B846B45C41B6376295ED3A67D7(EPathFollowingResult MovementResult);
	void PostInteract(class AActor* InteractingActor, class UPrimitiveComponent* InteractionComponent);
	void PreInteract(class AActor* InteractingActor, class UPrimitiveComponent* InteractionComponent);
	void ReceiveBeginPlay();
	void RegisterInteracter(class UPrimitiveComponent* InteractionComponent, class AActor* InteractingActor);
	void ReHunt();
	void Set_Awake_State();
	void Set_Sleep_State();
	void SetHoveredComponent(class UInteractionComponent_C* HoveredComponent, bool* Void);
	void SetInteractable(bool Interactable);
	void Start_Roaming();
	void Start_Should_Hunt_Timer();
	void TryOpenDoorInFront();
	void UnregisterInteracter(class UPrimitiveComponent* InteractionComponent, class AActor* InteractingActor);

	float GetInteractionDuration(class UPrimitiveComponent* InteractionComponent) const;
	void GetPostInteractSyncType(bool* bShouldSync, EAbilityTaskNetSyncType* Type, class UPrimitiveComponent* InteractionComponent) const;
	void GetPreInteractSyncType(bool* bShouldSync, EAbilityTaskNetSyncType* Type, class UPrimitiveComponent* InteractionComponent) const;
	bool IsAvailableForEnemyTeam(class UPrimitiveComponent* InteractionComponent) const;
	bool IsAvailableForInteraction(class AActor* InteractingActor, class UPrimitiveComponent* InteractionComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GuardDog_V2_C">();
	}
	static class ABP_GuardDog_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GuardDog_V2_C>();
	}
};
static_assert(alignof(ABP_GuardDog_V2_C) == 0x000010, "Wrong alignment on ABP_GuardDog_V2_C");
static_assert(sizeof(ABP_GuardDog_V2_C) == 0x000700, "Wrong size on ABP_GuardDog_V2_C");
static_assert(offsetof(ABP_GuardDog_V2_C, UberGraphFrame) == 0x000670, "Member 'ABP_GuardDog_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AudioBark) == 0x000678, "Member 'ABP_GuardDog_V2_C::AudioBark' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AudioGrowl) == 0x000680, "Member 'ABP_GuardDog_V2_C::AudioGrowl' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AudioBite) == 0x000688, "Member 'ABP_GuardDog_V2_C::AudioBite' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, Audio_Footstep_2) == 0x000690, "Member 'ABP_GuardDog_V2_C::Audio_Footstep_2' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, Audio_Footstep_1) == 0x000698, "Member 'ABP_GuardDog_V2_C::Audio_Footstep_1' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AudioPant) == 0x0006A0, "Member 'ABP_GuardDog_V2_C::AudioPant' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AbilitySystemComponentIW) == 0x0006A8, "Member 'ABP_GuardDog_V2_C::AbilitySystemComponentIW' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, BoxInteract) == 0x0006B0, "Member 'ABP_GuardDog_V2_C::BoxInteract' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, Box) == 0x0006B8, "Member 'ABP_GuardDog_V2_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, AssociatedTeamVolume) == 0x0006C0, "Member 'ABP_GuardDog_V2_C::AssociatedTeamVolume' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, DowntimeManager) == 0x0006C8, "Member 'ABP_GuardDog_V2_C::DowntimeManager' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, Awake) == 0x0006D0, "Member 'ABP_GuardDog_V2_C::Awake' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, TeamId) == 0x0006D1, "Member 'ABP_GuardDog_V2_C::TeamId' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, DogHouse) == 0x0006D8, "Member 'ABP_GuardDog_V2_C::DogHouse' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, RoamingTimer) == 0x0006E0, "Member 'ABP_GuardDog_V2_C::RoamingTimer' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, ShouldHuntTimer) == 0x0006E8, "Member 'ABP_GuardDog_V2_C::ShouldHuntTimer' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, HuntedCharacter) == 0x0006F0, "Member 'ABP_GuardDog_V2_C::HuntedCharacter' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, DelayBetweenAttacks) == 0x0006F8, "Member 'ABP_GuardDog_V2_C::DelayBetweenAttacks' has a wrong offset!");
static_assert(offsetof(ABP_GuardDog_V2_C, Hunting) == 0x0006FC, "Member 'ABP_GuardDog_V2_C::Hunting' has a wrong offset!");

}

