#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GarbageCollect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_DeliveryOrder_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GarbageCollect.BP_GarbageCollect_C
// 0x0130 (0x03C0 - 0x0290)
class ABP_GarbageCollect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          HornBox;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioImpact;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CollectLocation;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioTireSqueal;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioEngine;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioHorn;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SM_Veh_Truck_Collect_01;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TruckLocation_Alpha_1D8152DF4B85CE64E69A5A85C3E40CDA; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TruckLocation__Direction_1D8152DF4B85CE64E69A5A85C3E40CDA; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TruckLocation;                                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Trashcan_C*>                 TrashZones;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FS_DeliveryOrder>               CurrentDeliveryOrders;                             // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_DeliveryOrder>               BacklogDeliveryOrders;                             // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULevelStreamingDynamic*                 Level1;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ULevelStreamingDynamic*>         AllLevels;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OutForDelivery;                                    // 0x0338(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              PlayerControllersWhoOrdered;                       // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         RecentlyHitActors;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           DeliveryTimer;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StartDeliveryTimeStamp;                            // 0x0368(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeliveryInterval;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoneyToGive;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartedRunning;                                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RunOverKillFeedIcon;                               // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class ABP_Base_VehiclePathSpline_C*           TargetSpline;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          DeliveryDisabledByCheat;                           // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_DeliveryService_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_DeliveryService_SM_Veh_Truck_Delivery_01_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Cosmetics_Hit_Object();
	void DealDamage(class AActor* Target);
	void DisableDelivery();
	void ExecuteUbergraph_BP_GarbageCollect(int32 EntryPoint);
	void FindNearestTrashCan(class ABP_Trashcan_C** ClosestTrashCan);
	void GetLocationAndRotationAlongSpline(double Time, struct FVector* Location, struct FRotator* Rotation);
	void Impact(class AActor* Actor);
	void LerpTrashToTruck(class ABP_GarbageItem_C* Garbage, uint8 CurrentTeamCollected);
	void Multi_Audio_Tire_Squeal();
	void On_WarmupEnded();
	void OnGameEnded();
	void OnRep_OutForDelivery();
	void ReceiveBeginPlay();
	void Server_Start_Delevery();
	void SetDeadly(bool Deadly);
	void StopDelivery();
	void TruckLocation__CollectGarbage__EventFunc();
	void TruckLocation__FinishedFunc();
	void TruckLocation__TireSqueal__EventFunc();
	void TruckLocation__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GarbageCollect_C">();
	}
	static class ABP_GarbageCollect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GarbageCollect_C>();
	}
};
static_assert(alignof(ABP_GarbageCollect_C) == 0x000008, "Wrong alignment on ABP_GarbageCollect_C");
static_assert(sizeof(ABP_GarbageCollect_C) == 0x0003C0, "Wrong size on ABP_GarbageCollect_C");
static_assert(offsetof(ABP_GarbageCollect_C, UberGraphFrame) == 0x000290, "Member 'ABP_GarbageCollect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, HornBox) == 0x000298, "Member 'ABP_GarbageCollect_C::HornBox' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, AudioImpact) == 0x0002A0, "Member 'ABP_GarbageCollect_C::AudioImpact' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, CollectLocation) == 0x0002A8, "Member 'ABP_GarbageCollect_C::CollectLocation' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, AudioTireSqueal) == 0x0002B0, "Member 'ABP_GarbageCollect_C::AudioTireSqueal' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, AudioEngine) == 0x0002B8, "Member 'ABP_GarbageCollect_C::AudioEngine' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, AudioHorn) == 0x0002C0, "Member 'ABP_GarbageCollect_C::AudioHorn' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, SM_Veh_Truck_Collect_01) == 0x0002C8, "Member 'ABP_GarbageCollect_C::SM_Veh_Truck_Collect_01' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, Scene) == 0x0002D0, "Member 'ABP_GarbageCollect_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_GarbageCollect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, TruckLocation_Alpha_1D8152DF4B85CE64E69A5A85C3E40CDA) == 0x0002E0, "Member 'ABP_GarbageCollect_C::TruckLocation_Alpha_1D8152DF4B85CE64E69A5A85C3E40CDA' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, TruckLocation__Direction_1D8152DF4B85CE64E69A5A85C3E40CDA) == 0x0002E4, "Member 'ABP_GarbageCollect_C::TruckLocation__Direction_1D8152DF4B85CE64E69A5A85C3E40CDA' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, TruckLocation) == 0x0002E8, "Member 'ABP_GarbageCollect_C::TruckLocation' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, TrashZones) == 0x0002F0, "Member 'ABP_GarbageCollect_C::TrashZones' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, CurrentDeliveryOrders) == 0x000300, "Member 'ABP_GarbageCollect_C::CurrentDeliveryOrders' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, BacklogDeliveryOrders) == 0x000310, "Member 'ABP_GarbageCollect_C::BacklogDeliveryOrders' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, Level1) == 0x000320, "Member 'ABP_GarbageCollect_C::Level1' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, AllLevels) == 0x000328, "Member 'ABP_GarbageCollect_C::AllLevels' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, OutForDelivery) == 0x000338, "Member 'ABP_GarbageCollect_C::OutForDelivery' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, PlayerControllersWhoOrdered) == 0x000340, "Member 'ABP_GarbageCollect_C::PlayerControllersWhoOrdered' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, RecentlyHitActors) == 0x000350, "Member 'ABP_GarbageCollect_C::RecentlyHitActors' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, DeliveryTimer) == 0x000360, "Member 'ABP_GarbageCollect_C::DeliveryTimer' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, StartDeliveryTimeStamp) == 0x000368, "Member 'ABP_GarbageCollect_C::StartDeliveryTimeStamp' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, DeliveryInterval) == 0x000370, "Member 'ABP_GarbageCollect_C::DeliveryInterval' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, MoneyToGive) == 0x000378, "Member 'ABP_GarbageCollect_C::MoneyToGive' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, StartedRunning) == 0x000380, "Member 'ABP_GarbageCollect_C::StartedRunning' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, PlayRate) == 0x000384, "Member 'ABP_GarbageCollect_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, RunOverKillFeedIcon) == 0x000388, "Member 'ABP_GarbageCollect_C::RunOverKillFeedIcon' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, TargetSpline) == 0x0003B0, "Member 'ABP_GarbageCollect_C::TargetSpline' has a wrong offset!");
static_assert(offsetof(ABP_GarbageCollect_C, DeliveryDisabledByCheat) == 0x0003B8, "Member 'ABP_GarbageCollect_C::DeliveryDisabledByCheat' has a wrong offset!");

}

