#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GI

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUser_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonGame_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK::Params
{

// Function BP_GI.BP_GI_C.AfterPush_5782B2AF41B61B5563F189BB289E838B
// 0x0008 (0x0008 - 0x0000)
struct BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B) == 0x000008, "Wrong alignment on BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B");
static_assert(sizeof(BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B) == 0x000008, "Wrong size on BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B");
static_assert(offsetof(BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B, UserWidget) == 0x000000, "Member 'BP_GI_C_AfterPush_5782B2AF41B61B5563F189BB289E838B::UserWidget' has a wrong offset!");

// Function BP_GI.BP_GI_C.BeforePush_5782B2AF41B61B5563F189BB289E838B
// 0x0008 (0x0008 - 0x0000)
struct BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B) == 0x000008, "Wrong alignment on BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B");
static_assert(sizeof(BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B) == 0x000008, "Wrong size on BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B");
static_assert(offsetof(BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B, UserWidget) == 0x000000, "Member 'BP_GI_C_BeforePush_5782B2AF41B61B5563F189BB289E838B::UserWidget' has a wrong offset!");

// Function BP_GI.BP_GI_C.Create Host Request
// 0x0098 (0x0098 - 0x0000)
struct BP_GI_C_Create_Host_Request final
{
public:
	class FString                                 GameModeNameForAdvertisement;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ECommonSessionOnlineMode                      OnlineMode;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        MapID;                                             // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPlayerCount;                                    // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLobbies;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSession_HostSessionRequest*      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0038(0x0050)()
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_CreateOnlineHostSessionRequest_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GI_C_Create_Host_Request) == 0x000008, "Wrong alignment on BP_GI_C_Create_Host_Request");
static_assert(sizeof(BP_GI_C_Create_Host_Request) == 0x000098, "Wrong size on BP_GI_C_Create_Host_Request");
static_assert(offsetof(BP_GI_C_Create_Host_Request, GameModeNameForAdvertisement) == 0x000000, "Member 'BP_GI_C_Create_Host_Request::GameModeNameForAdvertisement' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, OnlineMode) == 0x000010, "Member 'BP_GI_C_Create_Host_Request::OnlineMode' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, MapID) == 0x000014, "Member 'BP_GI_C_Create_Host_Request::MapID' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, MaxPlayerCount) == 0x000024, "Member 'BP_GI_C_Create_Host_Request::MaxPlayerCount' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, UseLobbies) == 0x000028, "Member 'BP_GI_C_Create_Host_Request::UseLobbies' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, ReturnValue) == 0x000030, "Member 'BP_GI_C_Create_Host_Request::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, K2Node_MakeMap_Map) == 0x000038, "Member 'BP_GI_C_Create_Host_Request::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000088, "Member 'BP_GI_C_Create_Host_Request::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_Create_Host_Request, CallFunc_CreateOnlineHostSessionRequest_ReturnValue) == 0x000090, "Member 'BP_GI_C_Create_Host_Request::CallFunc_CreateOnlineHostSessionRequest_ReturnValue' has a wrong offset!");

// Function BP_GI.BP_GI_C.DisplayOkDialog
// 0x0020 (0x0020 - 0x0000)
struct BP_GI_C_DisplayOkDialog final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Body;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GI_C_DisplayOkDialog) == 0x000008, "Wrong alignment on BP_GI_C_DisplayOkDialog");
static_assert(sizeof(BP_GI_C_DisplayOkDialog) == 0x000020, "Wrong size on BP_GI_C_DisplayOkDialog");
static_assert(offsetof(BP_GI_C_DisplayOkDialog, Header) == 0x000000, "Member 'BP_GI_C_DisplayOkDialog::Header' has a wrong offset!");
static_assert(offsetof(BP_GI_C_DisplayOkDialog, Body) == 0x000010, "Member 'BP_GI_C_DisplayOkDialog::Body' has a wrong offset!");

// Function BP_GI.BP_GI_C.ExecuteUbergraph_BP_GI
// 0x05B8 (0x05B8 - 0x0000)
struct BP_GI_C_ExecuteUbergraph_BP_GI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_CommonUserInitialize*      CallFunc_LoginForOnlinePlay_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCommonUserInfo*                  K2Node_CustomEvent_UserInfo_2;                     // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error_2;                        // 0x0058(0x0010)()
	ECommonUserPrivilege                          K2Node_CustomEvent_RequestedPrivilege_2;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      K2Node_CustomEvent_OnlineContext_2;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      Temp_byte_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserPrivilege                          Temp_byte_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0070(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_CommonUserInitialize*      CallFunc_LoginForOnlinePlay_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCommonUserInfo*                  K2Node_CustomEvent_UserInfo_1;                     // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error_1;                        // 0x00C8(0x0010)()
	ECommonUserPrivilege                          K2Node_CustomEvent_RequestedPrivilege_1;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      K2Node_CustomEvent_OnlineContext_1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      Temp_byte_Variable_2;                              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserPrivilege                          Temp_byte_Variable_3;                              // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x00E0(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        Temp_object_Variable_1;                            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToInitializeUser_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchSessionRequest*    CallFunc_CreateOnlineSearchSessionRequest_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSucceeded, class FText ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_CommonUserInitialize*      CallFunc_LoginForOnlinePlay_ReturnValue_2;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UCommonUserInfo*                  K2Node_CustomEvent_UserInfo;                       // 0x01F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error;                          // 0x0200(0x0010)()
	ECommonUserPrivilege                          K2Node_CustomEvent_RequestedPrivilege;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      K2Node_CustomEvent_OnlineContext;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      Temp_byte_Variable_4;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserPrivilege                          Temp_byte_Variable_5;                              // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0218(0x0010)()
	bool                                          Temp_bool_Variable_2;                              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        Temp_object_Variable_2;                            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonUserInitializationState                CallFunc_GetLocalPlayerInitializationState_ReturnValue; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable_6;                              // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_StartMenuMusic;                 // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsLoggedIn_ReturnValue;                // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthenticationInitialization_RecoverMatch* K2Node_Event_RecoverMatch;                         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetworkFailure                               K2Node_Event_FailureType_1;                        // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsServer;                            // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETravelFailure                                K2Node_Event_FailureType;                          // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0300(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0320(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0368(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0378(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0388(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03D0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x03E0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0400(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_3;                            // 0x0448(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSucceeded;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ErrorMessage;                   // 0x0460(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0470(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x04B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04C8(0x0010)()
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x04D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonSessionOnlineMode                      K2Node_CustomEvent_OnlineMode;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0518(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonSessionOnlineMode                      CallFunc_GetOnlineModeFromMatchSettings_ReturnValue; // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetLobbyMapIDFromMatchSettings_ReturnValue; // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetLobbyMapIDFromMatchSettings_ReturnValue_1; // 0x0548(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Host_Request_ReturnValue;          // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers_1; // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Host_Request_ReturnValue_1;        // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Header;                               // 0x0570(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Body;                                 // 0x0580(0x0010)(ConstParm)
	class UGameInstanceJP*                        K2Node_DynamicCast_AsGame_Instance_JP;             // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonGameDialogDescriptor*            CallFunc_GetOkDialogDescriptor_ReturnValue;        // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationCustom_ReturnValue;       // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GI_C_ExecuteUbergraph_BP_GI) == 0x000008, "Wrong alignment on BP_GI_C_ExecuteUbergraph_BP_GI");
static_assert(sizeof(BP_GI_C_ExecuteUbergraph_BP_GI) == 0x0005B8, "Wrong size on BP_GI_C_ExecuteUbergraph_BP_GI");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, EntryPoint) == 0x000000, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000020, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_LoginForOnlinePlay_ReturnValue) == 0x000028, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_LoginForOnlinePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_UserInfo_2) == 0x000048, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_UserInfo_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_bSuccess_2) == 0x000050, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_Error_2) == 0x000058, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_Error_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_RequestedPrivilege_2) == 0x000068, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_RequestedPrivilege_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_OnlineContext_2) == 0x000069, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_OnlineContext_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable) == 0x00006A, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_1) == 0x00006B, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_text_Variable) == 0x000070, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_bool_Variable) == 0x000080, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_object_Variable) == 0x000088, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000090, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_LoginForOnlinePlay_ReturnValue_1) == 0x000098, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_LoginForOnlinePlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_UserInfo_1) == 0x0000B8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_UserInfo_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_bSuccess_1) == 0x0000C0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_Error_1) == 0x0000C8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_Error_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_RequestedPrivilege_1) == 0x0000D8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_RequestedPrivilege_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_OnlineContext_1) == 0x0000D9, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_OnlineContext_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_2) == 0x0000DA, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_3) == 0x0000DB, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_text_Variable_1) == 0x0000E0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_bool_Variable_1) == 0x0000F0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_object_Variable_1) == 0x0000F8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000100, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000108, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000110, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_TryToInitializeUser_ReturnValue) == 0x000118, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_TryToInitializeUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000120, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_CreateOnlineSearchSessionRequest_ReturnValue) == 0x000128, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_CreateOnlineSearchSessionRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_2) == 0x000130, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000140, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_LoginForOnlinePlay_ReturnValue_2) == 0x000150, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_LoginForOnlinePlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000158, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_5) == 0x0001A8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeArray_Array) == 0x0001B0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Format_ReturnValue) == 0x0001C0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_TextToString_ReturnValue) == 0x0001D0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_UserInfo) == 0x0001F0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_UserInfo' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_bSuccess) == 0x0001F8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_Error) == 0x000200, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_Error' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_RequestedPrivilege) == 0x000210, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_RequestedPrivilege' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_OnlineContext) == 0x000211, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_OnlineContext' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_4) == 0x000212, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_5) == 0x000213, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_text_Variable_2) == 0x000218, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_bool_Variable_2) == 0x000228, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_object_Variable_2) == 0x000230, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetGameInstanceSubsystem_ReturnValue_9) == 0x000238, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetGameInstanceSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetLocalPlayerInitializationState_ReturnValue) == 0x000240, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetLocalPlayerInitializationState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_SwitchEnum_CmpSuccess) == 0x000241, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_4) == 0x000244, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_Result) == 0x000254, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_byte_Variable_6) == 0x000255, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_SpawnSound2D_ReturnValue) == 0x000258, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000260, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_6) == 0x000268, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_StartMenuMusic) == 0x000269, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_StartMenuMusic' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_7) == 0x00026A, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_K2_IsLoggedIn_ReturnValue) == 0x00026B, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_K2_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsPlaying_ReturnValue) == 0x00026C, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_Event_RecoverMatch) == 0x000270, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_Event_RecoverMatch' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue) == 0x000278, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_8) == 0x000280, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_PushContentToLayerForPlayer_ReturnValue) == 0x000288, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_PushContentToLayerForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_BoolToString_ReturnValue) == 0x000290, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Concat_StrStr_ReturnValue) == 0x0002A0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_9) == 0x0002B0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002B8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002C8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_SpawnSound2D_ReturnValue_2) == 0x0002D0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0002D8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_SwitchString_CmpSuccess) == 0x0002E8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_Event_FailureType_1) == 0x0002E9, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_Event_FailureType_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_Event_bIsServer) == 0x0002EA, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_Event_bIsServer' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_Event_FailureType) == 0x0002EB, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_Event_FailureType' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0002F0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_StringToText_ReturnValue) == 0x000300, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000310, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeStruct_FormatArgumentData_1) == 0x000320, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000368, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeArray_Array_1) == 0x000378, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeStruct_FormatArgumentData_2) == 0x000388, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Format_ReturnValue_1) == 0x0003D0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeArray_Array_2) == 0x0003E0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0003F0, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Format_ReturnValue_2) == 0x000400, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000410, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000420, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_2) == 0x000428, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_IsValid_ReturnValue_10) == 0x000430, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_SpawnSound2D_ReturnValue_3) == 0x000438, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_3) == 0x000440, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, Temp_object_Variable_3) == 0x000448, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_UserWidget) == 0x000450, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_bSucceeded) == 0x000458, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_bSucceeded' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_ErrorMessage) == 0x000460, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeStruct_FormatArgumentData_3) == 0x000470, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_MakeArray_Array_3) == 0x0004B8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Format_ReturnValue_3) == 0x0004C8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004D8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0004E8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_4) == 0x0004F8, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_OnlineMode) == 0x000500, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_OnlineMode' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CustomEvent_UserWidget_1) == 0x000508, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CustomEvent_UserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_5) == 0x000510, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, K2Node_CreateDelegate_OutputDelegate_6) == 0x000518, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_GI_C_ExecuteUbergraph_BP_GI, CallFunc_GetPlayerController_ReturnValue_6) == 0x000528, "Member 'BP_GI_C_ExecuteUbergraph_BP_GI::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
