#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Benchmark_Neighbourhood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameMode_Match_CaptureFlagConquest_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GM_Benchmark_Neighbourhood.BP_GM_Benchmark_Neighbourhood_C
// 0x0038 (0x0540 - 0x0508)
class ABP_GM_Benchmark_Neighbourhood_C final : public AGameMode_Match_CaptureFlagConquest_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GM_Benchmark_Neighbourhood_C;    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 BenchmarkClass;                                    // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  BenchmarkAddonLevel;                               // 0x0518(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GM_Benchmark_Neighbourhood(int32 EntryPoint);
	class UClass* GetDefaultPawnClassForController(class AController* InController);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GM_Benchmark_Neighbourhood_C">();
	}
	static class ABP_GM_Benchmark_Neighbourhood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GM_Benchmark_Neighbourhood_C>();
	}
};
static_assert(alignof(ABP_GM_Benchmark_Neighbourhood_C) == 0x000008, "Wrong alignment on ABP_GM_Benchmark_Neighbourhood_C");
static_assert(sizeof(ABP_GM_Benchmark_Neighbourhood_C) == 0x000540, "Wrong size on ABP_GM_Benchmark_Neighbourhood_C");
static_assert(offsetof(ABP_GM_Benchmark_Neighbourhood_C, UberGraphFrame_BP_GM_Benchmark_Neighbourhood_C) == 0x000508, "Member 'ABP_GM_Benchmark_Neighbourhood_C::UberGraphFrame_BP_GM_Benchmark_Neighbourhood_C' has a wrong offset!");
static_assert(offsetof(ABP_GM_Benchmark_Neighbourhood_C, BenchmarkClass) == 0x000510, "Member 'ABP_GM_Benchmark_Neighbourhood_C::BenchmarkClass' has a wrong offset!");
static_assert(offsetof(ABP_GM_Benchmark_Neighbourhood_C, BenchmarkAddonLevel) == 0x000518, "Member 'ABP_GM_Benchmark_Neighbourhood_C::BenchmarkAddonLevel' has a wrong offset!");

}

