#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_groundskeeper

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_groundskeeper.bp_groundskeeper_C.CalculateHouseLevel
// 0x0040 (0x0040 - 0x0000)
struct bp_groundskeeper_C_CalculateHouseLevel final
{
public:
	int32                                         Return;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_HouseLevel;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoomData                              CallFunc_Array_Get_Item;                           // 0x0018(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_CalculateHouseLevel) == 0x000008, "Wrong alignment on bp_groundskeeper_C_CalculateHouseLevel");
static_assert(sizeof(bp_groundskeeper_C_CalculateHouseLevel) == 0x000040, "Wrong size on bp_groundskeeper_C_CalculateHouseLevel");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, Return) == 0x000000, "Member 'bp_groundskeeper_C_CalculateHouseLevel::Return' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, L_HouseLevel) == 0x000004, "Member 'bp_groundskeeper_C_CalculateHouseLevel::L_HouseLevel' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, Temp_int_Array_Index_Variable) == 0x000008, "Member 'bp_groundskeeper_C_CalculateHouseLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'bp_groundskeeper_C_CalculateHouseLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Array_Get_Item) == 0x000018, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_CalculateHouseLevel, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'bp_groundskeeper_C_CalculateHouseLevel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.ExecuteUbergraph_bp_groundskeeper
// 0x0140 (0x0140 - 0x0000)
struct bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateHouseLevel_Return;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RoomManager_C*                      CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_GameMaster_C>       K2Node_DynamicCast_AsI_Game_Master;                // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper) == 0x000010, "Wrong alignment on bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper");
static_assert(sizeof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper) == 0x000140, "Wrong size on bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, EntryPoint) == 0x000000, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_CalculateHouseLevel_Return) == 0x000004, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_CalculateHouseLevel_Return' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000008, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_int_Array_Index_Variable) == 0x000010, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, K2Node_MakeArray_Array) == 0x0000A0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_HasAuthority_ReturnValue) == 0x0000B0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_IsValid_ReturnValue_1) == 0x0000C4, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Less_IntInt_ReturnValue) == 0x0000C5, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_HasAuthority_ReturnValue_1) == 0x0000C6, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_int_Loop_Counter_Variable_1) == 0x0000C8, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_object_Variable) == 0x0000D0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_ComponentOverlapActors_OutActors) == 0x0000E0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_ComponentOverlapActors_ReturnValue) == 0x0000F0, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_ComponentOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, K2Node_DynamicCast_AsI_Game_Master) == 0x000108, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::K2Node_DynamicCast_AsI_Game_Master' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Less_IntInt_ReturnValue_1) == 0x000119, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Add_ReturnValue) == 0x00011C, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Array_Length_ReturnValue_2) == 0x000120, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000124, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, CallFunc_Get_ClassLog_Name_name) == 0x000128, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_bool_Has_Been_Initd_Variable) == 0x000138, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper, Temp_bool_IsClosed_Variable) == 0x000139, "Member 'bp_groundskeeper_C_ExecuteUbergraph_bp_groundskeeper::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.On_TeamObtainedItem__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature final
{
public:
	class UItemInstance*                          Item_Instance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CharacterWhoObtained;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature) == 0x000008, "Wrong alignment on bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature");
static_assert(sizeof(bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature) == 0x000010, "Wrong size on bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature");
static_assert(offsetof(bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature, Item_Instance) == 0x000000, "Member 'bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature::Item_Instance' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature, CharacterWhoObtained) == 0x000008, "Member 'bp_groundskeeper_C_On_TeamObtainedItem__DelegateSignature::CharacterWhoObtained' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.On_UpdateHouseLevel__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature) == 0x000004, "Wrong alignment on bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature");
static_assert(sizeof(bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature) == 0x000004, "Wrong size on bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature");
static_assert(offsetof(bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature, Level) == 0x000000, "Member 'bp_groundskeeper_C_On_UpdateHouseLevel__DelegateSignature::Level' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.On_UpdateTotalScore__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature final
{
public:
	double                                        TotalScore;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature) == 0x000008, "Wrong alignment on bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature");
static_assert(sizeof(bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature) == 0x000008, "Wrong size on bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature");
static_assert(offsetof(bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature, TotalScore) == 0x000000, "Member 'bp_groundskeeper_C_On_UpdateTotalScore__DelegateSignature::TotalScore' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.OnRep_HouseLevel
// 0x0038 (0x0038 - 0x0000)
struct bp_groundskeeper_C_OnRep_HouseLevel final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_OnRep_HouseLevel) == 0x000008, "Wrong alignment on bp_groundskeeper_C_OnRep_HouseLevel");
static_assert(sizeof(bp_groundskeeper_C_OnRep_HouseLevel) == 0x000038, "Wrong size on bp_groundskeeper_C_OnRep_HouseLevel");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_GetTeamID_ReturnValue) == 0x000010, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000018, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000028, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_GetTeamID_ReturnValue_1) == 0x000030, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_IsValid_ReturnValue_1) == 0x000033, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_OnRep_HouseLevel, CallFunc_Conv_IntToByte_ReturnValue) == 0x000034, "Member 'bp_groundskeeper_C_OnRep_HouseLevel::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");

// Function bp_groundskeeper.bp_groundskeeper_C.TeamObtainedItem
// 0x0010 (0x0010 - 0x0000)
struct bp_groundskeeper_C_TeamObtainedItem final
{
public:
	class UItemInstance*                          ItemInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CharacterWhoObtained;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_groundskeeper_C_TeamObtainedItem) == 0x000008, "Wrong alignment on bp_groundskeeper_C_TeamObtainedItem");
static_assert(sizeof(bp_groundskeeper_C_TeamObtainedItem) == 0x000010, "Wrong size on bp_groundskeeper_C_TeamObtainedItem");
static_assert(offsetof(bp_groundskeeper_C_TeamObtainedItem, ItemInstance) == 0x000000, "Member 'bp_groundskeeper_C_TeamObtainedItem::ItemInstance' has a wrong offset!");
static_assert(offsetof(bp_groundskeeper_C_TeamObtainedItem, CharacterWhoObtained) == 0x000008, "Member 'bp_groundskeeper_C_TeamObtainedItem::CharacterWhoObtained' has a wrong offset!");

}

