#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseScreen_HouseWorldSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_HouseBoughtMessage_structs.hpp"
#include "Engine_structs.hpp"
#include "S_PreviewHouseChangedMessage_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot
// 0x0430 (0x0430 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HouseBoughtMessage                  Temp_struct_Variable;                              // 0x0008(0x0028)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HouseBoughtMessage                  Temp_struct_Variable_1;                            // 0x0050(0x0028)(HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetHouseID_ReturnValue;                   // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x00A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          Temp_struct_Variable_3;                            // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          Temp_struct_Variable_4;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x00FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreviewHouseChangedMessage          Temp_struct_Variable_6;                            // 0x0158(0x0030)(HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_CustomEvent_HouseMesh;                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_HouseDefinition_3;              // 0x0190(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_SelectedHouseDefinition;        // 0x01B8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition_1;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_HousePreviewActorClass;         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_HouseDefinition_2;              // 0x0218(0x0028)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHousePreviewActorBase*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_HouseDefinition_1;              // 0x02B8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition_2;           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHouseStaticMeshFullyLoaded_FullyLoaded; // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_HouseDefinition;                // 0x0318(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition_3;           // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHousePreviewActorFullyLoaded_FullyLoaded; // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_2;  // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base_1; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_3;                            // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_7;                            // 0x0384(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreviewHouseChangedMessage          Temp_struct_Variable_8;                            // 0x0390(0x0030)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_2;                  // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_2;                // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        K2Node_CustomEvent_BoughtHouseDefinition;          // 0x03D0(0x0028)(HasGetValueTypeHash)
	class ABp_HousePreview_Base_C*                K2Node_DynamicCast_AsBp_House_Preview_Base;        // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0404(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0414(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot) == 0x000010, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot) == 0x000430, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, EntryPoint) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable) == 0x000008, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ProxyObject_1) == 0x000030, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ActualChannel_1) == 0x000038, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_1) == 0x000050, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_2) == 0x000078, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_object_Variable) == 0x000080, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_GetPayload_ReturnValue) == 0x000088, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000090, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_GetHouseID_ReturnValue) == 0x0000A0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_GetHouseID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x0000A8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x0000D0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_3) == 0x0000D2, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ProxyObject) == 0x0000D8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ActualChannel) == 0x0000E0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_4) == 0x0000F8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_5) == 0x0000FC, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_object_Variable_1) == 0x000108, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000110, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_GetPayload_ReturnValue_1) == 0x000118, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_Loaded) == 0x000120, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_object_Variable_2) == 0x000128, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsHouse_Definition) == 0x000130, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000140, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base) == 0x000148, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_ClassDynamicCast_bSuccess) == 0x000150, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_6) == 0x000158, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HouseMesh) == 0x000188, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HouseMesh' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HouseDefinition_3) == 0x000190, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HouseDefinition_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_SelectedHouseDefinition) == 0x0001B8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_SelectedHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0001E0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsHouse_Definition_1) == 0x0001E8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsHouse_Definition_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001F1, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0001F8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsStatic_Mesh) == 0x000200, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_2) == 0x000208, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_SetStaticMesh_ReturnValue) == 0x000209, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00020A, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HousePreviewActorClass) == 0x000210, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HousePreviewActorClass' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HouseDefinition_2) == 0x000218, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HouseDefinition_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000240, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002A8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsValid_ReturnValue_2) == 0x0002B0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HouseDefinition_1) == 0x0002B8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HouseDefinition_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0002E0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0002E8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsHouse_Definition_2) == 0x0002F0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsHouse_Definition_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_3) == 0x0002F8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsHouseStaticMeshFullyLoaded_FullyLoaded) == 0x0002F9, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsHouseStaticMeshFullyLoaded_FullyLoaded' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000300, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x000308, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_4) == 0x000310, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_HouseDefinition) == 0x000318, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_HouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000340, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsHouse_Definition_3) == 0x000348, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsHouse_Definition_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_5) == 0x000350, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsHousePreviewActorFullyLoaded_FullyLoaded) == 0x000351, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsHousePreviewActorFullyLoaded_FullyLoaded' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000358, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_ListenForGameplayMessages_ReturnValue_2) == 0x000360, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_ListenForGameplayMessages_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base_1) == 0x000368, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_ClassDynamicCast_bSuccess_1) == 0x000370, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_IsValid_ReturnValue_3) == 0x000371, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_object_Variable_3) == 0x000378, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, CallFunc_GetPayload_ReturnValue_2) == 0x000380, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::CallFunc_GetPayload_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_7) == 0x000384, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, Temp_struct_Variable_8) == 0x000390, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ProxyObject_2) == 0x0003C0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ProxyObject_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_ActualChannel_2) == 0x0003C8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_ActualChannel_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CustomEvent_BoughtHouseDefinition) == 0x0003D0, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CustomEvent_BoughtHouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_AsBp_House_Preview_Base) == 0x0003F8, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_AsBp_House_Preview_Base' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_DynamicCast_bSuccess_6) == 0x000400, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000404, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000414, "Member 'BP_HouseScreen_HouseWorldSlot_C_ExecuteUbergraph_BP_HouseScreen_HouseWorldSlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.HandleHouseBought
// 0x0028 (0x0028 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        BoughtHouseDefinition;                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought) == 0x000008, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought) == 0x000028, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought, BoughtHouseDefinition) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_HandleHouseBought::BoughtHouseDefinition' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.HandlePreviewHouseChanged
// 0x0028 (0x0028 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        SelectedHouseDefinition;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged) == 0x000008, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged) == 0x000028, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged, SelectedHouseDefinition) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_HandlePreviewHouseChanged::SelectedHouseDefinition' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.IsHousePreviewActorFullyLoaded
// 0x0060 (0x0060 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        HouseDefinition;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          FullyLoaded;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded) == 0x000008, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded) == 0x000060, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, HouseDefinition) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::HouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, FullyLoaded) == 0x000028, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::FullyLoaded' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, K2Node_DynamicCast_AsHouse_Definition) == 0x000038, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000048, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base) == 0x000050, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::K2Node_ClassDynamicCast_AsHouse_Preview_Actor_Base' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, K2Node_ClassDynamicCast_bSuccess) == 0x000058, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded, CallFunc_IsValidClass_ReturnValue) == 0x000059, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHousePreviewActorFullyLoaded::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.IsHouseStaticMeshFullyLoaded
// 0x0060 (0x0060 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        HouseDefinition;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          FullyLoaded;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded) == 0x000008, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded) == 0x000060, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, HouseDefinition) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::HouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, FullyLoaded) == 0x000028, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::FullyLoaded' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, K2Node_DynamicCast_AsHouse_Definition) == 0x000038, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000048, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, K2Node_DynamicCast_AsStatic_Mesh) == 0x000050, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsHouseStaticMeshFullyLoaded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.IsSoftHousePreviewActorClassValid
// 0x0048 (0x0048 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        HouseDefinition;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid) == 0x000008, "Wrong alignment on BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid");
static_assert(sizeof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid) == 0x000048, "Wrong size on BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, HouseDefinition) == 0x000000, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::HouseDefinition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, IsValid) == 0x000028, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::IsValid' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, K2Node_DynamicCast_AsHouse_Definition) == 0x000038, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::K2Node_DynamicCast_AsHouse_Definition' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000042, "Member 'BP_HouseScreen_HouseWorldSlot_C_IsSoftHousePreviewActorClassValid::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function BP_HouseScreen_HouseWorldSlot.BP_HouseScreen_HouseWorldSlot_C.IsSoftHouseStaticMeshValid
// 0x0048 (0x0048 - 0x0000)
struct BP_HouseScreen_HouseWorldSlot_C_IsSoftHouseStaticMeshValid final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        HouseDefinition;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
