#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_HousePreview_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bp_HousePreview_Base.Bp_HousePreview_Base_C.PlayHouseBoughtParticles
// 0x0020 (0x0020 - 0x0000)
struct Bp_HousePreview_Base_C_PlayHouseBoughtParticles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles) == 0x000008, "Wrong alignment on Bp_HousePreview_Base_C_PlayHouseBoughtParticles");
static_assert(sizeof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles) == 0x000020, "Wrong size on Bp_HousePreview_Base_C_PlayHouseBoughtParticles");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, CallFunc_Array_Get_Item) == 0x000010, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_PlayHouseBoughtParticles, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'Bp_HousePreview_Base_C_PlayHouseBoughtParticles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Bp_HousePreview_Base.Bp_HousePreview_Base_C.SetHouseBoughtParticles
// 0x0038 (0x0038 - 0x0000)
struct Bp_HousePreview_Base_C_SetHouseBoughtParticles final
{
public:
	TArray<class UNiagaraComponent*>              Particles;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_HousePreview_Base_C_SetHouseBoughtParticles) == 0x000008, "Wrong alignment on Bp_HousePreview_Base_C_SetHouseBoughtParticles");
static_assert(sizeof(Bp_HousePreview_Base_C_SetHouseBoughtParticles) == 0x000038, "Wrong size on Bp_HousePreview_Base_C_SetHouseBoughtParticles");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, Particles) == 0x000000, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::Particles' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_Array_Get_Item) == 0x000018, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_Array_AddUnique_ReturnValue) == 0x000020, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_HousePreview_Base_C_SetHouseBoughtParticles, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Bp_HousePreview_Base_C_SetHouseBoughtParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

