#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hedge_Branch

#include "Basic.hpp"

#include "E_MaterialTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.ExecuteUbergraph_BP_Hedge_Branch
// 0x0560 (0x0560 - 0x0000)
struct BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Hedge_Garbage_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Delta;                                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Causer;                               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x0098(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x00F8(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x03E0(0x0018)(NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x03F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HighlightManager_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxHealth;                            // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_Causer;                         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetParticleLocationAndRotation_Location;  // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetParticleLocationAndRotation_Rotation;  // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0538(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch) == 0x000010, "Wrong alignment on BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch");
static_assert(sizeof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch) == 0x000560, "Wrong size on BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, EntryPoint) == 0x000000, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_HasAuthority_ReturnValue) == 0x000088, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_Delta) == 0x00008C, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_Causer) == 0x000090, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_CombatParticipant) == 0x000098, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_KillMethod) == 0x0000F8, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_KillMethod' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_Location) == 0x0003E0, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_AttackingActor) == 0x0003F8, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_AttackingActor' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_Direction) == 0x000400, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetActorOfClass_ReturnValue) == 0x000418, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_Health) == 0x000420, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_Event_MaxHealth) == 0x000424, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_Event_MaxHealth' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000428, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_IsValid_ReturnValue_1) == 0x000429, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, K2Node_CustomEvent_Causer) == 0x000430, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::K2Node_CustomEvent_Causer' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_IsValid_ReturnValue_2) == 0x000438, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetActorUpVector_ReturnValue) == 0x000440, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_BreakVector_X) == 0x000458, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_BreakVector_Y) == 0x000460, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_BreakVector_Z) == 0x000468, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000470, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000488, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetActorForwardVector_ReturnValue) == 0x000490, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_BooleanAND_ReturnValue) == 0x0004A8, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_MakeRotFromY_ReturnValue) == 0x0004B0, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_MakeRotFromY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0004C8, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0004D0, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0004E8, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetParticleLocationAndRotation_Location) == 0x0004F0, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetParticleLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_GetParticleLocationAndRotation_Rotation) == 0x000508, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_GetParticleLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000520, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000538, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_IsValid_ReturnValue_3) == 0x000540, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000548, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000550, "Member 'BP_Hedge_Branch_C_ExecuteUbergraph_BP_Hedge_Branch::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.GetDurabilityCostWhenHit
// 0x0008 (0x0008 - 0x0000)
struct BP_Hedge_Branch_C_GetDurabilityCostWhenHit final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_GetDurabilityCostWhenHit");
static_assert(sizeof(BP_Hedge_Branch_C_GetDurabilityCostWhenHit) == 0x000008, "Wrong size on BP_Hedge_Branch_C_GetDurabilityCostWhenHit");
static_assert(offsetof(BP_Hedge_Branch_C_GetDurabilityCostWhenHit, Amount) == 0x000000, "Member 'BP_Hedge_Branch_C_GetDurabilityCostWhenHit::Amount' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.GetMaterialType
// 0x0001 (0x0001 - 0x0000)
struct BP_Hedge_Branch_C_GetMaterialType final
{
public:
	E_MaterialTypes                               MaterialType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_GetMaterialType) == 0x000001, "Wrong alignment on BP_Hedge_Branch_C_GetMaterialType");
static_assert(sizeof(BP_Hedge_Branch_C_GetMaterialType) == 0x000001, "Wrong size on BP_Hedge_Branch_C_GetMaterialType");
static_assert(offsetof(BP_Hedge_Branch_C_GetMaterialType, MaterialType) == 0x000000, "Member 'BP_Hedge_Branch_C_GetMaterialType::MaterialType' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.GetParticleLocationAndRotation
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hedge_Branch_C_GetParticleLocationAndRotation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hedge_Branch_C_GetParticleLocationAndRotation) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_GetParticleLocationAndRotation");
static_assert(sizeof(BP_Hedge_Branch_C_GetParticleLocationAndRotation) == 0x0000C0, "Wrong size on BP_Hedge_Branch_C_GetParticleLocationAndRotation");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, Location) == 0x000000, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::Location' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, Rotation) == 0x000018, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::Rotation' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000060, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_MakeRotFromZ_ReturnValue) == 0x000078, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000090, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_GetParticleLocationAndRotation, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000A8, "Member 'BP_Hedge_Branch_C_GetParticleLocationAndRotation::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.Hit Cosmetics
// 0x0008 (0x0008 - 0x0000)
struct BP_Hedge_Branch_C_Hit_Cosmetics final
{
public:
	class APawn*                                  Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_Hit_Cosmetics) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_Hit_Cosmetics");
static_assert(sizeof(BP_Hedge_Branch_C_Hit_Cosmetics) == 0x000008, "Wrong size on BP_Hedge_Branch_C_Hit_Cosmetics");
static_assert(offsetof(BP_Hedge_Branch_C_Hit_Cosmetics, Causer) == 0x000000, "Member 'BP_Hedge_Branch_C_Hit_Cosmetics::Causer' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.HitInterface
// 0x0018 (0x0018 - 0x0000)
struct BP_Hedge_Branch_C_HitInterface final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_HitInterface) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_HitInterface");
static_assert(sizeof(BP_Hedge_Branch_C_HitInterface) == 0x000018, "Wrong size on BP_Hedge_Branch_C_HitInterface");
static_assert(offsetof(BP_Hedge_Branch_C_HitInterface, Direction) == 0x000000, "Member 'BP_Hedge_Branch_C_HitInterface::Direction' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.ImpactCosmetics
// 0x0048 (0x0048 - 0x0000)
struct BP_Hedge_Branch_C_ImpactCosmetics final
{
public:
	class APawn*                                  ImpactCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                ImpactEffect;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x003C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedAttributes;                                 // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_ImpactCosmetics) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_ImpactCosmetics");
static_assert(sizeof(BP_Hedge_Branch_C_ImpactCosmetics) == 0x000048, "Wrong size on BP_Hedge_Branch_C_ImpactCosmetics");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, ImpactCauser) == 0x000000, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::ImpactCauser' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, Location) == 0x000008, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::Location' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, HitImpulse) == 0x000020, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::HitImpulse' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, ImpactEffect) == 0x000038, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::ImpactEffect' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, BoneName) == 0x00003C, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::BoneName' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ImpactCosmetics, ChangedAttributes) == 0x000044, "Member 'BP_Hedge_Branch_C_ImpactCosmetics::ChangedAttributes' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.MeleeHit
// 0x0008 (0x0008 - 0x0000)
struct BP_Hedge_Branch_C_MeleeHit final
{
public:
	const class AActor*                           AttackingActor;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_MeleeHit) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_MeleeHit");
static_assert(sizeof(BP_Hedge_Branch_C_MeleeHit) == 0x000008, "Wrong size on BP_Hedge_Branch_C_MeleeHit");
static_assert(offsetof(BP_Hedge_Branch_C_MeleeHit, AttackingActor) == 0x000000, "Member 'BP_Hedge_Branch_C_MeleeHit::AttackingActor' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.OnDamaged
// 0x0370 (0x0370 - 0x0000)
struct BP_Hedge_Branch_C_OnDamaged final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     CombatParticipant;                                 // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            KillMethod;                                        // 0x0070(0x02E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector_NetQuantize                    Location;                                          // 0x0358(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_OnDamaged) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_OnDamaged");
static_assert(sizeof(BP_Hedge_Branch_C_OnDamaged) == 0x000370, "Wrong size on BP_Hedge_Branch_C_OnDamaged");
static_assert(offsetof(BP_Hedge_Branch_C_OnDamaged, Delta) == 0x000000, "Member 'BP_Hedge_Branch_C_OnDamaged::Delta' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_OnDamaged, Causer) == 0x000008, "Member 'BP_Hedge_Branch_C_OnDamaged::Causer' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_OnDamaged, CombatParticipant) == 0x000010, "Member 'BP_Hedge_Branch_C_OnDamaged::CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_OnDamaged, KillMethod) == 0x000070, "Member 'BP_Hedge_Branch_C_OnDamaged::KillMethod' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_OnDamaged, Location) == 0x000358, "Member 'BP_Hedge_Branch_C_OnDamaged::Location' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.OnHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Hedge_Branch_C_OnHealthChanged final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_OnHealthChanged) == 0x000004, "Wrong alignment on BP_Hedge_Branch_C_OnHealthChanged");
static_assert(sizeof(BP_Hedge_Branch_C_OnHealthChanged) == 0x000008, "Wrong size on BP_Hedge_Branch_C_OnHealthChanged");
static_assert(offsetof(BP_Hedge_Branch_C_OnHealthChanged, Health) == 0x000000, "Member 'BP_Hedge_Branch_C_OnHealthChanged::Health' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_OnHealthChanged, MaxHealth) == 0x000004, "Member 'BP_Hedge_Branch_C_OnHealthChanged::MaxHealth' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.RandomizeTransforms
// 0x06E0 (0x06E0 - 0x0000)
struct BP_Hedge_Branch_C_RandomizeTransforms final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x01B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_2;    // 0x0318(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x04A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x05C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_2;           // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_RandomizeTransforms) == 0x000010, "Wrong alignment on BP_Hedge_Branch_C_RandomizeTransforms");
static_assert(sizeof(BP_Hedge_Branch_C_RandomizeTransforms) == 0x0006E0, "Wrong size on BP_Hedge_Branch_C_RandomizeTransforms");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000C0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x0001B8, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0002B0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue) == 0x000310, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult_2) == 0x000318, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_ReturnValue) == 0x000410, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000428, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000430, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000438, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000440, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000458, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000460, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000468, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_ReturnValue_1) == 0x000470, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000488, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0004A0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000598, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x0005A0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x0005A8, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_ReturnValue_2) == 0x0005B0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0005C8, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0006C0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0006C4, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0006C8, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0006CC, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x0006D0, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Roll_ImplicitCast_1) == 0x0006D4, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Roll_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_RandomizeTransforms, CallFunc_MakeRotator_Yaw_ImplicitCast_2) == 0x0006D8, "Member 'BP_Hedge_Branch_C_RandomizeTransforms::CallFunc_MakeRotator_Yaw_ImplicitCast_2' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.Score
// 0x0038 (0x0038 - 0x0000)
struct BP_Hedge_Branch_C_Score final
{
public:
	bool                                          GainScore;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_Score) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_Score");
static_assert(sizeof(BP_Hedge_Branch_C_Score) == 0x000038, "Wrong size on BP_Hedge_Branch_C_Score");
static_assert(offsetof(BP_Hedge_Branch_C_Score, GainScore) == 0x000000, "Member 'BP_Hedge_Branch_C_Score::GainScore' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_Score, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_Hedge_Branch_C_Score::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_Score, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000010, "Member 'BP_Hedge_Branch_C_Score::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_Score, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_Hedge_Branch_C_Score::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_Score, CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue) == 0x000030, "Member 'BP_Hedge_Branch_C_Score::CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.SetSeethroughParams
// 0x0020 (0x0020 - 0x0000)
struct BP_Hedge_Branch_C_SetSeethroughParams final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_SetSeethroughParams) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_SetSeethroughParams");
static_assert(sizeof(BP_Hedge_Branch_C_SetSeethroughParams) == 0x000020, "Wrong size on BP_Hedge_Branch_C_SetSeethroughParams");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, Temp_int_Variable) == 0x000000, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, Temp_int_Variable_1) == 0x000004, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, K2Node_Select_Default) == 0x000010, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_SetSeethroughParams, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_Hedge_Branch_C_SetSeethroughParams::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Hedge_Branch.BP_Hedge_Branch_C.ShowScoreNotification
// 0x0028 (0x0028 - 0x0000)
struct BP_Hedge_Branch_C_ShowScoreNotification final
{
public:
	bool                                          AddScore;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hedge_Branch_C_ShowScoreNotification) == 0x000008, "Wrong alignment on BP_Hedge_Branch_C_ShowScoreNotification");
static_assert(sizeof(BP_Hedge_Branch_C_ShowScoreNotification) == 0x000028, "Wrong size on BP_Hedge_Branch_C_ShowScoreNotification");
static_assert(offsetof(BP_Hedge_Branch_C_ShowScoreNotification, AddScore) == 0x000000, "Member 'BP_Hedge_Branch_C_ShowScoreNotification::AddScore' has a wrong offset!");
static_assert(offsetof(BP_Hedge_Branch_C_ShowScoreNotification, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Hedge_Branch_C_ShowScoreNotification::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
