#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeldMessItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MessItem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeldMessItem.BP_HeldMessItem_C
// 0x0010 (0x0610 - 0x0600)
class ABP_HeldMessItem_C : public ABP_MessItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HeldMessItem_C;                  // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SpawnedInAbility;                                  // 0x0608(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HeldInInventory;                                   // 0x0609(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void DisableCollisionAndHide();
	void EnableCollisionAndShow();
	void ExecuteUbergraph_BP_HeldMessItem(int32 EntryPoint);
	void Multi_Throw(const struct FVector& Velocity);
	void OnEnded_64D7C2314E1A6899D4B9D2B10D882FDB();
	void ReleaseFromInventory(const struct FVector& Velocity);
	void ShowAfterThrowDelay();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeldMessItem_C">();
	}
	static class ABP_HeldMessItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HeldMessItem_C>();
	}
};
static_assert(alignof(ABP_HeldMessItem_C) == 0x000010, "Wrong alignment on ABP_HeldMessItem_C");
static_assert(sizeof(ABP_HeldMessItem_C) == 0x000610, "Wrong size on ABP_HeldMessItem_C");
static_assert(offsetof(ABP_HeldMessItem_C, UberGraphFrame_BP_HeldMessItem_C) == 0x000600, "Member 'ABP_HeldMessItem_C::UberGraphFrame_BP_HeldMessItem_C' has a wrong offset!");
static_assert(offsetof(ABP_HeldMessItem_C, SpawnedInAbility) == 0x000608, "Member 'ABP_HeldMessItem_C::SpawnedInAbility' has a wrong offset!");
static_assert(offsetof(ABP_HeldMessItem_C, HeldInInventory) == 0x000609, "Member 'ABP_HeldMessItem_C::HeldInInventory' has a wrong offset!");

}

