#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseAdditionBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HouseActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HouseAdditionBase.BP_HouseAdditionBase_C
// 0x0048 (0x0438 - 0x03F0)
class ABP_HouseAdditionBase_C : public AHouseActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HouseAdditionBase_C;             // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0408(0x0010)(Edit, BlueprintVisible)
	class USceneComponent*                        HoveredInteractionComponent;                       // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HouseAdditionConstructSound;                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HouseAdditionConstructSoundStartTime;              // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OwningPlayerState;                                 // 0x0430(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Cosmetics_State_Repaired();
	void Cosmetics_State_Sabotaged();
	void ExecuteUbergraph_BP_HouseAdditionBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Sabotage(class AActor* SabotagingActor);
	void SetHoveredComponent(class UInteractionComponent_C* HoveredComponent, bool* Void);

	uint8 GetTeamID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HouseAdditionBase_C">();
	}
	static class ABP_HouseAdditionBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HouseAdditionBase_C>();
	}
};
static_assert(alignof(ABP_HouseAdditionBase_C) == 0x000008, "Wrong alignment on ABP_HouseAdditionBase_C");
static_assert(sizeof(ABP_HouseAdditionBase_C) == 0x000438, "Wrong size on ABP_HouseAdditionBase_C");
static_assert(offsetof(ABP_HouseAdditionBase_C, UberGraphFrame_BP_HouseAdditionBase_C) == 0x0003F0, "Member 'ABP_HouseAdditionBase_C::UberGraphFrame_BP_HouseAdditionBase_C' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, SkeletalMesh) == 0x0003F8, "Member 'ABP_HouseAdditionBase_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, StaticMesh) == 0x000400, "Member 'ABP_HouseAdditionBase_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, Materials) == 0x000408, "Member 'ABP_HouseAdditionBase_C::Materials' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, HoveredInteractionComponent) == 0x000418, "Member 'ABP_HouseAdditionBase_C::HoveredInteractionComponent' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, HouseAdditionConstructSound) == 0x000420, "Member 'ABP_HouseAdditionBase_C::HouseAdditionConstructSound' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, HouseAdditionConstructSoundStartTime) == 0x000428, "Member 'ABP_HouseAdditionBase_C::HouseAdditionConstructSoundStartTime' has a wrong offset!");
static_assert(offsetof(ABP_HouseAdditionBase_C, OwningPlayerState) == 0x000430, "Member 'ABP_HouseAdditionBase_C::OwningPlayerState' has a wrong offset!");

}

