#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_HousePreview_Base

#include "Basic.hpp"

#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_HousePreview_Base.Bp_HousePreview_Base_C
// 0x0020 (0x02B8 - 0x0298)
class ABp_HousePreview_Base_C : public AHousePreviewActorBase
{
public:
	class UStaticMeshComponent*                   HouseMesh;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              HouseBoughtParticles;                              // 0x02A8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)

public:
	void PlayHouseBoughtParticles();
	void SetHouseBoughtParticles(TArray<class UNiagaraComponent*>& Particles);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_HousePreview_Base_C">();
	}
	static class ABp_HousePreview_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_HousePreview_Base_C>();
	}
};
static_assert(alignof(ABp_HousePreview_Base_C) == 0x000008, "Wrong alignment on ABp_HousePreview_Base_C");
static_assert(sizeof(ABp_HousePreview_Base_C) == 0x0002B8, "Wrong size on ABp_HousePreview_Base_C");
static_assert(offsetof(ABp_HousePreview_Base_C, HouseMesh) == 0x000298, "Member 'ABp_HousePreview_Base_C::HouseMesh' has a wrong offset!");
static_assert(offsetof(ABp_HousePreview_Base_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABp_HousePreview_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABp_HousePreview_Base_C, HouseBoughtParticles) == 0x0002A8, "Member 'ABp_HousePreview_Base_C::HouseBoughtParticles' has a wrong offset!");

}

