#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseEssential_Cube

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JP_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "S_HouseEssentialWasDamagedMessage_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.ApplyDebugDamage
// 0x0030 (0x0030 - 0x0000)
struct BP_HouseEssential_Cube_C_ApplyDebugDamage final
{
public:
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0000(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0010(0x0010)()
	bool                                          CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue; // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_ApplyDebugDamage) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_ApplyDebugDamage");
static_assert(sizeof(BP_HouseEssential_Cube_C_ApplyDebugDamage) == 0x000030, "Wrong size on BP_HouseEssential_Cube_C_ApplyDebugDamage");
static_assert(offsetof(BP_HouseEssential_Cube_C_ApplyDebugDamage, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000000, "Member 'BP_HouseEssential_Cube_C_ApplyDebugDamage::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ApplyDebugDamage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000010, "Member 'BP_HouseEssential_Cube_C_ApplyDebugDamage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ApplyDebugDamage, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed) == 0x000020, "Member 'BP_HouseEssential_Cube_C_ApplyDebugDamage::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ApplyDebugDamage, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue) == 0x000024, "Member 'BP_HouseEssential_Cube_C_ApplyDebugDamage::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.AttackYourNeighborPOI
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseEssential_Cube_C_AttackYourNeighborPOI final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_AttackYourNeighborPOI) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_AttackYourNeighborPOI");
static_assert(sizeof(BP_HouseEssential_Cube_C_AttackYourNeighborPOI) == 0x000008, "Wrong size on BP_HouseEssential_Cube_C_AttackYourNeighborPOI");
static_assert(offsetof(BP_HouseEssential_Cube_C_AttackYourNeighborPOI, PlayerState) == 0x000000, "Member 'BP_HouseEssential_Cube_C_AttackYourNeighborPOI::PlayerState' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HouseEssential_Cube_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.CallOnEveryClient
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseEssential_Cube_C_CallOnEveryClient final
{
public:
	class ASubObjective*                          NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_CallOnEveryClient) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_CallOnEveryClient");
static_assert(sizeof(BP_HouseEssential_Cube_C_CallOnEveryClient) == 0x000008, "Wrong size on BP_HouseEssential_Cube_C_CallOnEveryClient");
static_assert(offsetof(BP_HouseEssential_Cube_C_CallOnEveryClient, NewParam) == 0x000000, "Member 'BP_HouseEssential_Cube_C_CallOnEveryClient::NewParam' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.CancelInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseEssential_Cube_C_CancelInteraction final
{
public:
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_CancelInteraction) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_CancelInteraction");
static_assert(sizeof(BP_HouseEssential_Cube_C_CancelInteraction) == 0x000008, "Wrong size on BP_HouseEssential_Cube_C_CancelInteraction");
static_assert(offsetof(BP_HouseEssential_Cube_C_CancelInteraction, InteractionComponent) == 0x000000, "Member 'BP_HouseEssential_Cube_C_CancelInteraction::InteractionComponent' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.CreateKillInfo
// 0x0FB0 (0x0FB0 - 0x0000)
struct BP_HouseEssential_Cube_C_CreateKillInfo final
{
public:
	struct FCombatParticipant                     Killer;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            Method;                                            // 0x0060(0x02E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillGameplayMessage                   KillGameplayMessage;                               // 0x0348(0x03D8)(Parm, OutParm)
	TArray<struct FCombatParticipant>             HealAssisters;                                     // 0x0720(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCombatParticipant>             KillAssisters;                                     // 0x0730(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetHouseEssentialIconTexture_ReturnValue; // 0x0740(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FCombatParticipant>             CallFunc_Add_Heal_Assisters_Modified;              // 0x0768(0x0010)(ReferenceParm)
	TArray<struct FCombatParticipant>             CallFunc_Add_Kill_Assisters_Modified;              // 0x0778(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UKillCircumstance*>              K2Node_MakeArray_Array;                            // 0x0790(0x0010)(ReferenceParm)
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x07A0(0x0060)()
	struct FKillInfo                              K2Node_MakeStruct_KillInfo;                        // 0x0800(0x03D8)()
	struct FKillGameplayMessage                   K2Node_MakeStruct_KillGameplayMessage;             // 0x0BD8(0x03D8)()
};
static_assert(alignof(BP_HouseEssential_Cube_C_CreateKillInfo) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_CreateKillInfo");
static_assert(sizeof(BP_HouseEssential_Cube_C_CreateKillInfo) == 0x000FB0, "Wrong size on BP_HouseEssential_Cube_C_CreateKillInfo");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, Killer) == 0x000000, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::Killer' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, Method) == 0x000060, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::Method' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, KillGameplayMessage) == 0x000348, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::KillGameplayMessage' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, HealAssisters) == 0x000720, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::HealAssisters' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, KillAssisters) == 0x000730, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::KillAssisters' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, CallFunc_GetHouseEssentialIconTexture_ReturnValue) == 0x000740, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::CallFunc_GetHouseEssentialIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, CallFunc_Add_Heal_Assisters_Modified) == 0x000768, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::CallFunc_Add_Heal_Assisters_Modified' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, CallFunc_Add_Kill_Assisters_Modified) == 0x000778, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::CallFunc_Add_Kill_Assisters_Modified' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, CallFunc_GetTeamID_ReturnValue) == 0x000788, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, K2Node_MakeArray_Array) == 0x000790, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, K2Node_MakeStruct_CombatParticipant) == 0x0007A0, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, K2Node_MakeStruct_KillInfo) == 0x000800, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::K2Node_MakeStruct_KillInfo' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_CreateKillInfo, K2Node_MakeStruct_KillGameplayMessage) == 0x000BD8, "Member 'BP_HouseEssential_Cube_C_CreateKillInfo::K2Node_MakeStruct_KillGameplayMessage' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.Destroyed Cosmetics State
// 0x0001 (0x0001 - 0x0000)
struct BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State final
{
public:
	bool                                          Dead_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State) == 0x000001, "Wrong alignment on BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State");
static_assert(sizeof(BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State) == 0x000001, "Wrong size on BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State");
static_assert(offsetof(BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State, Dead_0) == 0x000000, "Member 'BP_HouseEssential_Cube_C_Destroyed_Cosmetics_State::Dead_0' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.Die Now
// 0x0348 (0x0348 - 0x0000)
struct BP_HouseEssential_Cube_C_Die_Now final
{
public:
	struct FCombatParticipant                     KilledBy;                                          // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            KillMethod;                                        // 0x0060(0x02E8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_HouseEssential_Cube_C_Die_Now) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_Die_Now");
static_assert(sizeof(BP_HouseEssential_Cube_C_Die_Now) == 0x000348, "Wrong size on BP_HouseEssential_Cube_C_Die_Now");
static_assert(offsetof(BP_HouseEssential_Cube_C_Die_Now, KilledBy) == 0x000000, "Member 'BP_HouseEssential_Cube_C_Die_Now::KilledBy' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_Die_Now, KillMethod) == 0x000060, "Member 'BP_HouseEssential_Cube_C_Die_Now::KillMethod' has a wrong offset!");

// Function BP_HouseEssential_Cube.BP_HouseEssential_Cube_C.ExecuteUbergraph_BP_HouseEssential_Cube
// 0x15D8 (0x15D8 - 0x0000)
struct BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable;                              // 0x0018(0x0008)(NoDestructor)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveEndMessage                   Temp_struct_Variable_1;                            // 0x0040(0x0008)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor_5;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_4;                   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Focusing_Actor;                       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Interactable;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_5;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_4;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_3;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_3;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_2;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_2;                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_1;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_1;                   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x0140(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCombatParticipant                     K2Node_CustomEvent_KilledBy;                       // 0x02B8(0x0060)()
	struct FKillMethod                            K2Node_CustomEvent_KillMethod;                     // 0x0318(0x02E8)()
	struct FKillGameplayMessage                   CallFunc_CreateKillInfo_KillGameplayMessage;       // 0x0600(0x03D8)()
	float                                         K2Node_Event_Delta;                                // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x09E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x09E8(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x0A48(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x0D30(0x0018)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0D48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x3];                                      // 0x0D51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0D54(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5C[0x4];                                      // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0D60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0D68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0D70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGroundsKeeperAtPoint_bFoundTeam;       // 0x0D88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D89[0x7];                                      // 0x0D89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATeamVolume*>                    CallFunc_GetGroundsKeeperAtPoint_OverlappingTeamVolumes; // 0x0D90(0x0010)(ReferenceParm)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeperAtPoint_ReturnValue;      // 0x0DA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0DA8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHealthAttributeSet*                    K2Node_DynamicCast_AsHealth_Attribute_Set;         // 0x0DB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0DC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0DC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC2[0x6];                                      // 0x0DC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0DC8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0DD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD1[0x7];                                      // 0x0DD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0DD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0DE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxHealth;                            // 0x0DE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0DE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0DF0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0E00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E01[0x7];                                      // 0x0E01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0E08(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_1; // 0x0E10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0E19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1A[0x6];                                      // 0x0E1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKillGameplayMessage                   K2Node_CustomEvent_Message;                        // 0x0E28(0x03D8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x1200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HouseEssentialWasDamagedMessage     K2Node_MakeStruct_S_HouseEssentialWasDamagedMessage; // 0x1210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Dead;                           // 0x1220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1221[0x7];                                     // 0x1221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_2; // 0x1228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x1230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1231[0x7];                                     // 0x1231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x1238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x1250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x1258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x1268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnabled;                      // 0x1270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1271[0x7];                                     // 0x1271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraSettingsLocal*                     K2Node_DynamicCast_AsLyra_Settings_Local;          // 0x1278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x1280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1281[0x7];                                     // 0x1281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_PlayerState;                    // 0x1288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x1290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x1298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1299[0x3];                                     // 0x1299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x129C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12AC[0x4];                                     // 0x12AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASubObjective*                          K2Node_CustomEvent_NewParam;                       // 0x12B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x12B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x12B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BA[0x6];                                     // 0x12BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_Match*                   CallFunc_GetFirstPlayerStateJP_Match_ReturnValue;  // 0x12C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x12C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x12C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x12CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CB[0x5];                                     // 0x12CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHouseEssentialsManagerComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x12D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x12D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x12E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x12E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x12F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x12F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F5[0x3];                                     // 0x12F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x12F8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x13F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x13F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F9[0x7];                                     // 0x13F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x1400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x1408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x1410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x1418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x141C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141D[0x3];                                     // 0x141D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_2;                       // 0x1420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x1428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x1429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142A[0x2];                                     // 0x142A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_BlendTime;                      // 0x142C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x1430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x1438(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x1440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x1448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x1450(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x1548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent;                 // 0x1550(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x1558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x1559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x155A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x155B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x155C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155D[0x3];                                     // 0x155D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x1560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x1568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x1570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x1578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast;        // 0x157C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x1580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x1588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentHealth_ImplicitCast;     // 0x1590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateHealth_Health_ImplicitCast;         // 0x1598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_OldHealth_ImplicitCast;         // 0x15A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x15A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Value_ImplicitCast;     // 0x15B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x15B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x15C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Max_ImplicitCast;       // 0x15C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x15D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube) == 0x000008, "Wrong alignment on BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube");
static_assert(sizeof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube) == 0x0015D8, "Wrong size on BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, EntryPoint) == 0x000000, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_struct_Variable) == 0x000018, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CustomEvent_ProxyObject) == 0x000020, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CustomEvent_ActualChannel) == 0x000028, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_struct_Variable_1) == 0x000040, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_struct_Variable_2) == 0x000048, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_object_Variable) == 0x000050, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000058, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_GetPayload_ReturnValue) == 0x000060, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000078, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_MakeRotator_ReturnValue) == 0x000088, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A4, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_bool_IsClosed_Variable) == 0x0000B4, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, Temp_bool_Has_Been_Initd_Variable) == 0x0000B5, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_HasAuthority_ReturnValue) == 0x0000B6, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_Lerp_ReturnValue) == 0x0000B8, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_MakeVector_ReturnValue) == 0x0000C0, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D8, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_Event_InteractingActor_5) == 0x0000E0, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_Event_InteractingActor_5' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_Event_InteractingActor_4) == 0x0000E8, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_Event_InteractingActor_4' has a wrong offset!");
static_assert(offsetof(BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube, K2Node_Event_Focusing_Actor) == 0x0000F0, "Member 'BP_HouseEssential_Cube_C_ExecuteUbergraph_BP_HouseEssential_Cube::K2Node_Event_Focusing_Actor' has a wrong offset!");
