#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hedge_Branch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "E_ImpactEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hedge_Branch.BP_Hedge_Branch_C
// 0x0080 (0x0310 - 0x0290)
class ABP_Hedge_Branch_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SeeThrough03;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SeeThrough04;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SeeThrough02;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Hedge_FrontYard02;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              AbilitySystemComponentIW;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_Particle_System;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Hedge_FrontYard04;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_Hedge_FrontYard03;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  LastCauser;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CuttingParticles;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScoreToAdd;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DestroyedSound;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CauserPlayerState;                                 // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Hedge_Branch(int32 EntryPoint);
	void GetDurabilityCostWhenHit(double* Amount);
	void GetMaterialType(E_MaterialTypes* MaterialType);
	void GetParticleLocationAndRotation(struct FVector* Location, struct FRotator* Rotation);
	void Hit_Cosmetics(class APawn* Causer);
	void HitInterface(const struct FVector& Direction);
	void ImpactCosmetics(class APawn* ImpactCauser, const struct FVector& Location, const struct FVector& HitImpulse, E_ImpactEffect ImpactEffect, class FName BoneName, bool* ChangedAttributes);
	void MeleeHit(const class AActor*& AttackingActor);
	void OnDamaged(float Delta, class AActor* Causer, const struct FCombatParticipant& CombatParticipant, const struct FKillMethod& KillMethod, const struct FVector_NetQuantize& Location);
	void OnHealthChanged(float Health, float MaxHealth);
	void OnLostAllHealth();
	void RandomizeTransforms();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void RemovedCosmetics();
	void Score(bool GainScore);
	void SetSeethroughParams();
	void ShowScoreNotification(bool AddScore);
	void TakeDamage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Hedge_Branch_C">();
	}
	static class ABP_Hedge_Branch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Hedge_Branch_C>();
	}
};
static_assert(alignof(ABP_Hedge_Branch_C) == 0x000008, "Wrong alignment on ABP_Hedge_Branch_C");
static_assert(sizeof(ABP_Hedge_Branch_C) == 0x000310, "Wrong size on ABP_Hedge_Branch_C");
static_assert(offsetof(ABP_Hedge_Branch_C, UberGraphFrame) == 0x000290, "Member 'ABP_Hedge_Branch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, SeeThrough03) == 0x000298, "Member 'ABP_Hedge_Branch_C::SeeThrough03' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, SeeThrough04) == 0x0002A0, "Member 'ABP_Hedge_Branch_C::SeeThrough04' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, SeeThrough02) == 0x0002A8, "Member 'ABP_Hedge_Branch_C::SeeThrough02' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Audio) == 0x0002B0, "Member 'ABP_Hedge_Branch_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Box) == 0x0002B8, "Member 'ABP_Hedge_Branch_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Sm_Hedge_FrontYard02) == 0x0002C0, "Member 'ABP_Hedge_Branch_C::Sm_Hedge_FrontYard02' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, AbilitySystemComponentIW) == 0x0002C8, "Member 'ABP_Hedge_Branch_C::AbilitySystemComponentIW' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Niagara_Particle_System) == 0x0002D0, "Member 'ABP_Hedge_Branch_C::Niagara_Particle_System' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Sm_Hedge_FrontYard04) == 0x0002D8, "Member 'ABP_Hedge_Branch_C::Sm_Hedge_FrontYard04' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, Sm_Hedge_FrontYard03) == 0x0002E0, "Member 'ABP_Hedge_Branch_C::Sm_Hedge_FrontYard03' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, LastCauser) == 0x0002E8, "Member 'ABP_Hedge_Branch_C::LastCauser' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, CuttingParticles) == 0x0002F0, "Member 'ABP_Hedge_Branch_C::CuttingParticles' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, ScoreToAdd) == 0x0002F8, "Member 'ABP_Hedge_Branch_C::ScoreToAdd' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, DestroyedSound) == 0x000300, "Member 'ABP_Hedge_Branch_C::DestroyedSound' has a wrong offset!");
static_assert(offsetof(ABP_Hedge_Branch_C, CauserPlayerState) == 0x000308, "Member 'ABP_Hedge_Branch_C::CauserPlayerState' has a wrong offset!");

}

