#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IncomeNotification

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_IncomeNotification.BP_IncomeNotification_C.Activate
// 0x0004 (0x0004 - 0x0000)
struct BP_IncomeNotification_C_Activate final
{
public:
	float                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotification_C_Activate) == 0x000004, "Wrong alignment on BP_IncomeNotification_C_Activate");
static_assert(sizeof(BP_IncomeNotification_C_Activate) == 0x000004, "Wrong size on BP_IncomeNotification_C_Activate");
static_assert(offsetof(BP_IncomeNotification_C_Activate, Score) == 0x000000, "Member 'BP_IncomeNotification_C_Activate::Score' has a wrong offset!");

// Function BP_IncomeNotification.BP_IncomeNotification_C.ExecuteUbergraph_BP_IncomeNotification
// 0x0160 (0x0160 - 0x0000)
struct BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Score;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Score;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0030(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_IncomeChangeNotification_C*         K2Node_DynamicCast_AsWI_Income_Change_Notification; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification) == 0x000008, "Wrong alignment on BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification");
static_assert(sizeof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification) == 0x000160, "Wrong size on BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, EntryPoint) == 0x000000, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_Event_Score) == 0x000008, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_Event_Score' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_CustomEvent_Location) == 0x000010, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_CustomEvent_Score) == 0x000028, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_CustomEvent_Score' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000030, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000128, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, Temp_bool_IsClosed_Variable) == 0x000129, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000130, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_DynamicCast_AsWI_Income_Change_Notification) == 0x000138, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_DynamicCast_AsWI_Income_Change_Notification' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000144, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'BP_IncomeNotification_C_ExecuteUbergraph_BP_IncomeNotification::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_IncomeNotification.BP_IncomeNotification_C.Play Cosmetics
// 0x0020 (0x0020 - 0x0000)
struct BP_IncomeNotification_C_Play_Cosmetics final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotification_C_Play_Cosmetics) == 0x000008, "Wrong alignment on BP_IncomeNotification_C_Play_Cosmetics");
static_assert(sizeof(BP_IncomeNotification_C_Play_Cosmetics) == 0x000020, "Wrong size on BP_IncomeNotification_C_Play_Cosmetics");
static_assert(offsetof(BP_IncomeNotification_C_Play_Cosmetics, Location) == 0x000000, "Member 'BP_IncomeNotification_C_Play_Cosmetics::Location' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_Play_Cosmetics, Score) == 0x000018, "Member 'BP_IncomeNotification_C_Play_Cosmetics::Score' has a wrong offset!");

// Function BP_IncomeNotification.BP_IncomeNotification_C.PlaySoundBasedOnAmount
// 0x0028 (0x0028 - 0x0000)
struct BP_IncomeNotification_C_PlaySoundBasedOnAmount final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IncomeNotification_C_PlaySoundBasedOnAmount) == 0x000008, "Wrong alignment on BP_IncomeNotification_C_PlaySoundBasedOnAmount");
static_assert(sizeof(BP_IncomeNotification_C_PlaySoundBasedOnAmount) == 0x000028, "Wrong size on BP_IncomeNotification_C_PlaySoundBasedOnAmount");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, Amount) == 0x000000, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::Amount' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, Temp_bool_Variable) == 0x000008, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000009, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, Temp_object_Variable) == 0x000010, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, Temp_object_Variable_1) == 0x000018, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IncomeNotification_C_PlaySoundBasedOnAmount, K2Node_Select_Default) == 0x000020, "Member 'BP_IncomeNotification_C_PlaySoundBasedOnAmount::K2Node_Select_Default' has a wrong offset!");

}

