#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ListView_ChatMessage

#include "Basic.hpp"

#include "IWChat_structs.hpp"


namespace SDK::Params
{

// Function BP_ListView_ChatMessage.BP_ListView_ChatMessage_C.ExecuteUbergraph_BP_ListView_ChatMessage
// 0x0040 (0x0040 - 0x0000)
struct BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMessage                           K2Node_CustomEvent_DataForChatMessage;             // 0x0008(0x0038)()
};
static_assert(alignof(BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage) == 0x000008, "Wrong alignment on BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage");
static_assert(sizeof(BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage) == 0x000040, "Wrong size on BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage");
static_assert(offsetof(BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage, EntryPoint) == 0x000000, "Member 'BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage, K2Node_CustomEvent_DataForChatMessage) == 0x000008, "Member 'BP_ListView_ChatMessage_C_ExecuteUbergraph_BP_ListView_ChatMessage::K2Node_CustomEvent_DataForChatMessage' has a wrong offset!");

// Function BP_ListView_ChatMessage.BP_ListView_ChatMessage_C.Init
// 0x0038 (0x0038 - 0x0000)
struct BP_ListView_ChatMessage_C_Init final
{
public:
	struct FChatMessage                           DataForChatMessage_0;                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ListView_ChatMessage_C_Init) == 0x000008, "Wrong alignment on BP_ListView_ChatMessage_C_Init");
static_assert(sizeof(BP_ListView_ChatMessage_C_Init) == 0x000038, "Wrong size on BP_ListView_ChatMessage_C_Init");
static_assert(offsetof(BP_ListView_ChatMessage_C_Init, DataForChatMessage_0) == 0x000000, "Member 'BP_ListView_ChatMessage_C_Init::DataForChatMessage_0' has a wrong offset!");

}

