#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lamp

#include "Basic.hpp"

#include "E_LightTypes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Lamp.BP_Lamp_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Lamp_C_UserConstructionScript final
{
public:
	class ULocalLightComponent*                   Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LightTypes                                  Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalLightComponent*                   Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULocalLightComponent*                   Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LightTypes                                  Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalLightComponent*                   K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULocalLightComponent*                   K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColor_Desaturated_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_2; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lamp_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Lamp_C_UserConstructionScript");
static_assert(sizeof(BP_Lamp_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_Lamp_C_UserConstructionScript");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, Temp_object_Variable) == 0x000000, "Member 'BP_Lamp_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, Temp_byte_Variable) == 0x000009, "Member 'BP_Lamp_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_Lamp_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'BP_Lamp_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000028, "Member 'BP_Lamp_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000038, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, K2Node_Select_Default) == 0x000040, "Member 'BP_Lamp_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000048, "Member 'BP_Lamp_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000050, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_LinearColor_Desaturated_ReturnValue) == 0x000058, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_LinearColor_Desaturated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000068, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000078, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000080, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast) == 0x000088, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000090, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x000098, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x0000A0, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Lamp_C_UserConstructionScript, CallFunc_SetIntensity_NewIntensity_ImplicitCast_2) == 0x0000A8, "Member 'BP_Lamp_C_UserConstructionScript::CallFunc_SetIntensity_NewIntensity_ImplicitCast_2' has a wrong offset!");

}

