#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIntroCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchIntroCamera.BP_MatchIntroCamera_C
// 0x0048 (0x02D8 - 0x0290)
class ABP_MatchIntroCamera_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        CameraRotator;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotation_BA4720B54AE6F92E9DB3F69AB7925437; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_BA4720B54AE6F92E9DB3F69AB7925437; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CameraEventEnded;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AStaticMeshActor*                       StaticMeshActorInCenter;                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void CameraEventEnded__DelegateSignature();
	void ExecuteUbergraph_BP_MatchIntroCamera(int32 EntryPoint);
	void IntroFinished();
	void SwitchToTeamCamera(float BlendTime, double Duration);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchIntroCamera_C">();
	}
	static class ABP_MatchIntroCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MatchIntroCamera_C>();
	}
};
static_assert(alignof(ABP_MatchIntroCamera_C) == 0x000008, "Wrong alignment on ABP_MatchIntroCamera_C");
static_assert(sizeof(ABP_MatchIntroCamera_C) == 0x0002D8, "Wrong size on ABP_MatchIntroCamera_C");
static_assert(offsetof(ABP_MatchIntroCamera_C, UberGraphFrame) == 0x000290, "Member 'ABP_MatchIntroCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, CameraRotator) == 0x000298, "Member 'ABP_MatchIntroCamera_C::CameraRotator' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, Camera) == 0x0002A0, "Member 'ABP_MatchIntroCamera_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_MatchIntroCamera_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, Timeline_Rotation_BA4720B54AE6F92E9DB3F69AB7925437) == 0x0002B0, "Member 'ABP_MatchIntroCamera_C::Timeline_Rotation_BA4720B54AE6F92E9DB3F69AB7925437' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, Timeline__Direction_BA4720B54AE6F92E9DB3F69AB7925437) == 0x0002B4, "Member 'ABP_MatchIntroCamera_C::Timeline__Direction_BA4720B54AE6F92E9DB3F69AB7925437' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, Timeline) == 0x0002B8, "Member 'ABP_MatchIntroCamera_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, CameraEventEnded) == 0x0002C0, "Member 'ABP_MatchIntroCamera_C::CameraEventEnded' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroCamera_C, StaticMeshActorInCenter) == 0x0002D0, "Member 'ABP_MatchIntroCamera_C::StaticMeshActorInCenter' has a wrong offset!");

}

