#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MessScoreZoneComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.ExecuteUbergraph_BP_MessScoreZoneComponent
// 0x02E0 (0x02E0 - 0x0000)
struct BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0048(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_MessItem_1;                     // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_MessItem;                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent) == 0x000010, "Wrong alignment on BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent");
static_assert(sizeof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent) == 0x0002E0, "Wrong size on BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, EntryPoint) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OverlappedComponent_1) == 0x000028, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherActor_1) == 0x000030, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherComp_1) == 0x000038, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000040, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_bFromSweep) == 0x000044, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_SweepResult) == 0x000048, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_MessItem_1) == 0x000140, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_MessItem_1' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_MessItem) == 0x000148, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_MessItem' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_GetRelativeTransform_ReturnValue) == 0x000150, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_GetOwner_ReturnValue) == 0x0001B0, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_BreakTransform_Location) == 0x0001B8, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_BreakTransform_Rotation) == 0x0001D0, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_BreakTransform_Scale) == 0x0001E8, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x000200, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OverlappedComponent) == 0x000218, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherActor) == 0x000220, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherComp) == 0x000228, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, K2Node_CustomEvent_OtherBodyIndex) == 0x000230, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000238, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000250, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_MakeTransform_ReturnValue) == 0x000270, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_AddComponentByClass_ReturnValue) == 0x0002D0, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent, CallFunc_SetStaticMesh_ReturnValue) == 0x0002D8, "Member 'BP_MessScoreZoneComponent_C_ExecuteUbergraph_BP_MessScoreZoneComponent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.HandleIncomingItem
// 0x0048 (0x0048 - 0x0000)
struct BP_MessScoreZoneComponent_C_HandleIncomingItem final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MessItem_C*                         K2Node_DynamicCast_AsBP_Mess_Item;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceptacleSetComparison_Match;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_HandleIncomingItem) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_HandleIncomingItem");
static_assert(sizeof(BP_MessScoreZoneComponent_C_HandleIncomingItem) == 0x000048, "Wrong size on BP_MessScoreZoneComponent_C_HandleIncomingItem");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, Object) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::Object' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, ReturnValue) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, K2Node_DynamicCast_AsBP_Mess_Item) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::K2Node_DynamicCast_AsBP_Mess_Item' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_IsBeingHeld_ReturnValue) == 0x000019, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_ReceptacleSetComparison_Match) == 0x000040, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_ReceptacleSetComparison_Match' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItem, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.HandleIncomingItemNoHeldCheck
// 0x0048 (0x0048 - 0x0000)
struct BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MessItem_C*                         K2Node_DynamicCast_AsBP_Mess_Item;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceptacleSetComparison_Match;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck");
static_assert(sizeof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck) == 0x000048, "Wrong size on BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, Object) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::Object' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, ReturnValue) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, K2Node_DynamicCast_AsBP_Mess_Item) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::K2Node_DynamicCast_AsBP_Mess_Item' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck, CallFunc_ReceptacleSetComparison_Match) == 0x000040, "Member 'BP_MessScoreZoneComponent_C_HandleIncomingItemNoHeldCheck::CallFunc_ReceptacleSetComparison_Match' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.HandleOutgoingItem
// 0x0048 (0x0048 - 0x0000)
struct BP_MessScoreZoneComponent_C_HandleOutgoingItem final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MessItem_C*                         K2Node_DynamicCast_AsBP_Mess_Item;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceptacleSetComparison_Match;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_HandleOutgoingItem) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_HandleOutgoingItem");
static_assert(sizeof(BP_MessScoreZoneComponent_C_HandleOutgoingItem) == 0x000048, "Wrong size on BP_MessScoreZoneComponent_C_HandleOutgoingItem");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, Object) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::Object' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, ReturnValue) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, K2Node_DynamicCast_AsBP_Mess_Item) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::K2Node_DynamicCast_AsBP_Mess_Item' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, CallFunc_ReceptacleSetComparison_Match) == 0x000040, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::CallFunc_ReceptacleSetComparison_Match' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItem, CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue) == 0x000041, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItem::CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.HandleOutgoingItemHeldCheck
// 0x0048 (0x0048 - 0x0000)
struct BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MessItem_C*                         K2Node_DynamicCast_AsBP_Mess_Item;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceptacleSetComparison_Match;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck");
static_assert(sizeof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck) == 0x000048, "Wrong size on BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, Object) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::Object' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, Return) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::Return' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, K2Node_DynamicCast_AsBP_Mess_Item) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::K2Node_DynamicCast_AsBP_Mess_Item' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_IsBeingHeld_ReturnValue) == 0x000019, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_ReceptacleSetComparison_Match) == 0x000040, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_ReceptacleSetComparison_Match' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue) == 0x000041, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'BP_MessScoreZoneComponent_C_HandleOutgoingItemHeldCheck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.On Overlap Begin
// 0x0118 (0x0118 - 0x0000)
struct BP_MessScoreZoneComponent_C_On_Overlap_Begin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_On_Overlap_Begin) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_On_Overlap_Begin");
static_assert(sizeof(BP_MessScoreZoneComponent_C_On_Overlap_Begin) == 0x000118, "Wrong size on BP_MessScoreZoneComponent_C_On_Overlap_Begin");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, OverlappedComponent) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, OtherActor) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, OtherComp) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, OtherBodyIndex) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, bFromSweep) == 0x00001C, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_On_Overlap_Begin, SweepResult) == 0x000020, "Member 'BP_MessScoreZoneComponent_C_On_Overlap_Begin::SweepResult' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct BP_MessScoreZoneComponent_C_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_OnOverlapEnd) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_OnOverlapEnd");
static_assert(sizeof(BP_MessScoreZoneComponent_C_OnOverlapEnd) == 0x000020, "Wrong size on BP_MessScoreZoneComponent_C_OnOverlapEnd");
static_assert(offsetof(BP_MessScoreZoneComponent_C_OnOverlapEnd, OverlappedComponent) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_OnOverlapEnd::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_OnOverlapEnd, OtherActor) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_OnOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_OnOverlapEnd, OtherComp) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_OnOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_OnOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'BP_MessScoreZoneComponent_C_OnOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.RetriggerOverlapBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_MessScoreZoneComponent_C_RetriggerOverlapBegin final
{
public:
	class AActor*                                 MessItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_RetriggerOverlapBegin) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_RetriggerOverlapBegin");
static_assert(sizeof(BP_MessScoreZoneComponent_C_RetriggerOverlapBegin) == 0x000008, "Wrong size on BP_MessScoreZoneComponent_C_RetriggerOverlapBegin");
static_assert(offsetof(BP_MessScoreZoneComponent_C_RetriggerOverlapBegin, MessItem) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_RetriggerOverlapBegin::MessItem' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.RetriggerOverlapEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_MessScoreZoneComponent_C_RetriggerOverlapEnd final
{
public:
	class AActor*                                 MessItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_RetriggerOverlapEnd) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_RetriggerOverlapEnd");
static_assert(sizeof(BP_MessScoreZoneComponent_C_RetriggerOverlapEnd) == 0x000008, "Wrong size on BP_MessScoreZoneComponent_C_RetriggerOverlapEnd");
static_assert(offsetof(BP_MessScoreZoneComponent_C_RetriggerOverlapEnd, MessItem) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_RetriggerOverlapEnd::MessItem' has a wrong offset!");

// Function BP_MessScoreZoneComponent.BP_MessScoreZoneComponent_C.SetVisible
// 0x0020 (0x0020 - 0x0000)
struct BP_MessScoreZoneComponent_C_SetVisible final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ReceptacleFurnitureBase_C*          K2Node_DynamicCast_AsBP_Receptacle_Furniture_Base; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MessScoreZoneComponent_C_SetVisible) == 0x000008, "Wrong alignment on BP_MessScoreZoneComponent_C_SetVisible");
static_assert(sizeof(BP_MessScoreZoneComponent_C_SetVisible) == 0x000020, "Wrong size on BP_MessScoreZoneComponent_C_SetVisible");
static_assert(offsetof(BP_MessScoreZoneComponent_C_SetVisible, bNewVisibility) == 0x000000, "Member 'BP_MessScoreZoneComponent_C_SetVisible::bNewVisibility' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_SetVisible, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_MessScoreZoneComponent_C_SetVisible::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MessScoreZoneComponent_C_SetVisible, K2Node_DynamicCast_AsBP_Receptacle_Furniture_Base) == 0x000010, "Member 'BP_MessScoreZoneComponent_C_SetVisible::K2Node_DynamicCast_AsBP_Receptacle_Furniture_Base' has a wrong offset!");
