#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuJPUIController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MainMenuJPUIController.BP_MainMenuJPUIController_C.ExecuteUbergraph_BP_MainMenuJPUIController
// 0x0098 (0x0098 - 0x0000)
struct BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message_2;                      // 0x0008(0x0010)(ConstParm)
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message_1;                      // 0x0028(0x0010)(ConstParm)
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0048(0x0010)(ConstParm)
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0068(0x0010)()
	class UAsyncAction_StartMainMenuInitialization* CallFunc_StartMainMenuInitialization_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController) == 0x000008, "Wrong alignment on BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController");
static_assert(sizeof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController) == 0x000098, "Wrong size on BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, EntryPoint) == 0x000000, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CustomEvent_Message_2) == 0x000008, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CustomEvent_Message_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CustomEvent_Message_1) == 0x000028, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CustomEvent_Message) == 0x000048, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, Temp_text_Variable) == 0x000068, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, CallFunc_StartMainMenuInitialization_ReturnValue) == 0x000078, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::CallFunc_StartMainMenuInitialization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'BP_MainMenuJPUIController_C_ExecuteUbergraph_BP_MainMenuJPUIController::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_MainMenuJPUIController.BP_MainMenuJPUIController_C.OnFailed_8301015D40E48CD2C85272BB254C15BE
// 0x0010 (0x0010 - 0x0000)
struct BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE) == 0x000008, "Wrong alignment on BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE");
static_assert(sizeof(BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE) == 0x000010, "Wrong size on BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE");
static_assert(offsetof(BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE, Message) == 0x000000, "Member 'BP_MainMenuJPUIController_C_OnFailed_8301015D40E48CD2C85272BB254C15BE::Message' has a wrong offset!");

// Function BP_MainMenuJPUIController.BP_MainMenuJPUIController_C.OnStepUpdated_8301015D40E48CD2C85272BB254C15BE
// 0x0010 (0x0010 - 0x0000)
struct BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE) == 0x000008, "Wrong alignment on BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE");
static_assert(sizeof(BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE) == 0x000010, "Wrong size on BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE");
static_assert(offsetof(BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE, Message) == 0x000000, "Member 'BP_MainMenuJPUIController_C_OnStepUpdated_8301015D40E48CD2C85272BB254C15BE::Message' has a wrong offset!");

// Function BP_MainMenuJPUIController.BP_MainMenuJPUIController_C.OnSucceeded_8301015D40E48CD2C85272BB254C15BE
// 0x0010 (0x0010 - 0x0000)
struct BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE) == 0x000008, "Wrong alignment on BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE");
static_assert(sizeof(BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE) == 0x000010, "Wrong size on BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE");
static_assert(offsetof(BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE, Message) == 0x000000, "Member 'BP_MainMenuJPUIController_C_OnSucceeded_8301015D40E48CD2C85272BB254C15BE::Message' has a wrong offset!");

}

