#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuAudioManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MainMenuAudioManager.BP_MainMenuAudioManager_C.PlayAreaEnterSound
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuAudioManager_C_PlayAreaEnterSound final
{
public:
	class USoundBase*                             AmbienceSound;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuAudioManager_C_PlayAreaEnterSound) == 0x000008, "Wrong alignment on BP_MainMenuAudioManager_C_PlayAreaEnterSound");
static_assert(sizeof(BP_MainMenuAudioManager_C_PlayAreaEnterSound) == 0x000018, "Wrong size on BP_MainMenuAudioManager_C_PlayAreaEnterSound");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaEnterSound, AmbienceSound) == 0x000000, "Member 'BP_MainMenuAudioManager_C_PlayAreaEnterSound::AmbienceSound' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaEnterSound, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_MainMenuAudioManager_C_PlayAreaEnterSound::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaEnterSound, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MainMenuAudioManager_C_PlayAreaEnterSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MainMenuAudioManager.BP_MainMenuAudioManager_C.PlayAreaAmbienceSound
// 0x0028 (0x0028 - 0x0000)
struct BP_MainMenuAudioManager_C_PlayAreaAmbienceSound final
{
public:
	class USoundBase*                             AmbienceSound;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FadeIn_StartTime_ImplicitCast;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound) == 0x000008, "Wrong alignment on BP_MainMenuAudioManager_C_PlayAreaAmbienceSound");
static_assert(sizeof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound) == 0x000028, "Wrong size on BP_MainMenuAudioManager_C_PlayAreaAmbienceSound");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound, AmbienceSound) == 0x000000, "Member 'BP_MainMenuAudioManager_C_PlayAreaAmbienceSound::AmbienceSound' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_MainMenuAudioManager_C_PlayAreaAmbienceSound::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_MainMenuAudioManager_C_PlayAreaAmbienceSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'BP_MainMenuAudioManager_C_PlayAreaAmbienceSound::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuAudioManager_C_PlayAreaAmbienceSound, CallFunc_FadeIn_StartTime_ImplicitCast) == 0x000020, "Member 'BP_MainMenuAudioManager_C_PlayAreaAmbienceSound::CallFunc_FadeIn_StartTime_ImplicitCast' has a wrong offset!");

}

