#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mole_Explosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mole_Explosion.BP_Mole_Explosion_C.ExecuteUbergraph_BP_Mole_Explosion
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         CallFunc_SetRadialFalloff_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CallFunc_SetCullingField_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion) == 0x000008, "Wrong alignment on BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion");
static_assert(sizeof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion) == 0x0000A8, "Wrong size on BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, EntryPoint) == 0x000000, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000038, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_SetRadialVector_ReturnValue) == 0x000050, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_SetRadialFalloff_ReturnValue) == 0x000058, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_SetRadialFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_SetCullingField_ReturnValue) == 0x000060, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_SetCullingField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_GetUpVector_ReturnValue) == 0x000068, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_SetUniformVector_ReturnValue) == 0x000080, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_SetUniformVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000088, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000A0, "Member 'BP_Mole_Explosion_C_ExecuteUbergraph_BP_Mole_Explosion::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

