#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuTabCameraController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Lighting_Presets_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainMenuTabCameraController.BP_MainMenuTabCameraController_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_MainMenuTabCameraController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabNameID;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Lighting_Presets                            LevelLightingPreset;                               // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CurrentAreaAmbienceSound;                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentAreaEnterSound;                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       Camera;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MainMenuTabCameraController(int32 EntryPoint);
	void ActivateCamera(double BlendTime, double BlendExp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainMenuTabCameraController_C">();
	}
	static class ABP_MainMenuTabCameraController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MainMenuTabCameraController_C>();
	}
};
static_assert(alignof(ABP_MainMenuTabCameraController_C) == 0x000008, "Wrong alignment on ABP_MainMenuTabCameraController_C");
static_assert(sizeof(ABP_MainMenuTabCameraController_C) == 0x0002C8, "Wrong size on ABP_MainMenuTabCameraController_C");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, UberGraphFrame) == 0x000290, "Member 'ABP_MainMenuTabCameraController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_MainMenuTabCameraController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, TabNameID) == 0x0002A0, "Member 'ABP_MainMenuTabCameraController_C::TabNameID' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, LevelLightingPreset) == 0x0002A8, "Member 'ABP_MainMenuTabCameraController_C::LevelLightingPreset' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, CurrentAreaAmbienceSound) == 0x0002B0, "Member 'ABP_MainMenuTabCameraController_C::CurrentAreaAmbienceSound' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, CurrentAreaEnterSound) == 0x0002B8, "Member 'ABP_MainMenuTabCameraController_C::CurrentAreaEnterSound' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuTabCameraController_C, Camera) == 0x0002C0, "Member 'ABP_MainMenuTabCameraController_C::Camera' has a wrong offset!");

}

