#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MannedCannonProjectile

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MannedCannonProjectile.BP_MannedCannonProjectile_C.CreateCosmeticProjectileCueParameters
// 0x0278 (0x0278 - 0x0000)
struct BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00D8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x00E0(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0100(0x0020)()
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0148(0x0020)()
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0198(0x00D8)(ContainsInstancedReference)
	float                                         CallFunc_MakeGameplayCueParameters_NormalizedMagnitude_ImplicitCast; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters) == 0x000008, "Wrong alignment on BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters");
static_assert(sizeof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters) == 0x000278, "Wrong size on BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, ReturnValue) == 0x000000, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, Temp_bool_Variable) == 0x0000D8, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, Temp_struct_Variable) == 0x0000E0, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, Temp_struct_Variable_1) == 0x000100, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_GetInstigator_ReturnValue) == 0x000120, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_GetInstigator_ReturnValue_1) == 0x000128, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_HasAuthority_ReturnValue) == 0x000130, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000138, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, K2Node_Select_Default) == 0x000148, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_RandomUnitVector_ReturnValue) == 0x000168, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000180, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000198, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters, CallFunc_MakeGameplayCueParameters_NormalizedMagnitude_ImplicitCast) == 0x000270, "Member 'BP_MannedCannonProjectile_C_CreateCosmeticProjectileCueParameters::CallFunc_MakeGameplayCueParameters_NormalizedMagnitude_ImplicitCast' has a wrong offset!");

// Function BP_MannedCannonProjectile.BP_MannedCannonProjectile_C.ExecuteUbergraph_BP_MannedCannonProjectile
// 0x00E0 (0x00E0 - 0x0000)
struct BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue_1;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile) == 0x000008, "Wrong alignment on BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile");
static_assert(sizeof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile) == 0x0000E0, "Wrong size on BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, EntryPoint) == 0x000000, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_GetActorUpVector_ReturnValue) == 0x000038, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000050, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000080, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000088, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000A0, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000B8, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0000D0, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_IsActive_ReturnValue) == 0x0000D8, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile, CallFunc_IsActive_ReturnValue_1) == 0x0000D9, "Member 'BP_MannedCannonProjectile_C_ExecuteUbergraph_BP_MannedCannonProjectile::CallFunc_IsActive_ReturnValue_1' has a wrong offset!");

// Function BP_MannedCannonProjectile.BP_MannedCannonProjectile_C.Fire Projectile
// 0x0070 (0x0070 - 0x0000)
struct BP_MannedCannonProjectile_C_Fire_Projectile final
{
public:
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObjectPoolingSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APooledActor*                           CallFunc_GetInactiveObjectOfClass_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileBase_C*                   K2Node_DynamicCast_AsBP_Projectile_Base;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MannedCannonProjectile_C_Fire_Projectile) == 0x000008, "Wrong alignment on BP_MannedCannonProjectile_C_Fire_Projectile");
static_assert(sizeof(BP_MannedCannonProjectile_C_Fire_Projectile) == 0x000070, "Wrong size on BP_MannedCannonProjectile_C_Fire_Projectile");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_RandomUnitVector_ReturnValue) == 0x000000, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000018, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_GetInstigator_ReturnValue) == 0x000048, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, CallFunc_GetInactiveObjectOfClass_ReturnValue) == 0x000058, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::CallFunc_GetInactiveObjectOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, K2Node_DynamicCast_AsBP_Projectile_Base) == 0x000060, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::K2Node_DynamicCast_AsBP_Projectile_Base' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_Fire_Projectile, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_MannedCannonProjectile_C_Fire_Projectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MannedCannonProjectile.BP_MannedCannonProjectile_C.SpawnCosmeticProjectile
// 0x00F0 (0x00F0 - 0x0000)
struct BP_MannedCannonProjectile_C_SpawnCosmeticProjectile final
{
public:
	struct FGameplayCueParameters                 CallFunc_CreateCosmeticProjectileCueParameters_ReturnValue; // 0x0000(0x00D8)(ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentIW*              K2Node_DynamicCast_AsAbility_System_Component_IW;  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile) == 0x000008, "Wrong alignment on BP_MannedCannonProjectile_C_SpawnCosmeticProjectile");
static_assert(sizeof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile) == 0x0000F0, "Wrong size on BP_MannedCannonProjectile_C_SpawnCosmeticProjectile");
static_assert(offsetof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile, CallFunc_CreateCosmeticProjectileCueParameters_ReturnValue) == 0x000000, "Member 'BP_MannedCannonProjectile_C_SpawnCosmeticProjectile::CallFunc_CreateCosmeticProjectileCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000D8, "Member 'BP_MannedCannonProjectile_C_SpawnCosmeticProjectile::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile, K2Node_DynamicCast_AsAbility_System_Component_IW) == 0x0000E0, "Member 'BP_MannedCannonProjectile_C_SpawnCosmeticProjectile::K2Node_DynamicCast_AsAbility_System_Component_IW' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_MannedCannonProjectile_C_SpawnCosmeticProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_SpawnCosmeticProjectile, CallFunc_HasAuthority_ReturnValue) == 0x0000E9, "Member 'BP_MannedCannonProjectile_C_SpawnCosmeticProjectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_MannedCannonProjectile.BP_MannedCannonProjectile_C.HandleBounce
// 0x0238 (0x0238 - 0x0000)
struct BP_MannedCannonProjectile_C_HandleBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact_Velocity;                                   // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0140(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MannedCannonProjectile_C_HandleBounce) == 0x000008, "Wrong alignment on BP_MannedCannonProjectile_C_HandleBounce");
static_assert(sizeof(BP_MannedCannonProjectile_C_HandleBounce) == 0x000238, "Wrong size on BP_MannedCannonProjectile_C_HandleBounce");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, Hit) == 0x000000, "Member 'BP_MannedCannonProjectile_C_HandleBounce::Hit' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, Impact_Velocity) == 0x0000F8, "Member 'BP_MannedCannonProjectile_C_HandleBounce::Impact_Velocity' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'BP_MannedCannonProjectile_C_HandleBounce::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000128, "Member 'BP_MannedCannonProjectile_C_HandleBounce::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, Temp_int_Variable) == 0x000130, "Member 'BP_MannedCannonProjectile_C_HandleBounce::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000134, "Member 'BP_MannedCannonProjectile_C_HandleBounce::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'BP_MannedCannonProjectile_C_HandleBounce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannedCannonProjectile_C_HandleBounce, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000140, "Member 'BP_MannedCannonProjectile_C_HandleBounce::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

