#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PickupBase.BP_PickupBase_C.Add Ammo
// 0x0014 (0x0014 - 0x0000)
struct BP_PickupBase_C_Add_Ammo final
{
public:
	int32                                         AmmoCount;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTagStack_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_Add_Ammo) == 0x000004, "Wrong alignment on BP_PickupBase_C_Add_Ammo");
static_assert(sizeof(BP_PickupBase_C_Add_Ammo) == 0x000014, "Wrong size on BP_PickupBase_C_Add_Ammo");
static_assert(offsetof(BP_PickupBase_C_Add_Ammo, AmmoCount) == 0x000000, "Member 'BP_PickupBase_C_Add_Ammo::AmmoCount' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_Add_Ammo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_PickupBase_C_Add_Ammo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_Add_Ammo, CallFunc_GetTagStackCount_ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_Add_Ammo::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_Add_Ammo, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_PickupBase_C_Add_Ammo::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_Add_Ammo, CallFunc_ContainsTagStack_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_Add_Ammo::CallFunc_ContainsTagStack_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.AddNewItem
// 0x0040 (0x0040 - 0x0000)
struct BP_PickupBase_C_AddNewItem final
{
public:
	class UInventoryComponent*                    Inventory_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_AddItemDefinition_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_AddNewItem) == 0x000008, "Wrong alignment on BP_PickupBase_C_AddNewItem");
static_assert(sizeof(BP_PickupBase_C_AddNewItem) == 0x000040, "Wrong size on BP_PickupBase_C_AddNewItem");
static_assert(offsetof(BP_PickupBase_C_AddNewItem, Inventory_0) == 0x000000, "Member 'BP_PickupBase_C_AddNewItem::Inventory_0' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AddNewItem, ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_AddNewItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AddNewItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_AddNewItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AddNewItem, CallFunc_AddItemDefinition_ReturnValue) == 0x000038, "Member 'BP_PickupBase_C_AddNewItem::CallFunc_AddItemDefinition_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.AmmoInPickup
// 0x000C (0x000C - 0x0000)
struct BP_PickupBase_C_AmmoInPickup final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTagStack_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_AmmoInPickup) == 0x000004, "Wrong alignment on BP_PickupBase_C_AmmoInPickup");
static_assert(sizeof(BP_PickupBase_C_AmmoInPickup) == 0x00000C, "Wrong size on BP_PickupBase_C_AmmoInPickup");
static_assert(offsetof(BP_PickupBase_C_AmmoInPickup, ReturnValue) == 0x000000, "Member 'BP_PickupBase_C_AmmoInPickup::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AmmoInPickup, CallFunc_GetTagStackCount_ReturnValue) == 0x000004, "Member 'BP_PickupBase_C_AmmoInPickup::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AmmoInPickup, CallFunc_ContainsTagStack_ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_AmmoInPickup::CallFunc_ContainsTagStack_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.AssignCacheToItem
// 0x0040 (0x0040 - 0x0000)
struct BP_PickupBase_C_AssignCacheToItem final
{
public:
	class UItemInstance*                          Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_AssignCacheToItem) == 0x000008, "Wrong alignment on BP_PickupBase_C_AssignCacheToItem");
static_assert(sizeof(BP_PickupBase_C_AssignCacheToItem) == 0x000040, "Wrong size on BP_PickupBase_C_AssignCacheToItem");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, Item) == 0x000000, "Member 'BP_PickupBase_C_AssignCacheToItem::Item' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PickupBase_C_AssignCacheToItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_PickupBase_C_AssignCacheToItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Array_Get_Item) == 0x00002C, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Map_Find_Value) == 0x000038, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_AssignCacheToItem, CallFunc_Map_Find_ReturnValue) == 0x00003C, "Member 'BP_PickupBase_C_AssignCacheToItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(sizeof(BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature) == 0x000010, "Wrong size on BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature");
static_assert(offsetof(BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, SleepingComponent) == 0x000000, "Member 'BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::SleepingComponent' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature, BoneName) == 0x000008, "Member 'BP_PickupBase_C_BndEvt__BP_PickupBase_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentSleepSignature__DelegateSignature::BoneName' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.CalculateAmmoToAdd
// 0x0018 (0x0018 - 0x0000)
struct BP_PickupBase_C_CalculateAmmoToAdd final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AmmoInPickup_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_CalculateAmmoToAdd) == 0x000004, "Wrong alignment on BP_PickupBase_C_CalculateAmmoToAdd");
static_assert(sizeof(BP_PickupBase_C_CalculateAmmoToAdd) == 0x000018, "Wrong size on BP_PickupBase_C_CalculateAmmoToAdd");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, ReturnValue) == 0x000000, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, CallFunc_AmmoInPickup_ReturnValue) == 0x000004, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::CallFunc_AmmoInPickup_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, CallFunc_GetTagStackCount_ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, CallFunc_GetTagStackCount_ReturnValue_1) == 0x00000C, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, K2Node_MathExpression_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CalculateAmmoToAdd, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_PickupBase_C_CalculateAmmoToAdd::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.CanActivateTrap
// 0x0001 (0x0001 - 0x0000)
struct BP_PickupBase_C_CanActivateTrap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_CanActivateTrap) == 0x000001, "Wrong alignment on BP_PickupBase_C_CanActivateTrap");
static_assert(sizeof(BP_PickupBase_C_CanActivateTrap) == 0x000001, "Wrong size on BP_PickupBase_C_CanActivateTrap");
static_assert(offsetof(BP_PickupBase_C_CanActivateTrap, ReturnValue) == 0x000000, "Member 'BP_PickupBase_C_CanActivateTrap::ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.CancelInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_PickupBase_C_CancelInteraction final
{
public:
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_CancelInteraction) == 0x000008, "Wrong alignment on BP_PickupBase_C_CancelInteraction");
static_assert(sizeof(BP_PickupBase_C_CancelInteraction) == 0x000008, "Wrong size on BP_PickupBase_C_CancelInteraction");
static_assert(offsetof(BP_PickupBase_C_CancelInteraction, InteractionComponent) == 0x000000, "Member 'BP_PickupBase_C_CancelInteraction::InteractionComponent' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.CheckIfItemAlreadyInInventory
// 0x0050 (0x0050 - 0x0000)
struct BP_PickupBase_C_CheckIfItemAlreadyInInventory final
{
public:
	class AActor*                                 InteractingActor_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ItemAlreadyInInventory;                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_CheckIfItemAlreadyInInventory) == 0x000008, "Wrong alignment on BP_PickupBase_C_CheckIfItemAlreadyInInventory");
static_assert(sizeof(BP_PickupBase_C_CheckIfItemAlreadyInInventory) == 0x000050, "Wrong size on BP_PickupBase_C_CheckIfItemAlreadyInInventory");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, InteractingActor_0) == 0x000000, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::InteractingActor_0' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, ItemAlreadyInInventory) == 0x000008, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::ItemAlreadyInInventory' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000020, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_CheckIfItemAlreadyInInventory, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000048, "Member 'BP_PickupBase_C_CheckIfItemAlreadyInInventory::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.DisplayFullAmmoMessage_Auth
// 0x0118 (0x0118 - 0x0000)
struct BP_PickupBase_C_DisplayFullAmmoMessage_Auth final
{
public:
	class ABP_ResidentCharacter_C*                BP_ResidentCharacter;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	TScriptInterface<class II_PlayerControllerMessage_C> K2Node_DynamicCast_AsI_Player_Controller_Message;  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00A0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x00C0(0x0058)()
};
static_assert(alignof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth) == 0x000008, "Wrong alignment on BP_PickupBase_C_DisplayFullAmmoMessage_Auth");
static_assert(sizeof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth) == 0x000118, "Wrong size on BP_PickupBase_C_DisplayFullAmmoMessage_Auth");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, BP_ResidentCharacter) == 0x000000, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::BP_ResidentCharacter' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_DynamicCast_AsPlayer_Controller) == 0x000010, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_DynamicCast_AsI_Player_Controller_Message) == 0x000068, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_DynamicCast_AsI_Player_Controller_Message' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, CallFunc_TextToUpper_ReturnValue) == 0x0000A0, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullAmmoMessage_Auth, K2Node_MakeStruct_PlayerMessage) == 0x0000C0, "Member 'BP_PickupBase_C_DisplayFullAmmoMessage_Auth::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.DisplayFullInventoryMessage_Auth
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PickupBase_C_DisplayFullInventoryMessage_Auth final
{
public:
	class ABP_ResidentCharacter_C*                BP_ResidentCharacter;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0010)()
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0010)()
	TScriptInterface<class II_PlayerControllerMessage_C> K2Node_DynamicCast_AsI_Player_Controller_Message;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_MakeStruct_PlayerMessage;                   // 0x0068(0x0058)()
};
static_assert(alignof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth) == 0x000008, "Wrong alignment on BP_PickupBase_C_DisplayFullInventoryMessage_Auth");
static_assert(sizeof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth) == 0x0000C0, "Wrong size on BP_PickupBase_C_DisplayFullInventoryMessage_Auth");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, BP_ResidentCharacter) == 0x000000, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::BP_ResidentCharacter' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, K2Node_DynamicCast_AsPlayer_Controller) == 0x000020, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, K2Node_DynamicCast_AsI_Player_Controller_Message) == 0x000040, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::K2Node_DynamicCast_AsI_Player_Controller_Message' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_DisplayFullInventoryMessage_Auth, K2Node_MakeStruct_PlayerMessage) == 0x000068, "Member 'BP_PickupBase_C_DisplayFullInventoryMessage_Auth::K2Node_MakeStruct_PlayerMessage' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.Event Interact Cosmetics
// 0x0010 (0x0010 - 0x0000)
struct BP_PickupBase_C_Event_Interact_Cosmetics final
{
public:
	class AActor*                                 InteractingActor_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_Event_Interact_Cosmetics) == 0x000008, "Wrong alignment on BP_PickupBase_C_Event_Interact_Cosmetics");
static_assert(sizeof(BP_PickupBase_C_Event_Interact_Cosmetics) == 0x000010, "Wrong size on BP_PickupBase_C_Event_Interact_Cosmetics");
static_assert(offsetof(BP_PickupBase_C_Event_Interact_Cosmetics, InteractingActor_0) == 0x000000, "Member 'BP_PickupBase_C_Event_Interact_Cosmetics::InteractingActor_0' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_Event_Interact_Cosmetics, InteractionComponent) == 0x000008, "Member 'BP_PickupBase_C_Event_Interact_Cosmetics::InteractionComponent' has a wrong offset!");

// Function BP_PickupBase.BP_PickupBase_C.ExecuteUbergraph_BP_PickupBase
// 0x0590 (0x0590 - 0x0000)
struct BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Instigator;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbilityIW*                     K2Node_Event_Ability;                              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0110(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_5;               // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_4;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_5;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_3;               // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_2;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_4;                   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_1;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_3;                   // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_2;                   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_1;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAmmoBeAdded_ReturnValue;            // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAmmoMaximum_Return_Value;          // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateAmmoToAdd_ReturnValue;           // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_AddNewItem_ReturnValue;                   // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInventoryNotFull_ReturnValue;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AmmoInPickup_ReturnValue;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0294(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character;        // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovementCharacter_C*                K2Node_DynamicCast_AsBP_Movement_Character_1;      // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Interactable;                   // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_InteractingActor_1;             // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_InteractingActor;               // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_InteractionComponent;           // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Focusing_Actor;                       // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InFocus;                        // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Interactable;                         // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent;                 // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_SleepingComponent;      // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_BoneName;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x03E0(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x04E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0504(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnabled;                      // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraSettingsLocal*                     K2Node_DynamicCast_AsLyra_Settings_Local;          // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetItemColor_SlateColor;                  // 0x056C(0x0014)()
	int32                                         CallFunc_GetItemColor_StencilValue;                // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInitializationStateEnded_ReturnValue;  // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfItemAlreadyInInventory_ItemAlreadyInInventory; // 0x0585(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586[0x2];                                      // 0x0586(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase) == 0x000008, "Wrong alignment on BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase");
static_assert(sizeof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase) == 0x000590, "Wrong size on BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, EntryPoint) == 0x000000, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP) == 0x000008, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName_5) == 0x000014, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, Temp_name_Variable) == 0x00002C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName_4) == 0x000044, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName_3) == 0x00004C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName_2) == 0x000064, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName_1) == 0x00007C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x000084, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CustomEvent_NotifyName) == 0x000094, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x00009C, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, Temp_name_Variable_1) == 0x0000AC, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B4, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C4, "Member 'BP_PickupBase_C_ExecuteUbergraph_BP_PickupBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
