#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileBase

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_ProjectileBase.BP_ProjectileBase_C.ActivateNiagaraSystems
// 0x0050 (0x0050 - 0x0000)
struct BP_ProjectileBase_C_ActivateNiagaraSystems final
{
public:
	bool                                          Actrivate;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_ActivateNiagaraSystems) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_ActivateNiagaraSystems");
static_assert(sizeof(BP_ProjectileBase_C_ActivateNiagaraSystems) == 0x000050, "Wrong size on BP_ProjectileBase_C_ActivateNiagaraSystems");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, Actrivate) == 0x000000, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::Actrivate' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, Temp_int_Variable) == 0x000004, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, Temp_int_Variable_1) == 0x00000C, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ActivateNiagaraSystems, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_ProjectileBase_C_ActivateNiagaraSystems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.Apply Hit Effects On Valid Entity
// 0x0108 (0x0108 - 0x0000)
struct BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity final
{
public:
	struct FHitResult                             Hit_Result;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                Instigator_ASC;                                    // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                HitTarget_ASC;                                     // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity");
static_assert(sizeof(BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity) == 0x000108, "Wrong size on BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity");
static_assert(offsetof(BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity, Hit_Result) == 0x000000, "Member 'BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity::Hit_Result' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity, Instigator_ASC) == 0x0000F8, "Member 'BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity::Instigator_ASC' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity, HitTarget_ASC) == 0x000100, "Member 'BP_ProjectileBase_C_Apply_Hit_Effects_On_Valid_Entity::HitTarget_ASC' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.ApplyHitEffects
// 0x00F8 (0x00F8 - 0x0000)
struct BP_ProjectileBase_C_ApplyHitEffects final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ProjectileBase_C_ApplyHitEffects) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_ApplyHitEffects");
static_assert(sizeof(BP_ProjectileBase_C_ApplyHitEffects) == 0x0000F8, "Wrong size on BP_ProjectileBase_C_ApplyHitEffects");
static_assert(offsetof(BP_ProjectileBase_C_ApplyHitEffects, Hit) == 0x000000, "Member 'BP_ProjectileBase_C_ApplyHitEffects::Hit' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.ApplyKillAssistedEffect
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ProjectileBase_C_ApplyKillAssistedEffect final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              AssistGESpecHandle;                                // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0020(0x0018)()
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_Match*                   K2Node_DynamicCast_AsPlayer_State_JP_Match;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     CallFunc_CreateCombatParticipantFromPlayer_ReturnValue; // 0x0058(0x0060)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x00C0(0x0010)()
};
static_assert(alignof(BP_ProjectileBase_C_ApplyKillAssistedEffect) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_ApplyKillAssistedEffect");
static_assert(sizeof(BP_ProjectileBase_C_ApplyKillAssistedEffect) == 0x0000D0, "Wrong size on BP_ProjectileBase_C_ApplyKillAssistedEffect");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, TargetASC) == 0x000000, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, AssistGESpecHandle) == 0x000008, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::AssistGESpecHandle' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_GetEffectContext_ReturnValue) == 0x000020, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_GetPawn_ReturnValue) == 0x000038, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, K2Node_DynamicCast_AsPlayer_State_JP_Match) == 0x000040, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::K2Node_DynamicCast_AsPlayer_State_JP_Match' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000050, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_CreateCombatParticipantFromPlayer_ReturnValue) == 0x000058, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_CreateCombatParticipantFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0000B8, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_ApplyKillAssistedEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x0000C0, "Member 'BP_ProjectileBase_C_ApplyKillAssistedEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.Audio Default Impact
// 0x0018 (0x0018 - 0x0000)
struct BP_ProjectileBase_C_Audio_Default_Impact final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_Audio_Default_Impact) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_Audio_Default_Impact");
static_assert(sizeof(BP_ProjectileBase_C_Audio_Default_Impact) == 0x000018, "Wrong size on BP_ProjectileBase_C_Audio_Default_Impact");
static_assert(offsetof(BP_ProjectileBase_C_Audio_Default_Impact, Location) == 0x000000, "Member 'BP_ProjectileBase_C_Audio_Default_Impact::Location' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.Audio Material Layer
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileBase_C_Audio_Material_Layer final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      PhysicalMaterial;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_Audio_Material_Layer) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_Audio_Material_Layer");
static_assert(sizeof(BP_ProjectileBase_C_Audio_Material_Layer) == 0x000020, "Wrong size on BP_ProjectileBase_C_Audio_Material_Layer");
static_assert(offsetof(BP_ProjectileBase_C_Audio_Material_Layer, Location) == 0x000000, "Member 'BP_ProjectileBase_C_Audio_Material_Layer::Location' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_Audio_Material_Layer, PhysicalMaterial) == 0x000018, "Member 'BP_ProjectileBase_C_Audio_Material_Layer::PhysicalMaterial' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ProjectileBase_C_BndEvt__BP_ProjectileBase_PlayerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.CacheOwnerInfo
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileBase_C_CacheOwnerInfo final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_CacheOwnerInfo) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_CacheOwnerInfo");
static_assert(sizeof(BP_ProjectileBase_C_CacheOwnerInfo) == 0x000020, "Wrong size on BP_ProjectileBase_C_CacheOwnerInfo");
static_assert(offsetof(BP_ProjectileBase_C_CacheOwnerInfo, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_ProjectileBase_C_CacheOwnerInfo::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CacheOwnerInfo, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_ProjectileBase_C_CacheOwnerInfo::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CacheOwnerInfo, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'BP_ProjectileBase_C_CacheOwnerInfo::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CacheOwnerInfo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ProjectileBase_C_CacheOwnerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.CalculateDamageFalloffMultiplier
// 0x0060 (0x0060 - 0x0000)
struct BP_ProjectileBase_C_CalculateDamageFalloffMultiplier final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateRuntimeFloatCurve_ReturnValue;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateRuntimeFloatCurve_time_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_CalculateDamageFalloffMultiplier");
static_assert(sizeof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier) == 0x000060, "Wrong size on BP_ProjectileBase_C_CalculateDamageFalloffMultiplier");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, ReturnValue) == 0x000000, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, Temp_bool_Variable) == 0x000008, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, Temp_real_Variable) == 0x000010, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, CallFunc_Vector_Distance_ReturnValue) == 0x000030, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, CallFunc_EvaluateRuntimeFloatCurve_ReturnValue) == 0x000040, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::CallFunc_EvaluateRuntimeFloatCurve_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, K2Node_Select_Default) == 0x000048, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, CallFunc_EvaluateRuntimeFloatCurve_time_ImplicitCast) == 0x000050, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::CallFunc_EvaluateRuntimeFloatCurve_time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateDamageFalloffMultiplier, K2Node_Select_Option_1_ImplicitCast) == 0x000058, "Member 'BP_ProjectileBase_C_CalculateDamageFalloffMultiplier::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.CalculateImpactAngle
// 0x0230 (0x0230 - 0x0000)
struct BP_ProjectileBase_C_CalculateImpactAngle final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact_Velocity;                                   // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0110(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RadiansToDegrees_ReturnValue;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_CalculateImpactAngle) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_CalculateImpactAngle");
static_assert(sizeof(BP_ProjectileBase_C_CalculateImpactAngle) == 0x000230, "Wrong size on BP_ProjectileBase_C_CalculateImpactAngle");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, Hit) == 0x000000, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::Hit' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, Impact_Velocity) == 0x0000F8, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::Impact_Velocity' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, ReturnValue) == 0x000110, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_BoneName) == 0x0001A8, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_Normal_ReturnValue) == 0x0001F0, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000208, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_Dot_VectorVector_ReturnValue) == 0x000220, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CalculateImpactAngle, CallFunc_RadiansToDegrees_ReturnValue) == 0x000228, "Member 'BP_ProjectileBase_C_CalculateImpactAngle::CallFunc_RadiansToDegrees_ReturnValue' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.CanActivateTrap
// 0x0001 (0x0001 - 0x0000)
struct BP_ProjectileBase_C_CanActivateTrap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_CanActivateTrap) == 0x000001, "Wrong alignment on BP_ProjectileBase_C_CanActivateTrap");
static_assert(sizeof(BP_ProjectileBase_C_CanActivateTrap) == 0x000001, "Wrong size on BP_ProjectileBase_C_CanActivateTrap");
static_assert(offsetof(BP_ProjectileBase_C_CanActivateTrap, ReturnValue) == 0x000000, "Member 'BP_ProjectileBase_C_CanActivateTrap::ReturnValue' has a wrong offset!");

// Function BP_ProjectileBase.BP_ProjectileBase_C.CheckImpactAbilitySystemComponents
// 0x0328 (0x0328 - 0x0000)
struct BP_ProjectileBase_C_CheckImpactAbilitySystemComponents final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Reason;                                            // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Is_Valid;                                          // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Instigator_ASC;                                    // 0x0110(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Target_ASC;                                        // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundValidASCs;                                    // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Hit_Actor_Ability_System_Component;                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Instigator_Ability_System_Component;               // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid;  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid_1; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_1; // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidAbilitySystemComponent_is_Valid_2; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_HasValidAbilitySystemComponent_Target_Ability_System_Component_2; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents) == 0x000008, "Wrong alignment on BP_ProjectileBase_C_CheckImpactAbilitySystemComponents");
static_assert(sizeof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents) == 0x000328, "Wrong size on BP_ProjectileBase_C_CheckImpactAbilitySystemComponents");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Hit) == 0x000000, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Hit' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Reason) == 0x0000F8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Reason' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Is_Valid) == 0x000108, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Is_Valid' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Instigator_ASC) == 0x000110, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Instigator_ASC' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Target_ASC) == 0x000118, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Target_ASC' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, FoundValidASCs) == 0x000120, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::FoundValidASCs' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Hit_Actor_Ability_System_Component) == 0x000128, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Hit_Actor_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, Instigator_Ability_System_Component) == 0x000130, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::Instigator_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bBlockingHit) == 0x000138, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bInitialOverlap) == 0x000139, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Time) == 0x00013C, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Distance) == 0x000140, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Location) == 0x000148, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Normal) == 0x000178, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_BoneName) == 0x0001C8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_HitItem) == 0x0001D0, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_ElementIndex) == 0x0001D4, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_FaceIndex) == 0x0001D8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceStart) == 0x0001E0, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_TraceEnd) == 0x0001F8, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_GetInstigator_ReturnValue) == 0x000210, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000218, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000219, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Time_1) == 0x00021C, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Distance_1) == 0x000220, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileBase_C_CheckImpactAbilitySystemComponents, CallFunc_BreakHitResult_Location_1) == 0x000228, "Member 'BP_ProjectileBase_C_CheckImpactAbilitySystemComponents::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
