#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PingableComponent

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_PingableComponent.BP_PingableComponent_C.GetPingDataBP
// 0x0128 (0x0128 - 0x0000)
struct BP_PingableComponent_C_GetPingDataBP final
{
public:
	class APlayerControllerJP_Match*              InPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPingData                              ReturnValue;                                       // 0x0008(0x0090)(Parm, OutParm, ReturnParm)
	struct FPingData                              CallFunc_GetPingData_ReturnValue;                  // 0x0098(0x0090)()
};
static_assert(alignof(BP_PingableComponent_C_GetPingDataBP) == 0x000008, "Wrong alignment on BP_PingableComponent_C_GetPingDataBP");
static_assert(sizeof(BP_PingableComponent_C_GetPingDataBP) == 0x000128, "Wrong size on BP_PingableComponent_C_GetPingDataBP");
static_assert(offsetof(BP_PingableComponent_C_GetPingDataBP, InPC) == 0x000000, "Member 'BP_PingableComponent_C_GetPingDataBP::InPC' has a wrong offset!");
static_assert(offsetof(BP_PingableComponent_C_GetPingDataBP, ReturnValue) == 0x000008, "Member 'BP_PingableComponent_C_GetPingDataBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PingableComponent_C_GetPingDataBP, CallFunc_GetPingData_ReturnValue) == 0x000098, "Member 'BP_PingableComponent_C_GetPingDataBP::CallFunc_GetPingData_ReturnValue' has a wrong offset!");

}

