#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_PieDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HouseDecalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_PieDecal.Bp_PieDecal_C
// 0x0020 (0x0360 - 0x0340)
class ABp_PieDecal_C final : public ABP_HouseDecalBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Bp_PieDecal_C;                      // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PieDecalScale_Scale_BD62A6934E2976418DE12499EDADB344; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PieDecalScale__Direction_BD62A6934E2976418DE12499EDADB344; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PieDecalScale;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_PieDecal(int32 EntryPoint);
	void PieDecalScale__FinishedFunc();
	void PieDecalScale__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_PieDecal_C">();
	}
	static class ABp_PieDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_PieDecal_C>();
	}
};
static_assert(alignof(ABp_PieDecal_C) == 0x000008, "Wrong alignment on ABp_PieDecal_C");
static_assert(sizeof(ABp_PieDecal_C) == 0x000360, "Wrong size on ABp_PieDecal_C");
static_assert(offsetof(ABp_PieDecal_C, UberGraphFrame_Bp_PieDecal_C) == 0x000340, "Member 'ABp_PieDecal_C::UberGraphFrame_Bp_PieDecal_C' has a wrong offset!");
static_assert(offsetof(ABp_PieDecal_C, StaticMesh) == 0x000348, "Member 'ABp_PieDecal_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABp_PieDecal_C, PieDecalScale_Scale_BD62A6934E2976418DE12499EDADB344) == 0x000350, "Member 'ABp_PieDecal_C::PieDecalScale_Scale_BD62A6934E2976418DE12499EDADB344' has a wrong offset!");
static_assert(offsetof(ABp_PieDecal_C, PieDecalScale__Direction_BD62A6934E2976418DE12499EDADB344) == 0x000354, "Member 'ABp_PieDecal_C::PieDecalScale__Direction_BD62A6934E2976418DE12499EDADB344' has a wrong offset!");
static_assert(offsetof(ABp_PieDecal_C, PieDecalScale) == 0x000358, "Member 'ABp_PieDecal_C::PieDecalScale' has a wrong offset!");

}

