#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourcePile_Spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResourcePile_Spawner.BP_ResourcePile_Spawner_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_ResourcePile_Spawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PreviewMesh;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourcePile_C*                     SpawnedResourcePile;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedResourcePileDepleted;                       // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ResourcePile_Spawner(int32 EntryPoint);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void ReceiveBeginPlay();
	void Server_Spawn_Resource_Pile(int32 DaysPassed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResourcePile_Spawner_C">();
	}
	static class ABP_ResourcePile_Spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResourcePile_Spawner_C>();
	}
};
static_assert(alignof(ABP_ResourcePile_Spawner_C) == 0x000008, "Wrong alignment on ABP_ResourcePile_Spawner_C");
static_assert(sizeof(ABP_ResourcePile_Spawner_C) == 0x0002C0, "Wrong size on ABP_ResourcePile_Spawner_C");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, UberGraphFrame) == 0x000290, "Member 'ABP_ResourcePile_Spawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, Arrow) == 0x000298, "Member 'ABP_ResourcePile_Spawner_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, PreviewMesh) == 0x0002A0, "Member 'ABP_ResourcePile_Spawner_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_ResourcePile_Spawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, SpawnedResourcePile) == 0x0002B0, "Member 'ABP_ResourcePile_Spawner_C::SpawnedResourcePile' has a wrong offset!");
static_assert(offsetof(ABP_ResourcePile_Spawner_C, SpawnedResourcePileDepleted) == 0x0002B8, "Member 'ABP_ResourcePile_Spawner_C::SpawnedResourcePileDepleted' has a wrong offset!");

}

