#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourcePile_Spawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ResourcePile_Spawner.BP_ResourcePile_Spawner_C.ExecuteUbergraph_BP_ResourcePile_Spawner
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DaysPassed;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourcePile_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner) == 0x000010, "Wrong alignment on BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner");
static_assert(sizeof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner) == 0x0000A0, "Wrong size on BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, EntryPoint) == 0x000000, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, K2Node_CustomEvent_DaysPassed) == 0x000018, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::K2Node_CustomEvent_DaysPassed' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, K2Node_CustomEvent_DestroyedActor) == 0x000080, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000088, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'BP_ResourcePile_Spawner_C_ExecuteUbergraph_BP_ResourcePile_Spawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ResourcePile_Spawner.BP_ResourcePile_Spawner_C.OnDestroyed_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_ResourcePile_Spawner_C_OnDestroyed_Event final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePile_Spawner_C_OnDestroyed_Event) == 0x000008, "Wrong alignment on BP_ResourcePile_Spawner_C_OnDestroyed_Event");
static_assert(sizeof(BP_ResourcePile_Spawner_C_OnDestroyed_Event) == 0x000008, "Wrong size on BP_ResourcePile_Spawner_C_OnDestroyed_Event");
static_assert(offsetof(BP_ResourcePile_Spawner_C_OnDestroyed_Event, DestroyedActor) == 0x000000, "Member 'BP_ResourcePile_Spawner_C_OnDestroyed_Event::DestroyedActor' has a wrong offset!");

// Function BP_ResourcePile_Spawner.BP_ResourcePile_Spawner_C.Server_Spawn Resource Pile
// 0x0004 (0x0004 - 0x0000)
struct BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile final
{
public:
	int32                                         DaysPassed;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile) == 0x000004, "Wrong alignment on BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile");
static_assert(sizeof(BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile) == 0x000004, "Wrong size on BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile");
static_assert(offsetof(BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile, DaysPassed) == 0x000000, "Member 'BP_ResourcePile_Spawner_C_Server_Spawn_Resource_Pile::DaysPassed' has a wrong offset!");

}

