#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResidentCharacter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_DeathTimerDetails_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JP_structs.hpp"
#include "ServerWidgetTypeRow_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "Inventory_structs.hpp"
#include "S_HideScreenSplatMessage_structs.hpp"
#include "S_ShowScreenSplatMessage_structs.hpp"
#include "GASIW_structs.hpp"
#include "S_CharacterStats_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_ServerWidgetType_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.AbilityFailedAttributeCost
// 0x0008 (0x0008 - 0x0000)
struct BP_ResidentCharacter_C_AbilityFailedAttributeCost final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_AbilityFailedAttributeCost) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_AbilityFailedAttributeCost");
static_assert(sizeof(BP_ResidentCharacter_C_AbilityFailedAttributeCost) == 0x000008, "Wrong size on BP_ResidentCharacter_C_AbilityFailedAttributeCost");
static_assert(offsetof(BP_ResidentCharacter_C_AbilityFailedAttributeCost, OwningActor) == 0x000000, "Member 'BP_ResidentCharacter_C_AbilityFailedAttributeCost::OwningActor' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.AddHomeRegenEffect
// 0x0058 (0x0058 - 0x0000)
struct BP_ResidentCharacter_C_AddHomeRegenEffect final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TweakableData_C*                    CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0010(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0028(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0038(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_AddHomeRegenEffect) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_AddHomeRegenEffect");
static_assert(sizeof(BP_ResidentCharacter_C_AddHomeRegenEffect) == 0x000058, "Wrong size on BP_ResidentCharacter_C_AddHomeRegenEffect");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data) == 0x000008, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_Get_BP_Tweakable_Data_AsBP_Tweakable_Data' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_MakeEffectContext_ReturnValue) == 0x000010, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000028, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000038, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000048, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_AddHomeRegenEffect, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000050, "Member 'BP_ResidentCharacter_C_AddHomeRegenEffect::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.AddOnHealthChangedListener
// 0x0010 (0x0010 - 0x0000)
struct BP_ResidentCharacter_C_AddOnHealthChangedListener final
{
public:
	TScriptInterface<class II_ActorWithHealth_HealthChangedReceiver_C> Listener;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_AddOnHealthChangedListener) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_AddOnHealthChangedListener");
static_assert(sizeof(BP_ResidentCharacter_C_AddOnHealthChangedListener) == 0x000010, "Wrong size on BP_ResidentCharacter_C_AddOnHealthChangedListener");
static_assert(offsetof(BP_ResidentCharacter_C_AddOnHealthChangedListener, Listener) == 0x000000, "Member 'BP_ResidentCharacter_C_AddOnHealthChangedListener::Listener' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.AddOnTeamChangedListener
// 0x0010 (0x0010 - 0x0000)
struct BP_ResidentCharacter_C_AddOnTeamChangedListener final
{
public:
	TScriptInterface<class II_ActorWithChangeableTeam_TeamChangedReceiver_C> Listener;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_AddOnTeamChangedListener) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_AddOnTeamChangedListener");
static_assert(sizeof(BP_ResidentCharacter_C_AddOnTeamChangedListener) == 0x000010, "Wrong size on BP_ResidentCharacter_C_AddOnTeamChangedListener");
static_assert(offsetof(BP_ResidentCharacter_C_AddOnTeamChangedListener, Listener) == 0x000000, "Member 'BP_ResidentCharacter_C_AddOnTeamChangedListener::Listener' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyCombatGameplayEffectToTargetAndInstigator
// 0x0088 (0x0088 - 0x0000)
struct BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator final
{
public:
	class AActor*                                 Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Damage;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInCombatDuration_Return;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetInCombatDuration_Return_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0030(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue_1;           // 0x0040(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0050(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0060(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1; // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator) == 0x000088, "Wrong size on BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, Causer) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::Causer' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, Damage) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::Damage' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_GetInCombatDuration_Return) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_GetInCombatDuration_Return' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_GetInCombatDuration_Return_1) == 0x000020, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_GetInCombatDuration_Return_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000030, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_MakeOutgoingSpec_ReturnValue_1) == 0x000040, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_MakeOutgoingSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000050, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000060, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000070, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1) == 0x000078, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000080, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x000084, "Member 'BP_ResidentCharacter_C_ApplyCombatGameplayEffectToTargetAndInstigator::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyInteractionAudioMultiplier
// 0x0030 (0x0030 - 0x0000)
struct BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier final
{
public:
	class UAudioComponent*                        Audio_Component;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAttributeValue_bFound;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameplayAttributeValue_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier) == 0x000030, "Wrong size on BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, Audio_Component) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::Audio_Component' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_GetGameplayAttributeValue_bFound) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_GetGameplayAttributeValue_bFound' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_GetGameplayAttributeValue_ReturnValue) == 0x00000C, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_GetGameplayAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x000028, "Member 'BP_ResidentCharacter_C_ApplyInteractionAudioMultiplier::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyKillEffect
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ResidentCharacter_C_ApplyKillEffect final
{
public:
	class UAbilitySystemComponentJP*              ASC;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0008(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0020(0x0010)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0030(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0128(0x0010)()
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x0138(0x0060)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0198(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue_1;          // 0x01B0(0x0018)()
	bool                                          CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue; // 0x01CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01D4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyKillEffect) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyKillEffect");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyKillEffect) == 0x0001E0, "Wrong size on BP_ResidentCharacter_C_ApplyKillEffect");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, ASC) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::ASC' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_MakeEffectContext_ReturnValue) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000020, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_MakeHitResult_ReturnValue) == 0x000030, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000128, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, K2Node_MakeStruct_CombatParticipant) == 0x000138, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_GetEffectContext_ReturnValue) == 0x000198, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_MakeEffectContext_ReturnValue_1) == 0x0001B0, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_MakeEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed) == 0x0001C8, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue) == 0x0001CC, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyKillEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001D4, "Member 'BP_ResidentCharacter_C_ApplyKillEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyPassiveHealthRegenEffect
// 0x0078 (0x0078 - 0x0000)
struct BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect final
{
public:
	class UPerkManagerComponent*                  CallFunc_GetPerkManagerComponentFromPawn_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0008(0x0010)()
	TArray<class UPerkAction*>                    CallFunc_K2_GetAllActionsOfType_ReturnValue;       // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0028(0x0010)()
	class UPerkAction*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPA_ModifyPassiveHealthRegen_C*         K2Node_DynamicCast_AsPA_Modify_Passive_Health_Regen; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0058(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1; // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect) == 0x000078, "Wrong size on BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_GetPerkManagerComponentFromPawn_ReturnValue) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_GetPerkManagerComponentFromPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_K2_GetAllActionsOfType_ReturnValue) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_K2_GetAllActionsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000028, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000040, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, K2Node_DynamicCast_AsPA_Modify_Passive_Health_Regen) == 0x000048, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::K2Node_DynamicCast_AsPA_Modify_Passive_Health_Regen' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_Array_IsEmpty_ReturnValue) == 0x000051, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000058, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1) == 0x000068, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000070, "Member 'BP_ResidentCharacter_C_ApplyPassiveHealthRegenEffect::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyPerkActionsOnPossessed
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPerkManagerComponent*                  CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPerkAction*>                    CallFunc_K2_GetAllActionsOfType_ReturnValue;       // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPerkAction*                            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPA_ApplyEffectOnRespawn_C*             K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name_1;                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPerkManagerComponent*                  CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPerkAction*>                    CallFunc_K2_GetAllActionsOfType_ReturnValue_1;     // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPerkAction*                            CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPA_GrantGameplayAbility_C*             K2Node_DynamicCast_AsPA_Grant_Gameplay_Ability;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed) == 0x0000C0, "Wrong size on BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, Temp_int_Loop_Counter_Variable_1) == 0x000004, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Get_ClassLog_Name_name) == 0x000020, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue) == 0x000030, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_K2_GetAllActionsOfType_ReturnValue) == 0x000040, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_K2_GetAllActionsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn) == 0x000060, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Get_ClassLog_Name_name_1) == 0x000070, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Get_ClassLog_Name_name_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue_1) == 0x000080, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_GetPerkManagerComponentFromPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_K2_GetAllActionsOfType_ReturnValue_1) == 0x000090, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_K2_GetAllActionsOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, K2Node_DynamicCast_AsPA_Grant_Gameplay_Ability) == 0x0000B0, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::K2Node_DynamicCast_AsPA_Grant_Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B9, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnPossessed::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyPerkActionsOnRespawn
// 0x0050 (0x0050 - 0x0000)
struct BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkManagerComponent*                  CallFunc_GetPerkManagerComponentFromPawn_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UPerkAction*>                    CallFunc_K2_GetAllActionsOfType_ReturnValue;       // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkAction*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPA_ApplyEffectOnRespawn_C*             K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn) == 0x000050, "Wrong size on BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_GetPerkManagerComponentFromPawn_ReturnValue) == 0x000010, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_GetPerkManagerComponentFromPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_K2_GetAllActionsOfType_ReturnValue) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_K2_GetAllActionsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn) == 0x000038, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::K2Node_DynamicCast_AsPA_Apply_Effect_on_Respawn' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_ResidentCharacter_C_ApplyPerkActionsOnRespawn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.ApplyVitalInstinctPerkEffects
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects final
{
public:
	double                                        CurrentHealth;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HealthPercentage;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPerkAction*>                    CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions; // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPerkAction*                            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPA_ApplyEffectToCharacterWithLowHealth_C* K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_Low_Health; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGameplayEffectIfHealthLow_EffectApplied; // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPerkAction*>                    CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions_1; // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkAction*                            CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPA_ApplyEffectToCharacterWithHighHealth_C* K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_High_Health; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGameplayEffectIfHealthHigh_EffectApplied; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects) == 0x000008, "Wrong alignment on BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects");
static_assert(sizeof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects) == 0x0000A0, "Wrong size on BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CurrentHealth) == 0x000000, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CurrentHealth' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, MaxHealth) == 0x000008, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::MaxHealth' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, HealthPercentage) == 0x000010, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::HealthPercentage' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, K2Node_MathExpression_ReturnValue) == 0x000020, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_HasAuthority_ReturnValue) == 0x000034, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions) == 0x000038, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_Low_Health) == 0x000058, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_Low_Health' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_ApplyGameplayEffectIfHealthLow_EffectApplied) == 0x000061, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_ApplyGameplayEffectIfHealthLow_EffectApplied' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions_1) == 0x000068, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Get_Perk_Actions_for_Action_Type_PerkActions_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_High_Health) == 0x000088, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::K2Node_DynamicCast_AsPA_Apply_Effect_to_Character_with_High_Health' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_ApplyGameplayEffectIfHealthHigh_EffectApplied) == 0x000092, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_ApplyGameplayEffectIfHealthHigh_EffectApplied' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'BP_ResidentCharacter_C_ApplyVitalInstinctPerkEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ResidentCharacter.BP_ResidentCharacter_C.AssignLocationTag
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ResidentCharacter_C_AssignLocationTag final
{
public:
