#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourceCrane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResourceCrane.BP_ResourceCrane_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_ResourceCrane_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightConeTop2;                                     // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightConeTop1;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Crane;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_Light_Alpha_90B3A3AD4AB25A98565B948ECA96C482;   // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_Light__Direction_90B3A3AD4AB25A98565B948ECA96C482; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Light;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ResourceCrane(int32 EntryPoint);
	void LightConeAnimation(bool On);
	void Multi_Animate();
	void ResourcePilesRestocked();
	void TL_Light__FinishedFunc();
	void TL_Light__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResourceCrane_C">();
	}
	static class ABP_ResourceCrane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResourceCrane_C>();
	}
};
static_assert(alignof(ABP_ResourceCrane_C) == 0x000008, "Wrong alignment on ABP_ResourceCrane_C");
static_assert(sizeof(ABP_ResourceCrane_C) == 0x0002E8, "Wrong size on ABP_ResourceCrane_C");
static_assert(offsetof(ABP_ResourceCrane_C, UberGraphFrame) == 0x000290, "Member 'ABP_ResourceCrane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, RotatingMovement) == 0x000298, "Member 'ABP_ResourceCrane_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, LightConeTop2) == 0x0002A0, "Member 'ABP_ResourceCrane_C::LightConeTop2' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, LightConeTop1) == 0x0002A8, "Member 'ABP_ResourceCrane_C::LightConeTop1' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, PointLight1) == 0x0002B0, "Member 'ABP_ResourceCrane_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, PointLight) == 0x0002B8, "Member 'ABP_ResourceCrane_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, SK_Crane) == 0x0002C0, "Member 'ABP_ResourceCrane_C::SK_Crane' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, Scene) == 0x0002C8, "Member 'ABP_ResourceCrane_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_ResourceCrane_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, TL_Light_Alpha_90B3A3AD4AB25A98565B948ECA96C482) == 0x0002D8, "Member 'ABP_ResourceCrane_C::TL_Light_Alpha_90B3A3AD4AB25A98565B948ECA96C482' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, TL_Light__Direction_90B3A3AD4AB25A98565B948ECA96C482) == 0x0002DC, "Member 'ABP_ResourceCrane_C::TL_Light__Direction_90B3A3AD4AB25A98565B948ECA96C482' has a wrong offset!");
static_assert(offsetof(ABP_ResourceCrane_C, TL_Light) == 0x0002E0, "Member 'ABP_ResourceCrane_C::TL_Light' has a wrong offset!");

}

