#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourceCrate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function BP_ResourceCrate.BP_ResourceCrate_C.DisableCollisionAndHide
// 0x0018 (0x0018 - 0x0000)
struct BP_ResourceCrate_C_DisableCollisionAndHide final
{
public:
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_DisableCollisionAndHide) == 0x000008, "Wrong alignment on BP_ResourceCrate_C_DisableCollisionAndHide");
static_assert(sizeof(BP_ResourceCrate_C_DisableCollisionAndHide) == 0x000018, "Wrong size on BP_ResourceCrate_C_DisableCollisionAndHide");
static_assert(offsetof(BP_ResourceCrate_C_DisableCollisionAndHide, CallFunc_GetInstigator_ReturnValue) == 0x000000, "Member 'BP_ResourceCrate_C_DisableCollisionAndHide::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_DisableCollisionAndHide, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_ResourceCrate_C_DisableCollisionAndHide::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_DisableCollisionAndHide, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'BP_ResourceCrate_C_DisableCollisionAndHide::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_ResourceCrate.BP_ResourceCrate_C.EnableCollisionAndShow
// 0x0100 (0x0100 - 0x0000)
struct BP_ResourceCrate_C_EnableCollisionAndShow final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_EnableCollisionAndShow) == 0x000008, "Wrong alignment on BP_ResourceCrate_C_EnableCollisionAndShow");
static_assert(sizeof(BP_ResourceCrate_C_EnableCollisionAndShow) == 0x000100, "Wrong size on BP_ResourceCrate_C_EnableCollisionAndShow");
static_assert(offsetof(BP_ResourceCrate_C_EnableCollisionAndShow, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'BP_ResourceCrate_C_EnableCollisionAndShow::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_EnableCollisionAndShow, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000F8, "Member 'BP_ResourceCrate_C_EnableCollisionAndShow::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_ResourceCrate.BP_ResourceCrate_C.ExecuteUbergraph_BP_ResourceCrate
// 0x0120 (0x0120 - 0x0000)
struct BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Velocity;                             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourceCrate_Destroyed_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate) == 0x000010, "Wrong alignment on BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate");
static_assert(sizeof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate) == 0x000120, "Wrong size on BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, EntryPoint) == 0x000000, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_Get_ClassLog_Name_name) == 0x000048, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000058, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_GetInstigator_ReturnValue) == 0x000068, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, K2Node_Event_Velocity) == 0x000088, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::K2Node_Event_Velocity' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, Temp_bool_IsClosed_Variable) == 0x0000A0, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'BP_ResourceCrate_C_ExecuteUbergraph_BP_ResourceCrate::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ResourceCrate.BP_ResourceCrate_C.LaunchCrate
// 0x0030 (0x0030 - 0x0000)
struct BP_ResourceCrate_C_LaunchCrate final
{
public:
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_LaunchCrate) == 0x000008, "Wrong alignment on BP_ResourceCrate_C_LaunchCrate");
static_assert(sizeof(BP_ResourceCrate_C_LaunchCrate) == 0x000030, "Wrong size on BP_ResourceCrate_C_LaunchCrate");
static_assert(offsetof(BP_ResourceCrate_C_LaunchCrate, CallFunc_GetActorUpVector_ReturnValue) == 0x000000, "Member 'BP_ResourceCrate_C_LaunchCrate::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_LaunchCrate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000018, "Member 'BP_ResourceCrate_C_LaunchCrate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_ResourceCrate.BP_ResourceCrate_C.Multi_Throw
// 0x0018 (0x0018 - 0x0000)
struct BP_ResourceCrate_C_Multi_Throw final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_Multi_Throw) == 0x000008, "Wrong alignment on BP_ResourceCrate_C_Multi_Throw");
static_assert(sizeof(BP_ResourceCrate_C_Multi_Throw) == 0x000018, "Wrong size on BP_ResourceCrate_C_Multi_Throw");
static_assert(offsetof(BP_ResourceCrate_C_Multi_Throw, Velocity) == 0x000000, "Member 'BP_ResourceCrate_C_Multi_Throw::Velocity' has a wrong offset!");

// Function BP_ResourceCrate.BP_ResourceCrate_C.ToggleReceptacleVisual
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ResourceCrate_C_ToggleReceptacleVisual final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Resource_Receptacle_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	class ABP_Resource_Receptacle_C*              CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0068(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceCrate_C_ToggleReceptacleVisual) == 0x000008, "Wrong alignment on BP_ResourceCrate_C_ToggleReceptacleVisual");
static_assert(sizeof(BP_ResourceCrate_C_ToggleReceptacleVisual) == 0x0000A8, "Wrong size on BP_ResourceCrate_C_ToggleReceptacleVisual");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, Visible) == 0x000000, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::Visible' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, Character) == 0x000008, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::Character' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000028, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, K2Node_DynamicCast_AsTeamable_Interface) == 0x000030, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_GetTeamID_ReturnValue) == 0x000042, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, Temp_byte_Variable) == 0x000043, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_GetTeam_ReturnValue) == 0x000068, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceCrate_C_ToggleReceptacleVisual, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'BP_ResourceCrate_C_ToggleReceptacleVisual::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

