#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SlingProjectile_Decoy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SlingProjectile_Decoy.BP_SlingProjectile_Decoy_C.ExecuteUbergraph_BP_SlingProjectile_Decoy
// 0x02A0 (0x02A0 - 0x0000)
struct BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal;                         // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DecoyFirecracker_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy) == 0x000010, "Wrong alignment on BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy");
static_assert(sizeof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy) == 0x0002A0, "Wrong size on BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, EntryPoint) == 0x000000, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, K2Node_Event_Hit) == 0x000008, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_HasAuthority_ReturnValue) == 0x000100, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_bBlockingHit) == 0x000101, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_bInitialOverlap) == 0x000102, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_Time) == 0x000104, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_Distance) == 0x000108, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_Location) == 0x000110, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_Normal) == 0x000140, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_ImpactNormal) == 0x000158, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_PhysMat) == 0x000170, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_HitActor) == 0x000178, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_HitComponent) == 0x000180, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_HitBoneName) == 0x000188, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_BoneName) == 0x000190, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_HitItem) == 0x000198, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_ElementIndex) == 0x00019C, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_FaceIndex) == 0x0001A0, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BreakHitResult_TraceEnd) == 0x0001C0, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, K2Node_CustomEvent_Location) == 0x0001D8, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, K2Node_CustomEvent_Normal) == 0x0001F0, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::K2Node_CustomEvent_Normal' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000208, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000280, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_IsValid_ReturnValue) == 0x000288, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy, CallFunc_FinishSpawningActor_ReturnValue) == 0x000290, "Member 'BP_SlingProjectile_Decoy_C_ExecuteUbergraph_BP_SlingProjectile_Decoy::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_SlingProjectile_Decoy.BP_SlingProjectile_Decoy_C.Spawn Decoy Firecracker
// 0x0030 (0x0030 - 0x0000)
struct BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker) == 0x000008, "Wrong alignment on BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker");
static_assert(sizeof(BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker) == 0x000030, "Wrong size on BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker, Location) == 0x000000, "Member 'BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker::Location' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker, Normal) == 0x000018, "Member 'BP_SlingProjectile_Decoy_C_Spawn_Decoy_Firecracker::Normal' has a wrong offset!");

// Function BP_SlingProjectile_Decoy.BP_SlingProjectile_Decoy_C.DamageTarget
// 0x0108 (0x0108 - 0x0000)
struct BP_SlingProjectile_Decoy_C_DamageTarget final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                Instigator_Ability_System_Component;               // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Hit_Actor_Ability_System_Component;                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SlingProjectile_Decoy_C_DamageTarget) == 0x000008, "Wrong alignment on BP_SlingProjectile_Decoy_C_DamageTarget");
static_assert(sizeof(BP_SlingProjectile_Decoy_C_DamageTarget) == 0x000108, "Wrong size on BP_SlingProjectile_Decoy_C_DamageTarget");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_DamageTarget, Hit) == 0x000000, "Member 'BP_SlingProjectile_Decoy_C_DamageTarget::Hit' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_DamageTarget, Instigator_Ability_System_Component) == 0x0000F8, "Member 'BP_SlingProjectile_Decoy_C_DamageTarget::Instigator_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_DamageTarget, Hit_Actor_Ability_System_Component) == 0x000100, "Member 'BP_SlingProjectile_Decoy_C_DamageTarget::Hit_Actor_Ability_System_Component' has a wrong offset!");

// Function BP_SlingProjectile_Decoy.BP_SlingProjectile_Decoy_C.HandleProjectileStop
// 0x00F8 (0x00F8 - 0x0000)
struct BP_SlingProjectile_Decoy_C_HandleProjectileStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SlingProjectile_Decoy_C_HandleProjectileStop) == 0x000008, "Wrong alignment on BP_SlingProjectile_Decoy_C_HandleProjectileStop");
static_assert(sizeof(BP_SlingProjectile_Decoy_C_HandleProjectileStop) == 0x0000F8, "Wrong size on BP_SlingProjectile_Decoy_C_HandleProjectileStop");
static_assert(offsetof(BP_SlingProjectile_Decoy_C_HandleProjectileStop, Hit) == 0x000000, "Member 'BP_SlingProjectile_Decoy_C_HandleProjectileStop::Hit' has a wrong offset!");

}

