#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScatterSound_Spawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_TimeOfDay_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.PlaySoundAttached
// 0x0130 (0x0130 - 0x0000)
struct BP_ScatterSound_Spawner_C_PlaySoundAttached final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0028(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_PlaySoundAttached) == 0x000008, "Wrong alignment on BP_ScatterSound_Spawner_C_PlaySoundAttached");
static_assert(sizeof(BP_ScatterSound_Spawner_C_PlaySoundAttached) == 0x000130, "Wrong size on BP_ScatterSound_Spawner_C_PlaySoundAttached");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, Location) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::Location' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, Temp_byte_Variable) == 0x000018, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, Temp_object_Variable) == 0x000020, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000028, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, K2Node_Select_Default) == 0x000120, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAttached, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000128, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAttached::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.PlaySoundAtLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_ScatterSound_Spawner_C_PlaySoundAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation) == 0x000008, "Wrong alignment on BP_ScatterSound_Spawner_C_PlaySoundAtLocation");
static_assert(sizeof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation) == 0x000030, "Wrong size on BP_ScatterSound_Spawner_C_PlaySoundAtLocation");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation, Location) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAtLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation, Temp_byte_Variable) == 0x000018, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAtLocation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation, Temp_object_Variable) == 0x000020, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAtLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_PlaySoundAtLocation, K2Node_Select_Default) == 0x000028, "Member 'BP_ScatterSound_Spawner_C_PlaySoundAtLocation::K2Node_Select_Default' has a wrong offset!");

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.On_Client_TimeOfDayChange_Event
// 0x0002 (0x0002 - 0x0000)
struct BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event final
{
public:
	bool                                          InitialState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   TimeOfDay;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event) == 0x000001, "Wrong alignment on BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event");
static_assert(sizeof(BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event) == 0x000002, "Wrong size on BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event");
static_assert(offsetof(BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event, InitialState) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event::InitialState' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event, TimeOfDay) == 0x000001, "Member 'BP_ScatterSound_Spawner_C_On_Client_TimeOfDayChange_Event::TimeOfDay' has a wrong offset!");

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.GetRandomFloatInRange
// 0x0040 (0x0040 - 0x0000)
struct BP_ScatterSound_Spawner_C_GetRandomFloatInRange final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange) == 0x000008, "Wrong alignment on BP_ScatterSound_Spawner_C_GetRandomFloatInRange");
static_assert(sizeof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange) == 0x000040, "Wrong size on BP_ScatterSound_Spawner_C_GetRandomFloatInRange");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, ReturnValue) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, Temp_bool_Variable) == 0x000008, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, Temp_real_Variable) == 0x000010, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, Temp_real_Variable_1) == 0x000018, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, CallFunc_RandomBool_ReturnValue) == 0x000020, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, K2Node_Select_Default) == 0x000030, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_GetRandomFloatInRange, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_ScatterSound_Spawner_C_GetRandomFloatInRange::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.ExecuteUbergraph_BP_ScatterSound_Spawner
// 0x0290 (0x0290 - 0x0000)
struct BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InitialState;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TimeOfDay                                   K2Node_CustomEvent_TimeOfDay;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_For_Overlapping_Pawns_IsInside;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool InitialState, E_TimeOfDay TimeOfDay)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRandomFloatInRange_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRandomFloatInRange_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue_1;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_1;   // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0190(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner) == 0x000008, "Wrong alignment on BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner");
static_assert(sizeof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner) == 0x000290, "Wrong size on BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, EntryPoint) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000018, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000020, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000058, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, K2Node_CustomEvent_InitialState) == 0x000070, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::K2Node_CustomEvent_InitialState' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, K2Node_CustomEvent_TimeOfDay) == 0x000071, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::K2Node_CustomEvent_TimeOfDay' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000078, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetActorOfClass_ReturnValue) == 0x000080, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000098, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_Check_For_Overlapping_Pawns_IsInside) == 0x0000A8, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_Check_For_Overlapping_Pawns_IsInside' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_BreakVector_X) == 0x0000C8, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_BreakVector_Z) == 0x0000D8, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetRandomFloatInRange_ReturnValue) == 0x0000F0, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetRandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetRandomFloatInRange_ReturnValue_1) == 0x0000F8, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetRandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000118, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000130, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000138, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000139, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000140, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_IsDedicatedServer_ReturnValue) == 0x000158, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_GetScaledBoxExtent_ReturnValue_1) == 0x000160, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_GetScaledBoxExtent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_RandomPointInBoundingBox_ReturnValue_1) == 0x000178, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_RandomPointInBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000190, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000288, "Member 'BP_ScatterSound_Spawner_C_ExecuteUbergraph_BP_ScatterSound_Spawner::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_ScatterSound_Spawner.BP_ScatterSound_Spawner_C.Check For Overlapping Pawns
// 0x0048 (0x0048 - 0x0000)
struct BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns final
{
public:
	bool                                          IsInside;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_LocalPlayerInside;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns) == 0x000008, "Wrong alignment on BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns");
static_assert(sizeof(BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns) == 0x000048, "Wrong size on BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns");
static_assert(offsetof(BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns, IsInside) == 0x000000, "Member 'BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns::IsInside' has a wrong offset!");
static_assert(offsetof(BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns, L_LocalPlayerInside) == 0x000001, "Member 'BP_ScatterSound_Spawner_C_Check_For_Overlapping_Pawns::L_LocalPlayerInside' has a wrong offset!");
