#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StickOfFire_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StickOfFire_Projectile.BP_StickOfFire_Projectile_C
// 0x0038 (0x0560 - 0x0528)
class ABP_StickOfFire_Projectile_C final : public ABP_ProjectileBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_StickOfFire_Projectile_C;        // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           InstigatorPlayerState;                             // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Lifetime;                                          // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DotDuration;                                       // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DamagePerTick;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void DetermineSpawnLocationAndNormal(const struct FHitResult& Hit, struct FVector* Location, struct FVector* Normal);
	void ExecuteUbergraph_BP_StickOfFire_Projectile(int32 EntryPoint);
	void SpawnFireSpot(const struct FVector& SpawnLocation, const struct FVector& Normal, class APlayerState* OwningPlayerState);
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StickOfFire_Projectile_C">();
	}
	static class ABP_StickOfFire_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StickOfFire_Projectile_C>();
	}
};
static_assert(alignof(ABP_StickOfFire_Projectile_C) == 0x000008, "Wrong alignment on ABP_StickOfFire_Projectile_C");
static_assert(sizeof(ABP_StickOfFire_Projectile_C) == 0x000560, "Wrong size on ABP_StickOfFire_Projectile_C");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, UberGraphFrame_BP_StickOfFire_Projectile_C) == 0x000528, "Member 'ABP_StickOfFire_Projectile_C::UberGraphFrame_BP_StickOfFire_Projectile_C' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, RotatingMovement) == 0x000530, "Member 'ABP_StickOfFire_Projectile_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, Niagara) == 0x000538, "Member 'ABP_StickOfFire_Projectile_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, InstigatorPlayerState) == 0x000540, "Member 'ABP_StickOfFire_Projectile_C::InstigatorPlayerState' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, Lifetime) == 0x000548, "Member 'ABP_StickOfFire_Projectile_C::Lifetime' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, DotDuration) == 0x000550, "Member 'ABP_StickOfFire_Projectile_C::DotDuration' has a wrong offset!");
static_assert(offsetof(ABP_StickOfFire_Projectile_C, DamagePerTick) == 0x000558, "Member 'ABP_StickOfFire_Projectile_C::DamagePerTick' has a wrong offset!");

}

