#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StickOfFire_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StickOfFire_Projectile.BP_StickOfFire_Projectile_C.DetermineSpawnLocationAndNormal
// 0x0240 (0x0240 - 0x0000)
struct BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Location;                                          // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0110(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal) == 0x000008, "Wrong alignment on BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal");
static_assert(sizeof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal) == 0x000240, "Wrong size on BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, Hit) == 0x000000, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::Hit' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, Location) == 0x0000F8, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::Location' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, Normal) == 0x000110, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::Normal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_bBlockingHit) == 0x000128, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_bInitialOverlap) == 0x000129, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_Time) == 0x00012C, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_Distance) == 0x000130, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_Location) == 0x000138, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_ImpactPoint) == 0x000150, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_Normal) == 0x000168, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_ImpactNormal) == 0x000180, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_PhysMat) == 0x000198, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_HitActor) == 0x0001A0, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_HitComponent) == 0x0001A8, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_HitBoneName) == 0x0001B0, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_BoneName) == 0x0001B8, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_TraceStart) == 0x0001D0, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_BreakHitResult_TraceEnd) == 0x0001E8, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000200, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_GetActorUpVector_ReturnValue) == 0x000210, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000228, "Member 'BP_StickOfFire_Projectile_C_DetermineSpawnLocationAndNormal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_StickOfFire_Projectile.BP_StickOfFire_Projectile_C.ExecuteUbergraph_BP_StickOfFire_Projectile
// 0x00E0 (0x00E0 - 0x0000)
struct BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_SpawnLocation;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal;                         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_CustomEvent_OwningPlayerState;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FireSpot_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile) == 0x000010, "Wrong alignment on BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile");
static_assert(sizeof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile) == 0x0000E0, "Wrong size on BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, EntryPoint) == 0x000000, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, K2Node_CustomEvent_SpawnLocation) == 0x000008, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::K2Node_CustomEvent_SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, K2Node_CustomEvent_Normal) == 0x000020, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::K2Node_CustomEvent_Normal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, K2Node_CustomEvent_OwningPlayerState) == 0x000038, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::K2Node_CustomEvent_OwningPlayerState' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_MakeRotFromZ_ReturnValue) == 0x000040, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_GetInstigator_ReturnValue) == 0x0000C0, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C8, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x0000D8, "Member 'BP_StickOfFire_Projectile_C_ExecuteUbergraph_BP_StickOfFire_Projectile::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");

// Function BP_StickOfFire_Projectile.BP_StickOfFire_Projectile_C.SpawnFireSpot
// 0x0038 (0x0038 - 0x0000)
struct BP_StickOfFire_Projectile_C_SpawnFireSpot final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           OwningPlayerState;                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickOfFire_Projectile_C_SpawnFireSpot) == 0x000008, "Wrong alignment on BP_StickOfFire_Projectile_C_SpawnFireSpot");
static_assert(sizeof(BP_StickOfFire_Projectile_C_SpawnFireSpot) == 0x000038, "Wrong size on BP_StickOfFire_Projectile_C_SpawnFireSpot");
static_assert(offsetof(BP_StickOfFire_Projectile_C_SpawnFireSpot, SpawnLocation) == 0x000000, "Member 'BP_StickOfFire_Projectile_C_SpawnFireSpot::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_SpawnFireSpot, Normal) == 0x000018, "Member 'BP_StickOfFire_Projectile_C_SpawnFireSpot::Normal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_SpawnFireSpot, OwningPlayerState) == 0x000030, "Member 'BP_StickOfFire_Projectile_C_SpawnFireSpot::OwningPlayerState' has a wrong offset!");

// Function BP_StickOfFire_Projectile.BP_StickOfFire_Projectile_C.HandleProjectileStop
// 0x0130 (0x0130 - 0x0000)
struct BP_StickOfFire_Projectile_C_HandleProjectileStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_DetermineSpawnLocationAndNormal_Location; // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DetermineSpawnLocationAndNormal_Normal;   // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickOfFire_Projectile_C_HandleProjectileStop) == 0x000008, "Wrong alignment on BP_StickOfFire_Projectile_C_HandleProjectileStop");
static_assert(sizeof(BP_StickOfFire_Projectile_C_HandleProjectileStop) == 0x000130, "Wrong size on BP_StickOfFire_Projectile_C_HandleProjectileStop");
static_assert(offsetof(BP_StickOfFire_Projectile_C_HandleProjectileStop, Hit) == 0x000000, "Member 'BP_StickOfFire_Projectile_C_HandleProjectileStop::Hit' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_HandleProjectileStop, CallFunc_DetermineSpawnLocationAndNormal_Location) == 0x0000F8, "Member 'BP_StickOfFire_Projectile_C_HandleProjectileStop::CallFunc_DetermineSpawnLocationAndNormal_Location' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_HandleProjectileStop, CallFunc_DetermineSpawnLocationAndNormal_Normal) == 0x000110, "Member 'BP_StickOfFire_Projectile_C_HandleProjectileStop::CallFunc_DetermineSpawnLocationAndNormal_Normal' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_HandleProjectileStop, CallFunc_HasAuthority_ReturnValue) == 0x000128, "Member 'BP_StickOfFire_Projectile_C_HandleProjectileStop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickOfFire_Projectile_C_HandleProjectileStop, CallFunc_Not_PreBool_ReturnValue) == 0x000129, "Member 'BP_StickOfFire_Projectile_C_HandleProjectileStop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

