#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShopInteraction

#include "Basic.hpp"

#include "InteractableBase_classes.hpp"
#include "Engine_structs.hpp"
#include "E_ShopType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShopInteraction.BP_ShopInteraction_C
// 0x0060 (0x0340 - 0x02E0)
class ABP_ShopInteraction_C final : public AInteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ShopInteraction_C;               // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGroundskeeperReference*                GroundskeeperReference;                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    ShopType;                                          // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NotYourProperty;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_RoomManager_C*                      AssociatedRoomManager;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Radial;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ShopOpened;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             OpenSound;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DebugLogShopInteraction(class Abp_groundskeeper_C* GroundsKeeper);
	void ExecuteUbergraph_BP_ShopInteraction(int32 EntryPoint);
	void GetTeamShopManager(class UObject* InteractingActor_0, class ABP_ResidentCharacter_C** AsALS_Synthy_Character_BP);
	void IsInteractingActorOnPhoneTeam(class ABP_ResidentCharacter_C* ResidentCharacter, bool* SameTeam);
	void Play_Shop_Open_Sound(const struct FVector& Location, class AActor* InteractingActor_0);
	void PostInteract(class AActor* InteractingActor_0, class UPrimitiveComponent* InteractionComponent);
	void ShopOpened__DelegateSignature(class AActor* InteractingActor_0);

	struct FTeam GetTeam() const;
	uint8 GetTeamID() const;
	bool HasTeam() const;
	bool IsAvailableForEnemyTeam(class UPrimitiveComponent* InteractionComponent) const;
	bool TakeDamageFromAllTeams() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShopInteraction_C">();
	}
	static class ABP_ShopInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShopInteraction_C>();
	}
};
static_assert(alignof(ABP_ShopInteraction_C) == 0x000008, "Wrong alignment on ABP_ShopInteraction_C");
static_assert(sizeof(ABP_ShopInteraction_C) == 0x000340, "Wrong size on ABP_ShopInteraction_C");
static_assert(offsetof(ABP_ShopInteraction_C, UberGraphFrame_BP_ShopInteraction_C) == 0x0002E0, "Member 'ABP_ShopInteraction_C::UberGraphFrame_BP_ShopInteraction_C' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, GroundskeeperReference) == 0x0002E8, "Member 'ABP_ShopInteraction_C::GroundskeeperReference' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, Billboard) == 0x0002F0, "Member 'ABP_ShopInteraction_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, Box) == 0x0002F8, "Member 'ABP_ShopInteraction_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, ShopType) == 0x000300, "Member 'ABP_ShopInteraction_C::ShopType' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, NotYourProperty) == 0x000308, "Member 'ABP_ShopInteraction_C::NotYourProperty' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, AssociatedRoomManager) == 0x000318, "Member 'ABP_ShopInteraction_C::AssociatedRoomManager' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, Radial) == 0x000320, "Member 'ABP_ShopInteraction_C::Radial' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, ShopOpened) == 0x000328, "Member 'ABP_ShopInteraction_C::ShopOpened' has a wrong offset!");
static_assert(offsetof(ABP_ShopInteraction_C, OpenSound) == 0x000338, "Member 'ABP_ShopInteraction_C::OpenSound' has a wrong offset!");

}

