#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SlingProjectile_Decoy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SlingProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SlingProjectile_Decoy.BP_SlingProjectile_Decoy_C
// 0x0020 (0x0560 - 0x0540)
class ABP_SlingProjectile_Decoy_C final : public ABP_SlingProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SlingProjectile_Decoy_C;         // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FuseAudio;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SlingProjectile_Decoy(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn_Decoy_Firecracker(const struct FVector& Location, const struct FVector& Normal);
	void DamageTarget(const struct FHitResult& Hit, class UAbilitySystemComponent* Instigator_Ability_System_Component, class UAbilitySystemComponent* Hit_Actor_Ability_System_Component);
	void DeactivatePooledActor();
	void HandleProjectileStop(const struct FHitResult& Hit);
	void PooledBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SlingProjectile_Decoy_C">();
	}
	static class ABP_SlingProjectile_Decoy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SlingProjectile_Decoy_C>();
	}
};
static_assert(alignof(ABP_SlingProjectile_Decoy_C) == 0x000008, "Wrong alignment on ABP_SlingProjectile_Decoy_C");
static_assert(sizeof(ABP_SlingProjectile_Decoy_C) == 0x000560, "Wrong size on ABP_SlingProjectile_Decoy_C");
static_assert(offsetof(ABP_SlingProjectile_Decoy_C, UberGraphFrame_BP_SlingProjectile_Decoy_C) == 0x000540, "Member 'ABP_SlingProjectile_Decoy_C::UberGraphFrame_BP_SlingProjectile_Decoy_C' has a wrong offset!");
static_assert(offsetof(ABP_SlingProjectile_Decoy_C, FuseAudio) == 0x000548, "Member 'ABP_SlingProjectile_Decoy_C::FuseAudio' has a wrong offset!");
static_assert(offsetof(ABP_SlingProjectile_Decoy_C, Niagara) == 0x000550, "Member 'ABP_SlingProjectile_Decoy_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_SlingProjectile_Decoy_C, RotatingMovement) == 0x000558, "Member 'ABP_SlingProjectile_Decoy_C::RotatingMovement' has a wrong offset!");

}

