#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Seagull130_Path

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Seagull130_Path.BP_Seagull130_Path_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_Seagull130_Path_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplinePath;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Seagull130_Path_C">();
	}
	static class ABP_Seagull130_Path_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Seagull130_Path_C>();
	}
};
static_assert(alignof(ABP_Seagull130_Path_C) == 0x000008, "Wrong alignment on ABP_Seagull130_Path_C");
static_assert(sizeof(ABP_Seagull130_Path_C) == 0x0002A8, "Wrong size on ABP_Seagull130_Path_C");
static_assert(offsetof(ABP_Seagull130_Path_C, Billboard) == 0x000290, "Member 'ABP_Seagull130_Path_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Seagull130_Path_C, SplinePath) == 0x000298, "Member 'ABP_Seagull130_Path_C::SplinePath' has a wrong offset!");
static_assert(offsetof(ABP_Seagull130_Path_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_Seagull130_Path_C::DefaultSceneRoot' has a wrong offset!");

}

