#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_Trajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bp_Trajectory.Bp_Trajectory_C.ExecuteUbergraph_Bp_Trajectory
// 0x04B0 (0x04B0 - 0x0000)
struct Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGravityScale_GravityScale;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetStartPositionTransform_StartTransform; // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_Velocity;                     // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit; // 0x01B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions; // 0x02B0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination; // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0390(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OverrideGravityZ_ImplicitCast; // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory) == 0x000010, "Wrong alignment on Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory");
static_assert(sizeof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory) == 0x0004B0, "Wrong size on Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, EntryPoint) == 0x000000, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, Temp_int_Variable) == 0x000070, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, K2Node_Event_DeltaSeconds) == 0x000094, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, Temp_int_Variable_1) == 0x000098, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_GetGravityScale_GravityScale) == 0x0000A0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_GetGravityScale_GravityScale' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_GetStartPositionTransform_StartTransform) == 0x0000C0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_GetStartPositionTransform_StartTransform' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_GetVelocity_Velocity) == 0x000120, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_GetVelocity_Velocity' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_BreakTransform_Location) == 0x000138, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_BreakTransform_Rotation) == 0x000150, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_BreakTransform_Scale) == 0x000168, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Add_ReturnValue) == 0x000180, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_MakeVector2D_ReturnValue) == 0x000188, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000198, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, K2Node_MakeArray_Array) == 0x0001A0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit) == 0x0001B8, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions) == 0x0002B0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination) == 0x0002C0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue) == 0x0002D8, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Get_Item_1) == 0x0002E0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Get_Item_2) == 0x0002F8, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Length_ReturnValue) == 0x000310, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000318, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000330, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Normal_ReturnValue) == 0x000338, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000350, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000358, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000360, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_SafeDivide_ReturnValue) == 0x000368, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Get_Item_3) == 0x000370, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Lerp_ReturnValue) == 0x000388, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000390, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_MakeVector2D_ReturnValue_1) == 0x000488, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Greater_IntInt_ReturnValue) == 0x000498, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Array_Length_ReturnValue_1) == 0x00049C, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Less_IntInt_ReturnValue) == 0x0004A0, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OverrideGravityZ_ImplicitCast) == 0x0004A4, "Member 'Bp_Trajectory_C_ExecuteUbergraph_Bp_Trajectory::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OverrideGravityZ_ImplicitCast' has a wrong offset!");

// Function Bp_Trajectory.Bp_Trajectory_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Bp_Trajectory_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_Trajectory_C_ReceiveTick) == 0x000004, "Wrong alignment on Bp_Trajectory_C_ReceiveTick");
static_assert(sizeof(Bp_Trajectory_C_ReceiveTick) == 0x000004, "Wrong size on Bp_Trajectory_C_ReceiveTick");
static_assert(offsetof(Bp_Trajectory_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Bp_Trajectory_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

