#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrashCanLid_Equipable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TrashCanLid_Equipable.BP_TrashCanLid_Equipable_C.Cosmetics
// 0x0018 (0x0018 - 0x0000)
struct BP_TrashCanLid_Equipable_C_Cosmetics final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrashCanLid_Equipable_C_Cosmetics) == 0x000008, "Wrong alignment on BP_TrashCanLid_Equipable_C_Cosmetics");
static_assert(sizeof(BP_TrashCanLid_Equipable_C_Cosmetics) == 0x000018, "Wrong size on BP_TrashCanLid_Equipable_C_Cosmetics");
static_assert(offsetof(BP_TrashCanLid_Equipable_C_Cosmetics, Location) == 0x000000, "Member 'BP_TrashCanLid_Equipable_C_Cosmetics::Location' has a wrong offset!");

// Function BP_TrashCanLid_Equipable.BP_TrashCanLid_Equipable_C.ExecuteUbergraph_BP_TrashCanLid_Equipable
// 0x0020 (0x0020 - 0x0000)
struct BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable) == 0x000008, "Wrong alignment on BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable");
static_assert(sizeof(BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable) == 0x000020, "Wrong size on BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable");
static_assert(offsetof(BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable, EntryPoint) == 0x000000, "Member 'BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable, K2Node_CustomEvent_Location) == 0x000008, "Member 'BP_TrashCanLid_Equipable_C_ExecuteUbergraph_BP_TrashCanLid_Equipable::K2Node_CustomEvent_Location' has a wrong offset!");

}

