#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamShopManager

#include "Basic.hpp"

#include "S_ShopItem_structs.hpp"


namespace SDK::Params
{

// Function BP_TeamShopManager.BP_TeamShopManager_C.Add Data Table Entries to Array
// 0x0070 (0x0070 - 0x0000)
struct BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ShopItem>                    TargetArray;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ShopItem                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array");
static_assert(sizeof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array) == 0x000070, "Wrong size on BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, DataTable) == 0x000000, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::DataTable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, TargetArray) == 0x000008, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::TargetArray' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_Array_Get_Item) == 0x00003C, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_TeamShopManager_C_Add_Data_Table_Entries_to_Array::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.ExecuteUbergraph_BP_TeamShopManager
// 0x0040 (0x0040 - 0x0000)
struct BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager");
static_assert(sizeof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager) == 0x000040, "Wrong size on BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, EntryPoint) == 0x000000, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_TeamShopManager_C_ExecuteUbergraph_BP_TeamShopManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.OnRep_ItemsInBedroom
// 0x0038 (0x0038 - 0x0000)
struct BP_TeamShopManager_C_OnRep_ItemsInBedroom final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_OnRep_ItemsInBedroom) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_OnRep_ItemsInBedroom");
static_assert(sizeof(BP_TeamShopManager_C_OnRep_ItemsInBedroom) == 0x000038, "Wrong size on BP_TeamShopManager_C_OnRep_ItemsInBedroom");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInBedroom, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamShopManager_C_OnRep_ItemsInBedroom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.OnRep_ItemsInGarage
// 0x0038 (0x0038 - 0x0000)
struct BP_TeamShopManager_C_OnRep_ItemsInGarage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_OnRep_ItemsInGarage) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_OnRep_ItemsInGarage");
static_assert(sizeof(BP_TeamShopManager_C_OnRep_ItemsInGarage) == 0x000038, "Wrong size on BP_TeamShopManager_C_OnRep_ItemsInGarage");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInGarage, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamShopManager_C_OnRep_ItemsInGarage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.OnRep_ItemsInKitchen
// 0x0038 (0x0038 - 0x0000)
struct BP_TeamShopManager_C_OnRep_ItemsInKitchen final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_OnRep_ItemsInKitchen) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_OnRep_ItemsInKitchen");
static_assert(sizeof(BP_TeamShopManager_C_OnRep_ItemsInKitchen) == 0x000038, "Wrong size on BP_TeamShopManager_C_OnRep_ItemsInKitchen");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInKitchen, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamShopManager_C_OnRep_ItemsInKitchen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.OnRep_ItemsInPhone
// 0x0038 (0x0038 - 0x0000)
struct BP_TeamShopManager_C_OnRep_ItemsInPhone final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_OnRep_ItemsInPhone) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_OnRep_ItemsInPhone");
static_assert(sizeof(BP_TeamShopManager_C_OnRep_ItemsInPhone) == 0x000038, "Wrong size on BP_TeamShopManager_C_OnRep_ItemsInPhone");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInPhone, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamShopManager_C_OnRep_ItemsInPhone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamShopManager.BP_TeamShopManager_C.OnRep_ItemsInToolShed
// 0x0038 (0x0038 - 0x0000)
struct BP_TeamShopManager_C_OnRep_ItemsInToolShed final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Shop_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Shop_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamShopManager_C_OnRep_ItemsInToolShed) == 0x000008, "Wrong alignment on BP_TeamShopManager_C_OnRep_ItemsInToolShed");
static_assert(sizeof(BP_TeamShopManager_C_OnRep_ItemsInToolShed) == 0x000038, "Wrong size on BP_TeamShopManager_C_OnRep_ItemsInToolShed");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamShopManager_C_OnRep_ItemsInToolShed, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_TeamShopManager_C_OnRep_ItemsInToolShed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

