#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_ThrowableProp_Small

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Bp_ThrowableProp_Small_C_BndEvt__Bp_ThrowableProp_Small_StaticMeshComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.CanActivateTrap
// 0x0001 (0x0001 - 0x0000)
struct Bp_ThrowableProp_Small_C_CanActivateTrap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_CanActivateTrap) == 0x000001, "Wrong alignment on Bp_ThrowableProp_Small_C_CanActivateTrap");
static_assert(sizeof(Bp_ThrowableProp_Small_C_CanActivateTrap) == 0x000001, "Wrong size on Bp_ThrowableProp_Small_C_CanActivateTrap");
static_assert(offsetof(Bp_ThrowableProp_Small_C_CanActivateTrap, ReturnValue) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_CanActivateTrap::ReturnValue' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.ExecuteUbergraph_Bp_ThrowableProp_Small
// 0x0330 (0x0330 - 0x0000)
struct Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_SleepingComponent;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_WakingComponent;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeSquared_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* WakingComponent, class FName BoneName)> K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingPlayer_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue_1;                // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeSquared_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue_1;   // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingHeld_ReturnValue_2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_LaunchVelocity;                 // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* SleepingComponent, class FName BoneName)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Knockbackable_C>    K2Node_DynamicCast_AsI_Knockbackable;              // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Knockback_Void;                           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01A8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Character;                      // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x030C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0320(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small");
static_assert(sizeof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small) == 0x000330, "Wrong size on Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, EntryPoint) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_Has_Been_Initd_Variable_2) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_SleepingComponent) == 0x000010, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_SleepingComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_BoneName_1) == 0x000018, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_WakingComponent) == 0x000020, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_WakingComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_BoneName) == 0x000028, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, Temp_bool_IsClosed_Variable_2) == 0x000030, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x000038, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_VSizeSquared_ReturnValue) == 0x000050, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_IsOverlappingPlayer_ReturnValue) == 0x00006C, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_IsOverlappingPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_BooleanOR_ReturnValue) == 0x00006D, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_IsBeingHeld_ReturnValue) == 0x00006E, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_IsBeingHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_IsBeingHeld_ReturnValue_1) == 0x00006F, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_IsBeingHeld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GetVelocity_ReturnValue) == 0x000070, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_VSizeSquared_ReturnValue_1) == 0x0000A0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_VSizeSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Normal_ReturnValue) == 0x0000A8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000E0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GetPhysicsLinearVelocity_ReturnValue_1) == 0x0000F8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GetPhysicsLinearVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000110, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_IsBeingHeld_ReturnValue_2) == 0x000128, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_IsBeingHeld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_TargetActor) == 0x000130, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_LaunchVelocity) == 0x000138, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_LaunchVelocity' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_DynamicCast_AsCharacter) == 0x000150, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_DynamicCast_AsI_Knockbackable) == 0x000170, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_DynamicCast_AsI_Knockbackable' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_Knockback_Void) == 0x000181, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_Knockback_Void' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000188, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000190, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000198, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0001A0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001A4, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_SweepResult) == 0x0001A8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002A0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherActor) == 0x0002A8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherComp) == 0x0002B0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002B8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_DoesImplementInterface_ReturnValue) == 0x0002BC, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CustomEvent_Character) == 0x0002C0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002C8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002CC, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_BooleanAND_ReturnValue) == 0x0002DC, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002E0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x0002E8, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F0, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000308, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, K2Node_CreateDelegate_OutputDelegate_3) == 0x00030C, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000320, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000328, "Member 'Bp_ThrowableProp_Small_C_ExecuteUbergraph_Bp_ThrowableProp_Small::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.GetLocalExtent
// 0x00B0 (0x00B0 - 0x0000)
struct Bp_ThrowableProp_Small_C_GetLocalExtent final
{
public:
	class UStaticMeshComponent*                   InputValue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue_1;              // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_GetLocalExtent) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_GetLocalExtent");
static_assert(sizeof(Bp_ThrowableProp_Small_C_GetLocalExtent) == 0x0000B0, "Wrong size on Bp_ThrowableProp_Small_C_GetLocalExtent");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, InputValue) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::InputValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, ReturnValue) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_GetLocalBounds_Min) == 0x000020, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_GetLocalBounds_Max) == 0x000038, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_Vector_GetAbs_ReturnValue) == 0x000050, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_Vector_GetAbs_ReturnValue_1) == 0x000068, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_Vector_GetAbs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_GetLocalExtent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'Bp_ThrowableProp_Small_C_GetLocalExtent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.IsOverlappingPlayer
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Small_C_IsOverlappingPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_IsOverlappingPlayer");
static_assert(sizeof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer) == 0x000020, "Wrong size on Bp_ThrowableProp_Small_C_IsOverlappingPlayer");
static_assert(offsetof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer, ReturnValue) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_IsOverlappingPlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_IsOverlappingPlayer::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Bp_ThrowableProp_Small_C_IsOverlappingPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_IsOverlappingPlayer, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'Bp_ThrowableProp_Small_C_IsOverlappingPlayer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.PlayerCollision
// 0x0001 (0x0001 - 0x0000)
struct Bp_ThrowableProp_Small_C_PlayerCollision final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_PlayerCollision) == 0x000001, "Wrong alignment on Bp_ThrowableProp_Small_C_PlayerCollision");
static_assert(sizeof(Bp_ThrowableProp_Small_C_PlayerCollision) == 0x000001, "Wrong size on Bp_ThrowableProp_Small_C_PlayerCollision");
static_assert(offsetof(Bp_ThrowableProp_Small_C_PlayerCollision, Enabled) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_PlayerCollision::Enabled' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.ServerPush
// 0x0020 (0x0020 - 0x0000)
struct Bp_ThrowableProp_Small_C_ServerPush final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchVelocity;                                    // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_ServerPush) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_ServerPush");
static_assert(sizeof(Bp_ThrowableProp_Small_C_ServerPush) == 0x000020, "Wrong size on Bp_ThrowableProp_Small_C_ServerPush");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ServerPush, TargetActor) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_ServerPush::TargetActor' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_ServerPush, LaunchVelocity) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_ServerPush::LaunchVelocity' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.SetReleaserTemp
// 0x0008 (0x0008 - 0x0000)
struct Bp_ThrowableProp_Small_C_SetReleaserTemp final
{
public:
	class UObject*                                Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_SetReleaserTemp) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_SetReleaserTemp");
static_assert(sizeof(Bp_ThrowableProp_Small_C_SetReleaserTemp) == 0x000008, "Wrong size on Bp_ThrowableProp_Small_C_SetReleaserTemp");
static_assert(offsetof(Bp_ThrowableProp_Small_C_SetReleaserTemp, Character) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_SetReleaserTemp::Character' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.Sleep
// 0x0010 (0x0010 - 0x0000)
struct Bp_ThrowableProp_Small_C_Sleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_Sleep) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_Sleep");
static_assert(sizeof(Bp_ThrowableProp_Small_C_Sleep) == 0x000010, "Wrong size on Bp_ThrowableProp_Small_C_Sleep");
static_assert(offsetof(Bp_ThrowableProp_Small_C_Sleep, SleepingComponent) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_Sleep::SleepingComponent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_Sleep, BoneName) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_Sleep::BoneName' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.Try Drop Object
// 0x0018 (0x0018 - 0x0000)
struct Bp_ThrowableProp_Small_C_Try_Drop_Object final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_Try_Drop_Object) == 0x000008, "Wrong alignment on Bp_ThrowableProp_Small_C_Try_Drop_Object");
static_assert(sizeof(Bp_ThrowableProp_Small_C_Try_Drop_Object) == 0x000018, "Wrong size on Bp_ThrowableProp_Small_C_Try_Drop_Object");
static_assert(offsetof(Bp_ThrowableProp_Small_C_Try_Drop_Object, Character) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_Try_Drop_Object::Character' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_Try_Drop_Object, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_Try_Drop_Object::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_Try_Drop_Object, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Bp_ThrowableProp_Small_C_Try_Drop_Object::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Bp_ThrowableProp_Small.Bp_ThrowableProp_Small_C.UserConstructionScript
// 0x02F0 (0x02F0 - 0x0000)
struct Bp_ThrowableProp_Small_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalExtent_ReturnValue;               // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Bp_ThrowableProp_Small_C_UserConstructionScript) == 0x000010, "Wrong alignment on Bp_ThrowableProp_Small_C_UserConstructionScript");
static_assert(sizeof(Bp_ThrowableProp_Small_C_UserConstructionScript) == 0x0002F0, "Wrong size on Bp_ThrowableProp_Small_C_UserConstructionScript");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000008, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x000020, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x000038, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x00003C, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x0000C0, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x0000D8, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x0000F0, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_TransformLocation_ReturnValue) == 0x000170, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin_1) == 0x000188, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent_1) == 0x0001A0, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius_1) == 0x0001B8, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(Bp_ThrowableProp_Small_C_UserConstructionScript, CallFunc_GetLocalExtent_ReturnValue) == 0x0001C0, "Member 'Bp_ThrowableProp_Small_C_UserConstructionScript::CallFunc_GetLocalExtent_ReturnValue' has a wrong offset!");
