#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_TitleFenceDestructionEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FieldSystemEngine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_TitleFenceDestructionEffect.Bp_TitleFenceDestructionEffect_C
// 0x0030 (0x02C8 - 0x0298)
class ABp_TitleFenceDestructionEffect_C final : public AFieldSystemActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloff;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DestructionMagnitude;                              // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForceMagnitude;                                    // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularMagnitude;                                  // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_TitleFenceDestructionEffect(int32 EntryPoint);
	void Detonate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_TitleFenceDestructionEffect_C">();
	}
	static class ABp_TitleFenceDestructionEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_TitleFenceDestructionEffect_C>();
	}
};
static_assert(alignof(ABp_TitleFenceDestructionEffect_C) == 0x000008, "Wrong alignment on ABp_TitleFenceDestructionEffect_C");
static_assert(sizeof(ABp_TitleFenceDestructionEffect_C) == 0x0002C8, "Wrong size on ABp_TitleFenceDestructionEffect_C");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, UberGraphFrame) == 0x000298, "Member 'ABp_TitleFenceDestructionEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, Sphere) == 0x0002A0, "Member 'ABp_TitleFenceDestructionEffect_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, RadialVector) == 0x0002A8, "Member 'ABp_TitleFenceDestructionEffect_C::RadialVector' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, RadialFalloff) == 0x0002B0, "Member 'ABp_TitleFenceDestructionEffect_C::RadialFalloff' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, DestructionMagnitude) == 0x0002B8, "Member 'ABp_TitleFenceDestructionEffect_C::DestructionMagnitude' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, ForceMagnitude) == 0x0002BC, "Member 'ABp_TitleFenceDestructionEffect_C::ForceMagnitude' has a wrong offset!");
static_assert(offsetof(ABp_TitleFenceDestructionEffect_C, AngularMagnitude) == 0x0002C0, "Member 'ABp_TitleFenceDestructionEffect_C::AngularMagnitude' has a wrong offset!");

}

