#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamShopManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_ShopItem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeamShopManager.BP_TeamShopManager_C
// 0x0080 (0x0310 - 0x0290)
class ABP_TeamShopManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Player;                                            // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ShopItem>                    ItemsInGarage;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    ItemsInPhone;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    ItemsInToolShed;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    ItemsInBathroom;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, Deprecated, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    ItemsInKitchen;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	TArray<struct FS_ShopItem>                    ItemsInBedroom;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)

public:
	void Add_Data_Table_Entries_to_Array(class UDataTable* DataTable, const TArray<struct FS_ShopItem>& TargetArray);
	void ExecuteUbergraph_BP_TeamShopManager(int32 EntryPoint);
	void OnRep_ItemsInBedroom();
	void OnRep_ItemsInGarage();
	void OnRep_ItemsInKitchen();
	void OnRep_ItemsInPhone();
	void OnRep_ItemsInToolShed();
	void ReceiveBeginPlay();
	void UpdateShopItems();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TeamShopManager_C">();
	}
	static class ABP_TeamShopManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TeamShopManager_C>();
	}
};
static_assert(alignof(ABP_TeamShopManager_C) == 0x000008, "Wrong alignment on ABP_TeamShopManager_C");
static_assert(sizeof(ABP_TeamShopManager_C) == 0x000310, "Wrong size on ABP_TeamShopManager_C");
static_assert(offsetof(ABP_TeamShopManager_C, UberGraphFrame) == 0x000290, "Member 'ABP_TeamShopManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, Billboard) == 0x000298, "Member 'ABP_TeamShopManager_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_TeamShopManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ID) == 0x0002A8, "Member 'ABP_TeamShopManager_C::ID' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, Player) == 0x0002AC, "Member 'ABP_TeamShopManager_C::Player' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInGarage) == 0x0002B0, "Member 'ABP_TeamShopManager_C::ItemsInGarage' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInPhone) == 0x0002C0, "Member 'ABP_TeamShopManager_C::ItemsInPhone' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInToolShed) == 0x0002D0, "Member 'ABP_TeamShopManager_C::ItemsInToolShed' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInBathroom) == 0x0002E0, "Member 'ABP_TeamShopManager_C::ItemsInBathroom' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInKitchen) == 0x0002F0, "Member 'ABP_TeamShopManager_C::ItemsInKitchen' has a wrong offset!");
static_assert(offsetof(ABP_TeamShopManager_C, ItemsInBedroom) == 0x000300, "Member 'ABP_TeamShopManager_C::ItemsInBedroom' has a wrong offset!");

}

