#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_TransformSyncLiteComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.CalculateTickGroup
// 0x0020 (0x0020 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_CalculateTickGroup final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_CalculateTickGroup");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup) == 0x000020, "Wrong size on Bp_TransformSyncLiteComponent_C_CalculateTickGroup");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup, Distance) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_CalculateTickGroup::Distance' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup, ReturnValue) == 0x000008, "Member 'Bp_TransformSyncLiteComponent_C_CalculateTickGroup::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'Bp_TransformSyncLiteComponent_C_CalculateTickGroup::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup, CallFunc_FFloor_ReturnValue) == 0x000018, "Member 'Bp_TransformSyncLiteComponent_C_CalculateTickGroup::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_CalculateTickGroup, CallFunc_Min_ReturnValue) == 0x00001C, "Member 'Bp_TransformSyncLiteComponent_C_CalculateTickGroup::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.ComponentSleep
// 0x0010 (0x0010 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_ComponentSleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_ComponentSleep) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_ComponentSleep");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_ComponentSleep) == 0x000010, "Wrong size on Bp_TransformSyncLiteComponent_C_ComponentSleep");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ComponentSleep, SleepingComponent) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_ComponentSleep::SleepingComponent' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ComponentSleep, BoneName) == 0x000008, "Member 'Bp_TransformSyncLiteComponent_C_ComponentSleep::BoneName' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.ComponentWake
// 0x0010 (0x0010 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_ComponentWake final
{
public:
	class UPrimitiveComponent*                    WakingComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_ComponentWake) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_ComponentWake");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_ComponentWake) == 0x000010, "Wrong size on Bp_TransformSyncLiteComponent_C_ComponentWake");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ComponentWake, WakingComponent) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_ComponentWake::WakingComponent' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ComponentWake, BoneName) == 0x000008, "Member 'Bp_TransformSyncLiteComponent_C_ComponentWake::BoneName' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.Enable Sync
// 0x0002 (0x0002 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_Enable_Sync final
{
public:
	bool                                          Enabled_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_Enable_Sync) == 0x000001, "Wrong alignment on Bp_TransformSyncLiteComponent_C_Enable_Sync");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_Enable_Sync) == 0x000002, "Wrong size on Bp_TransformSyncLiteComponent_C_Enable_Sync");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_Enable_Sync, Enabled_0) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_Enable_Sync::Enabled_0' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_Enable_Sync, CallFunc_IsServer_ReturnValue) == 0x000001, "Member 'Bp_TransformSyncLiteComponent_C_Enable_Sync::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.EnableRelativeSync
// 0x0008 (0x0008 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_EnableRelativeSync final
{
public:
	class UPrimitiveComponent*                    RelativeComponent_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_EnableRelativeSync) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_EnableRelativeSync");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_EnableRelativeSync) == 0x000008, "Wrong size on Bp_TransformSyncLiteComponent_C_EnableRelativeSync");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_EnableRelativeSync, RelativeComponent_0) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_EnableRelativeSync::RelativeComponent_0' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.ExecuteUbergraph_Bp_TransformSyncLiteComponent
// 0x0238 (0x0238 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_SleepingComponent;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_WakingComponent;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* WakingComponent, class FName BoneName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize10                  K2Node_CustomEvent_InLocation_1;                   // 0x0068(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  K2Node_CustomEvent_InRotation_1;                   // 0x0080(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_CustomEvent_LinearVelocity_1;               // 0x0098(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_CustomEvent_AngularVelocity_1;              // 0x00B0(0x0018)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_RelativeComponent;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDefaultTickRate_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  K2Node_CustomEvent_InLocation;                     // 0x00D8(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  K2Node_CustomEvent_InRotation;                     // 0x00F0(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_CustomEvent_LinearVelocity;                 // 0x0108(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_CustomEvent_AngularVelocity;                // 0x0120(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue;     // 0x0198(0x0018)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_1;   // 0x01C8(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSimulating;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* SleepingComponent, class FName BoneName)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LocalDeltaSeconds_ImplicitCast; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_X_ImplicitCast;  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Y_ImplicitCast;  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Z_ImplicitCast;  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent) == 0x000238, "Wrong size on Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, EntryPoint) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_IsValid_ReturnValue_2) == 0x000010, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000018, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_DynamicCast_AsPrimitive_Component) == 0x000020, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_SleepingComponent) == 0x000030, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_SleepingComponent' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_BoneName_1) == 0x000038, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_WakingComponent) == 0x000040, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_WakingComponent' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_BoneName) == 0x000048, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_InLocation_1) == 0x000068, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_InLocation_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_InRotation_1) == 0x000080, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_InRotation_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_LinearVelocity_1) == 0x000098, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_LinearVelocity_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_AngularVelocity_1) == 0x0000B0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_AngularVelocity_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_RelativeComponent) == 0x0000C8, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_RelativeComponent' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_GetDefaultTickRate_ReturnValue) == 0x0000D0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_GetDefaultTickRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_InLocation) == 0x0000D8, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_InLocation' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_InRotation) == 0x0000F0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_InRotation' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_LinearVelocity) == 0x000108, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_LinearVelocity' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_AngularVelocity) == 0x000120, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_AngularVelocity' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_IsServer_ReturnValue) == 0x000138, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_SetTimer_ReturnValue) == 0x000140, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000158, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakRotator_Roll) == 0x000170, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakRotator_Pitch) == 0x000174, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakRotator_Yaw) == 0x000178, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000180, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_MakeVector_NetQuantize10_ReturnValue) == 0x000198, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_MakeVector_NetQuantize10_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakVector_X) == 0x0001B0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakVector_Y) == 0x0001B8, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BreakVector_Z) == 0x0001C0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_MakeVector_NetQuantize10_ReturnValue_1) == 0x0001C8, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_MakeVector_NetQuantize10_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CustomEvent_IsSimulating) == 0x0001E0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CustomEvent_IsSimulating' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_BooleanAND_ReturnValue) == 0x0001E1, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_IsValid_ReturnValue_3) == 0x0001E2, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_SelectFloat_ReturnValue) == 0x0001E8, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F0, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000200, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, K2Node_VariableSet_LocalDeltaSeconds_ImplicitCast) == 0x000208, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::K2Node_VariableSet_LocalDeltaSeconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast) == 0x000210, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000214, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_MakeVector_NetQuantize10_X_ImplicitCast) == 0x000218, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_MakeVector_NetQuantize10_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_MakeVector_NetQuantize10_Y_ImplicitCast) == 0x000220, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_MakeVector_NetQuantize10_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_MakeVector_NetQuantize10_Z_ImplicitCast) == 0x000228, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_MakeVector_NetQuantize10_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000230, "Member 'Bp_TransformSyncLiteComponent_C_ExecuteUbergraph_Bp_TransformSyncLiteComponent::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.GetDefaultTickRate
// 0x0020 (0x0020 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_GetDefaultTickRate final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate) == 0x000008, "Wrong alignment on Bp_TransformSyncLiteComponent_C_GetDefaultTickRate");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate) == 0x000020, "Wrong size on Bp_TransformSyncLiteComponent_C_GetDefaultTickRate");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate, ReturnValue) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_GetDefaultTickRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'Bp_TransformSyncLiteComponent_C_GetDefaultTickRate::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'Bp_TransformSyncLiteComponent_C_GetDefaultTickRate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_GetDefaultTickRate, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'Bp_TransformSyncLiteComponent_C_GetDefaultTickRate::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.IsLocallyControlled
// 0x0001 (0x0001 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_IsLocallyControlled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_IsLocallyControlled) == 0x000001, "Wrong alignment on Bp_TransformSyncLiteComponent_C_IsLocallyControlled");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_IsLocallyControlled) == 0x000001, "Wrong size on Bp_TransformSyncLiteComponent_C_IsLocallyControlled");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_IsLocallyControlled, ReturnValue) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_IsLocallyControlled::ReturnValue' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on Bp_TransformSyncLiteComponent_C_ReceiveTick");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_ReceiveTick) == 0x000004, "Wrong size on Bp_TransformSyncLiteComponent_C_ReceiveTick");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Bp_TransformSyncLiteComponent.Bp_TransformSyncLiteComponent_C.ResetCoordinates
// 0x0490 (0x0490 - 0x0000)
struct Bp_TransformSyncLiteComponent_C_ResetCoordinates final
{
public:
	class UPrimitiveComponent*                    RelativeComponent_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_NetQuantize10_X;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_NetQuantize10_Y;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_NetQuantize10_Z;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue; // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue;     // 0x0270(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue;       // 0x0288(0x0018)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_1;   // 0x02B8(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue_1;  // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue_1; // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue_1;     // 0x0330(0x0018)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue_2;     // 0x0360(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue_1;   // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue_3;     // 0x03C0(0x0018)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_2;   // 0x03E8(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_3;   // 0x0430(0x0018)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_NetQuantize10_X_ImplicitCast;  // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Y_ImplicitCast;  // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Z_ImplicitCast;  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_X_ImplicitCast_1; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Y_ImplicitCast_1; // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_NetQuantize10_Z_ImplicitCast_1; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TransformSyncLiteComponent_C_ResetCoordinates) == 0x000010, "Wrong alignment on Bp_TransformSyncLiteComponent_C_ResetCoordinates");
static_assert(sizeof(Bp_TransformSyncLiteComponent_C_ResetCoordinates) == 0x000490, "Wrong size on Bp_TransformSyncLiteComponent_C_ResetCoordinates");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, RelativeComponent_0) == 0x000000, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::RelativeComponent_0' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000070, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_NetQuantize10_X) == 0x0000D8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_NetQuantize10_X' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_NetQuantize10_Y) == 0x0000E0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_NetQuantize10_Y' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_NetQuantize10_Z) == 0x0000E8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_NetQuantize10_Z' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeRotator_ReturnValue) == 0x0000F0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x000110, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000170, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue) == 0x0001D0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakTransform_Location) == 0x0001E8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakTransform_Rotation) == 0x000200, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakTransform_Scale) == 0x000218, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_InverseTransformDirection_ReturnValue) == 0x000230, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakRotator_Roll) == 0x000248, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakRotator_Pitch) == 0x00024C, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakRotator_Yaw) == 0x000250, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_X) == 0x000258, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Y) == 0x000260, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Z) == 0x000268, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeVector_NetQuantize10_ReturnValue) == 0x000270, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeVector_NetQuantize10_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeVector_NetQuantize_ReturnValue) == 0x000288, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeVector_NetQuantize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_X_1) == 0x0002A0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Y_1) == 0x0002A8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Z_1) == 0x0002B0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeVector_NetQuantize10_ReturnValue_1) == 0x0002B8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeVector_NetQuantize10_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_GetPhysicsLinearVelocity_ReturnValue) == 0x0002D0, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_GetPhysicsLinearVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_InverseTransformDirection_ReturnValue_1) == 0x0002E8, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_InverseTransformDirection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_X_2) == 0x000300, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Y_2) == 0x000308, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Z_2) == 0x000310, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue_1) == 0x000318, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_GetPhysicsAngularVelocityInRadians_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeVector_NetQuantize_ReturnValue_1) == 0x000330, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeVector_NetQuantize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_X_3) == 0x000348, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Y_3) == 0x000350, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_BreakVector_Z_3) == 0x000358, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_MakeVector_NetQuantize_ReturnValue_2) == 0x000360, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_MakeVector_NetQuantize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_TransformSyncLiteComponent_C_ResetCoordinates, CallFunc_GetPhysicsLinearVelocity_ReturnValue_1) == 0x000378, "Member 'Bp_TransformSyncLiteComponent_C_ResetCoordinates::CallFunc_GetPhysicsLinearVelocity_ReturnValue_1' has a wrong offset!");
