#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_Trajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bp_Trajectory.Bp_Trajectory_C
// 0x0058 (0x02E8 - 0x0290)
class ABp_Trajectory_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   EndPoint;                                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Trajectoryable_C>   OwningGA;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshes;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 Throwable;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Previous;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartScale;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndScale;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Bp_Trajectory(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bp_Trajectory_C">();
	}
	static class ABp_Trajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABp_Trajectory_C>();
	}
};
static_assert(alignof(ABp_Trajectory_C) == 0x000008, "Wrong alignment on ABp_Trajectory_C");
static_assert(sizeof(ABp_Trajectory_C) == 0x0002E8, "Wrong size on ABp_Trajectory_C");
static_assert(offsetof(ABp_Trajectory_C, UberGraphFrame) == 0x000290, "Member 'ABp_Trajectory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, EndPoint) == 0x000298, "Member 'ABp_Trajectory_C::EndPoint' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABp_Trajectory_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, OwningGA) == 0x0002A8, "Member 'ABp_Trajectory_C::OwningGA' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, SplineMeshes) == 0x0002B8, "Member 'ABp_Trajectory_C::SplineMeshes' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, Throwable) == 0x0002C8, "Member 'ABp_Trajectory_C::Throwable' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, Previous) == 0x0002D0, "Member 'ABp_Trajectory_C::Previous' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, StartScale) == 0x0002D8, "Member 'ABp_Trajectory_C::StartScale' has a wrong offset!");
static_assert(offsetof(ABp_Trajectory_C, EndScale) == 0x0002E0, "Member 'ABp_Trajectory_C::EndScale' has a wrong offset!");

}

