#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_TitleFenceDestructionEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_TitleFenceDestructionEffect.Bp_TitleFenceDestructionEffect_C.ExecuteUbergraph_Bp_TitleFenceDestructionEffect
// 0x0058 (0x0058 - 0x0000)
struct Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialFalloff*                         CallFunc_SetRadialFalloff_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_3;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect) == 0x000008, "Wrong alignment on Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect");
static_assert(sizeof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect) == 0x000058, "Wrong size on Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, EntryPoint) == 0x000000, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_SetRadialVector_ReturnValue) == 0x000028, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_GetScaledSphereRadius_ReturnValue) == 0x000030, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_GetScaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_SetRadialFalloff_ReturnValue) == 0x000038, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_SetRadialFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_SetRadialVector_ReturnValue_1) == 0x000040, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_SetRadialVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_Delay_Duration_ImplicitCast) == 0x000048, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_Delay_Duration_ImplicitCast_1) == 0x00004C, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_Delay_Duration_ImplicitCast_2) == 0x000050, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_Delay_Duration_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect, CallFunc_Delay_Duration_ImplicitCast_3) == 0x000054, "Member 'Bp_TitleFenceDestructionEffect_C_ExecuteUbergraph_Bp_TitleFenceDestructionEffect::CallFunc_Delay_Duration_ImplicitCast_3' has a wrong offset!");

}

