#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UpgradePlanSmallShortFence

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UpgradePlanSmallShortFence.BP_UpgradePlanSmallShortFence_C.TogglePlanVisibility
// 0x0010 (0x0010 - 0x0000)
struct BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility) == 0x000004, "Wrong alignment on BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility");
static_assert(sizeof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility) == 0x000010, "Wrong size on BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility");
static_assert(offsetof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility, Visible) == 0x000000, "Member 'BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility::Visible' has a wrong offset!");
static_assert(offsetof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility, K2Node_MultiGate_FirstRun) == 0x000001, "Member 'BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility, K2Node_MultiGate_Data) == 0x000004, "Member 'BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility, K2Node_MultiGate_ScratchBool) == 0x000008, "Member 'BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility, K2Node_MultiGate_ScratchIndex) == 0x00000C, "Member 'BP_UpgradePlanSmallShortFence_C_TogglePlanVisibility::K2Node_MultiGate_ScratchIndex' has a wrong offset!");

}

