#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bp_WarmupBlocker_Spline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Bp_WarmupBlocker_Spline.Bp_WarmupBlocker_Spline_C.ConstructSplineMesh
// 0x01B0 (0x01B0 - 0x0000)
struct Bp_WarmupBlocker_Spline_C_ConstructSplineMesh final
{
public:
	int32                                         Segments;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDistanceFromIndex_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetDistanceFromIndex_ReturnValue_1;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh) == 0x000010, "Wrong alignment on Bp_WarmupBlocker_Spline_C_ConstructSplineMesh");
static_assert(sizeof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh) == 0x0001B0, "Wrong size on Bp_WarmupBlocker_Spline_C_ConstructSplineMesh");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, Segments) == 0x000000, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::Segments' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, Temp_int_Variable) == 0x000004, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, Temp_int_Variable_1) == 0x000018, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Array_Get_Item) == 0x000030, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_BreakVector2D_X) == 0x000040, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_AddComponent_ReturnValue) == 0x0000E0, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetDistanceFromIndex_ReturnValue) == 0x0000E8, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetDistanceFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetDistanceFromIndex_ReturnValue_1) == 0x0000F8, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetDistanceFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000100, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetSplineLength_ReturnValue) == 0x000118, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000120, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000138, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000140, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Round_ReturnValue) == 0x000158, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000160, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000178, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00017C, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000180, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000184, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000188, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00018C, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000190, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000194, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000198, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x00019C, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ConstructSplineMesh, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'Bp_WarmupBlocker_Spline_C_ConstructSplineMesh::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Bp_WarmupBlocker_Spline.Bp_WarmupBlocker_Spline_C.ExecuteUbergraph_Bp_WarmupBlocker_Spline
// 0x0040 (0x0040 - 0x0000)
struct Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VolumetricAudioEmitter_WarmupBlocker_C* CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_VolumetricAudioEmitter_WarmupBlocker_C* CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline) == 0x000008, "Wrong alignment on Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline");
static_assert(sizeof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline) == 0x000040, "Wrong size on Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, EntryPoint) == 0x000000, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000018, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000030, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'Bp_WarmupBlocker_Spline_C_ExecuteUbergraph_Bp_WarmupBlocker_Spline::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function Bp_WarmupBlocker_Spline.Bp_WarmupBlocker_Spline_C.GetDistanceFromIndex
// 0x0040 (0x0040 - 0x0000)
struct Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex) == 0x000008, "Wrong alignment on Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex");
static_assert(sizeof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex) == 0x000040, "Wrong size on Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, Index_0) == 0x000000, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::Index_0' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, Max) == 0x000004, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::Max' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, ReturnValue) == 0x000008, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_GetSplineLength_ReturnValue) == 0x000018, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'Bp_WarmupBlocker_Spline_C_GetDistanceFromIndex::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function Bp_WarmupBlocker_Spline.Bp_WarmupBlocker_Spline_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Bp_WarmupBlocker_Spline_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bp_WarmupBlocker_Spline_C_UserConstructionScript) == 0x000008, "Wrong alignment on Bp_WarmupBlocker_Spline_C_UserConstructionScript");
static_assert(sizeof(Bp_WarmupBlocker_Spline_C_UserConstructionScript) == 0x000010, "Wrong size on Bp_WarmupBlocker_Spline_C_UserConstructionScript");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_UserConstructionScript, Material) == 0x000000, "Member 'Bp_WarmupBlocker_Spline_C_UserConstructionScript::Material' has a wrong offset!");
static_assert(offsetof(Bp_WarmupBlocker_Spline_C_UserConstructionScript, Segments) == 0x000008, "Member 'Bp_WarmupBlocker_Spline_C_UserConstructionScript::Segments' has a wrong offset!");

}

