#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Window_Level3

#include "Basic.hpp"

#include "BP_Window_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Window_Level3.BP_Window_Level3_C
// 0x0030 (0x0520 - 0x04F0)
class ABP_Window_Level3_C final : public ABP_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Window_Level3_C;                 // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AudioAlarm;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ElectricOK1;                                       // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ElectricOK;                                        // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BarsOK;                                            // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BarsBroken;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void AddMeshBounceComponents();
	void Audio_Damage_Impact();
	void ExecuteUbergraph_BP_Window_Level3(int32 EntryPoint);
	void GetWindowBaseHealth(double* Health);
	void IsNotLockpickable(bool* Param_IsNotLockpickable_0);
	void WindowSabotaged(bool TURR);

	bool IsAvailableForInteraction(class AActor* InteractingActor, class UPrimitiveComponent* InteractionComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Window_Level3_C">();
	}
	static class ABP_Window_Level3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Window_Level3_C>();
	}
};
static_assert(alignof(ABP_Window_Level3_C) == 0x000008, "Wrong alignment on ABP_Window_Level3_C");
static_assert(sizeof(ABP_Window_Level3_C) == 0x000520, "Wrong size on ABP_Window_Level3_C");
static_assert(offsetof(ABP_Window_Level3_C, UberGraphFrame_BP_Window_Level3_C) == 0x0004F0, "Member 'ABP_Window_Level3_C::UberGraphFrame_BP_Window_Level3_C' has a wrong offset!");
static_assert(offsetof(ABP_Window_Level3_C, AudioAlarm) == 0x0004F8, "Member 'ABP_Window_Level3_C::AudioAlarm' has a wrong offset!");
static_assert(offsetof(ABP_Window_Level3_C, ElectricOK1) == 0x000500, "Member 'ABP_Window_Level3_C::ElectricOK1' has a wrong offset!");
static_assert(offsetof(ABP_Window_Level3_C, ElectricOK) == 0x000508, "Member 'ABP_Window_Level3_C::ElectricOK' has a wrong offset!");
static_assert(offsetof(ABP_Window_Level3_C, BarsOK) == 0x000510, "Member 'ABP_Window_Level3_C::BarsOK' has a wrong offset!");
static_assert(offsetof(ABP_Window_Level3_C, BarsBroken) == 0x000518, "Member 'ABP_Window_Level3_C::BarsBroken' has a wrong offset!");

}

