#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WinScreenConfetti_Profile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WinScreenConfetti_Profile.BP_WinScreenConfetti_Profile_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_WinScreenConfetti_Profile_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Above;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WinScreenConfetti_Profile(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WinScreenConfetti_Profile_C">();
	}
	static class ABP_WinScreenConfetti_Profile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WinScreenConfetti_Profile_C>();
	}
};
static_assert(alignof(ABP_WinScreenConfetti_Profile_C) == 0x000008, "Wrong alignment on ABP_WinScreenConfetti_Profile_C");
static_assert(sizeof(ABP_WinScreenConfetti_Profile_C) == 0x0002A8, "Wrong size on ABP_WinScreenConfetti_Profile_C");
static_assert(offsetof(ABP_WinScreenConfetti_Profile_C, UberGraphFrame) == 0x000290, "Member 'ABP_WinScreenConfetti_Profile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WinScreenConfetti_Profile_C, Niagara_Above) == 0x000298, "Member 'ABP_WinScreenConfetti_Profile_C::Niagara_Above' has a wrong offset!");
static_assert(offsetof(ABP_WinScreenConfetti_Profile_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_WinScreenConfetti_Profile_C::DefaultSceneRoot' has a wrong offset!");

}

