#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WarmupComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WarmupComponent.BP_WarmupComponent_C.CreateWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_WarmupComponent_C_CreateWidget final
{
public:
	class UWI_WarmupCountdown_C*                  CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WarmupComponent_C_CreateWidget) == 0x000008, "Wrong alignment on BP_WarmupComponent_C_CreateWidget");
static_assert(sizeof(BP_WarmupComponent_C_CreateWidget) == 0x000008, "Wrong size on BP_WarmupComponent_C_CreateWidget");
static_assert(offsetof(BP_WarmupComponent_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_WarmupComponent_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_WarmupComponent.BP_WarmupComponent_C.ExecuteUbergraph_BP_WarmupComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WarmupBlockerManager_C*             CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent) == 0x000008, "Wrong alignment on BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent");
static_assert(sizeof(BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent) == 0x000010, "Wrong size on BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent");
static_assert(offsetof(BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent, EntryPoint) == 0x000000, "Member 'BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_WarmupComponent_C_ExecuteUbergraph_BP_WarmupComponent::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");

}

