#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_HouseEssentialActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_HouseEssentialActor.BPI_HouseEssentialActor_C.GetHealth
// 0x0008 (0x0008 - 0x0000)
struct BPI_HouseEssentialActor_C_GetHealth final
{
public:
	double                                        CurrentHealth;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_HouseEssentialActor_C_GetHealth) == 0x000008, "Wrong alignment on BPI_HouseEssentialActor_C_GetHealth");
static_assert(sizeof(BPI_HouseEssentialActor_C_GetHealth) == 0x000008, "Wrong size on BPI_HouseEssentialActor_C_GetHealth");
static_assert(offsetof(BPI_HouseEssentialActor_C_GetHealth, CurrentHealth) == 0x000000, "Member 'BPI_HouseEssentialActor_C_GetHealth::CurrentHealth' has a wrong offset!");

// Function BPI_HouseEssentialActor.BPI_HouseEssentialActor_C.GetMaxHealth
// 0x0008 (0x0008 - 0x0000)
struct BPI_HouseEssentialActor_C_GetMaxHealth final
{
public:
	double                                        MaxHealth;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_HouseEssentialActor_C_GetMaxHealth) == 0x000008, "Wrong alignment on BPI_HouseEssentialActor_C_GetMaxHealth");
static_assert(sizeof(BPI_HouseEssentialActor_C_GetMaxHealth) == 0x000008, "Wrong size on BPI_HouseEssentialActor_C_GetMaxHealth");
static_assert(offsetof(BPI_HouseEssentialActor_C_GetMaxHealth, MaxHealth) == 0x000000, "Member 'BPI_HouseEssentialActor_C_GetMaxHealth::MaxHealth' has a wrong offset!");

}

