#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_IsTargetDead

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_IsTargetDead.BTS_IsTargetDead_C.ExecuteUbergraph_BTS_IsTargetDead
// 0x0058 (0x0058 - 0x0000)
struct BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAIC_Leloi_C*                           K2Node_DynamicCast_AsAIC_Leloi;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDead_Dead;                           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead) == 0x000008, "Wrong alignment on BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead");
static_assert(sizeof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead) == 0x000058, "Wrong size on BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, EntryPoint) == 0x000000, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_Event_OwnerController) == 0x000010, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, CallFunc_GetBlackboard_ReturnValue) == 0x000020, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_DynamicCast_AsAIC_Leloi) == 0x000028, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_DynamicCast_AsAIC_Leloi' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, CallFunc_GetValueAsObject_ReturnValue) == 0x000038, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_DynamicCast_AsI_Character) == 0x000040, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_DynamicCast_AsI_Character' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead, CallFunc_GetIsDead_Dead) == 0x000051, "Member 'BTS_IsTargetDead_C_ExecuteUbergraph_BTS_IsTargetDead::CallFunc_GetIsDead_Dead' has a wrong offset!");

// Function BTS_IsTargetDead.BTS_IsTargetDead_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_IsTargetDead_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_IsTargetDead_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_IsTargetDead_C_ReceiveActivationAI");
static_assert(sizeof(BTS_IsTargetDead_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_IsTargetDead_C_ReceiveActivationAI");
static_assert(offsetof(BTS_IsTargetDead_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_IsTargetDead_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_IsTargetDead_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_IsTargetDead_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

