#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Goose_AttackTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_Goose_AttackTarget.BTT_Goose_AttackTarget_C.ExecuteUbergraph_BTT_Goose_AttackTarget
// 0x0038 (0x0038 - 0x0000)
struct BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Goose_C*                            K2Node_DynamicCast_AsBP_Goose;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget) == 0x000008, "Wrong alignment on BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget");
static_assert(sizeof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget) == 0x000038, "Wrong size on BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, EntryPoint) == 0x000000, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, K2Node_Event_OwnerController) == 0x000018, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, K2Node_DynamicCast_AsBP_Goose) == 0x000028, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::K2Node_DynamicCast_AsBP_Goose' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_Goose_AttackTarget_C_ExecuteUbergraph_BTT_Goose_AttackTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_Goose_AttackTarget.BTT_Goose_AttackTarget_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_Goose_AttackTarget_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_Goose_AttackTarget_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_Goose_AttackTarget_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_Goose_AttackTarget_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_Goose_AttackTarget_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_Goose_AttackTarget_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Goose_AttackTarget_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_Goose_AttackTarget_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

