#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetTargetLocationToDogHouse

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_SetTargetLocationToDogHouse.BTT_SetTargetLocationToDogHouse_C.ExecuteUbergraph_BTT_SetTargetLocationToDogHouse
// 0x0058 (0x0058 - 0x0000)
struct BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetOwnersBlackboard_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_Leloi_C>            K2Node_DynamicCast_AsI_Leloi;                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DogHouse_V2_C*                      CallFunc_GetDogHouse_DogHouse;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse) == 0x000008, "Wrong alignment on BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse");
static_assert(sizeof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse) == 0x000058, "Wrong size on BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, EntryPoint) == 0x000000, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, CallFunc_GetOwnersBlackboard_ReturnValue) == 0x000008, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::CallFunc_GetOwnersBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, K2Node_Event_OwnerController) == 0x000010, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, K2Node_DynamicCast_AsI_Leloi) == 0x000020, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::K2Node_DynamicCast_AsI_Leloi' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, CallFunc_GetDogHouse_DogHouse) == 0x000038, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::CallFunc_GetDogHouse_DogHouse' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BTT_SetTargetLocationToDogHouse_C_ExecuteUbergraph_BTT_SetTargetLocationToDogHouse::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BTT_SetTargetLocationToDogHouse.BTT_SetTargetLocationToDogHouse_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_SetTargetLocationToDogHouse_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

