#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShake_Local

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraShake_Local.CameraShake_Local_C.Received_Notify
// 0x0068 (0x0068 - 0x0000)
struct CameraShake_Local_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble;                    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraShake_Local_C_Received_Notify) == 0x000008, "Wrong alignment on CameraShake_Local_C_Received_Notify");
static_assert(sizeof(CameraShake_Local_C_Received_Notify) == 0x000068, "Wrong size on CameraShake_Local_C_Received_Notify");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, MeshComp) == 0x000000, "Member 'CameraShake_Local_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, Animation) == 0x000008, "Member 'CameraShake_Local_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, EventReference) == 0x000010, "Member 'CameraShake_Local_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, ReturnValue) == 0x000040, "Member 'CameraShake_Local_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'CameraShake_Local_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, K2Node_DynamicCast_AsI_FOVAble) == 0x000050, "Member 'CameraShake_Local_C_Received_Notify::K2Node_DynamicCast_AsI_FOVAble' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CameraShake_Local_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraShake_Local_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'CameraShake_Local_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

