#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonLoadingScreen.LoadingScreenWidgetHandler.UpdateBackground
// 0x0008 (0x0008 - 0x0000)
struct LoadingScreenWidgetHandler_UpdateBackground final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenWidgetHandler_UpdateBackground) == 0x000008, "Wrong alignment on LoadingScreenWidgetHandler_UpdateBackground");
static_assert(sizeof(LoadingScreenWidgetHandler_UpdateBackground) == 0x000008, "Wrong size on LoadingScreenWidgetHandler_UpdateBackground");
static_assert(offsetof(LoadingScreenWidgetHandler_UpdateBackground, Texture) == 0x000000, "Member 'LoadingScreenWidgetHandler_UpdateBackground::Texture' has a wrong offset!");

// Function CommonLoadingScreen.LoadingScreenWidgetHandler.UpdateMessage
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenWidgetHandler_UpdateMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenWidgetHandler_UpdateMessage) == 0x000008, "Wrong alignment on LoadingScreenWidgetHandler_UpdateMessage");
static_assert(sizeof(LoadingScreenWidgetHandler_UpdateMessage) == 0x000010, "Wrong size on LoadingScreenWidgetHandler_UpdateMessage");
static_assert(offsetof(LoadingScreenWidgetHandler_UpdateMessage, Message) == 0x000000, "Member 'LoadingScreenWidgetHandler_UpdateMessage::Message' has a wrong offset!");

// Function CommonLoadingScreen.LoadingScreenWidgetHandler.UpdateSound
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenWidgetHandler_UpdateSound final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopMenuMusic;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LoadingScreenWidgetHandler_UpdateSound) == 0x000008, "Wrong alignment on LoadingScreenWidgetHandler_UpdateSound");
static_assert(sizeof(LoadingScreenWidgetHandler_UpdateSound) == 0x000010, "Wrong size on LoadingScreenWidgetHandler_UpdateSound");
static_assert(offsetof(LoadingScreenWidgetHandler_UpdateSound, Sound) == 0x000000, "Member 'LoadingScreenWidgetHandler_UpdateSound::Sound' has a wrong offset!");
static_assert(offsetof(LoadingScreenWidgetHandler_UpdateSound, StopMenuMusic) == 0x000008, "Member 'LoadingScreenWidgetHandler_UpdateSound::StopMenuMusic' has a wrong offset!");

// Function CommonLoadingScreen.LoadingScreenWidgetHandler.UpdateSoundLoadingScreenHidden
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden final
{
public:
	bool                                          StartMenuMusic;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden) == 0x000001, "Wrong alignment on LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden");
static_assert(sizeof(LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden) == 0x000001, "Wrong size on LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden");
static_assert(offsetof(LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden, StartMenuMusic) == 0x000000, "Member 'LoadingScreenWidgetHandler_UpdateSoundLoadingScreenHidden::StartMenuMusic' has a wrong offset!");

// Function CommonLoadingScreen.LoadingScreenManager.GetDebugReasonForShowingOrHidingLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(sizeof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(offsetof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen, ReturnValue) == 0x000000, "Member 'LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen::ReturnValue' has a wrong offset!");

// Function CommonLoadingScreen.LoadingProcessTask.CreateLoadingScreenProcessTask
// 0x0020 (0x0020 - 0x0000)
struct LoadingProcessTask_CreateLoadingScreenProcessTask final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowLoadingScreenReason;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoadingProcessTask*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000008, "Wrong alignment on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(sizeof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000020, "Wrong size on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, WorldContextObject) == 0x000000, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ShowLoadingScreenReason) == 0x000008, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ShowLoadingScreenReason' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ReturnValue) == 0x000018, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ReturnValue' has a wrong offset!");

// Function CommonLoadingScreen.LoadingProcessTask.SetShowLoadingScreenReason
// 0x0010 (0x0010 - 0x0000)
struct LoadingProcessTask_SetShowLoadingScreenReason final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000008, "Wrong alignment on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(sizeof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000010, "Wrong size on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(offsetof(LoadingProcessTask_SetShowLoadingScreenReason, InReason) == 0x000000, "Member 'LoadingProcessTask_SetShowLoadingScreenReason::InReason' has a wrong offset!");

}

