#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EI_Hands

#include "Basic.hpp"

#include "BP_EquipmentInstance_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EI_Hands.EI_Hands_C
// 0x0018 (0x0158 - 0x0140)
class UEI_Hands_C final : public UBP_EquipmentInstance_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_EI_Hands_C;                         // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABp_ThrowableProp_Base_C*               ThrowableFocus;                                    // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABp_ThrowableProp_Base_C*               ThrowableCarrying;                                 // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EI_Hands(int32 EntryPoint);
	void K2_OnEquipped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EI_Hands_C">();
	}
	static class UEI_Hands_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEI_Hands_C>();
	}
};
static_assert(alignof(UEI_Hands_C) == 0x000008, "Wrong alignment on UEI_Hands_C");
static_assert(sizeof(UEI_Hands_C) == 0x000158, "Wrong size on UEI_Hands_C");
static_assert(offsetof(UEI_Hands_C, UberGraphFrame_EI_Hands_C) == 0x000140, "Member 'UEI_Hands_C::UberGraphFrame_EI_Hands_C' has a wrong offset!");
static_assert(offsetof(UEI_Hands_C, ThrowableFocus) == 0x000148, "Member 'UEI_Hands_C::ThrowableFocus' has a wrong offset!");
static_assert(offsetof(UEI_Hands_C, ThrowableCarrying) == 0x000150, "Member 'UEI_Hands_C::ThrowableCarrying' has a wrong offset!");

}

