#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmoteWheelEntryWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmoteWheelEntryWI.EmoteWheelEntryWI_C
// 0x0160 (0x0440 - 0x02E0)
class UEmoteWheelEntryWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUEmoteWheelEntryData                  EmoteInfo;                                         // 0x0300(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Highlighted;                                       // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmoteWheelWI_C*                        EmoteWheel;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateBrush                            CachedAssociatedIconBrush;                         // 0x0360(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnEntryHovered;                                    // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_EmoteWheelEntryWI(int32 EntryPoint);
	struct FLinearColor GetColorAndOpacity_0();
	void OnEntryHovered__DelegateSignature(class UItemDefinition* HoveredItemDefinition);
	void OnHighlight();
	void OnLoaded_3AF18C4F4A21BA73C5B0B88A30247017(class UObject* Loaded);
	void OnUnhighlight();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmoteWheelEntryWI_C">();
	}
	static class UEmoteWheelEntryWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteWheelEntryWI_C>();
	}
};
static_assert(alignof(UEmoteWheelEntryWI_C) == 0x000010, "Wrong alignment on UEmoteWheelEntryWI_C");
static_assert(sizeof(UEmoteWheelEntryWI_C) == 0x000440, "Wrong size on UEmoteWheelEntryWI_C");
static_assert(offsetof(UEmoteWheelEntryWI_C, UberGraphFrame) == 0x0002E0, "Member 'UEmoteWheelEntryWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, ShowAnim) == 0x0002E8, "Member 'UEmoteWheelEntryWI_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, Image) == 0x0002F0, "Member 'UEmoteWheelEntryWI_C::Image' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, Image_1) == 0x0002F8, "Member 'UEmoteWheelEntryWI_C::Image_1' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, EmoteInfo) == 0x000300, "Member 'UEmoteWheelEntryWI_C::EmoteInfo' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, Highlighted) == 0x000350, "Member 'UEmoteWheelEntryWI_C::Highlighted' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, EmoteWheel) == 0x000358, "Member 'UEmoteWheelEntryWI_C::EmoteWheel' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, CachedAssociatedIconBrush) == 0x000360, "Member 'UEmoteWheelEntryWI_C::CachedAssociatedIconBrush' has a wrong offset!");
static_assert(offsetof(UEmoteWheelEntryWI_C, OnEntryHovered) == 0x000430, "Member 'UEmoteWheelEntryWI_C::OnEntryHovered' has a wrong offset!");

}

