#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMatchSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FMatchSettings.FMatchSettings
// 0x0028 (0x0028 - 0x0000)
struct FFMatchSettings final
{
public:
	struct FPrimaryAssetId                        LobbyMapID_29_0FC75F574F0BB05B36C23997982B5EF0;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        NextMapID_31_5D862F524A41C8398926368742F5047C;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPlayers_22_5E2B5EE64D3DE00128638F99F43DDC71;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLanMatch_21_42018E5D4C57A99B98C34B9FC9778845;   // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFMatchSettings) == 0x000004, "Wrong alignment on FFMatchSettings");
static_assert(sizeof(FFMatchSettings) == 0x000028, "Wrong size on FFMatchSettings");
static_assert(offsetof(FFMatchSettings, LobbyMapID_29_0FC75F574F0BB05B36C23997982B5EF0) == 0x000000, "Member 'FFMatchSettings::LobbyMapID_29_0FC75F574F0BB05B36C23997982B5EF0' has a wrong offset!");
static_assert(offsetof(FFMatchSettings, NextMapID_31_5D862F524A41C8398926368742F5047C) == 0x000010, "Member 'FFMatchSettings::NextMapID_31_5D862F524A41C8398926368742F5047C' has a wrong offset!");
static_assert(offsetof(FFMatchSettings, MaxPlayers_22_5E2B5EE64D3DE00128638F99F43DDC71) == 0x000020, "Member 'FFMatchSettings::MaxPlayers_22_5E2B5EE64D3DE00128638F99F43DDC71' has a wrong offset!");
static_assert(offsetof(FFMatchSettings, bIsLanMatch_21_42018E5D4C57A99B98C34B9FC9778845) == 0x000024, "Member 'FFMatchSettings::bIsLanMatch_21_42018E5D4C57A99B98C34B9FC9778845' has a wrong offset!");

}

