#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DropUnequipped

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GASIW_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DropUnequipped.GA_DropUnequipped_C
// 0x0070 (0x04D0 - 0x0460)
class UGA_DropUnequipped_C final : public UGameplayAbilityIW
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  BlockedTags;                                       // 0x0468(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TraceableDistance;                                 // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TraceDistance;                                     // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_ContinuousTraceHitables_C*          GA_Continuous_Trace_for_Hitables;                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABp_ThrowableProp_Base_C*               CurrentTarget;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         LastDroppedItem;                                   // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DropUnequipped(int32 EntryPoint);
	class UObject* GetDroppableEquipmentInstance(class UObject* Object);
	void K2_ActivateAbility();
	void K2_OnAbilityRemoved();
	void OnUnequipped(class UEquipmentInstance* Instance);
	void ShouldSpawnEquipment(bool* ShouldSpawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DropUnequipped_C">();
	}
	static class UGA_DropUnequipped_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DropUnequipped_C>();
	}
};
static_assert(alignof(UGA_DropUnequipped_C) == 0x000010, "Wrong alignment on UGA_DropUnequipped_C");
static_assert(sizeof(UGA_DropUnequipped_C) == 0x0004D0, "Wrong size on UGA_DropUnequipped_C");
static_assert(offsetof(UGA_DropUnequipped_C, UberGraphFrame) == 0x000460, "Member 'UGA_DropUnequipped_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, BlockedTags) == 0x000468, "Member 'UGA_DropUnequipped_C::BlockedTags' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, TraceableDistance) == 0x000488, "Member 'UGA_DropUnequipped_C::TraceableDistance' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, TraceDistance) == 0x000490, "Member 'UGA_DropUnequipped_C::TraceDistance' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, GA_Continuous_Trace_for_Hitables) == 0x000498, "Member 'UGA_DropUnequipped_C::GA_Continuous_Trace_for_Hitables' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, CurrentTarget) == 0x0004A0, "Member 'UGA_DropUnequipped_C::CurrentTarget' has a wrong offset!");
static_assert(offsetof(UGA_DropUnequipped_C, LastDroppedItem) == 0x0004A8, "Member 'UGA_DropUnequipped_C::LastDroppedItem' has a wrong offset!");

}

