#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_EquipPrevious

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_EquipPrevious.GA_EquipPrevious_C.ExecuteUbergraph_GA_EquipPrevious
// 0x0018 (0x0018 - 0x0000)
struct GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterItemWheelComponent_C*         CallFunc_GetItemWheelComponent_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious) == 0x000008, "Wrong alignment on GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious");
static_assert(sizeof(GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious) == 0x000018, "Wrong size on GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious");
static_assert(offsetof(GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious, EntryPoint) == 0x000000, "Member 'GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious, CallFunc_GetItemWheelComponent_ReturnValue) == 0x000008, "Member 'GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious::CallFunc_GetItemWheelComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious, CallFunc_K2_CommitAbility_ReturnValue) == 0x000010, "Member 'GA_EquipPrevious_C_ExecuteUbergraph_GA_EquipPrevious::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_EquipPrevious.GA_EquipPrevious_C.GetEquipmentManager
// 0x0018 (0x0018 - 0x0000)
struct GA_EquipPrevious_C_GetEquipmentManager final
{
public:
	class UEquipmentManagerComponent*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EquipPrevious_C_GetEquipmentManager) == 0x000008, "Wrong alignment on GA_EquipPrevious_C_GetEquipmentManager");
static_assert(sizeof(GA_EquipPrevious_C_GetEquipmentManager) == 0x000018, "Wrong size on GA_EquipPrevious_C_GetEquipmentManager");
static_assert(offsetof(GA_EquipPrevious_C_GetEquipmentManager, ReturnValue) == 0x000000, "Member 'GA_EquipPrevious_C_GetEquipmentManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_GetEquipmentManager, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_EquipPrevious_C_GetEquipmentManager::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_GetEquipmentManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_EquipPrevious_C_GetEquipmentManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_EquipPrevious.GA_EquipPrevious_C.GetItemWheelComponent
// 0x0018 (0x0018 - 0x0000)
struct GA_EquipPrevious_C_GetItemWheelComponent final
{
public:
	class UCharacterItemWheelComponent_C*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EquipPrevious_C_GetItemWheelComponent) == 0x000008, "Wrong alignment on GA_EquipPrevious_C_GetItemWheelComponent");
static_assert(sizeof(GA_EquipPrevious_C_GetItemWheelComponent) == 0x000018, "Wrong size on GA_EquipPrevious_C_GetItemWheelComponent");
static_assert(offsetof(GA_EquipPrevious_C_GetItemWheelComponent, ReturnValue) == 0x000000, "Member 'GA_EquipPrevious_C_GetItemWheelComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_GetItemWheelComponent, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_EquipPrevious_C_GetItemWheelComponent::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_GetItemWheelComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_EquipPrevious_C_GetItemWheelComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_EquipPrevious.GA_EquipPrevious_C.K2_CanActivateAbility
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EquipPrevious_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterItemWheelComponent_C*         CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EquipPrevious_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_EquipPrevious_C_K2_CanActivateAbility");
static_assert(sizeof(GA_EquipPrevious_C_K2_CanActivateAbility) == 0x0000B8, "Wrong size on GA_EquipPrevious_C_K2_CanActivateAbility");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000080, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x000088, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x000090, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000098, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_GetInstigator_ReturnValue) == 0x0000A0, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, K2Node_DynamicCast_AsItem_Instance) == 0x0000A8, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_EquipPrevious_C_K2_CanActivateAbility, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B1, "Member 'GA_EquipPrevious_C_K2_CanActivateAbility::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

