#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_JackHammerActive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_MeleeLightHit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_JackHammerActive.GA_JackHammerActive_C
// 0x0020 (0x07E0 - 0x07C0)
class UGA_JackHammerActive_C final : public UGA_MeleeLightHit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_JackHammerActive_C;              // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            SlowEffect;                                        // 0x07C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HitActors_0;                                       // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAbilityTask_RepeatContinuous*          BashTask;                                          // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddActiveCue();
	void DropJackhammer();
	void ExecuteUbergraph_GA_JackHammerActive(int32 EntryPoint);
	void GetPercentageCharged(double* Percentage);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void On_Other_Item_Equipped(class UEquipmentInstance* Instance);
	void On_Dead_Event(class ACharacter* Character);
	void OnFinished_13A37D2E4A791499F77B39A2E3D5645A(int32 ActionNumber);
	void OnGameEnded();
	void OnPerformAction_13A37D2E4A791499F77B39A2E3D5645A(int32 ActionNumber);
	void Try_Spawn_Hit_Decal(const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_JackHammerActive_C">();
	}
	static class UGA_JackHammerActive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_JackHammerActive_C>();
	}
};
static_assert(alignof(UGA_JackHammerActive_C) == 0x000010, "Wrong alignment on UGA_JackHammerActive_C");
static_assert(sizeof(UGA_JackHammerActive_C) == 0x0007E0, "Wrong size on UGA_JackHammerActive_C");
static_assert(offsetof(UGA_JackHammerActive_C, UberGraphFrame_GA_JackHammerActive_C) == 0x0007B8, "Member 'UGA_JackHammerActive_C::UberGraphFrame_GA_JackHammerActive_C' has a wrong offset!");
static_assert(offsetof(UGA_JackHammerActive_C, SlowEffect) == 0x0007C0, "Member 'UGA_JackHammerActive_C::SlowEffect' has a wrong offset!");
static_assert(offsetof(UGA_JackHammerActive_C, HitActors_0) == 0x0007C8, "Member 'UGA_JackHammerActive_C::HitActors_0' has a wrong offset!");
static_assert(offsetof(UGA_JackHammerActive_C, BashTask) == 0x0007D8, "Member 'UGA_JackHammerActive_C::BashTask' has a wrong offset!");

}

