#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MultipointDeployable

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_DeploymentInformationGameplayMessage_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_DeployItem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.Add Point
// 0x0110 (0x0110 - 0x0000)
struct GA_MultipointDeployable_C_Add_Point final
{
public:
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_Add_Point) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_Add_Point");
static_assert(sizeof(GA_MultipointDeployable_C_Add_Point) == 0x000110, "Wrong size on GA_MultipointDeployable_C_Add_Point");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_Get_ClassLog_Name_name) == 0x000000, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_bBlockingHit) == 0x000010, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_bInitialOverlap) == 0x000011, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_Time) == 0x000014, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_Distance) == 0x000018, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_Location) == 0x000020, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_ImpactPoint) == 0x000038, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_Normal) == 0x000050, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_ImpactNormal) == 0x000068, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_PhysMat) == 0x000080, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_HitActor) == 0x000088, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_HitComponent) == 0x000090, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_HitBoneName) == 0x000098, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_BoneName) == 0x0000A0, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_HitItem) == 0x0000A8, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_ElementIndex) == 0x0000AC, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_FaceIndex) == 0x0000B0, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_TraceStart) == 0x0000B8, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_BreakHitResult_TraceEnd) == 0x0000D0, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_Conv_VectorToString_ReturnValue) == 0x0000E8, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Add_Point, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'GA_MultipointDeployable_C_Add_Point::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.AddDeployingGameplayEffect
// 0x0028 (0x0028 - 0x0000)
struct GA_MultipointDeployable_C_AddDeployingGameplayEffect final
{
public:
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0000(0x0010)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_AddDeployingGameplayEffect) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_AddDeployingGameplayEffect");
static_assert(sizeof(GA_MultipointDeployable_C_AddDeployingGameplayEffect) == 0x000028, "Wrong size on GA_MultipointDeployable_C_AddDeployingGameplayEffect");
static_assert(offsetof(GA_MultipointDeployable_C_AddDeployingGameplayEffect, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_AddDeployingGameplayEffect::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AddDeployingGameplayEffect, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_MultipointDeployable_C_AddDeployingGameplayEffect::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AddDeployingGameplayEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_MultipointDeployable_C_AddDeployingGameplayEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AddDeployingGameplayEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000020, "Member 'GA_MultipointDeployable_C_AddDeployingGameplayEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.AnimPrimaryPressed
// 0x0088 (0x0088 - 0x0000)
struct GA_MultipointDeployable_C_AnimPrimaryPressed final
{
public:
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0000(0x0048)(ContainsInstancedReference)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_AnimPrimaryPressed) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_AnimPrimaryPressed");
static_assert(sizeof(GA_MultipointDeployable_C_AnimPrimaryPressed) == 0x000088, "Wrong size on GA_MultipointDeployable_C_AnimPrimaryPressed");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, CallFunc_GetActorInfo_ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000048, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_AsI_Character_Animation) == 0x000058, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000070, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimPrimaryPressed, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GA_MultipointDeployable_C_AnimPrimaryPressed::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.AnimSecondaryPressed
// 0x0088 (0x0088 - 0x0000)
struct GA_MultipointDeployable_C_AnimSecondaryPressed final
{
public:
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0000(0x0048)(ContainsInstancedReference)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_AnimSecondaryPressed) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_AnimSecondaryPressed");
static_assert(sizeof(GA_MultipointDeployable_C_AnimSecondaryPressed) == 0x000088, "Wrong size on GA_MultipointDeployable_C_AnimSecondaryPressed");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, CallFunc_GetActorInfo_ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000048, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_AsI_Character_Animation) == 0x000058, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000070, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_AnimSecondaryPressed, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GA_MultipointDeployable_C_AnimSecondaryPressed::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.Auth_SpawnItem
// 0x0048 (0x0048 - 0x0000)
struct GA_MultipointDeployable_C_Auth_SpawnItem final
{
public:
	TArray<struct FHitResult>                     TraceHits;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FRotator                               PreviewRotation;                                   // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        OptionalAngle_0;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OptionalVector_0;                                  // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_Auth_SpawnItem) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_Auth_SpawnItem");
static_assert(sizeof(GA_MultipointDeployable_C_Auth_SpawnItem) == 0x000048, "Wrong size on GA_MultipointDeployable_C_Auth_SpawnItem");
static_assert(offsetof(GA_MultipointDeployable_C_Auth_SpawnItem, TraceHits) == 0x000000, "Member 'GA_MultipointDeployable_C_Auth_SpawnItem::TraceHits' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Auth_SpawnItem, PreviewRotation) == 0x000010, "Member 'GA_MultipointDeployable_C_Auth_SpawnItem::PreviewRotation' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Auth_SpawnItem, OptionalAngle_0) == 0x000028, "Member 'GA_MultipointDeployable_C_Auth_SpawnItem::OptionalAngle_0' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Auth_SpawnItem, OptionalVector_0) == 0x000030, "Member 'GA_MultipointDeployable_C_Auth_SpawnItem::OptionalVector_0' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.Blocked by Dynamic Object
// 0x01B8 (0x01B8 - 0x0000)
struct GA_MultipointDeployable_C_Blocked_by_Dynamic_Object final
{
public:
	bool                                          NotBlocked;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectTypeQuery                              Temp_byte_Variable;                                // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetTracePoints_Start;                     // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTracePoints_End;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_GetAllowedObjectTypes_AllowedObjectTypes; // 0x01A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_Blocked_by_Dynamic_Object");
static_assert(sizeof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object) == 0x0001B8, "Wrong size on GA_MultipointDeployable_C_Blocked_by_Dynamic_Object");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, NotBlocked) == 0x000000, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::NotBlocked' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, Temp_byte_Variable) == 0x000001, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, K2Node_MakeArray_Array) == 0x000050, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_GetTracePoints_Start) == 0x000060, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_GetTracePoints_Start' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_GetTracePoints_End) == 0x000078, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_GetTracePoints_End' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, K2Node_MakeArray_Array_1) == 0x000090, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000A0, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000198, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_GetAllowedObjectTypes_AllowedObjectTypes) == 0x0001A0, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_GetAllowedObjectTypes_AllowedObjectTypes' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_Blocked_by_Dynamic_Object, CallFunc_Array_Contains_ReturnValue) == 0x0001B0, "Member 'GA_MultipointDeployable_C_Blocked_by_Dynamic_Object::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.BoxTraceEnd
// 0x01C8 (0x01C8 - 0x0000)
struct GA_MultipointDeployable_C_BoxTraceEnd final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_BoxTraceEnd) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_BoxTraceEnd");
static_assert(sizeof(GA_MultipointDeployable_C_BoxTraceEnd) == 0x0001C8, "Wrong size on GA_MultipointDeployable_C_BoxTraceEnd");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_bBlockingHit) == 0x000019, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_bInitialOverlap) == 0x00001A, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_Time) == 0x00001C, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_Distance) == 0x000020, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_Location) == 0x000028, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_ImpactPoint) == 0x000040, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_Normal) == 0x000058, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_ImpactNormal) == 0x000070, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_PhysMat) == 0x000088, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_HitActor) == 0x000090, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_HitComponent) == 0x000098, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_HitBoneName) == 0x0000A0, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_BoneName) == 0x0000A8, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_HitItem) == 0x0000B0, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_ElementIndex) == 0x0000B4, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_FaceIndex) == 0x0000B8, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_TraceStart) == 0x0000C0, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakHitResult_TraceEnd) == 0x0000D8, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_GetLocalBounds_Min) == 0x0000F0, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_GetLocalBounds_Max) == 0x000108, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_X) == 0x000120, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_Y) == 0x000128, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_Z) == 0x000130, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_X_1) == 0x000138, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_Y_1) == 0x000140, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_BreakVector_Z_1) == 0x000148, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000150, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000168, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000180, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000198, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceEnd, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B0, "Member 'GA_MultipointDeployable_C_BoxTraceEnd::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.BoxTraceHalfSize
// 0x00A8 (0x00A8 - 0x0000)
struct GA_MultipointDeployable_C_BoxTraceHalfSize final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_BoxTraceHalfSize) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_BoxTraceHalfSize");
static_assert(sizeof(GA_MultipointDeployable_C_BoxTraceHalfSize) == 0x0000A8, "Wrong size on GA_MultipointDeployable_C_BoxTraceHalfSize");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, X) == 0x000000, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::X' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, Y) == 0x000008, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::Y' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_GetLocalBounds_Min) == 0x000018, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_GetLocalBounds_Max) == 0x000030, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_X) == 0x000048, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_Y) == 0x000050, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_Z) == 0x000058, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_X_1) == 0x000060, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000088, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000098, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_BoxTraceHalfSize, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000A0, "Member 'GA_MultipointDeployable_C_BoxTraceHalfSize::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.CloneSpawnPreviewMesh
// 0x0090 (0x0090 - 0x0000)
struct GA_MultipointDeployable_C_CloneSpawnPreviewMesh final
{
public:
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetPreviewMaterial_NewParam;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PreviewMesh_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh) == 0x000010, "Wrong alignment on GA_MultipointDeployable_C_CloneSpawnPreviewMesh");
static_assert(sizeof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh) == 0x000090, "Wrong size on GA_MultipointDeployable_C_CloneSpawnPreviewMesh");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_IsLocallyControlled_ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_GetPreviewMaterial_NewParam) == 0x000008, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_GetPreviewMaterial_NewParam' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000080, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CloneSpawnPreviewMesh, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'GA_MultipointDeployable_C_CloneSpawnPreviewMesh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.CollisionBetweenPoints
// 0x0110 (0x0110 - 0x0000)
struct GA_MultipointDeployable_C_CollisionBetweenPoints final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SphereTraceBetweenPoints_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0008(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceBetweenPoints_ReturnValue_1;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_CollisionBetweenPoints) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_CollisionBetweenPoints");
static_assert(sizeof(GA_MultipointDeployable_C_CollisionBetweenPoints) == 0x000110, "Wrong size on GA_MultipointDeployable_C_CollisionBetweenPoints");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, ReturnValue) == 0x000000, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, CallFunc_SphereTraceBetweenPoints_ReturnValue) == 0x000001, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::CallFunc_SphereTraceBetweenPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, CallFunc_Array_Get_Item) == 0x000008, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, CallFunc_SphereTraceBetweenPoints_ReturnValue_1) == 0x000100, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::CallFunc_SphereTraceBetweenPoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MultipointDeployable_C_CollisionBetweenPoints, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000108, "Member 'GA_MultipointDeployable_C_CollisionBetweenPoints::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.ConstructCosmetics
// 0x0018 (0x0018 - 0x0000)
struct GA_MultipointDeployable_C_ConstructCosmetics final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MultipointDeployable_C_ConstructCosmetics) == 0x000008, "Wrong alignment on GA_MultipointDeployable_C_ConstructCosmetics");
static_assert(sizeof(GA_MultipointDeployable_C_ConstructCosmetics) == 0x000018, "Wrong size on GA_MultipointDeployable_C_ConstructCosmetics");
static_assert(offsetof(GA_MultipointDeployable_C_ConstructCosmetics, Location) == 0x000000, "Member 'GA_MultipointDeployable_C_ConstructCosmetics::Location' has a wrong offset!");

// Function GA_MultipointDeployable.GA_MultipointDeployable_C.DebugPlacement
// 0x01B0 (0x01B0 - 0x0000)
struct GA_MultipointDeployable_C_DebugPlacement final
{
public:
	bool                                          CallFunc_LegalPreviewMeshCollision_Return_Value;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_LegalPreviewMeshCollision_HitActor;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_3;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_4;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_5;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
