#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PopGunBlast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_MeleeLightHit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PopGunBlast.GA_PopGunBlast_C
// 0x0010 (0x07D0 - 0x07C0)
class UGA_PopGunBlast_C final : public UGA_MeleeLightHit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_PopGunBlast_C;                   // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CorkBullet;                                        // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_WaitDelay*                Async_Task;                                        // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Bash_With_Hit_Delay();
	void ExecuteFireCue();
	void ExecuteUbergraph_GA_PopGunBlast(int32 EntryPoint);
	void GetHoldingPopGun(class ABP_PopGun_Equipable_C** HoldingPopGun);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinish_7271CEF14B727E6F6D14DEA3C055D80E();
	void OnFinish_D891CA0A4D6D0474A79C1194D922EA94();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_PopGunBlast_C">();
	}
	static class UGA_PopGunBlast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PopGunBlast_C>();
	}
};
static_assert(alignof(UGA_PopGunBlast_C) == 0x000010, "Wrong alignment on UGA_PopGunBlast_C");
static_assert(sizeof(UGA_PopGunBlast_C) == 0x0007D0, "Wrong size on UGA_PopGunBlast_C");
static_assert(offsetof(UGA_PopGunBlast_C, UberGraphFrame_GA_PopGunBlast_C) == 0x0007B8, "Member 'UGA_PopGunBlast_C::UberGraphFrame_GA_PopGunBlast_C' has a wrong offset!");
static_assert(offsetof(UGA_PopGunBlast_C, CorkBullet) == 0x0007C0, "Member 'UGA_PopGunBlast_C::CorkBullet' has a wrong offset!");
static_assert(offsetof(UGA_PopGunBlast_C, Async_Task) == 0x0007C8, "Member 'UGA_PopGunBlast_C::Async_Task' has a wrong offset!");

}

