#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ThrowWrench

#include "Basic.hpp"

#include "S_ChargeBarStartGameplayMessage_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_ChargeBarEndGameplayMessage_structs.hpp"
#include "GASIW_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_ThrowWrench.GA_ThrowWrench_C.AddCooldownGameplayCue
// 0x00D8 (0x00D8 - 0x0000)
struct GA_ThrowWrench_C_AddCooldownGameplayCue final
{
public:
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0000(0x00D8)(ContainsInstancedReference)
};
static_assert(alignof(GA_ThrowWrench_C_AddCooldownGameplayCue) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_AddCooldownGameplayCue");
static_assert(sizeof(GA_ThrowWrench_C_AddCooldownGameplayCue) == 0x0000D8, "Wrong size on GA_ThrowWrench_C_AddCooldownGameplayCue");
static_assert(offsetof(GA_ThrowWrench_C_AddCooldownGameplayCue, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000000, "Member 'GA_ThrowWrench_C_AddCooldownGameplayCue::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.AnimSetBlocking
// 0x0028 (0x0028 - 0x0000)
struct GA_ThrowWrench_C_AnimSetBlocking final
{
public:
	bool                                          Blocking;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_AnimSetBlocking) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_AnimSetBlocking");
static_assert(sizeof(GA_ThrowWrench_C_AnimSetBlocking) == 0x000028, "Wrong size on GA_ThrowWrench_C_AnimSetBlocking");
static_assert(offsetof(GA_ThrowWrench_C_AnimSetBlocking, Blocking) == 0x000000, "Member 'GA_ThrowWrench_C_AnimSetBlocking::Blocking' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_AnimSetBlocking, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_ThrowWrench_C_AnimSetBlocking::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_AnimSetBlocking, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'GA_ThrowWrench_C_AnimSetBlocking::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_AnimSetBlocking, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000018, "Member 'GA_ThrowWrench_C_AnimSetBlocking::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_AnimSetBlocking, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000020, "Member 'GA_ThrowWrench_C_AnimSetBlocking::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.DisableTrajectory
// 0x0028 (0x0028 - 0x0000)
struct GA_ThrowWrench_C_DisableTrajectory final
{
public:
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_ChargeBarEndGameplayMessage         K2Node_MakeStruct_S_ChargeBarEndGameplayMessage;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_DisableTrajectory) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_DisableTrajectory");
static_assert(sizeof(GA_ThrowWrench_C_DisableTrajectory) == 0x000028, "Wrong size on GA_ThrowWrench_C_DisableTrajectory");
static_assert(offsetof(GA_ThrowWrench_C_DisableTrajectory, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'GA_ThrowWrench_C_DisableTrajectory::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_DisableTrajectory, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_ThrowWrench_C_DisableTrajectory::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_DisableTrajectory, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'GA_ThrowWrench_C_DisableTrajectory::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_DisableTrajectory, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_ThrowWrench_C_DisableTrajectory::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_DisableTrajectory, K2Node_MakeStruct_S_ChargeBarEndGameplayMessage) == 0x000020, "Member 'GA_ThrowWrench_C_DisableTrajectory::K2Node_MakeStruct_S_ChargeBarEndGameplayMessage' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.Enable Charge Shake
// 0x0001 (0x0001 - 0x0000)
struct GA_ThrowWrench_C_Enable_Charge_Shake final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_Enable_Charge_Shake) == 0x000001, "Wrong alignment on GA_ThrowWrench_C_Enable_Charge_Shake");
static_assert(sizeof(GA_ThrowWrench_C_Enable_Charge_Shake) == 0x000001, "Wrong size on GA_ThrowWrench_C_Enable_Charge_Shake");
static_assert(offsetof(GA_ThrowWrench_C_Enable_Charge_Shake, Enable) == 0x000000, "Member 'GA_ThrowWrench_C_Enable_Charge_Shake::Enable' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.EnableTrajectory
// 0x0078 (0x0078 - 0x0000)
struct GA_ThrowWrench_C_EnableTrajectory final
{
public:
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetAssociatedItem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_2;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ChargeBarStartGameplayMessage       K2Node_MakeStruct_S_ChargeBarStartGameplayMessage; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_EnableTrajectory) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_EnableTrajectory");
static_assert(sizeof(GA_ThrowWrench_C_EnableTrajectory) == 0x000078, "Wrong size on GA_ThrowWrench_C_EnableTrajectory");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetAssociatedItem_ReturnValue) == 0x000018, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetAssociatedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetTagStackCount_ReturnValue) == 0x000028, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00002C, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000040, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_GetTagStackCount_ReturnValue_2) == 0x000044, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_GetTagStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000050, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_IsLocallyControlled_ReturnValue) == 0x000060, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'GA_ThrowWrench_C_EnableTrajectory::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_EnableTrajectory, K2Node_MakeStruct_S_ChargeBarStartGameplayMessage) == 0x000070, "Member 'GA_ThrowWrench_C_EnableTrajectory::K2Node_MakeStruct_S_ChargeBarStartGameplayMessage' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.ExecuteUbergraph_GA_ThrowWrench
// 0x0110 (0x0110 - 0x0000)
struct GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble;                    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0028(0x0010)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0040(0x0010)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble_1;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetCooldownTimeRemainingAndDuration_TimeRemaining; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCooldownTimeRemainingAndDuration_CooldownDuration; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetCooldownTimeRemainingAndDuration_ReturnValue; // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0078(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble_2;                  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble_3;                  // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench");
static_assert(sizeof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench) == 0x000110, "Wrong size on GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, EntryPoint) == 0x000000, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_AsI_FOVAble) == 0x000010, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_AsI_FOVAble' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000028, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_Event_bWasCancelled) == 0x000038, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000040, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000050, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_AsI_FOVAble_1) == 0x000058, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_AsI_FOVAble_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, Temp_bool_IsClosed_Variable) == 0x000069, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_K2_GetCooldownTimeRemainingAndDuration_TimeRemaining) == 0x00006C, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_K2_GetCooldownTimeRemainingAndDuration_TimeRemaining' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_K2_GetCooldownTimeRemainingAndDuration_CooldownDuration) == 0x000070, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_K2_GetCooldownTimeRemainingAndDuration_CooldownDuration' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_K2_GetCooldownTimeRemainingAndDuration_ReturnValue) == 0x000074, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_K2_GetCooldownTimeRemainingAndDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_SetDuration_ReturnValue) == 0x000078, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_SetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000088, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_CustomEvent_Enable) == 0x000090, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000098, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_AsI_FOVAble_2) == 0x0000A0, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_AsI_FOVAble_2' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0000B8, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_Abs_ReturnValue) == 0x0000D8, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E8, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x0000F0, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_AsI_FOVAble_3) == 0x0000F8, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_AsI_FOVAble_3' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench, Temp_bool_Has_Been_Initd_Variable) == 0x000109, "Member 'GA_ThrowWrench_C_ExecuteUbergraph_GA_ThrowWrench::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_ThrowWrench_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_ThrowWrench_C_K2_OnEndAbility");
static_assert(sizeof(GA_ThrowWrench_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_ThrowWrench_C_K2_OnEndAbility");
static_assert(offsetof(GA_ThrowWrench_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_ThrowWrench_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.LookForTargetsInFront
// 0x02F0 (0x02F0 - 0x0000)
struct GA_ThrowWrench_C_LookForTargetsInFront final
{
public:
	class ACharacter*                             FirstCharacterFound;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_TraceFrom_C>        K2Node_DynamicCast_AsI_Trace_From;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTraceFrom_Location;                    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTraceFrom_Rotation;                    // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0108(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_LookForTargetsInFront) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_LookForTargetsInFront");
static_assert(sizeof(GA_ThrowWrench_C_LookForTargetsInFront) == 0x0002F0, "Wrong size on GA_ThrowWrench_C_LookForTargetsInFront");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, FirstCharacterFound) == 0x000000, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::FirstCharacterFound' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_MakeArray_Array) == 0x000020, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000030, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_MakeArray_Array_1) == 0x000048, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000058, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_DynamicCast_AsI_Trace_From) == 0x000060, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_DynamicCast_AsI_Trace_From' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_GetTraceFrom_Location) == 0x000078, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_GetTraceFrom_Location' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_GetTraceFrom_Rotation) == 0x000090, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_GetTraceFrom_Rotation' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_GetForwardVector_ReturnValue) == 0x0000A8, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C0, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x0000F0, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x000100, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000101, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Array_Get_Item) == 0x000108, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_bBlockingHit) == 0x000200, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_bInitialOverlap) == 0x000201, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_Time) == 0x000204, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_Distance) == 0x000208, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_Location) == 0x000210, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_ImpactPoint) == 0x000228, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_BoneName) == 0x000290, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_HitItem) == 0x000298, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_ElementIndex) == 0x00029C, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_FaceIndex) == 0x0002A0, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_TraceStart) == 0x0002A8, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_BreakHitResult_TraceEnd) == 0x0002C0, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Array_Length_ReturnValue) == 0x0002D8, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_DynamicCast_AsCharacter) == 0x0002E0, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, K2Node_DynamicCast_bSuccess_1) == 0x0002E8, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_LookForTargetsInFront, CallFunc_Less_IntInt_ReturnValue) == 0x0002E9, "Member 'GA_ThrowWrench_C_LookForTargetsInFront::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.SetOnCooldown
// 0x0160 (0x0160 - 0x0000)
struct GA_ThrowWrench_C_SetOnCooldown final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetAssociatedEquipment_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0038(0x0010)(ReferenceParm)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0050(0x0100)(NoDestructor)
	class UStaticMeshComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_SetOnCooldown) == 0x000010, "Wrong alignment on GA_ThrowWrench_C_SetOnCooldown");
static_assert(sizeof(GA_ThrowWrench_C_SetOnCooldown) == 0x000160, "Wrong size on GA_ThrowWrench_C_SetOnCooldown");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, Enable) == 0x000000, "Member 'GA_ThrowWrench_C_SetOnCooldown::Enable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, Temp_object_Variable) == 0x000008, "Member 'GA_ThrowWrench_C_SetOnCooldown::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, Temp_object_Variable_1) == 0x000010, "Member 'GA_ThrowWrench_C_SetOnCooldown::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, Temp_bool_Variable) == 0x000018, "Member 'GA_ThrowWrench_C_SetOnCooldown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, CallFunc_GetAssociatedEquipment_ReturnValue) == 0x000020, "Member 'GA_ThrowWrench_C_SetOnCooldown::CallFunc_GetAssociatedEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_ThrowWrench_C_SetOnCooldown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, K2Node_Select_Default) == 0x000030, "Member 'GA_ThrowWrench_C_SetOnCooldown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, CallFunc_GetSpawnedActors_ReturnValue) == 0x000038, "Member 'GA_ThrowWrench_C_SetOnCooldown::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, CallFunc_Array_Get_Item) == 0x000050, "Member 'GA_ThrowWrench_C_SetOnCooldown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_SetOnCooldown, CallFunc_GetComponentByClass_ReturnValue) == 0x000150, "Member 'GA_ThrowWrench_C_SetOnCooldown::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.TryHomeTowardsCharacter
// 0x0020 (0x0020 - 0x0000)
struct GA_ThrowWrench_C_TryHomeTowardsCharacter final
{
public:
	class ABP_ProjectileBase_C*                   Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_LookForTargetsInFront_FirstCharacterFound; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_GetProjectileComponent_ProjectileComponent; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_TryHomeTowardsCharacter) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_TryHomeTowardsCharacter");
static_assert(sizeof(GA_ThrowWrench_C_TryHomeTowardsCharacter) == 0x000020, "Wrong size on GA_ThrowWrench_C_TryHomeTowardsCharacter");
static_assert(offsetof(GA_ThrowWrench_C_TryHomeTowardsCharacter, Projectile) == 0x000000, "Member 'GA_ThrowWrench_C_TryHomeTowardsCharacter::Projectile' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_TryHomeTowardsCharacter, CallFunc_LookForTargetsInFront_FirstCharacterFound) == 0x000008, "Member 'GA_ThrowWrench_C_TryHomeTowardsCharacter::CallFunc_LookForTargetsInFront_FirstCharacterFound' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_TryHomeTowardsCharacter, CallFunc_GetProjectileComponent_ProjectileComponent) == 0x000010, "Member 'GA_ThrowWrench_C_TryHomeTowardsCharacter::CallFunc_GetProjectileComponent_ProjectileComponent' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_TryHomeTowardsCharacter, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_ThrowWrench_C_TryHomeTowardsCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_ThrowWrench.GA_ThrowWrench_C.GetDamage
// 0x0018 (0x0018 - 0x0000)
struct GA_ThrowWrench_C_GetDamage final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDamage_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ThrowWrench_C_GetDamage) == 0x000008, "Wrong alignment on GA_ThrowWrench_C_GetDamage");
static_assert(sizeof(GA_ThrowWrench_C_GetDamage) == 0x000018, "Wrong size on GA_ThrowWrench_C_GetDamage");
static_assert(offsetof(GA_ThrowWrench_C_GetDamage, ReturnValue) == 0x000000, "Member 'GA_ThrowWrench_C_GetDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_GetDamage, CallFunc_GetDamage_ReturnValue) == 0x000008, "Member 'GA_ThrowWrench_C_GetDamage::CallFunc_GetDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ThrowWrench_C_GetDamage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'GA_ThrowWrench_C_GetDamage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

}

