#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameMode_Match_Time

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameMode_Match_Time.GameMode_Match_Time_C.ExecuteUbergraph_GameMode_Match_Time
// 0x0028 (0x0028 - 0x0000)
struct GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time) == 0x000008, "Wrong alignment on GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time");
static_assert(sizeof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time) == 0x000028, "Wrong size on GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time");
static_assert(offsetof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time, EntryPoint) == 0x000000, "Member 'GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time, Temp_class_Variable) == 0x000020, "Member 'GameMode_Match_Time_C_ExecuteUbergraph_GameMode_Match_Time::Temp_class_Variable' has a wrong offset!");

// Function GameMode_Match_Time.GameMode_Match_Time_C.OnLoaded_336D133E40B74FFD3E0682A36D9B45D9
// 0x0008 (0x0008 - 0x0000)
struct GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9) == 0x000008, "Wrong alignment on GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9");
static_assert(sizeof(GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9) == 0x000008, "Wrong size on GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9");
static_assert(offsetof(GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9, Loaded) == 0x000000, "Member 'GameMode_Match_Time_C_OnLoaded_336D133E40B74FFD3E0682A36D9B45D9::Loaded' has a wrong offset!");

}

