#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_FireChargableEquipable

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_FireChargableEquipable.GCN_FireChargableEquipable_C.GetChargableEquipmentInstance
// 0x0020 (0x0020 - 0x0000)
struct GCN_FireChargableEquipable_C_GetChargableEquipmentInstance final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChargableEquipmentInstance_C*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChargableEquipmentInstance_C*          CallFunc_GetFirstInstanceOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance) == 0x000008, "Wrong alignment on GCN_FireChargableEquipable_C_GetChargableEquipmentInstance");
static_assert(sizeof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance) == 0x000020, "Wrong size on GCN_FireChargableEquipable_C_GetChargableEquipmentInstance");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance, Target) == 0x000000, "Member 'GCN_FireChargableEquipable_C_GetChargableEquipmentInstance::Target' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance, ReturnValue) == 0x000008, "Member 'GCN_FireChargableEquipable_C_GetChargableEquipmentInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GCN_FireChargableEquipable_C_GetChargableEquipmentInstance::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargableEquipmentInstance, CallFunc_GetFirstInstanceOfType_ReturnValue) == 0x000018, "Member 'GCN_FireChargableEquipable_C_GetChargableEquipmentInstance::CallFunc_GetFirstInstanceOfType_ReturnValue' has a wrong offset!");

// Function GCN_FireChargableEquipable.GCN_FireChargableEquipable_C.GetChargesPercentage
// 0x0028 (0x0028 - 0x0000)
struct GCN_FireChargableEquipable_C_GetChargesPercentage final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ChargesPercentage;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChargableEquipmentInstance_C*          CallFunc_GetFirstInstanceOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPercentageCharged_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_FireChargableEquipable_C_GetChargesPercentage) == 0x000008, "Wrong alignment on GCN_FireChargableEquipable_C_GetChargesPercentage");
static_assert(sizeof(GCN_FireChargableEquipable_C_GetChargesPercentage) == 0x000028, "Wrong size on GCN_FireChargableEquipable_C_GetChargesPercentage");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargesPercentage, Target) == 0x000000, "Member 'GCN_FireChargableEquipable_C_GetChargesPercentage::Target' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargesPercentage, ChargesPercentage) == 0x000008, "Member 'GCN_FireChargableEquipable_C_GetChargesPercentage::ChargesPercentage' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargesPercentage, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GCN_FireChargableEquipable_C_GetChargesPercentage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargesPercentage, CallFunc_GetFirstInstanceOfType_ReturnValue) == 0x000018, "Member 'GCN_FireChargableEquipable_C_GetChargesPercentage::CallFunc_GetFirstInstanceOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetChargesPercentage, CallFunc_GetPercentageCharged_ReturnValue) == 0x000020, "Member 'GCN_FireChargableEquipable_C_GetChargesPercentage::CallFunc_GetPercentageCharged_ReturnValue' has a wrong offset!");

// Function GCN_FireChargableEquipable.GCN_FireChargableEquipable_C.GetCurrentCharges
// 0x0028 (0x0028 - 0x0000)
struct GCN_FireChargableEquipable_C_GetCurrentCharges final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Charges;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_FireChargableEquipable_C_GetCurrentCharges) == 0x000008, "Wrong alignment on GCN_FireChargableEquipable_C_GetCurrentCharges");
static_assert(sizeof(GCN_FireChargableEquipable_C_GetCurrentCharges) == 0x000028, "Wrong size on GCN_FireChargableEquipable_C_GetCurrentCharges");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetCurrentCharges, Target) == 0x000000, "Member 'GCN_FireChargableEquipable_C_GetCurrentCharges::Target' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetCurrentCharges, Current_Charges) == 0x000008, "Member 'GCN_FireChargableEquipable_C_GetCurrentCharges::Current_Charges' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetCurrentCharges, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GCN_FireChargableEquipable_C_GetCurrentCharges::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetCurrentCharges, CallFunc_GetFirstItemOfType_ReturnValue) == 0x000018, "Member 'GCN_FireChargableEquipable_C_GetCurrentCharges::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_GetCurrentCharges, CallFunc_GetTagStackCount_ReturnValue) == 0x000020, "Member 'GCN_FireChargableEquipable_C_GetCurrentCharges::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");

// Function GCN_FireChargableEquipable.GCN_FireChargableEquipable_C.OnBurst
// 0x0168 (0x0168 - 0x0000)
struct GCN_FireChargableEquipable_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetChargesPercentage_ChargesPercentage;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFirstSpawnedActorWithInterface_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IChargableEquipmentInterface_C> K2Node_DynamicCast_AsChargable_Equipment_Interface; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCharges_Current_Charges;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_FireChargableEquipable_C_OnBurst) == 0x000008, "Wrong alignment on GCN_FireChargableEquipable_C_OnBurst");
static_assert(sizeof(GCN_FireChargableEquipable_C_OnBurst) == 0x000168, "Wrong size on GCN_FireChargableEquipable_C_OnBurst");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, Target) == 0x000000, "Member 'GCN_FireChargableEquipable_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_FireChargableEquipable_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GCN_FireChargableEquipable_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, CallFunc_GetComponentByClass_ReturnValue) == 0x000138, "Member 'GCN_FireChargableEquipable_C_OnBurst::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, CallFunc_GetChargesPercentage_ChargesPercentage) == 0x000140, "Member 'GCN_FireChargableEquipable_C_OnBurst::CallFunc_GetChargesPercentage_ChargesPercentage' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, CallFunc_GetFirstSpawnedActorWithInterface_ReturnValue) == 0x000148, "Member 'GCN_FireChargableEquipable_C_OnBurst::CallFunc_GetFirstSpawnedActorWithInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, K2Node_DynamicCast_AsChargable_Equipment_Interface) == 0x000150, "Member 'GCN_FireChargableEquipable_C_OnBurst::K2Node_DynamicCast_AsChargable_Equipment_Interface' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'GCN_FireChargableEquipable_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_FireChargableEquipable_C_OnBurst, CallFunc_GetCurrentCharges_Current_Charges) == 0x000164, "Member 'GCN_FireChargableEquipable_C_OnBurst::CallFunc_GetCurrentCharges_Current_Charges' has a wrong offset!");

}

