#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Potato_Slow

#include "Basic.hpp"

#include "S_ShowScreenSplatMessage_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_HideScreenSplatMessage_structs.hpp"


namespace SDK::Params
{

// Function GCN_Potato_Slow.GCN_Potato_Slow_C.OnActive
// 0x0140 (0x0140 - 0x0000)
struct GCN_Potato_Slow_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Target_ASC;                                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_ShowScreenSplatMessage              K2Node_MakeStruct_S_ShowScreenSplatMessage;        // 0x00F8(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Potato_Slow_C_OnActive) == 0x000008, "Wrong alignment on GCN_Potato_Slow_C_OnActive");
static_assert(sizeof(GCN_Potato_Slow_C_OnActive) == 0x000140, "Wrong size on GCN_Potato_Slow_C_OnActive");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, MyTarget) == 0x000000, "Member 'GCN_Potato_Slow_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, Parameters) == 0x000008, "Member 'GCN_Potato_Slow_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GCN_Potato_Slow_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, Target_ASC) == 0x0000E8, "Member 'GCN_Potato_Slow_C_OnActive::Target_ASC' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000F0, "Member 'GCN_Potato_Slow_C_OnActive::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, K2Node_MakeStruct_S_ShowScreenSplatMessage) == 0x0000F8, "Member 'GCN_Potato_Slow_C_OnActive::K2Node_MakeStruct_S_ShowScreenSplatMessage' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000120, "Member 'GCN_Potato_Slow_C_OnActive::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, CallFunc_GetOwner_ReturnValue) == 0x000128, "Member 'GCN_Potato_Slow_C_OnActive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, K2Node_DynamicCast_AsCharacter) == 0x000130, "Member 'GCN_Potato_Slow_C_OnActive::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'GCN_Potato_Slow_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnActive, CallFunc_IsLocallyControlled_ReturnValue) == 0x000139, "Member 'GCN_Potato_Slow_C_OnActive::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function GCN_Potato_Slow.GCN_Potato_Slow_C.OnRemove
// 0x0160 (0x0160 - 0x0000)
struct GCN_Potato_Slow_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Target_ASC;                                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_HideScreenSplatMessage              K2Node_MakeStruct_S_HideScreenSplatMessage;        // 0x0100(0x0028)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Character_C>        K2Node_DynamicCast_AsI_Character;                  // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDead_Dead;                           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Potato_Slow_C_OnRemove) == 0x000008, "Wrong alignment on GCN_Potato_Slow_C_OnRemove");
static_assert(sizeof(GCN_Potato_Slow_C_OnRemove) == 0x000160, "Wrong size on GCN_Potato_Slow_C_OnRemove");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, MyTarget) == 0x000000, "Member 'GCN_Potato_Slow_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, Parameters) == 0x000008, "Member 'GCN_Potato_Slow_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCN_Potato_Slow_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, Target_ASC) == 0x0000E8, "Member 'GCN_Potato_Slow_C_OnRemove::Target_ASC' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000F0, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F8, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, K2Node_MakeStruct_S_HideScreenSplatMessage) == 0x000100, "Member 'GCN_Potato_Slow_C_OnRemove::K2Node_MakeStruct_S_HideScreenSplatMessage' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000128, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00012C, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_GetOwner_ReturnValue) == 0x000130, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, K2Node_DynamicCast_AsCharacter) == 0x000138, "Member 'GCN_Potato_Slow_C_OnRemove::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GCN_Potato_Slow_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_IsLocallyControlled_ReturnValue) == 0x000141, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, K2Node_DynamicCast_AsI_Character) == 0x000148, "Member 'GCN_Potato_Slow_C_OnRemove::K2Node_DynamicCast_AsI_Character' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'GCN_Potato_Slow_C_OnRemove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_GetIsDead_Dead) == 0x000159, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_GetIsDead_Dead' has a wrong offset!");
static_assert(offsetof(GCN_Potato_Slow_C_OnRemove, CallFunc_BooleanOR_ReturnValue) == 0x00015A, "Member 'GCN_Potato_Slow_C_OnRemove::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

