#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_ShieldBlocked

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_ShieldBlocked.GCN_ShieldBlocked_C.OnBurst
// 0x03F0 (0x03F0 - 0x0000)
struct GCN_ShieldBlocked_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0140(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0168(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0188(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0218(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_TrashCanLid_Equipable_C*            CallFunc_GetFirstSpawnedActor_ReturnValue;         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_ShieldBlocked_C_OnBurst) == 0x000008, "Wrong alignment on GCN_ShieldBlocked_C_OnBurst");
static_assert(sizeof(GCN_ShieldBlocked_C_OnBurst) == 0x0003F0, "Wrong size on GCN_ShieldBlocked_C_OnBurst");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, Target) == 0x000000, "Member 'GCN_ShieldBlocked_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_ShieldBlocked_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GCN_ShieldBlocked_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000138, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00013C, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000140, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000158, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000160, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000168, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000188, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001A8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001C0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001D8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001E0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001E8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001F0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001F8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001FC, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000200, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000208, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_GetComponentByClass_ReturnValue) == 0x000210, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000218, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_GetFirstSpawnedActor_ReturnValue) == 0x000310, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_GetFirstSpawnedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_bBlockingHit) == 0x000318, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_bInitialOverlap) == 0x000319, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_Time) == 0x00031C, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_Distance) == 0x000320, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_Location) == 0x000328, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_ImpactPoint) == 0x000340, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_Normal) == 0x000358, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_ImpactNormal) == 0x000370, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_PhysMat) == 0x000388, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_HitActor) == 0x000390, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_HitComponent) == 0x000398, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_HitBoneName) == 0x0003A0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_BoneName) == 0x0003A8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_HitItem) == 0x0003B0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_ElementIndex) == 0x0003B4, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_FaceIndex) == 0x0003B8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_TraceStart) == 0x0003C0, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GCN_ShieldBlocked_C_OnBurst, CallFunc_BreakHitResult_TraceEnd) == 0x0003D8, "Member 'GCN_ShieldBlocked_C_OnBurst::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

}

