#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Concussed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Concussed.GCN_Concussed_C
// 0x0028 (0x0EC0 - 0x0E98)
class AGCN_Concussed_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Fade_Post_Process_Effects_2_E844CDE7451DC4AB0A9942B9E5E698DA; // 0x0EA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Post_Process_Effects_1_E844CDE7451DC4AB0A9942B9E5E698DA; // 0x0EA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade_Post_Process__Direction_E844CDE7451DC4AB0A9942B9E5E698DA; // 0x0EA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA9[0x7];                                      // 0x0EA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fade_Post_Process;                                 // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AChameleon_C*                           Chameleon;                                         // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EnablePostProcessEffects(bool Enable);
	void ExecuteUbergraph_GCN_Concussed(int32 EntryPoint);
	void Explode();
	void Fade_Post_Process__FinishedFunc();
	void Fade_Post_Process__UpdateFunc();
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void SetBlendOnPostProcess(float Blending_Opacity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Concussed_C">();
	}
	static class AGCN_Concussed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Concussed_C>();
	}
};
static_assert(alignof(AGCN_Concussed_C) == 0x000008, "Wrong alignment on AGCN_Concussed_C");
static_assert(sizeof(AGCN_Concussed_C) == 0x000EC0, "Wrong size on AGCN_Concussed_C");
static_assert(offsetof(AGCN_Concussed_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_Concussed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Concussed_C, Fade_Post_Process_Effects_2_E844CDE7451DC4AB0A9942B9E5E698DA) == 0x000EA0, "Member 'AGCN_Concussed_C::Fade_Post_Process_Effects_2_E844CDE7451DC4AB0A9942B9E5E698DA' has a wrong offset!");
static_assert(offsetof(AGCN_Concussed_C, Fade_Post_Process_Effects_1_E844CDE7451DC4AB0A9942B9E5E698DA) == 0x000EA4, "Member 'AGCN_Concussed_C::Fade_Post_Process_Effects_1_E844CDE7451DC4AB0A9942B9E5E698DA' has a wrong offset!");
static_assert(offsetof(AGCN_Concussed_C, Fade_Post_Process__Direction_E844CDE7451DC4AB0A9942B9E5E698DA) == 0x000EA8, "Member 'AGCN_Concussed_C::Fade_Post_Process__Direction_E844CDE7451DC4AB0A9942B9E5E698DA' has a wrong offset!");
static_assert(offsetof(AGCN_Concussed_C, Fade_Post_Process) == 0x000EB0, "Member 'AGCN_Concussed_C::Fade_Post_Process' has a wrong offset!");
static_assert(offsetof(AGCN_Concussed_C, Chameleon) == 0x000EB8, "Member 'AGCN_Concussed_C::Chameleon' has a wrong offset!");

}

