#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_GooseLeash

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_GooseLeash.GCN_GooseLeash_C.ExecuteUbergraph_GCN_GooseLeash
// 0x0100 (0x0100 - 0x0000)
struct GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0010(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0038(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0058(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Goose_C*                            K2Node_DynamicCast_AsBP_Goose;                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash) == 0x000008, "Wrong alignment on GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash");
static_assert(sizeof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash) == 0x000100, "Wrong size on GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, EntryPoint) == 0x000000, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000008, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00000C, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000010, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000028, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000030, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000038, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000058, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_Location) == 0x000078, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_Normal) == 0x000090, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0000A8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0000B0, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0000B8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0000C0, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0000C8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0000CC, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0000D0, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0000D8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, K2Node_DynamicCast_AsBP_Goose) == 0x0000E0, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::K2Node_DynamicCast_AsBP_Goose' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, K2Node_DynamicCast_AsBP_Resident_Character) == 0x0000F0, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'GCN_GooseLeash_C_ExecuteUbergraph_GCN_GooseLeash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GCN_GooseLeash.GCN_GooseLeash_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_GooseLeash_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_OnActive) == 0x000008, "Wrong alignment on GCN_GooseLeash_C_OnActive");
static_assert(sizeof(GCN_GooseLeash_C_OnActive) == 0x0000F8, "Wrong size on GCN_GooseLeash_C_OnActive");
static_assert(offsetof(GCN_GooseLeash_C_OnActive, MyTarget) == 0x000000, "Member 'GCN_GooseLeash_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnActive, Parameters_0) == 0x000008, "Member 'GCN_GooseLeash_C_OnActive::Parameters_0' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GCN_GooseLeash_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnActive, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'GCN_GooseLeash_C_OnActive::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnActive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'GCN_GooseLeash_C_OnActive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GCN_GooseLeash.GCN_GooseLeash_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_GooseLeash_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_OnRemove) == 0x000008, "Wrong alignment on GCN_GooseLeash_C_OnRemove");
static_assert(sizeof(GCN_GooseLeash_C_OnRemove) == 0x0000E8, "Wrong size on GCN_GooseLeash_C_OnRemove");
static_assert(offsetof(GCN_GooseLeash_C_OnRemove, MyTarget) == 0x000000, "Member 'GCN_GooseLeash_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnRemove, Parameters_0) == 0x000008, "Member 'GCN_GooseLeash_C_OnRemove::Parameters_0' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCN_GooseLeash_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GCN_GooseLeash.GCN_GooseLeash_C.PlaySoundAttached
// 0x0100 (0x0100 - 0x0000)
struct GCN_GooseLeash_C_PlaySoundAttached final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0018(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0040(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0060(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_PlaySoundAttached) == 0x000008, "Wrong alignment on GCN_GooseLeash_C_PlaySoundAttached");
static_assert(sizeof(GCN_GooseLeash_C_PlaySoundAttached) == 0x000100, "Wrong size on GCN_GooseLeash_C_PlaySoundAttached");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, Sound) == 0x000000, "Member 'GCN_GooseLeash_C_PlaySoundAttached::Sound' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, AudioComponent) == 0x000008, "Member 'GCN_GooseLeash_C_PlaySoundAttached::AudioComponent' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000010, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000014, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000018, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000030, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000038, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000040, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000060, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_Location) == 0x000080, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_Normal) == 0x000098, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0000B0, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0000B8, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0000C0, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0000C8, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0000D0, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0000D4, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0000D8, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0000E0, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E8, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_PlaySoundAttached, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000F8, "Member 'GCN_GooseLeash_C_PlaySoundAttached::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function GCN_GooseLeash.GCN_GooseLeash_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_GooseLeash_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_GooseLeash_C_ReceiveTick");
static_assert(sizeof(GCN_GooseLeash_C_ReceiveTick) == 0x000004, "Wrong size on GCN_GooseLeash_C_ReceiveTick");
static_assert(offsetof(GCN_GooseLeash_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_GooseLeash_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCN_GooseLeash.GCN_GooseLeash_C.SetCableEndLocation
// 0x00A0 (0x00A0 - 0x0000)
struct GCN_GooseLeash_C_SetCableEndLocation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_GooseLeash_C_SetCableEndLocation) == 0x000010, "Wrong alignment on GCN_GooseLeash_C_SetCableEndLocation");
static_assert(sizeof(GCN_GooseLeash_C_SetCableEndLocation) == 0x0000A0, "Wrong size on GCN_GooseLeash_C_SetCableEndLocation");
static_assert(offsetof(GCN_GooseLeash_C_SetCableEndLocation, Temp_bool_Variable) == 0x000000, "Member 'GCN_GooseLeash_C_SetCableEndLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_SetCableEndLocation, K2Node_Select_Default) == 0x000008, "Member 'GCN_GooseLeash_C_SetCableEndLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_SetCableEndLocation, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GCN_GooseLeash_C_SetCableEndLocation::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_SetCableEndLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x000070, "Member 'GCN_GooseLeash_C_SetCableEndLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_GooseLeash_C_SetCableEndLocation, CallFunc_InverseTransformLocation_ReturnValue) == 0x000088, "Member 'GCN_GooseLeash_C_SetCableEndLocation::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");

}

