#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_PlayerHurt

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_PlayerHurt.GCN_PlayerHurt_C.ExecuteUbergraph_GCN_PlayerHurt
// 0x0138 (0x0138 - 0x0000)
struct GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00D8)(ConstParm, ContainsInstancedReference)
	TScriptInterface<class II_Hittable_C>         K2Node_DynamicCast_AsI_Hittable;                   // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ImpactCosmetics_ChangedAttributes;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt) == 0x000008, "Wrong alignment on GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt");
static_assert(sizeof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt) == 0x000138, "Wrong size on GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, EntryPoint) == 0x000000, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_Event_MyTarget) == 0x000008, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_Event_EventType) == 0x000010, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_Event_Parameters) == 0x000018, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_DynamicCast_AsI_Hittable) == 0x0000F0, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_DynamicCast_AsI_Hittable' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_DynamicCast_AsPawn) == 0x000108, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, CallFunc_DoesImplementInterface_ReturnValue) == 0x000130, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt, CallFunc_ImpactCosmetics_ChangedAttributes) == 0x000131, "Member 'GCN_PlayerHurt_C_ExecuteUbergraph_GCN_PlayerHurt::CallFunc_ImpactCosmetics_ChangedAttributes' has a wrong offset!");

// Function GCN_PlayerHurt.GCN_PlayerHurt_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_PlayerHurt_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_PlayerHurt_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCN_PlayerHurt_C_K2_HandleGameplayCue");
static_assert(sizeof(GCN_PlayerHurt_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCN_PlayerHurt_C_K2_HandleGameplayCue");
static_assert(offsetof(GCN_PlayerHurt_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCN_PlayerHurt_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCN_PlayerHurt_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCN_PlayerHurt_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCN_PlayerHurt_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

