#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_GrappleHookPull

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_SpecialAbility_GrappleHookPull.GCN_SpecialAbility_GrappleHookPull_C
// 0x0140 (0x07A8 - 0x0668)
class AGCN_SpecialAbility_GrappleHookPull_C final : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveInterpolationComponent*           CurveInterpolation;                                // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plunger;                                           // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ChargeParticle;                                    // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Kevin_C*                            Kevin;                                             // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        Cable;                                             // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0698(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x06B0(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               MI_SpeedLines;                                     // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        WindAudio;                                         // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpoolAudio;                                        // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                GrappleAttachPoint;                                // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Cue();
	void BndEvt__GCN_SpecialAbility_GrappleHookPull_CurveInterpolation_K2Node_ComponentBoundEvent_0_OnCurveInterpolationUpdate__DelegateSignature(float InterpolatedValue);
	void BndEvt__GCN_SpecialAbility_GrappleHookPull_CurveInterpolation_K2Node_ComponentBoundEvent_1_OnCurveInterpolationComplete__DelegateSignature();
	void EnableSpeedLines(bool Enable);
	void ExecuteUbergraph_GCN_SpecialAbility_GrappleHookPull(int32 EntryPoint);
	void LandedDelegate_Event(const struct FHitResult& Hit);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	void PlaySoundAttached(class USoundBase* Sound, class UAudioComponent** AudioComponent);
	void ReceiveTick(float DeltaSeconds);
	void Remove_Cue();
	void SetCableEndLocation();
	void SetWindVolumeMultiplierBasedOnVelocity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_SpecialAbility_GrappleHookPull_C">();
	}
	static class AGCN_SpecialAbility_GrappleHookPull_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_SpecialAbility_GrappleHookPull_C>();
	}
};
static_assert(alignof(AGCN_SpecialAbility_GrappleHookPull_C) == 0x000008, "Wrong alignment on AGCN_SpecialAbility_GrappleHookPull_C");
static_assert(sizeof(AGCN_SpecialAbility_GrappleHookPull_C) == 0x0007A8, "Wrong size on AGCN_SpecialAbility_GrappleHookPull_C");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, UberGraphFrame) == 0x000668, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, CurveInterpolation) == 0x000670, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::CurveInterpolation' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, Plunger) == 0x000678, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::Plunger' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, ChargeParticle) == 0x000680, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::ChargeParticle' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, Kevin) == 0x000688, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::Kevin' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, Cable) == 0x000690, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::Cable' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, ImpactPoint) == 0x000698, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::ImpactPoint' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, Parameters) == 0x0006B0, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, MI_SpeedLines) == 0x000788, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::MI_SpeedLines' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, WindAudio) == 0x000790, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::WindAudio' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, SpoolAudio) == 0x000798, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::SpoolAudio' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_GrappleHookPull_C, GrappleAttachPoint) == 0x0007A0, "Member 'AGCN_SpecialAbility_GrappleHookPull_C::GrappleAttachPoint' has a wrong offset!");

}

