#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_OutOfStamina

#include "Basic.hpp"


namespace SDK::Params
{

// Function GCN_OutOfStamina.GCN_OutOfStamina_C.EnableOOStaminaEffect
// 0x0038 (0x0038 - 0x0000)
struct GCN_OutOfStamina_C_EnableOOStaminaEffect final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_OutOfStamina_C_EnableOOStaminaEffect) == 0x000008, "Wrong alignment on GCN_OutOfStamina_C_EnableOOStaminaEffect");
static_assert(sizeof(GCN_OutOfStamina_C_EnableOOStaminaEffect) == 0x000038, "Wrong size on GCN_OutOfStamina_C_EnableOOStaminaEffect");
static_assert(offsetof(GCN_OutOfStamina_C_EnableOOStaminaEffect, Enable) == 0x000000, "Member 'GCN_OutOfStamina_C_EnableOOStaminaEffect::Enable' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_EnableOOStaminaEffect, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'GCN_OutOfStamina_C_EnableOOStaminaEffect::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_EnableOOStaminaEffect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_OutOfStamina_C_EnableOOStaminaEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_EnableOOStaminaEffect, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000020, "Member 'GCN_OutOfStamina_C_EnableOOStaminaEffect::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_EnableOOStaminaEffect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'GCN_OutOfStamina_C_EnableOOStaminaEffect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function GCN_OutOfStamina.GCN_OutOfStamina_C.ExecuteUbergraph_GCN_OutOfStamina
// 0x0078 (0x0078 - 0x0000)
struct GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_PlayerCamera_C>     K2Node_DynamicCast_AsI_Player_Camera;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_OutOfStaminaSound_C> K2Node_DynamicCast_AsI_Out_Of_Stamina_Sound;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetPlayerCamera_Return;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetOutOfStaminaSound_Return;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina) == 0x000008, "Wrong alignment on GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina");
static_assert(sizeof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina) == 0x000078, "Wrong size on GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, EntryPoint) == 0x000000, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, K2Node_DynamicCast_AsI_Player_Camera) == 0x000008, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::K2Node_DynamicCast_AsI_Player_Camera' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, K2Node_DynamicCast_AsI_Out_Of_Stamina_Sound) == 0x000020, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::K2Node_DynamicCast_AsI_Out_Of_Stamina_Sound' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_GetPlayerCamera_Return) == 0x000038, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_GetPlayerCamera_Return' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_GetOutOfStaminaSound_Return) == 0x000040, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_GetOutOfStaminaSound_Return' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000048, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000058, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_Lerp_ReturnValue) == 0x000060, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000068, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000070, "Member 'GCN_OutOfStamina_C_ExecuteUbergraph_GCN_OutOfStamina::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

