#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Eating

#include "Basic.hpp"

#include "GASIW_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Eating.GCN_Eating_C.AddAnimations
// 0x00A8 (0x00A8 - 0x0000)
struct GCN_Eating_C_AddAnimations final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_FirstPersonAnimInstance; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_2;      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_3;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_4;      // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_5;      // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_AddAnimations) == 0x000008, "Wrong alignment on GCN_Eating_C_AddAnimations");
static_assert(sizeof(GCN_Eating_C_AddAnimations) == 0x0000A8, "Wrong size on GCN_Eating_C_AddAnimations");
static_assert(offsetof(GCN_Eating_C_AddAnimations, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCN_Eating_C_AddAnimations::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation) == 0x000008, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000020, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, CallFunc_Get_Anim_Instances_FirstPersonAnimInstance) == 0x000038, "Member 'GCN_Eating_C_AddAnimations::CallFunc_Get_Anim_Instances_FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance) == 0x000040, "Member 'GCN_Eating_C_AddAnimations::CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_2) == 0x000048, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_3) == 0x000060, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_3' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_4) == 0x000078, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_4' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_5) == 0x000090, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_5' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_AddAnimations, K2Node_DynamicCast_bSuccess_5) == 0x0000A0, "Member 'GCN_Eating_C_AddAnimations::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.ExecuteUbergraph_GCN_Eating
// 0x03E0 (0x03E0 - 0x0000)
struct GCN_Eating_C_ExecuteUbergraph_GCN_Eating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0148(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0220(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0280(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x02A8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x02C8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChargableEquipmentInstance_C*          K2Node_DynamicCast_AsChargable_Equipment_Instance; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_FirstPersonAnimInstance; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_2;      // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_3;      // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating) == 0x000008, "Wrong alignment on GCN_Eating_C_ExecuteUbergraph_GCN_Eating");
static_assert(sizeof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating) == 0x0003E0, "Wrong size on GCN_Eating_C_ExecuteUbergraph_GCN_Eating");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, EntryPoint) == 0x000000, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_Target_1) == 0x000008, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_SpawnResults_1) == 0x0000E8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_Target) == 0x000140, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_Parameters) == 0x000148, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_SpawnResults) == 0x000220, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000278, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00027C, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000280, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000298, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0002A0, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0002A8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0002C8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_Location) == 0x0002E8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_Normal) == 0x000300, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000318, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000320, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000328, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000330, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000338, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00033C, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000340, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000348, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000350, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess) == 0x000358, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsChargable_Equipment_Instance) == 0x000360, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsChargable_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_Event_DeltaSeconds) == 0x00036C, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsI_Character_Animation) == 0x000370, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess_2) == 0x000380, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000388, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess_3) == 0x000398, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_Get_Anim_Instances_FirstPersonAnimInstance) == 0x0003A0, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_Get_Anim_Instances_FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance) == 0x0003A8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsI_Character_Animation_2) == 0x0003B0, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsI_Character_Animation_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess_4) == 0x0003C0, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_AsI_Character_Animation_3) == 0x0003C8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_AsI_Character_Animation_3' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_ExecuteUbergraph_GCN_Eating, K2Node_DynamicCast_bSuccess_5) == 0x0003D8, "Member 'GCN_Eating_C_ExecuteUbergraph_GCN_Eating::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.FakeLerpInterpolationCharge
// 0x0018 (0x0018 - 0x0000)
struct GCN_Eating_C_FakeLerpInterpolationCharge final
{
public:
	double                                        Percentage;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPercentageCharged_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_FakeLerpInterpolationCharge) == 0x000008, "Wrong alignment on GCN_Eating_C_FakeLerpInterpolationCharge");
static_assert(sizeof(GCN_Eating_C_FakeLerpInterpolationCharge) == 0x000018, "Wrong size on GCN_Eating_C_FakeLerpInterpolationCharge");
static_assert(offsetof(GCN_Eating_C_FakeLerpInterpolationCharge, Percentage) == 0x000000, "Member 'GCN_Eating_C_FakeLerpInterpolationCharge::Percentage' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_FakeLerpInterpolationCharge, CallFunc_GetPercentageCharged_ReturnValue) == 0x000008, "Member 'GCN_Eating_C_FakeLerpInterpolationCharge::CallFunc_GetPercentageCharged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_FakeLerpInterpolationCharge, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'GCN_Eating_C_FakeLerpInterpolationCharge::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.Get Anim Instances
// 0x0040 (0x0040 - 0x0000)
struct GCN_Eating_C_Get_Anim_Instances final
{
public:
	class UAnimInstance*                          FirstPersonAnimInstance;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          ThirdPersonAnimInstance;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_Get_Anim_Instances) == 0x000008, "Wrong alignment on GCN_Eating_C_Get_Anim_Instances");
static_assert(sizeof(GCN_Eating_C_Get_Anim_Instances) == 0x000040, "Wrong size on GCN_Eating_C_Get_Anim_Instances");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, FirstPersonAnimInstance) == 0x000000, "Member 'GCN_Eating_C_Get_Anim_Instances::FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, ThirdPersonAnimInstance) == 0x000008, "Member 'GCN_Eating_C_Get_Anim_Instances::ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'GCN_Eating_C_Get_Anim_Instances::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, CallFunc_Array_Get_Item) == 0x000020, "Member 'GCN_Eating_C_Get_Anim_Instances::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'GCN_Eating_C_Get_Anim_Instances::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'GCN_Eating_C_Get_Anim_Instances::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_Get_Anim_Instances, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000038, "Member 'GCN_Eating_C_Get_Anim_Instances::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_Eating_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Eating_C_OnApplication) == 0x000008, "Wrong alignment on GCN_Eating_C_OnApplication");
static_assert(sizeof(GCN_Eating_C_OnApplication) == 0x000138, "Wrong size on GCN_Eating_C_OnApplication");
static_assert(offsetof(GCN_Eating_C_OnApplication, Target) == 0x000000, "Member 'GCN_Eating_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_Eating_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_Eating_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_Eating_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Eating_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Eating_C_OnRemoval");
static_assert(sizeof(GCN_Eating_C_OnRemoval) == 0x000138, "Wrong size on GCN_Eating_C_OnRemoval");
static_assert(offsetof(GCN_Eating_C_OnRemoval, Target) == 0x000000, "Member 'GCN_Eating_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Eating_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_Eating_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.PlayChargeSound
// 0x0140 (0x0140 - 0x0000)
struct GCN_Eating_C_PlayChargeSound final
{
public:
	class UEquipmentInstance*                     EquipmentInstance;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnedActorData>              CallFunc_GetSpawnedActors_ReturnValue;             // 0x0008(0x0010)(ReferenceParm)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnedActorData                      CallFunc_Array_Get_Item;                           // 0x0020(0x0100)(NoDestructor)
	TScriptInterface<class II_Soundable_C>        K2Node_DynamicCast_AsI_Soundable;                  // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_PlayChargeSound) == 0x000010, "Wrong alignment on GCN_Eating_C_PlayChargeSound");
static_assert(sizeof(GCN_Eating_C_PlayChargeSound) == 0x000140, "Wrong size on GCN_Eating_C_PlayChargeSound");
static_assert(offsetof(GCN_Eating_C_PlayChargeSound, EquipmentInstance) == 0x000000, "Member 'GCN_Eating_C_PlayChargeSound::EquipmentInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_PlayChargeSound, CallFunc_GetSpawnedActors_ReturnValue) == 0x000008, "Member 'GCN_Eating_C_PlayChargeSound::CallFunc_GetSpawnedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_PlayChargeSound, CallFunc_Array_Get_Item) == 0x000020, "Member 'GCN_Eating_C_PlayChargeSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_PlayChargeSound, K2Node_DynamicCast_AsI_Soundable) == 0x000120, "Member 'GCN_Eating_C_PlayChargeSound::K2Node_DynamicCast_AsI_Soundable' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_PlayChargeSound, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GCN_Eating_C_PlayChargeSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Eating_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_Eating_C_ReceiveTick");
static_assert(sizeof(GCN_Eating_C_ReceiveTick) == 0x000004, "Wrong size on GCN_Eating_C_ReceiveTick");
static_assert(offsetof(GCN_Eating_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_Eating_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.SetStartFOV
// 0x0008 (0x0008 - 0x0000)
struct GCN_Eating_C_SetStartFOV final
{
public:
	double                                        K2Node_VariableSet_StartFOV_ImplicitCast;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_SetStartFOV) == 0x000008, "Wrong alignment on GCN_Eating_C_SetStartFOV");
static_assert(sizeof(GCN_Eating_C_SetStartFOV) == 0x000008, "Wrong size on GCN_Eating_C_SetStartFOV");
static_assert(offsetof(GCN_Eating_C_SetStartFOV, K2Node_VariableSet_StartFOV_ImplicitCast) == 0x000000, "Member 'GCN_Eating_C_SetStartFOV::K2Node_VariableSet_StartFOV_ImplicitCast' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.UpdateAnimations
// 0x0080 (0x0080 - 0x0000)
struct GCN_Eating_C_UpdateAnimations final
{
public:
	double                                        CallFunc_FakeLerpInterpolationCharge_Percentage;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_FirstPersonAnimInstance; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_2;      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_3;      // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_UpdateAnimations) == 0x000008, "Wrong alignment on GCN_Eating_C_UpdateAnimations");
static_assert(sizeof(GCN_Eating_C_UpdateAnimations) == 0x000080, "Wrong size on GCN_Eating_C_UpdateAnimations");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, CallFunc_FakeLerpInterpolationCharge_Percentage) == 0x000000, "Member 'GCN_Eating_C_UpdateAnimations::CallFunc_FakeLerpInterpolationCharge_Percentage' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'GCN_Eating_C_UpdateAnimations::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, CallFunc_Get_Anim_Instances_FirstPersonAnimInstance) == 0x000010, "Member 'GCN_Eating_C_UpdateAnimations::CallFunc_Get_Anim_Instances_FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance) == 0x000018, "Member 'GCN_Eating_C_UpdateAnimations::CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_AsI_Character_Animation) == 0x000020, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000038, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_AsI_Character_Animation_2) == 0x000050, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_AsI_Character_Animation_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_AsI_Character_Animation_3) == 0x000068, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_AsI_Character_Animation_3' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateAnimations, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'GCN_Eating_C_UpdateAnimations::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function GCN_Eating.GCN_Eating_C.UpdateZoomEffect
// 0x0018 (0x0018 - 0x0000)
struct GCN_Eating_C_UpdateZoomEffect final
{
public:
	double                                        CallFunc_GetPercentageCharged_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Eating_C_UpdateZoomEffect) == 0x000008, "Wrong alignment on GCN_Eating_C_UpdateZoomEffect");
static_assert(sizeof(GCN_Eating_C_UpdateZoomEffect) == 0x000018, "Wrong size on GCN_Eating_C_UpdateZoomEffect");
static_assert(offsetof(GCN_Eating_C_UpdateZoomEffect, CallFunc_GetPercentageCharged_ReturnValue) == 0x000000, "Member 'GCN_Eating_C_UpdateZoomEffect::CallFunc_GetPercentageCharged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateZoomEffect, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'GCN_Eating_C_UpdateZoomEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Eating_C_UpdateZoomEffect, CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast) == 0x000010, "Member 'GCN_Eating_C_UpdateZoomEffect::CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast' has a wrong offset!");

}

