#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_FuryRush_Charge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_SpecialAbility_FuryRush_Charge.GCN_SpecialAbility_FuryRush_Charge_C
// 0x0018 (0x0680 - 0x0668)
class AGCN_SpecialAbility_FuryRush_Charge_C final : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 My_Target;                                         // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ChargeParticle;                                    // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void All_Execute(class AActor* MyTarget);
	void All_Remove();
	void ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Charge(int32 EntryPoint);
	void Local_Execute();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void Other_Execute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_SpecialAbility_FuryRush_Charge_C">();
	}
	static class AGCN_SpecialAbility_FuryRush_Charge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_SpecialAbility_FuryRush_Charge_C>();
	}
};
static_assert(alignof(AGCN_SpecialAbility_FuryRush_Charge_C) == 0x000008, "Wrong alignment on AGCN_SpecialAbility_FuryRush_Charge_C");
static_assert(sizeof(AGCN_SpecialAbility_FuryRush_Charge_C) == 0x000680, "Wrong size on AGCN_SpecialAbility_FuryRush_Charge_C");
static_assert(offsetof(AGCN_SpecialAbility_FuryRush_Charge_C, UberGraphFrame) == 0x000668, "Member 'AGCN_SpecialAbility_FuryRush_Charge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_FuryRush_Charge_C, My_Target) == 0x000670, "Member 'AGCN_SpecialAbility_FuryRush_Charge_C::My_Target' has a wrong offset!");
static_assert(offsetof(AGCN_SpecialAbility_FuryRush_Charge_C, ChargeParticle) == 0x000678, "Member 'AGCN_SpecialAbility_FuryRush_Charge_C::ChargeParticle' has a wrong offset!");

}

