#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HitDecal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_HitDecal.GCN_HitDecal_C.OnExecute
// 0x01C0 (0x01C0 - 0x0000)
struct GCN_HitDecal_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0118(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0138(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitDecal_C_OnExecute) == 0x000008, "Wrong alignment on GCN_HitDecal_C_OnExecute");
static_assert(sizeof(GCN_HitDecal_C_OnExecute) == 0x0001C0, "Wrong size on GCN_HitDecal_C_OnExecute");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_HitDecal_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_HitDecal_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GCN_HitDecal_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000E4, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000E8, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F0, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000108, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000110, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000118, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000138, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000158, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000170, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GCN_HitDecal_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");

// Function GCN_HitDecal.GCN_HitDecal_C.Spawn Decal
// 0x01E0 (0x01E0 - 0x0000)
struct GCN_HitDecal_C_Spawn_Decal final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal_0;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Instigator_0;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      PhysMat;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_8;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_9;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_10;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_11;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_12;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_13;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_14;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_15;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_16;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_17;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_18;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble;                    // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HitDecal_subUV_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitDecal_C_Spawn_Decal) == 0x000010, "Wrong alignment on GCN_HitDecal_C_Spawn_Decal");
static_assert(sizeof(GCN_HitDecal_C_Spawn_Decal) == 0x0001E0, "Wrong size on GCN_HitDecal_C_Spawn_Decal");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Location) == 0x000000, "Member 'GCN_HitDecal_C_Spawn_Decal::Location' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Normal_0) == 0x000018, "Member 'GCN_HitDecal_C_Spawn_Decal::Normal_0' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Instigator_0) == 0x000030, "Member 'GCN_HitDecal_C_Spawn_Decal::Instigator_0' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, PhysMat) == 0x000038, "Member 'GCN_HitDecal_C_Spawn_Decal::PhysMat' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable) == 0x000040, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_1) == 0x000048, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_2) == 0x000050, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_3) == 0x000058, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_4) == 0x000060, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_5) == 0x000068, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_6) == 0x000070, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_7) == 0x000078, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_8) == 0x000080, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_9) == 0x000088, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_10) == 0x000090, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_11) == 0x000098, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_12) == 0x0000A0, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_13) == 0x0000A8, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_14) == 0x0000B0, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_15) == 0x0000B8, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_16) == 0x0000C0, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_17) == 0x0000C8, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_object_Variable_18) == 0x0000D0, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_GetGameState_ReturnValue) == 0x0000D8, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_HasMatchEnded_ReturnValue) == 0x0000E0, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_HasMatchEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E8, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_MakeVector_ReturnValue) == 0x0000F0, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_MakeRotFromZ_ReturnValue) == 0x000108, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, Temp_byte_Variable) == 0x000120, "Member 'GCN_HitDecal_C_Spawn_Decal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, K2Node_DynamicCast_AsI_FOVAble) == 0x000128, "Member 'GCN_HitDecal_C_Spawn_Decal::K2Node_DynamicCast_AsI_FOVAble' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'GCN_HitDecal_C_Spawn_Decal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, K2Node_Select_Default) == 0x000140, "Member 'GCN_HitDecal_C_Spawn_Decal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000148, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000160, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001D0, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitDecal_C_Spawn_Decal, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D8, "Member 'GCN_HitDecal_C_Spawn_Decal::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

