#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_NightStalkerActive

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.All_Add
// 0x0008 (0x0008 - 0x0000)
struct GCN_NightStalkerActive_C_All_Add final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_All_Add) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_All_Add");
static_assert(sizeof(GCN_NightStalkerActive_C_All_Add) == 0x000008, "Wrong size on GCN_NightStalkerActive_C_All_Add");
static_assert(offsetof(GCN_NightStalkerActive_C_All_Add, Target) == 0x000000, "Member 'GCN_NightStalkerActive_C_All_Add::Target' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.All_Remove
// 0x0008 (0x0008 - 0x0000)
struct GCN_NightStalkerActive_C_All_Remove final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_All_Remove) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_All_Remove");
static_assert(sizeof(GCN_NightStalkerActive_C_All_Remove) == 0x000008, "Wrong size on GCN_NightStalkerActive_C_All_Remove");
static_assert(offsetof(GCN_NightStalkerActive_C_All_Remove, Target) == 0x000000, "Member 'GCN_NightStalkerActive_C_All_Remove::Target' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.ExecuteUbergraph_GCN_NightStalkerActive
// 0x0088 (0x0088 - 0x0000)
struct GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_ScreenBorder_FuryRush_C*            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target_1;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInstigatorFromParams_Instigator;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive");
static_assert(sizeof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive) == 0x000088, "Wrong size on GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, EntryPoint) == 0x000000, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Create_ReturnValue) == 0x000010, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, K2Node_CustomEvent_Target_1) == 0x000020, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Array_Get_Item) == 0x000028, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000038, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, K2Node_CustomEvent_Target) == 0x000048, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000058, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000060, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_GetInstigatorFromParams_Instigator) == 0x000068, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_GetInstigatorFromParams_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000070, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000078, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'GCN_NightStalkerActive_C_ExecuteUbergraph_GCN_NightStalkerActive::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.GetInstigatorFromParams
// 0x00E0 (0x00E0 - 0x0000)
struct GCN_NightStalkerActive_C_GetInstigatorFromParams final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0010(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0038(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0058(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_GetInstigatorFromParams) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_GetInstigatorFromParams");
static_assert(sizeof(GCN_NightStalkerActive_C_GetInstigatorFromParams) == 0x0000E0, "Wrong size on GCN_NightStalkerActive_C_GetInstigatorFromParams");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, Instigator_0) == 0x000000, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::Instigator_0' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000008, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00000C, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000010, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000028, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000030, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000038, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000058, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_Location) == 0x000078, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_Normal) == 0x000090, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0000A8, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0000B0, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0000B8, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0000C0, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0000C8, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0000CC, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0000D0, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_GetInstigatorFromParams, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0000D8, "Member 'GCN_NightStalkerActive_C_GetInstigatorFromParams::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_NightStalkerActive_C_OnActive final
{
public:
	class AActor*                                 MyTarget_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_OnActive) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_OnActive");
static_assert(sizeof(GCN_NightStalkerActive_C_OnActive) == 0x0000F8, "Wrong size on GCN_NightStalkerActive_C_OnActive");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, MyTarget_0) == 0x000000, "Member 'GCN_NightStalkerActive_C_OnActive::MyTarget_0' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, Parameters_0) == 0x000008, "Member 'GCN_NightStalkerActive_C_OnActive::Parameters_0' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GCN_NightStalkerActive_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000E1, "Member 'GCN_NightStalkerActive_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'GCN_NightStalkerActive_C_OnActive::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnActive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'GCN_NightStalkerActive_C_OnActive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.OnRemove
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_NightStalkerActive_C_OnRemove final
{
public:
	class AActor*                                 MyTarget_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_OnRemove) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_OnRemove");
static_assert(sizeof(GCN_NightStalkerActive_C_OnRemove) == 0x0000F8, "Wrong size on GCN_NightStalkerActive_C_OnRemove");
static_assert(offsetof(GCN_NightStalkerActive_C_OnRemove, MyTarget_0) == 0x000000, "Member 'GCN_NightStalkerActive_C_OnRemove::MyTarget_0' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnRemove, Parameters_0) == 0x000008, "Member 'GCN_NightStalkerActive_C_OnRemove::Parameters_0' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GCN_NightStalkerActive_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnRemove, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'GCN_NightStalkerActive_C_OnRemove::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_OnRemove, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'GCN_NightStalkerActive_C_OnRemove::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GCN_NightStalkerActive.GCN_NightStalkerActive_C.SetFaceAnimToAngryForDuration
// 0x0118 (0x0118 - 0x0000)
struct GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration final
{
public:
	class AActor*                                 CallFunc_GetInstigatorFromParams_Instigator;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0010(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0038(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0058(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetFacialStates_HoldStateDuration_ImplicitCast; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration) == 0x000008, "Wrong alignment on GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration");
static_assert(sizeof(GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration) == 0x000118, "Wrong size on GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration");
static_assert(offsetof(GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration, CallFunc_GetInstigatorFromParams_Instigator) == 0x000000, "Member 'GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration::CallFunc_GetInstigatorFromParams_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000008, "Member 'GCN_NightStalkerActive_C_SetFaceAnimToAngryForDuration::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
