#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_AbilityActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_AbilityActorBase.GCN_AbilityActorBase_C
// 0x00E8 (0x03E8 - 0x0300)
class AGCN_AbilityActorBase_C : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0310(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void All_Add();
	void All_Remove();
	void ExecuteUbergraph_GCN_AbilityActorBase(int32 EntryPoint);
	void GetInstigatorFromParams(class AActor** Instigator_0);
	void Local_Add();
	void Local_Remove();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters_0);
	void Other_Add();
	void Other_Remove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_AbilityActorBase_C">();
	}
	static class AGCN_AbilityActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_AbilityActorBase_C>();
	}
};
static_assert(alignof(AGCN_AbilityActorBase_C) == 0x000008, "Wrong alignment on AGCN_AbilityActorBase_C");
static_assert(sizeof(AGCN_AbilityActorBase_C) == 0x0003E8, "Wrong size on AGCN_AbilityActorBase_C");
static_assert(offsetof(AGCN_AbilityActorBase_C, UberGraphFrame) == 0x000300, "Member 'AGCN_AbilityActorBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_AbilityActorBase_C, DefaultSceneRoot) == 0x000308, "Member 'AGCN_AbilityActorBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCN_AbilityActorBase_C, Parameters) == 0x000310, "Member 'AGCN_AbilityActorBase_C::Parameters' has a wrong offset!");

}

