#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Jump.GCN_Jump_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x0000F8, "Wrong size on GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0, Hit) == 0x000000, "Member 'GCN_Jump_C_CREATEDELEGATE_PROXYFUNCTION_0::Hit' has a wrong offset!");

// Function GCN_Jump.GCN_Jump_C.ExecuteUbergraph_GCN_Jump
// 0x0310 (0x0310 - 0x0000)
struct GCN_Jump_C_ExecuteUbergraph_GCN_Jump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EffectGameplayTag, const struct FActiveGameplayEffectHandle& Handle, int32 NewStackCount, int32 OldStackCount)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EffectGameplayTag;              // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_Handle;                         // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldStackCount;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0050(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0128(0x0058)(ConstParm, ContainsInstancedReference)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0190(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncTaskEffectStackChanged*           CallFunc_ListenForGameplayEffectStackChange_ReturnValue; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump) == 0x000008, "Wrong alignment on GCN_Jump_C_ExecuteUbergraph_GCN_Jump");
static_assert(sizeof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump) == 0x000310, "Wrong size on GCN_Jump_C_ExecuteUbergraph_GCN_Jump");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, EntryPoint) == 0x000000, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CustomEvent_EffectGameplayTag) == 0x000018, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CustomEvent_EffectGameplayTag' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CustomEvent_Handle) == 0x000020, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CustomEvent_Handle' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CustomEvent_NewStackCount) == 0x000028, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CustomEvent_OldStackCount) == 0x00002C, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CustomEvent_OldStackCount' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, Temp_int_Variable) == 0x000030, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, Temp_int_Variable_1) == 0x000034, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, Temp_struct_Variable) == 0x000038, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, Temp_struct_Variable_1) == 0x000040, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_Event_Target) == 0x000048, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_Event_Parameters) == 0x000050, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_Event_SpawnResults) == 0x000128, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_DynamicCast_AsCharacter) == 0x000180, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CustomEvent_HitResult) == 0x000190, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, K2Node_CreateDelegate_OutputDelegate_1) == 0x000288, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_GetVelocity_ReturnValue) == 0x000298, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0002B0, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_VSize_ReturnValue) == 0x0002B8, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_MapRangeClamped_ReturnValue) == 0x0002C0, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C8, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0002E0, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_Conv_StringToDouble_ReturnValue) == 0x0002F0, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0002F8, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_ListenForGameplayEffectStackChange_ReturnValue) == 0x000300, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_ListenForGameplayEffectStackChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_IsValid_ReturnValue_1) == 0x000308, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_IsValid_ReturnValue_2) == 0x000309, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_ExecuteUbergraph_GCN_Jump, CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast) == 0x00030C, "Member 'GCN_Jump_C_ExecuteUbergraph_GCN_Jump::CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function GCN_Jump.GCN_Jump_C.Land
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_Jump_C_Land final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_Jump_C_Land) == 0x000008, "Wrong alignment on GCN_Jump_C_Land");
static_assert(sizeof(GCN_Jump_C_Land) == 0x0000F8, "Wrong size on GCN_Jump_C_Land");
static_assert(offsetof(GCN_Jump_C_Land, HitResult) == 0x000000, "Member 'GCN_Jump_C_Land::HitResult' has a wrong offset!");

// Function GCN_Jump.GCN_Jump_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_Jump_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Jump_C_OnApplication) == 0x000008, "Wrong alignment on GCN_Jump_C_OnApplication");
static_assert(sizeof(GCN_Jump_C_OnApplication) == 0x000138, "Wrong size on GCN_Jump_C_OnApplication");
static_assert(offsetof(GCN_Jump_C_OnApplication, Target) == 0x000000, "Member 'GCN_Jump_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_Jump_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_Jump_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_Jump.GCN_Jump_C.OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427
// 0x0018 (0x0018 - 0x0000)
struct GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427 final
{
public:
	struct FGameplayTag                           EffectGameplayTag;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldStackCount;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427) == 0x000004, "Wrong alignment on GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427");
static_assert(sizeof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427) == 0x000018, "Wrong size on GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427");
static_assert(offsetof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427, EffectGameplayTag) == 0x000000, "Member 'GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427::EffectGameplayTag' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427, Handle) == 0x000008, "Member 'GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427::Handle' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427, NewStackCount) == 0x000010, "Member 'GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427::NewStackCount' has a wrong offset!");
static_assert(offsetof(GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427, OldStackCount) == 0x000014, "Member 'GCN_Jump_C_OnGameplayEffectStackChange_879A1349468925F3855D48B9DCA9E427::OldStackCount' has a wrong offset!");

}

