#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Heal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Heal.GCN_Heal_C.AddAnimations
// 0x00A8 (0x00A8 - 0x0000)
struct GCN_Heal_C_AddAnimations final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_FirstPersonAnimInstance; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_2;      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_3;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_4;      // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_5;      // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Heal_C_AddAnimations) == 0x000008, "Wrong alignment on GCN_Heal_C_AddAnimations");
static_assert(sizeof(GCN_Heal_C_AddAnimations) == 0x0000A8, "Wrong size on GCN_Heal_C_AddAnimations");
static_assert(offsetof(GCN_Heal_C_AddAnimations, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCN_Heal_C_AddAnimations::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation) == 0x000008, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000020, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, CallFunc_Get_Anim_Instances_FirstPersonAnimInstance) == 0x000038, "Member 'GCN_Heal_C_AddAnimations::CallFunc_Get_Anim_Instances_FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance) == 0x000040, "Member 'GCN_Heal_C_AddAnimations::CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_2) == 0x000048, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_2' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_3) == 0x000060, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_3' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_4) == 0x000078, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_4' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_AsI_Character_Animation_5) == 0x000090, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_AsI_Character_Animation_5' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_AddAnimations, K2Node_DynamicCast_bSuccess_5) == 0x0000A0, "Member 'GCN_Heal_C_AddAnimations::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function GCN_Heal.GCN_Heal_C.ExecuteUbergraph_GCN_Heal
// 0x03E0 (0x03E0 - 0x0000)
struct GCN_Heal_C_ExecuteUbergraph_GCN_Heal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0148(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0170(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0190(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0230(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0308(0x0058)(ConstParm, ContainsInstancedReference)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_FirstPersonAnimInstance; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation;        // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_1;      // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_2;      // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_CharacterAnimation_C> K2Node_DynamicCast_AsI_Character_Animation_3;      // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal) == 0x000008, "Wrong alignment on GCN_Heal_C_ExecuteUbergraph_GCN_Heal");
static_assert(sizeof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal) == 0x0003E0, "Wrong size on GCN_Heal_C_ExecuteUbergraph_GCN_Heal");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, EntryPoint) == 0x000000, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_Target_1) == 0x000008, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_SpawnResults_1) == 0x0000E8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000140, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000144, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000148, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000160, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000168, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000170, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000190, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_Location) == 0x0001B0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001C8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001E0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001E8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001F0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001F8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000200, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000204, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000208, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000210, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000218, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_Target) == 0x000228, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_Parameters) == 0x000230, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_Event_SpawnResults) == 0x000308, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_Get_Anim_Instances_FirstPersonAnimInstance) == 0x000360, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_Get_Anim_Instances_FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance) == 0x000368, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_Get_Anim_Instances_ThirdPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_AsI_Character_Animation) == 0x000370, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_AsI_Character_Animation' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_bSuccess_1) == 0x000380, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_AsI_Character_Animation_1) == 0x000388, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_AsI_Character_Animation_1' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_bSuccess_2) == 0x000398, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_AsI_Character_Animation_2) == 0x0003A0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_AsI_Character_Animation_2' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_bSuccess_3) == 0x0003B0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_AsI_Character_Animation_3) == 0x0003B8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_AsI_Character_Animation_3' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, K2Node_DynamicCast_bSuccess_4) == 0x0003C8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003D0, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_ExecuteUbergraph_GCN_Heal, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0003D8, "Member 'GCN_Heal_C_ExecuteUbergraph_GCN_Heal::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function GCN_Heal.GCN_Heal_C.Get Anim Instances
// 0x0010 (0x0010 - 0x0000)
struct GCN_Heal_C_Get_Anim_Instances final
{
public:
	class UAnimInstance*                          FirstPersonAnimInstance;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          ThirdPersonAnimInstance;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Heal_C_Get_Anim_Instances) == 0x000008, "Wrong alignment on GCN_Heal_C_Get_Anim_Instances");
static_assert(sizeof(GCN_Heal_C_Get_Anim_Instances) == 0x000010, "Wrong size on GCN_Heal_C_Get_Anim_Instances");
static_assert(offsetof(GCN_Heal_C_Get_Anim_Instances, FirstPersonAnimInstance) == 0x000000, "Member 'GCN_Heal_C_Get_Anim_Instances::FirstPersonAnimInstance' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_Get_Anim_Instances, ThirdPersonAnimInstance) == 0x000008, "Member 'GCN_Heal_C_Get_Anim_Instances::ThirdPersonAnimInstance' has a wrong offset!");

// Function GCN_Heal.GCN_Heal_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GCN_Heal_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Heal_C_OnApplication) == 0x000008, "Wrong alignment on GCN_Heal_C_OnApplication");
static_assert(sizeof(GCN_Heal_C_OnApplication) == 0x000138, "Wrong size on GCN_Heal_C_OnApplication");
static_assert(offsetof(GCN_Heal_C_OnApplication, Target) == 0x000000, "Member 'GCN_Heal_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_OnApplication, Parameters) == 0x000008, "Member 'GCN_Heal_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GCN_Heal_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GCN_Heal.GCN_Heal_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_Heal_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Heal_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Heal_C_OnRemoval");
static_assert(sizeof(GCN_Heal_C_OnRemoval) == 0x000138, "Wrong size on GCN_Heal_C_OnRemoval");
static_assert(offsetof(GCN_Heal_C_OnRemoval, Target) == 0x000000, "Member 'GCN_Heal_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Heal_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Heal_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_Heal_C_OnRemoval::SpawnResults' has a wrong offset!");

}

