#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_TeaBag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GCN_AbilityActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_TeaBag.GCN_TeaBag_C
// 0x0028 (0x0410 - 0x03E8)
class AGCN_TeaBag_C final : public AGCN_AbilityActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GCN_TeaBag_C;                       // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_Equipable_C*>                LocalSpawnedActors;                                // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_Equipable_C*>                OtherSpawnedActors;                                // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCN_TeaBag(int32 EntryPoint);
	void Local_Add();
	void Local_Remove();
	void Other_Add();
	void Other_Remove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_TeaBag_C">();
	}
	static class AGCN_TeaBag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_TeaBag_C>();
	}
};
static_assert(alignof(AGCN_TeaBag_C) == 0x000008, "Wrong alignment on AGCN_TeaBag_C");
static_assert(sizeof(AGCN_TeaBag_C) == 0x000410, "Wrong size on AGCN_TeaBag_C");
static_assert(offsetof(AGCN_TeaBag_C, UberGraphFrame_GCN_TeaBag_C) == 0x0003E8, "Member 'AGCN_TeaBag_C::UberGraphFrame_GCN_TeaBag_C' has a wrong offset!");
static_assert(offsetof(AGCN_TeaBag_C, LocalSpawnedActors) == 0x0003F0, "Member 'AGCN_TeaBag_C::LocalSpawnedActors' has a wrong offset!");
static_assert(offsetof(AGCN_TeaBag_C, OtherSpawnedActors) == 0x000400, "Member 'AGCN_TeaBag_C::OtherSpawnedActors' has a wrong offset!");

}

