#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_FuryRush_Hit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_SpecialAbility_FuryRush_Hit.GCN_SpecialAbility_FuryRush_Hit_C.ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit
// 0x0170 (0x0170 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_ScreenBorder_FuryRush_C*>    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ScreenBorder_FuryRush_C*            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0040(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0118(0x0058)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit) == 0x000170, "Wrong size on GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, EntryPoint) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, CallFunc_Array_Get_Item) == 0x000028, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, K2Node_Event_Target) == 0x000038, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, K2Node_Event_Parameters) == 0x000040, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit, K2Node_Event_SpawnResults) == 0x000118, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_ExecuteUbergraph_GCN_SpecialAbility_FuryRush_Hit::K2Node_Event_SpawnResults' has a wrong offset!");

// Function GCN_SpecialAbility_FuryRush_Hit.GCN_SpecialAbility_FuryRush_Hit_C.OnBurst
// 0x0138 (0x0138 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Hit_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Hit_C_OnBurst) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Hit_C_OnBurst");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Hit_C_OnBurst) == 0x000138, "Wrong size on GCN_SpecialAbility_FuryRush_Hit_C_OnBurst");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnBurst, Target) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnBurst::SpawnResults' has a wrong offset!");

// Function GCN_SpecialAbility_FuryRush_Hit.GCN_SpecialAbility_FuryRush_Hit_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_SpecialAbility_FuryRush_Hit_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute) == 0x000008, "Wrong alignment on GCN_SpecialAbility_FuryRush_Hit_C_OnExecute");
static_assert(sizeof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute) == 0x0000F8, "Wrong size on GCN_SpecialAbility_FuryRush_Hit_C_OnExecute");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F0, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_FuryRush_Hit_C_OnExecute, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F1, "Member 'GCN_SpecialAbility_FuryRush_Hit_C_OnExecute::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

