#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Sprint_LineTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Sprint_LineTrail.GCN_Sprint_LineTrail_C
// 0x0028 (0x0EC0 - 0x0E98)
class AGCN_Sprint_LineTrail_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SpawnedDust;                                       // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedTrail;                                      // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VelocityTimer;                                     // 0x0EB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SprintSound;                                       // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Sprint_LineTrail(int32 EntryPoint);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void Update_Sound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Sprint_LineTrail_C">();
	}
	static class AGCN_Sprint_LineTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Sprint_LineTrail_C>();
	}
};
static_assert(alignof(AGCN_Sprint_LineTrail_C) == 0x000008, "Wrong alignment on AGCN_Sprint_LineTrail_C");
static_assert(sizeof(AGCN_Sprint_LineTrail_C) == 0x000EC0, "Wrong size on AGCN_Sprint_LineTrail_C");
static_assert(offsetof(AGCN_Sprint_LineTrail_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_Sprint_LineTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Sprint_LineTrail_C, SpawnedDust) == 0x000EA0, "Member 'AGCN_Sprint_LineTrail_C::SpawnedDust' has a wrong offset!");
static_assert(offsetof(AGCN_Sprint_LineTrail_C, SpawnedTrail) == 0x000EA8, "Member 'AGCN_Sprint_LineTrail_C::SpawnedTrail' has a wrong offset!");
static_assert(offsetof(AGCN_Sprint_LineTrail_C, VelocityTimer) == 0x000EB0, "Member 'AGCN_Sprint_LineTrail_C::VelocityTimer' has a wrong offset!");
static_assert(offsetof(AGCN_Sprint_LineTrail_C, SprintSound) == 0x000EB8, "Member 'AGCN_Sprint_LineTrail_C::SprintSound' has a wrong offset!");

}

