#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HitEffect

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_HitEffect.GCN_HitEffect_C.ExecuteUbergraph_GCN_HitEffect
// 0x0490 (0x0490 - 0x0000)
struct GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_9;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_10;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_11;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_12;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_13;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_14;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_15;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_16;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_17;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00A0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x00C8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x00E8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitCharacterSelf_ReturnValue;           // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_18;                           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x0180(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x01A8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x01C8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlockingVolume_C*                   K2Node_DynamicCast_AsBP_Blocking_Volume;           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0268(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0340(0x0058)(ConstParm, ContainsInstancedReference)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_2; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_2; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_2; // 0x03A8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_2; // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_2; // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_2; // 0x03D0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_2; // 0x03F0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_2;    // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_2;      // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_2;  // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_2; // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_2; // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_2; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_2; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_2; // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_2; // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_2; // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect) == 0x000008, "Wrong alignment on GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect");
static_assert(sizeof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect) == 0x000490, "Wrong size on GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, EntryPoint) == 0x000000, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable) == 0x000008, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_1) == 0x000010, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_2) == 0x000018, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_3) == 0x000020, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_4) == 0x000028, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_5) == 0x000030, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_6) == 0x000038, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_7) == 0x000040, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_8) == 0x000048, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_9) == 0x000050, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_10) == 0x000058, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_11) == 0x000060, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_12) == 0x000068, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_13) == 0x000070, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_14) == 0x000078, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_15) == 0x000080, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_16) == 0x000088, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_17) == 0x000090, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000098, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00009C, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000A0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0000B8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0000C0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0000C8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0000E8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Location) == 0x000108, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Normal) == 0x000120, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000138, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000140, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000148, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000150, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000158, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00015C, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000160, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000168, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_IsHitCharacterSelf_ReturnValue) == 0x000169, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_IsHitCharacterSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_object_Variable_18) == 0x000170, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x000178, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x00017C, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x000180, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x000198, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x0001A0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x0001A8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x0001C8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Location_1) == 0x0001E8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x000200, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x000218, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x000220, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x000228, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x000230, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x000238, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x00023C, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x000240, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1) == 0x000248, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_DynamicCast_AsBP_Blocking_Volume) == 0x000250, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_DynamicCast_AsBP_Blocking_Volume' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_Event_Target) == 0x000260, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_Event_Parameters) == 0x000268, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_Event_SpawnResults) == 0x000340, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, Temp_byte_Variable) == 0x000398, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_2) == 0x00039C, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_RawMagnitude_2) == 0x0003A0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_RawMagnitude_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectContext_2) == 0x0003A8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectContext_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_MatchedTagName_2) == 0x0003C0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_MatchedTagName_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_OriginalTag_2) == 0x0003C8, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_OriginalTag_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_2) == 0x0003D0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_2) == 0x0003F0, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Location_2) == 0x000410, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Location_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Normal_2) == 0x000428, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Normal_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_Instigator_2) == 0x000440, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_Instigator_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_EffectCauser_2) == 0x000448, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_EffectCauser_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_SourceObject_2) == 0x000450, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_SourceObject_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_2) == 0x000458, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_2) == 0x000460, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_AbilityLevel_2) == 0x000464, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_AbilityLevel_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_2) == 0x000468, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_2) == 0x000470, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_2' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_HasTag_ReturnValue) == 0x000471, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, K2Node_Select_Default) == 0x000478, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000480, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_IsServer_ReturnValue) == 0x000488, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000489, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect, CallFunc_BooleanAND_ReturnValue) == 0x00048A, "Member 'GCN_HitEffect_C_ExecuteUbergraph_GCN_HitEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GCN_HitEffect.GCN_HitEffect_C.ImpactCosmeticsForActor
// 0x0168 (0x0168 - 0x0000)
struct GCN_HitEffect_C_ImpactCosmeticsForActor final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ImpactCauser;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0080(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x00A8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x00C8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_Hittable_C>         K2Node_DynamicCast_AsI_Hittable;                   // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ImpactCosmetics_ChangedAttributes;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitEffect_C_ImpactCosmeticsForActor) == 0x000008, "Wrong alignment on GCN_HitEffect_C_ImpactCosmeticsForActor");
static_assert(sizeof(GCN_HitEffect_C_ImpactCosmeticsForActor) == 0x000168, "Wrong size on GCN_HitEffect_C_ImpactCosmeticsForActor");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, Location) == 0x000000, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::Location' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, Normal) == 0x000018, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::Normal' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, ImpactCauser) == 0x000030, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::ImpactCauser' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000038, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, K2Node_DynamicCast_AsPawn) == 0x000050, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000078, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00007C, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000080, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000098, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0000A0, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0000A8, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0000C8, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_Location) == 0x0000E8, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_Normal) == 0x000100, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000118, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000120, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000128, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000130, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000138, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00013C, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000140, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000148, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, K2Node_DynamicCast_AsI_Hittable) == 0x000150, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::K2Node_DynamicCast_AsI_Hittable' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_ImpactCosmeticsForActor, CallFunc_ImpactCosmetics_ChangedAttributes) == 0x000161, "Member 'GCN_HitEffect_C_ImpactCosmeticsForActor::CallFunc_ImpactCosmetics_ChangedAttributes' has a wrong offset!");

// Function GCN_HitEffect.GCN_HitEffect_C.IsHitCharacterSelf
// 0x0028 (0x0028 - 0x0000)
struct GCN_HitEffect_C_IsHitCharacterSelf final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitEffect_C_IsHitCharacterSelf) == 0x000008, "Wrong alignment on GCN_HitEffect_C_IsHitCharacterSelf");
static_assert(sizeof(GCN_HitEffect_C_IsHitCharacterSelf) == 0x000028, "Wrong size on GCN_HitEffect_C_IsHitCharacterSelf");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, Object) == 0x000000, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::Object' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, ReturnValue) == 0x000008, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_IsHitCharacterSelf, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'GCN_HitEffect_C_IsHitCharacterSelf::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GCN_HitEffect.GCN_HitEffect_C.OnBurst
// 0x0138 (0x0138 - 0x0000)
struct GCN_HitEffect_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_HitEffect_C_OnBurst) == 0x000008, "Wrong alignment on GCN_HitEffect_C_OnBurst");
static_assert(sizeof(GCN_HitEffect_C_OnBurst) == 0x000138, "Wrong size on GCN_HitEffect_C_OnBurst");
static_assert(offsetof(GCN_HitEffect_C_OnBurst, Target) == 0x000000, "Member 'GCN_HitEffect_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_OnBurst, Parameters_0) == 0x000008, "Member 'GCN_HitEffect_C_OnBurst::Parameters_0' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GCN_HitEffect_C_OnBurst::SpawnResults' has a wrong offset!");

// Function GCN_HitEffect.GCN_HitEffect_C.PlayBashItemSpecificParticle
// 0x0100 (0x0100 - 0x0000)
struct GCN_HitEffect_C_PlayBashItemSpecificParticle final
{
public:
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0008(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0030(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0050(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HitEffect_C_PlayBashItemSpecificParticle) == 0x000008, "Wrong alignment on GCN_HitEffect_C_PlayBashItemSpecificParticle");
static_assert(sizeof(GCN_HitEffect_C_PlayBashItemSpecificParticle) == 0x000100, "Wrong size on GCN_HitEffect_C_PlayBashItemSpecificParticle");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000000, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000004, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000008, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000020, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000028, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HitEffect_C_PlayBashItemSpecificParticle, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000030, "Member 'GCN_HitEffect_C_PlayBashItemSpecificParticle::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
