#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_TrespassingAtNight

#include "Basic.hpp"


namespace SDK::Params
{

// Function GCN_TrespassingAtNight.GCN_TrespassingAtNight_C.Enable Trespassing Effect
// 0x0038 (0x0038 - 0x0000)
struct GCN_TrespassingAtNight_C_Enable_Trespassing_Effect final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect) == 0x000008, "Wrong alignment on GCN_TrespassingAtNight_C_Enable_Trespassing_Effect");
static_assert(sizeof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect) == 0x000038, "Wrong size on GCN_TrespassingAtNight_C_Enable_Trespassing_Effect");
static_assert(offsetof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect, Enable) == 0x000000, "Member 'GCN_TrespassingAtNight_C_Enable_Trespassing_Effect::Enable' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'GCN_TrespassingAtNight_C_Enable_Trespassing_Effect::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_TrespassingAtNight_C_Enable_Trespassing_Effect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000020, "Member 'GCN_TrespassingAtNight_C_Enable_Trespassing_Effect::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_Enable_Trespassing_Effect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'GCN_TrespassingAtNight_C_Enable_Trespassing_Effect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function GCN_TrespassingAtNight.GCN_TrespassingAtNight_C.ExecuteUbergraph_GCN_TrespassingAtNight
// 0x0050 (0x0050 - 0x0000)
struct GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_PlayerCamera_C>     K2Node_DynamicCast_AsI_Player_Camera;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetPlayerCamera_Return;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADowntimeManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight) == 0x000008, "Wrong alignment on GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight");
static_assert(sizeof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight) == 0x000050, "Wrong size on GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, EntryPoint) == 0x000000, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, K2Node_DynamicCast_AsI_Player_Camera) == 0x000010, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::K2Node_DynamicCast_AsI_Player_Camera' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_GetPlayerCamera_Return) == 0x000028, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_GetPlayerCamera_Return' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_GetActorOfClass_ReturnValue) == 0x000030, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000040, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000048, "Member 'GCN_TrespassingAtNight_C_ExecuteUbergraph_GCN_TrespassingAtNight::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

