#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_ForceDropHeldObject

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_ForceDropHeldObject.GCN_ForceDropHeldObject_C.K2_HandleGameplayCue
// 0x0250 (0x0250 - 0x0000)
struct GCN_ForceDropHeldObject_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0118(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0138(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ForceDroppedObject_C*               CallFunc_Create_ReturnValue;                       // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble;                    // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCN_ForceDropHeldObject_C_K2_HandleGameplayCue");
static_assert(sizeof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue) == 0x000250, "Wrong size on GCN_ForceDropHeldObject_C_K2_HandleGameplayCue");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000E8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000EC, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000108, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000110, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000118, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000138, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Location) == 0x000158, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Normal) == 0x000170, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001C0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001D0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_GetOwner_ReturnValue) == 0x0001E0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_GetAnimInstance_ReturnValue) == 0x0001E8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsCharacter) == 0x0001F0, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_Montage_Play_ReturnValue) == 0x0001FC, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_GetController_ReturnValue) == 0x000200, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000208, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsPlayer_Controller) == 0x000210, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsCharacter_1) == 0x000220, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_2) == 0x000228, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_Create_ReturnValue) == 0x000230, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_AsI_FOVAble) == 0x000238, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_AsI_FOVAble' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, K2Node_DynamicCast_bSuccess_3) == 0x000248, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GCN_ForceDropHeldObject_C_K2_HandleGameplayCue, CallFunc_IsLocallyControlled_ReturnValue) == 0x000249, "Member 'GCN_ForceDropHeldObject_C_K2_HandleGameplayCue::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

