#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Trapped

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Trapped.GCN_Trapped_C.ExecuteUbergraph_GCN_Trapped
// 0x02A8 (0x02A8 - 0x0000)
struct GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble;                    // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0160(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x0238(0x0058)(ConstParm, ContainsInstancedReference)
	TScriptInterface<class II_FOVAble_C>          K2Node_DynamicCast_AsI_FOVAble_1;                  // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped) == 0x000008, "Wrong alignment on GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped");
static_assert(sizeof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped) == 0x0002A8, "Wrong size on GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, EntryPoint) == 0x000000, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_Target) == 0x000008, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_Parameters) == 0x000010, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_SpawnResults) == 0x0000E8, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_DynamicCast_AsI_FOVAble) == 0x000140, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_DynamicCast_AsI_FOVAble' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_Target_1) == 0x000158, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_Parameters_1) == 0x000160, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_Event_SpawnResults_1) == 0x000238, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_DynamicCast_AsI_FOVAble_1) == 0x000290, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_DynamicCast_AsI_FOVAble_1' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped, K2Node_DynamicCast_bSuccess_1) == 0x0002A0, "Member 'GCN_Trapped_C_ExecuteUbergraph_GCN_Trapped::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GCN_Trapped.GCN_Trapped_C.OnLoopingStart
// 0x0138 (0x0138 - 0x0000)
struct GCN_Trapped_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Trapped_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCN_Trapped_C_OnLoopingStart");
static_assert(sizeof(GCN_Trapped_C_OnLoopingStart) == 0x000138, "Wrong size on GCN_Trapped_C_OnLoopingStart");
static_assert(offsetof(GCN_Trapped_C_OnLoopingStart, Target) == 0x000000, "Member 'GCN_Trapped_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCN_Trapped_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_OnLoopingStart, SpawnResults) == 0x0000E0, "Member 'GCN_Trapped_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GCN_Trapped.GCN_Trapped_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GCN_Trapped_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Trapped_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Trapped_C_OnRemoval");
static_assert(sizeof(GCN_Trapped_C_OnRemoval) == 0x000138, "Wrong size on GCN_Trapped_C_OnRemoval");
static_assert(offsetof(GCN_Trapped_C_OnRemoval, Target) == 0x000000, "Member 'GCN_Trapped_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Trapped_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Trapped_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GCN_Trapped_C_OnRemoval::SpawnResults' has a wrong offset!");

}

