#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_SpecialAbility_GrappleHookCharge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_SpecialAbility_GrappleHookCharge.GCN_SpecialAbility_GrappleHookCharge_C.ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge
// 0x00F0 (0x00F0 - 0x0000)
struct GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0010(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0038(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0058(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge) == 0x000008, "Wrong alignment on GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge");
static_assert(sizeof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge) == 0x0000F0, "Wrong size on GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, EntryPoint) == 0x000000, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000004, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000008, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000010, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000028, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000030, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000038, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000058, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_Location) == 0x000078, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_Normal) == 0x000090, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0000A8, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0000B0, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0000B8, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0000C0, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0000C8, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0000CC, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0000D0, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0000D8, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E0, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000E8, "Member 'GCN_SpecialAbility_GrappleHookCharge_C_ExecuteUbergraph_GCN_SpecialAbility_GrappleHookCharge::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

}

