#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HealingHuddle

#include "Basic.hpp"


namespace SDK::Params
{

// Function GCN_HealingHuddle.GCN_HealingHuddle_C.ExecuteUbergraph_GCN_HealingHuddle
// 0x0020 (0x0020 - 0x0000)
struct GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle) == 0x000008, "Wrong alignment on GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle");
static_assert(sizeof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle) == 0x000020, "Wrong size on GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle");
static_assert(offsetof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle, EntryPoint) == 0x000000, "Member 'GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000018, "Member 'GCN_HealingHuddle_C_ExecuteUbergraph_GCN_HealingHuddle::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

}

