#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HitEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_HitEffect.GCN_HitEffect_C
// 0x00F8 (0x0760 - 0x0668)
class AGCN_HitEffect_C : public AGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0670(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class USoundBase*                             ItemSpecificHitSound;                              // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ItemSpecificHitParticle;                           // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                DamageType;                                        // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayTargetPhysicalMaterialParticle;                // 0x0759(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayTargetPhysicalMaterialSound;                   // 0x075A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ItemSpecificParticleAttached;                      // 0x075B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnDecal;                                        // 0x075C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_HitEffect(int32 EntryPoint);
	void ImpactCosmeticsForActor(const struct FVector& Location, const struct FVector& Normal, class UObject* ImpactCauser);
	bool IsHitCharacterSelf(class UObject* Object);
	void OnBurst(class AActor* Target, const struct FGameplayCueParameters& Parameters_0, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void PlayBashItemSpecificParticle();
	void PlayPhysMatParticle();
	void Spawn_Decal(const struct FVector& Location, const struct FVector& Normal);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_HitEffect_C">();
	}
	static class AGCN_HitEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_HitEffect_C>();
	}
};
static_assert(alignof(AGCN_HitEffect_C) == 0x000008, "Wrong alignment on AGCN_HitEffect_C");
static_assert(sizeof(AGCN_HitEffect_C) == 0x000760, "Wrong size on AGCN_HitEffect_C");
static_assert(offsetof(AGCN_HitEffect_C, UberGraphFrame) == 0x000668, "Member 'AGCN_HitEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, Parameters) == 0x000670, "Member 'AGCN_HitEffect_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, ItemSpecificHitSound) == 0x000748, "Member 'AGCN_HitEffect_C::ItemSpecificHitSound' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, ItemSpecificHitParticle) == 0x000750, "Member 'AGCN_HitEffect_C::ItemSpecificHitParticle' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, DamageType) == 0x000758, "Member 'AGCN_HitEffect_C::DamageType' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, PlayTargetPhysicalMaterialParticle) == 0x000759, "Member 'AGCN_HitEffect_C::PlayTargetPhysicalMaterialParticle' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, PlayTargetPhysicalMaterialSound) == 0x00075A, "Member 'AGCN_HitEffect_C::PlayTargetPhysicalMaterialSound' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, ItemSpecificParticleAttached) == 0x00075B, "Member 'AGCN_HitEffect_C::ItemSpecificParticleAttached' has a wrong offset!");
static_assert(offsetof(AGCN_HitEffect_C, SpawnDecal) == 0x00075C, "Member 'AGCN_HitEffect_C::SpawnDecal' has a wrong offset!");

}

