#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_PlayerInFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_PlayerInFire.GCN_PlayerInFire_C
// 0x0020 (0x0EB8 - 0x0E98)
class AGCN_PlayerInFire_C final : public AGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSpeedOfPlayers;                                 // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerArrayEmpty;                                  // 0x0EB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_PlayerInFire(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRecurring(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_PlayerInFire_C">();
	}
	static class AGCN_PlayerInFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_PlayerInFire_C>();
	}
};
static_assert(alignof(AGCN_PlayerInFire_C) == 0x000008, "Wrong alignment on AGCN_PlayerInFire_C");
static_assert(sizeof(AGCN_PlayerInFire_C) == 0x000EB8, "Wrong size on AGCN_PlayerInFire_C");
static_assert(offsetof(AGCN_PlayerInFire_C, UberGraphFrame) == 0x000E98, "Member 'AGCN_PlayerInFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_PlayerInFire_C, Audio) == 0x000EA0, "Member 'AGCN_PlayerInFire_C::Audio' has a wrong offset!");
static_assert(offsetof(AGCN_PlayerInFire_C, MaxSpeedOfPlayers) == 0x000EA8, "Member 'AGCN_PlayerInFire_C::MaxSpeedOfPlayers' has a wrong offset!");
static_assert(offsetof(AGCN_PlayerInFire_C, PlayerArrayEmpty) == 0x000EB0, "Member 'AGCN_PlayerInFire_C::PlayerArrayEmpty' has a wrong offset!");

}

