#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_JetpackAffected

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_JetpackAffected.GCN_JetpackAffected_C.ExecuteUbergraph_GCN_JetpackAffected
// 0x0130 (0x0130 - 0x0000)
struct GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0030(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected) == 0x000008, "Wrong alignment on GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected");
static_assert(sizeof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected) == 0x000130, "Wrong size on GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, EntryPoint) == 0x000000, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000018, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_Event_MyTarget) == 0x000020, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_Event_EventType) == 0x000028, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_Event_Parameters) == 0x000030, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_SwitchEnum_CmpSuccess) == 0x000108, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000109, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000110, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x000120, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000129, "Member 'GCN_JetpackAffected_C_ExecuteUbergraph_GCN_JetpackAffected::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function GCN_JetpackAffected.GCN_JetpackAffected_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_JetpackAffected_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_JetpackAffected_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCN_JetpackAffected_C_K2_HandleGameplayCue");
static_assert(sizeof(GCN_JetpackAffected_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GCN_JetpackAffected_C_K2_HandleGameplayCue");
static_assert(offsetof(GCN_JetpackAffected_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCN_JetpackAffected_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCN_JetpackAffected_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCN_JetpackAffected_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GCN_JetpackAffected.GCN_JetpackAffected_C.OnExecute
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_JetpackAffected_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_JetpackAffected_C_OnExecute) == 0x000008, "Wrong alignment on GCN_JetpackAffected_C_OnExecute");
static_assert(sizeof(GCN_JetpackAffected_C_OnExecute) == 0x0000E8, "Wrong size on GCN_JetpackAffected_C_OnExecute");
static_assert(offsetof(GCN_JetpackAffected_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_JetpackAffected_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_JetpackAffected_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_JetpackAffected_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GCN_JetpackAffected_C_OnExecute::ReturnValue' has a wrong offset!");

}

