#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrabThrowableWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function GrabThrowableWI.GrabThrowableWI_C.ExecuteUbergraph_GrabThrowableWI
// 0x0018 (0x0018 - 0x0000)
struct GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Held;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI) == 0x000004, "Wrong alignment on GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI");
static_assert(sizeof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI) == 0x000018, "Wrong size on GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, EntryPoint) == 0x000000, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, Temp_bool_Variable) == 0x000004, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, Temp_int_Variable) == 0x000008, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, Temp_int_Variable_1) == 0x00000C, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, K2Node_CustomEvent_Held) == 0x000010, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::K2Node_CustomEvent_Held' has a wrong offset!");
static_assert(offsetof(GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI, K2Node_Select_Default) == 0x000014, "Member 'GrabThrowableWI_C_ExecuteUbergraph_GrabThrowableWI::K2Node_Select_Default' has a wrong offset!");

// Function GrabThrowableWI.GrabThrowableWI_C.Set Held
// 0x0001 (0x0001 - 0x0000)
struct GrabThrowableWI_C_Set_Held final
{
public:
	bool                                          Held;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrabThrowableWI_C_Set_Held) == 0x000001, "Wrong alignment on GrabThrowableWI_C_Set_Held");
static_assert(sizeof(GrabThrowableWI_C_Set_Held) == 0x000001, "Wrong size on GrabThrowableWI_C_Set_Held");
static_assert(offsetof(GrabThrowableWI_C_Set_Held, Held) == 0x000000, "Member 'GrabThrowableWI_C_Set_Held::Held' has a wrong offset!");

}

