#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrabThrowableWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GrabThrowableWI.GrabThrowableWI_C
// 0x0020 (0x0300 - 0x02E0)
class UGrabThrowableWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_MiscAbility_C*                      WI_MiscAbility;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_110;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GrabThrowableWI(int32 EntryPoint);
	void Set_Held(bool Held);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GrabThrowableWI_C">();
	}
	static class UGrabThrowableWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrabThrowableWI_C>();
	}
};
static_assert(alignof(UGrabThrowableWI_C) == 0x000008, "Wrong alignment on UGrabThrowableWI_C");
static_assert(sizeof(UGrabThrowableWI_C) == 0x000300, "Wrong size on UGrabThrowableWI_C");
static_assert(offsetof(UGrabThrowableWI_C, UberGraphFrame) == 0x0002E0, "Member 'UGrabThrowableWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGrabThrowableWI_C, WI_MiscAbility) == 0x0002E8, "Member 'UGrabThrowableWI_C::WI_MiscAbility' has a wrong offset!");
static_assert(offsetof(UGrabThrowableWI_C, WidgetSwitcher_110) == 0x0002F0, "Member 'UGrabThrowableWI_C::WidgetSwitcher_110' has a wrong offset!");
static_assert(offsetof(UGrabThrowableWI_C, PickedUp) == 0x0002F8, "Member 'UGrabThrowableWI_C::PickedUp' has a wrong offset!");

}

