#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthbarComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function HealthbarComponent.HealthBarComponent_C.ExecuteUbergraph_HealthBarComponent
// 0x0060 (0x0060 - 0x0000)
struct HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_MaxHealth;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_CustomEvent_Owner;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Health;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Max_Health;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Damage;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_Character_Attributes_C*             CallFunc_GetAttributes_WI_Attributes;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Character_Attributes_C*             CallFunc_GetAttributes_WI_Attributes_1;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent) == 0x000008, "Wrong alignment on HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent");
static_assert(sizeof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent) == 0x000060, "Wrong size on HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, EntryPoint) == 0x000000, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, K2Node_CustomEvent_MaxHealth) == 0x000008, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::K2Node_CustomEvent_MaxHealth' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, K2Node_CustomEvent_Owner) == 0x000010, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::K2Node_CustomEvent_Owner' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, K2Node_CustomEvent_Health) == 0x000018, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::K2Node_CustomEvent_Health' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, K2Node_CustomEvent_Max_Health) == 0x000020, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::K2Node_CustomEvent_Max_Health' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, K2Node_CustomEvent_Damage) == 0x000028, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_GetAttributes_WI_Attributes) == 0x000040, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_GetAttributes_WI_Attributes' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_GetAttributes_WI_Attributes_1) == 0x000050, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_GetAttributes_WI_Attributes_1' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'HealthBarComponent_C_ExecuteUbergraph_HealthBarComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.GetAttributes
// 0x0058 (0x0058 - 0x0000)
struct HealthBarComponent_C_GetAttributes final
{
public:
	class UWI_Character_Attributes_C*             WI_Attributes;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Character_Attributes_C*>     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_Character_Attributes_C*             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_GetAttributes) == 0x000008, "Wrong alignment on HealthBarComponent_C_GetAttributes");
static_assert(sizeof(HealthBarComponent_C_GetAttributes) == 0x000058, "Wrong size on HealthBarComponent_C_GetAttributes");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, WI_Attributes) == 0x000000, "Member 'HealthBarComponent_C_GetAttributes::WI_Attributes' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, Temp_int_Array_Index_Variable) == 0x000008, "Member 'HealthBarComponent_C_GetAttributes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'HealthBarComponent_C_GetAttributes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000028, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_Array_Get_Item) == 0x000038, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000048, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_GetAttributes, CallFunc_BooleanOR_ReturnValue) == 0x000053, "Member 'HealthBarComponent_C_GetAttributes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct HealthBarComponent_C_Initialize final
{
public:
	double                                        MaxHealth_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_Initialize) == 0x000008, "Wrong alignment on HealthBarComponent_C_Initialize");
static_assert(sizeof(HealthBarComponent_C_Initialize) == 0x000010, "Wrong size on HealthBarComponent_C_Initialize");
static_assert(offsetof(HealthBarComponent_C_Initialize, MaxHealth_0) == 0x000000, "Member 'HealthBarComponent_C_Initialize::MaxHealth_0' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_Initialize, Owner) == 0x000008, "Member 'HealthBarComponent_C_Initialize::Owner' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.Take Damage
// 0x0008 (0x0008 - 0x0000)
struct HealthBarComponent_C_Take_Damage final
{
public:
	double                                        Damage;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_Take_Damage) == 0x000008, "Wrong alignment on HealthBarComponent_C_Take_Damage");
static_assert(sizeof(HealthBarComponent_C_Take_Damage) == 0x000008, "Wrong size on HealthBarComponent_C_Take_Damage");
static_assert(offsetof(HealthBarComponent_C_Take_Damage, Damage) == 0x000000, "Member 'HealthBarComponent_C_Take_Damage::Damage' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.Update Health
// 0x0008 (0x0008 - 0x0000)
struct HealthBarComponent_C_Update_Health final
{
public:
	double                                        Health;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_Update_Health) == 0x000008, "Wrong alignment on HealthBarComponent_C_Update_Health");
static_assert(sizeof(HealthBarComponent_C_Update_Health) == 0x000008, "Wrong size on HealthBarComponent_C_Update_Health");
static_assert(offsetof(HealthBarComponent_C_Update_Health, Health) == 0x000000, "Member 'HealthBarComponent_C_Update_Health::Health' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.Update Max Health
// 0x0008 (0x0008 - 0x0000)
struct HealthBarComponent_C_Update_Max_Health final
{
public:
	double                                        Max_Health;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_Update_Max_Health) == 0x000008, "Wrong alignment on HealthBarComponent_C_Update_Max_Health");
static_assert(sizeof(HealthBarComponent_C_Update_Max_Health) == 0x000008, "Wrong size on HealthBarComponent_C_Update_Max_Health");
static_assert(offsetof(HealthBarComponent_C_Update_Max_Health, Max_Health) == 0x000000, "Member 'HealthBarComponent_C_Update_Max_Health::Max_Health' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.UpdateHealthBarPercentage
// 0x0010 (0x0010 - 0x0000)
struct HealthBarComponent_C_UpdateHealthBarPercentage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthBarComponent_C_UpdateHealthBarPercentage) == 0x000008, "Wrong alignment on HealthBarComponent_C_UpdateHealthBarPercentage");
static_assert(sizeof(HealthBarComponent_C_UpdateHealthBarPercentage) == 0x000010, "Wrong size on HealthBarComponent_C_UpdateHealthBarPercentage");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarPercentage, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'HealthBarComponent_C_UpdateHealthBarPercentage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarPercentage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'HealthBarComponent_C_UpdateHealthBarPercentage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function HealthbarComponent.HealthBarComponent_C.UpdateHealthBarWidgetText
// 0x0050 (0x0050 - 0x0000)
struct HealthBarComponent_C_UpdateHealthBarWidgetText final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
};
static_assert(alignof(HealthBarComponent_C_UpdateHealthBarWidgetText) == 0x000008, "Wrong alignment on HealthBarComponent_C_UpdateHealthBarWidgetText");
static_assert(sizeof(HealthBarComponent_C_UpdateHealthBarWidgetText) == 0x000050, "Wrong size on HealthBarComponent_C_UpdateHealthBarWidgetText");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_FTrunc_ReturnValue) == 0x000004, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_FTrunc_ReturnValue_1) == 0x000018, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000020, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_BuildString_Name_ReturnValue) == 0x000030, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthBarComponent_C_UpdateHealthBarWidgetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'HealthBarComponent_C_UpdateHealthBarWidgetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

