#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthbarComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HealthbarComponent.HealthBarComponent_C
// 0x0028 (0x00C8 - 0x00A0)
class UHealthBarComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaxHealth;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Health;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_Character_Attributes_C*             WI_CharacterAttributes;                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PC;                                                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HealthBarComponent(int32 EntryPoint);
	void GetAttributes(class UWI_Character_Attributes_C** WI_Attributes);
	void Initialize(double MaxHealth_0, class APlayerController* Owner);
	void Take_Damage(double Damage);
	void Update_Health(double Health);
	void Update_Max_Health(double Max_Health);
	void UpdateHealthBarPercentage();
	void UpdateHealthBarWidgetText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthBarComponent_C">();
	}
	static class UHealthBarComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthBarComponent_C>();
	}
};
static_assert(alignof(UHealthBarComponent_C) == 0x000008, "Wrong alignment on UHealthBarComponent_C");
static_assert(sizeof(UHealthBarComponent_C) == 0x0000C8, "Wrong size on UHealthBarComponent_C");
static_assert(offsetof(UHealthBarComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UHealthBarComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHealthBarComponent_C, MaxHealth) == 0x0000A8, "Member 'UHealthBarComponent_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(UHealthBarComponent_C, Current_Health) == 0x0000B0, "Member 'UHealthBarComponent_C::Current_Health' has a wrong offset!");
static_assert(offsetof(UHealthBarComponent_C, WI_CharacterAttributes) == 0x0000B8, "Member 'UHealthBarComponent_C::WI_CharacterAttributes' has a wrong offset!");
static_assert(offsetof(UHealthBarComponent_C, PC) == 0x0000C0, "Member 'UHealthBarComponent_C::PC' has a wrong offset!");

}

