#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HouseEssentialsManagerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_HouseEssential_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HouseEssentialsManagerComponent.HouseEssentialsManagerComponent_C
// 0x0048 (0x00E8 - 0x00A0)
class UHouseEssentialsManagerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             On_HouseEssentialDestroyed;                        // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class Abp_groundskeeper_C*                    GroundsKeeper;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         HouseEssentialsAmount;                             // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_HouseEssential>              S_HouseEssentials;                                 // 0x00C8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	TArray<struct FS_HouseEssential>              S_PreviousHouseEssentials;                         // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DebugPrintReplicatedHouseEssentials();
	void ExecuteUbergraph_HouseEssentialsManagerComponent(int32 EntryPoint);
	void FindNewlyDestroyedHouseEssentials(TArray<struct FS_HouseEssential>& Current_House_Essentials, TArray<struct FS_HouseEssential>& Previous_House_Essentials, TArray<class ABP_HouseEssential_Cube_C*>* Newly_Destroyed_House_Essentials);
	void GetAmountOfAliveHouseEssentials(int32* Return);
	void HandleHouseEssentialsUpdated(bool Condition);
	void HasAllHouseEssentialsBeenInitiallyReplicated(bool* AllHouseEssentialsHaveBeenInitiallyReplicated);
	void IsBrawlGameMode(bool* IsBrawlGameMode_0);
	void IsOnlyOneHouseEssentialFromLosing(bool* Result);
	void Multicast_HouseEssential_Was_Destroyed_By_Player(class ABP_HouseEssential_Cube_C* HouseEssential, class APlayerState* AttackerPlayerState);
	void On_HouseEssentialDestroyed__DelegateSignature(int32 AliveHouseEssentials, class Abp_groundskeeper_C* GroundsKeeper_0);
	void OnRep_S_HouseEssentials();
	void OnStarted_1E304AF647AA67F0789B6F82692DE6AB();
	void OnStarted_DE605ADE453362D0229162B8A59394B5();
	void ReceiveBeginPlay();
	void Reduce_Alive_House_Essentials(class ABP_HouseEssential_Cube_C* HouseEssential);
	void RegisterHouseEssential(class ABP_HouseEssential_Cube_C* HouseEssential);
	void UpdateUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HouseEssentialsManagerComponent_C">();
	}
	static class UHouseEssentialsManagerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHouseEssentialsManagerComponent_C>();
	}
};
static_assert(alignof(UHouseEssentialsManagerComponent_C) == 0x000008, "Wrong alignment on UHouseEssentialsManagerComponent_C");
static_assert(sizeof(UHouseEssentialsManagerComponent_C) == 0x0000E8, "Wrong size on UHouseEssentialsManagerComponent_C");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UHouseEssentialsManagerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, On_HouseEssentialDestroyed) == 0x0000A8, "Member 'UHouseEssentialsManagerComponent_C::On_HouseEssentialDestroyed' has a wrong offset!");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, GroundsKeeper) == 0x0000B8, "Member 'UHouseEssentialsManagerComponent_C::GroundsKeeper' has a wrong offset!");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, HouseEssentialsAmount) == 0x0000C0, "Member 'UHouseEssentialsManagerComponent_C::HouseEssentialsAmount' has a wrong offset!");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, S_HouseEssentials) == 0x0000C8, "Member 'UHouseEssentialsManagerComponent_C::S_HouseEssentials' has a wrong offset!");
static_assert(offsetof(UHouseEssentialsManagerComponent_C, S_PreviousHouseEssentials) == 0x0000D8, "Member 'UHouseEssentialsManagerComponent_C::S_PreviousHouseEssentials' has a wrong offset!");

}

