#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HouseActorBase

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ImpactEffect_structs.hpp"
#include "E_Tools_structs.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HouseActorBase.HouseActorBase_C.AddRepairness
// 0x0030 (0x0030 - 0x0000)
struct HouseActorBase_C_AddRepairness final
{
public:
	float                                         Magnitude;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0008(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0018(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HouseActorBase_C_AddRepairness) == 0x000008, "Wrong alignment on HouseActorBase_C_AddRepairness");
static_assert(sizeof(HouseActorBase_C_AddRepairness) == 0x000030, "Wrong size on HouseActorBase_C_AddRepairness");
static_assert(offsetof(HouseActorBase_C_AddRepairness, Magnitude) == 0x000000, "Member 'HouseActorBase_C_AddRepairness::Magnitude' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_AddRepairness, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000008, "Member 'HouseActorBase_C_AddRepairness::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_AddRepairness, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000018, "Member 'HouseActorBase_C_AddRepairness::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_AddRepairness, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000028, "Member 'HouseActorBase_C_AddRepairness::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'HouseActorBase_C_BndEvt__HouseActorBase_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.CancelInteraction
// 0x0008 (0x0008 - 0x0000)
struct HouseActorBase_C_CancelInteraction final
{
public:
	class UPrimitiveComponent*                    InteractionComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HouseActorBase_C_CancelInteraction) == 0x000008, "Wrong alignment on HouseActorBase_C_CancelInteraction");
static_assert(sizeof(HouseActorBase_C_CancelInteraction) == 0x000008, "Wrong size on HouseActorBase_C_CancelInteraction");
static_assert(offsetof(HouseActorBase_C_CancelInteraction, InteractionComponent) == 0x000000, "Member 'HouseActorBase_C_CancelInteraction::InteractionComponent' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.CreateKillInfo
// 0x0F88 (0x0F88 - 0x0000)
struct HouseActorBase_C_CreateKillInfo final
{
public:
	struct FCombatParticipant                     Killer;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillMethod                            Method;                                            // 0x0060(0x02E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKillGameplayMessage                   KillGameplayMessage;                               // 0x0348(0x03D8)(Parm, OutParm)
	TArray<struct FCombatParticipant>             Heal_Assisters;                                    // 0x0720(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCombatParticipant>             Kill_Assisters;                                    // 0x0730(0x0010)(Edit, BlueprintVisible)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCombatParticipant>             CallFunc_Add_Heal_Assisters_Modified;              // 0x0748(0x0010)(ReferenceParm)
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x0758(0x0060)()
	TArray<struct FCombatParticipant>             CallFunc_Add_Kill_Assisters_Modified;              // 0x07B8(0x0010)(ReferenceParm)
	TArray<class UKillCircumstance*>              K2Node_MakeArray_Array;                            // 0x07C8(0x0010)(ReferenceParm)
	struct FKillInfo                              K2Node_MakeStruct_KillInfo;                        // 0x07D8(0x03D8)()
	struct FKillGameplayMessage                   K2Node_MakeStruct_KillGameplayMessage;             // 0x0BB0(0x03D8)()
};
static_assert(alignof(HouseActorBase_C_CreateKillInfo) == 0x000008, "Wrong alignment on HouseActorBase_C_CreateKillInfo");
static_assert(sizeof(HouseActorBase_C_CreateKillInfo) == 0x000F88, "Wrong size on HouseActorBase_C_CreateKillInfo");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, Killer) == 0x000000, "Member 'HouseActorBase_C_CreateKillInfo::Killer' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, Method) == 0x000060, "Member 'HouseActorBase_C_CreateKillInfo::Method' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, KillGameplayMessage) == 0x000348, "Member 'HouseActorBase_C_CreateKillInfo::KillGameplayMessage' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, Heal_Assisters) == 0x000720, "Member 'HouseActorBase_C_CreateKillInfo::Heal_Assisters' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, Kill_Assisters) == 0x000730, "Member 'HouseActorBase_C_CreateKillInfo::Kill_Assisters' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, CallFunc_GetTeamID_ReturnValue) == 0x000740, "Member 'HouseActorBase_C_CreateKillInfo::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, CallFunc_Add_Heal_Assisters_Modified) == 0x000748, "Member 'HouseActorBase_C_CreateKillInfo::CallFunc_Add_Heal_Assisters_Modified' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, K2Node_MakeStruct_CombatParticipant) == 0x000758, "Member 'HouseActorBase_C_CreateKillInfo::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, CallFunc_Add_Kill_Assisters_Modified) == 0x0007B8, "Member 'HouseActorBase_C_CreateKillInfo::CallFunc_Add_Kill_Assisters_Modified' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, K2Node_MakeArray_Array) == 0x0007C8, "Member 'HouseActorBase_C_CreateKillInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, K2Node_MakeStruct_KillInfo) == 0x0007D8, "Member 'HouseActorBase_C_CreateKillInfo::K2Node_MakeStruct_KillInfo' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_CreateKillInfo, K2Node_MakeStruct_KillGameplayMessage) == 0x000BB0, "Member 'HouseActorBase_C_CreateKillInfo::K2Node_MakeStruct_KillGameplayMessage' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.DebugPrintHealth
// 0x0098 (0x0098 - 0x0000)
struct HouseActorBase_C_DebugPrintHealth final
{
public:
	double                                        MinHealth;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Normalized;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HouseActorBase_C_DebugPrintHealth) == 0x000008, "Wrong alignment on HouseActorBase_C_DebugPrintHealth");
static_assert(sizeof(HouseActorBase_C_DebugPrintHealth) == 0x000098, "Wrong size on HouseActorBase_C_DebugPrintHealth");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, MinHealth) == 0x000000, "Member 'HouseActorBase_C_DebugPrintHealth::MinHealth' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, MaxHealth) == 0x000008, "Member 'HouseActorBase_C_DebugPrintHealth::MaxHealth' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, Normalized) == 0x000010, "Member 'HouseActorBase_C_DebugPrintHealth::Normalized' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000018, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Get_ClassLog_Name_name) == 0x000028, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000038, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x000048, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_DebugPrintHealth, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'HouseActorBase_C_DebugPrintHealth::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.Event On Team Replicated Cosmetic
// 0x0038 (0x0038 - 0x0000)
struct HouseActorBase_C_Event_On_Team_Replicated_Cosmetic final
{
public:
	struct FTeam                                  New_Team;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(HouseActorBase_C_Event_On_Team_Replicated_Cosmetic) == 0x000008, "Wrong alignment on HouseActorBase_C_Event_On_Team_Replicated_Cosmetic");
static_assert(sizeof(HouseActorBase_C_Event_On_Team_Replicated_Cosmetic) == 0x000038, "Wrong size on HouseActorBase_C_Event_On_Team_Replicated_Cosmetic");
static_assert(offsetof(HouseActorBase_C_Event_On_Team_Replicated_Cosmetic, New_Team) == 0x000000, "Member 'HouseActorBase_C_Event_On_Team_Replicated_Cosmetic::New_Team' has a wrong offset!");

// Function HouseActorBase.HouseActorBase_C.ExecuteUbergraph_HouseActorBase
// 0x1080 (0x1080 - 0x0000)
struct HouseActorBase_C_ExecuteUbergraph_HouseActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_5;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_4;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_5;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_4;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_3;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_InteractionComponent;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_2;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_AttackingActor;                       // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Direction;                            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor_1;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InteractingActor;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Interactable;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show_1;                         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Focusing_Actor;                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SabotagingActor;                      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitImpulse;                     // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                K2Node_CustomEvent_ImpactEffect;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Health;                               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxHealth;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_Event_CombatParticipant;                    // 0x01B0(0x0060)(ConstParm)
	struct FKillMethod                            K2Node_Event_KillMethod;                           // 0x0210(0x02E8)(ConstParm)
	struct FVector_NetQuantize                    K2Node_Event_Location;                             // 0x04F8(0x0018)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Amount;                         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Target;                         // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKillGameplayMessage                   CallFunc_CreateKillInfo_KillGameplayMessage;       // 0x0520(0x03D8)()
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_1; // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeam                                  K2Node_CustomEvent_New_Team;                       // 0x0918(0x0038)(NoDestructor)
	bool                                          CallFunc_IsNotLocalTeam_ReturnValue;               // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_952[0x6];                                      // 0x0952(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKillGameplayMessage                   K2Node_CustomEvent_Message;                        // 0x0958(0x03D8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0D30(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0D40(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0D48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemCompatibleInfoWI_C*                K2Node_DynamicCast_AsItem_Compatible_Info_WI;      // 0x0D60(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0D68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InVisible;                      // 0x0D69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0D6A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6B[0x1];                                      // 0x0D6B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0D6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D71[0x3];                                      // 0x0D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0D74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0D78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0D7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue_2; // 0x0D80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0D88(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0D98(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0DA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA4[0x4];                                      // 0x0DA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0DA8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0DB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0DB2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB3[0x1];                                      // 0x0DB3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0DB4(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStencilValueFromMask_ReturnValue;      // 0x0DBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0DC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC1[0x7];                                      // 0x0DC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0DC8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0DD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0DD8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0DE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0DE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE5[0x3];                                      // 0x0DE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0DE8(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0EE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0EE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE9[0x7];                                      // 0x0EE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item_1;                         // 0x0EF0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0EF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0EF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EFA[0x2];                                      // 0x0EFA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0EFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0F00(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0F08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0F10(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0F18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0F1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1D[0x3];                                      // 0x0F1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0F20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0F28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0F29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2A[0x6];                                      // 0x0F2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0F30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0F48(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x1040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Value_ImplicitCast;     // 0x1048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Max_ImplicitCast;       // 0x1050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x1058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMorphTarget_Value_ImplicitCast;        // 0x1060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1064[0x4];                                     // 0x1064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x1068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Value_ImplicitCast_1;   // 0x1070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgressbar_Max_ImplicitCast_1;     // 0x1078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase) == 0x000008, "Wrong alignment on HouseActorBase_C_ExecuteUbergraph_HouseActorBase");
static_assert(sizeof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase) == 0x001080, "Wrong size on HouseActorBase_C_ExecuteUbergraph_HouseActorBase");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, EntryPoint) == 0x000000, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, Temp_int_Array_Index_Variable) == 0x000020, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x000028, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_HasAuthority_ReturnValue) == 0x000031, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent_5) == 0x000038, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent_5' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent_4) == 0x000040, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent_4' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor_5) == 0x000048, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor_5' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent_3) == 0x000050, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent_3' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor_4) == 0x000058, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor_4' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent_2) == 0x000060, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent_2' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent_1) == 0x000068, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor_3) == 0x000070, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor_3' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractionComponent) == 0x000078, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractionComponent' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor_2) == 0x000080, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor_2' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_AttackingActor) == 0x000088, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_AttackingActor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Direction) == 0x000090, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor_1) == 0x0000A8, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_InteractingActor) == 0x0000B0, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_InteractingActor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Interactable) == 0x0000B8, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Interactable' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CustomEvent_Show_1) == 0x0000B9, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CustomEvent_Show_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Focusing_Actor) == 0x0000C0, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Focusing_Actor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CustomEvent_Show) == 0x0000C8, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000C9, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_SabotagingActor) == 0x0000D0, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_SabotagingActor' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CustomEvent_Location) == 0x0000D8, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CustomEvent_HitImpulse) == 0x0000F0, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CustomEvent_HitImpulse' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CustomEvent_ImpactEffect) == 0x000108, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CustomEvent_ImpactEffect' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_SwitchEnum_CmpSuccess) == 0x000109, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000110, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Health) == 0x000118, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Health' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_MaxHealth) == 0x00011C, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_MaxHealth' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000120, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000128, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, Temp_bool_IsClosed_Variable) == 0x000138, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000140, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000150, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_HasAuthority_ReturnValue_1) == 0x000158, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000159, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00016C, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, Temp_int_Array_Index_Variable_1) == 0x000170, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000178, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000180, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000188, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000190, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000198, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Delta) == 0x0001A0, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(HouseActorBase_C_ExecuteUbergraph_HouseActorBase, K2Node_Event_Causer) == 0x0001A8, "Member 'HouseActorBase_C_ExecuteUbergraph_HouseActorBase::K2Node_Event_Causer' has a wrong offset!");
