#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_BashSound

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_BashSound.I_BashSound_C.GetInitialBashSound
// 0x0008 (0x0008 - 0x0000)
struct I_BashSound_C_GetInitialBashSound final
{
public:
	class USoundCue*                              InitialSound;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_BashSound_C_GetInitialBashSound) == 0x000008, "Wrong alignment on I_BashSound_C_GetInitialBashSound");
static_assert(sizeof(I_BashSound_C_GetInitialBashSound) == 0x000008, "Wrong size on I_BashSound_C_GetInitialBashSound");
static_assert(offsetof(I_BashSound_C_GetInitialBashSound, InitialSound) == 0x000000, "Member 'I_BashSound_C_GetInitialBashSound::InitialSound' has a wrong offset!");

// Function I_BashSound.I_BashSound_C.GetItemAffectedSound
// 0x0008 (0x0008 - 0x0000)
struct I_BashSound_C_GetItemAffectedSound final
{
public:
	class USoundCue*                              Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_BashSound_C_GetItemAffectedSound) == 0x000008, "Wrong alignment on I_BashSound_C_GetItemAffectedSound");
static_assert(sizeof(I_BashSound_C_GetItemAffectedSound) == 0x000008, "Wrong size on I_BashSound_C_GetItemAffectedSound");
static_assert(offsetof(I_BashSound_C_GetItemAffectedSound, Return) == 0x000000, "Member 'I_BashSound_C_GetItemAffectedSound::Return' has a wrong offset!");

// Function I_BashSound.I_BashSound_C.GetItemCompatibleSound
// 0x0008 (0x0008 - 0x0000)
struct I_BashSound_C_GetItemCompatibleSound final
{
public:
	class USoundCue*                              Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_BashSound_C_GetItemCompatibleSound) == 0x000008, "Wrong alignment on I_BashSound_C_GetItemCompatibleSound");
static_assert(sizeof(I_BashSound_C_GetItemCompatibleSound) == 0x000008, "Wrong size on I_BashSound_C_GetItemCompatibleSound");
static_assert(offsetof(I_BashSound_C_GetItemCompatibleSound, Return) == 0x000000, "Member 'I_BashSound_C_GetItemCompatibleSound::Return' has a wrong offset!");

// Function I_BashSound.I_BashSound_C.GetPlayMaterialLayerSound
// 0x0001 (0x0001 - 0x0000)
struct I_BashSound_C_GetPlayMaterialLayerSound final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_BashSound_C_GetPlayMaterialLayerSound) == 0x000001, "Wrong alignment on I_BashSound_C_GetPlayMaterialLayerSound");
static_assert(sizeof(I_BashSound_C_GetPlayMaterialLayerSound) == 0x000001, "Wrong size on I_BashSound_C_GetPlayMaterialLayerSound");
static_assert(offsetof(I_BashSound_C_GetPlayMaterialLayerSound, Return) == 0x000000, "Member 'I_BashSound_C_GetPlayMaterialLayerSound::Return' has a wrong offset!");

}

