#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_ChickenAnimation

#include "Basic.hpp"

#include "EChickenRunStates_structs.hpp"
#include "EChickenStates_structs.hpp"


namespace SDK::Params
{

// Function I_ChickenAnimation.I_ChickenAnimation_C.ChangeAnimationState
// 0x0001 (0x0001 - 0x0000)
struct I_ChickenAnimation_C_ChangeAnimationState final
{
public:
	EChickenStates                                State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_ChickenAnimation_C_ChangeAnimationState) == 0x000001, "Wrong alignment on I_ChickenAnimation_C_ChangeAnimationState");
static_assert(sizeof(I_ChickenAnimation_C_ChangeAnimationState) == 0x000001, "Wrong size on I_ChickenAnimation_C_ChangeAnimationState");
static_assert(offsetof(I_ChickenAnimation_C_ChangeAnimationState, State) == 0x000000, "Member 'I_ChickenAnimation_C_ChangeAnimationState::State' has a wrong offset!");

// Function I_ChickenAnimation.I_ChickenAnimation_C.ChangeRunState
// 0x0001 (0x0001 - 0x0000)
struct I_ChickenAnimation_C_ChangeRunState final
{
public:
	EChickenRunStates                             RunState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_ChickenAnimation_C_ChangeRunState) == 0x000001, "Wrong alignment on I_ChickenAnimation_C_ChangeRunState");
static_assert(sizeof(I_ChickenAnimation_C_ChangeRunState) == 0x000001, "Wrong size on I_ChickenAnimation_C_ChangeRunState");
static_assert(offsetof(I_ChickenAnimation_C_ChangeRunState, RunState) == 0x000000, "Member 'I_ChickenAnimation_C_ChangeRunState::RunState' has a wrong offset!");

}

