#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Durable

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_Durable.I_Durable_C.GetDurability
// 0x0008 (0x0008 - 0x0000)
struct I_Durable_C_GetDurability final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Durable_C_GetDurability) == 0x000008, "Wrong alignment on I_Durable_C_GetDurability");
static_assert(sizeof(I_Durable_C_GetDurability) == 0x000008, "Wrong size on I_Durable_C_GetDurability");
static_assert(offsetof(I_Durable_C_GetDurability, Amount) == 0x000000, "Member 'I_Durable_C_GetDurability::Amount' has a wrong offset!");

// Function I_Durable.I_Durable_C.SetDurability
// 0x0010 (0x0010 - 0x0000)
struct I_Durable_C_SetDurability final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Durable_C_SetDurability) == 0x000008, "Wrong alignment on I_Durable_C_SetDurability");
static_assert(sizeof(I_Durable_C_SetDurability) == 0x000010, "Wrong size on I_Durable_C_SetDurability");
static_assert(offsetof(I_Durable_C_SetDurability, Amount) == 0x000000, "Member 'I_Durable_C_SetDurability::Amount' has a wrong offset!");
static_assert(offsetof(I_Durable_C_SetDurability, Void) == 0x000008, "Member 'I_Durable_C_SetDurability::Void' has a wrong offset!");

}

