#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_FOVAble

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_FOVAble.I_FOVAble_C.GetCameraFOV
// 0x0008 (0x0008 - 0x0000)
struct I_FOVAble_C_GetCameraFOV final
{
public:
	double                                        FOV;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_FOVAble_C_GetCameraFOV) == 0x000008, "Wrong alignment on I_FOVAble_C_GetCameraFOV");
static_assert(sizeof(I_FOVAble_C_GetCameraFOV) == 0x000008, "Wrong size on I_FOVAble_C_GetCameraFOV");
static_assert(offsetof(I_FOVAble_C_GetCameraFOV, FOV) == 0x000000, "Member 'I_FOVAble_C_GetCameraFOV::FOV' has a wrong offset!");

// Function I_FOVAble.I_FOVAble_C.PlayCameraShake
// 0x0010 (0x0010 - 0x0000)
struct I_FOVAble_C_PlayCameraShake final
{
public:
	class UClass*                                 CameraShake;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_FOVAble_C_PlayCameraShake) == 0x000008, "Wrong alignment on I_FOVAble_C_PlayCameraShake");
static_assert(sizeof(I_FOVAble_C_PlayCameraShake) == 0x000010, "Wrong size on I_FOVAble_C_PlayCameraShake");
static_assert(offsetof(I_FOVAble_C_PlayCameraShake, CameraShake) == 0x000000, "Member 'I_FOVAble_C_PlayCameraShake::CameraShake' has a wrong offset!");
static_assert(offsetof(I_FOVAble_C_PlayCameraShake, Scale) == 0x000008, "Member 'I_FOVAble_C_PlayCameraShake::Scale' has a wrong offset!");

// Function I_FOVAble.I_FOVAble_C.ResetCameraFOV
// 0x0008 (0x0008 - 0x0000)
struct I_FOVAble_C_ResetCameraFOV final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_FOVAble_C_ResetCameraFOV) == 0x000008, "Wrong alignment on I_FOVAble_C_ResetCameraFOV");
static_assert(sizeof(I_FOVAble_C_ResetCameraFOV) == 0x000008, "Wrong size on I_FOVAble_C_ResetCameraFOV");
static_assert(offsetof(I_FOVAble_C_ResetCameraFOV, Speed) == 0x000000, "Member 'I_FOVAble_C_ResetCameraFOV::Speed' has a wrong offset!");

// Function I_FOVAble.I_FOVAble_C.SetCameraFOV
// 0x0020 (0x0020 - 0x0000)
struct I_FOVAble_C_SetCameraFOV final
{
public:
	double                                        Amount;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OptionalCameraShake;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_FOVAble_C_SetCameraFOV) == 0x000008, "Wrong alignment on I_FOVAble_C_SetCameraFOV");
static_assert(sizeof(I_FOVAble_C_SetCameraFOV) == 0x000020, "Wrong size on I_FOVAble_C_SetCameraFOV");
static_assert(offsetof(I_FOVAble_C_SetCameraFOV, Amount) == 0x000000, "Member 'I_FOVAble_C_SetCameraFOV::Amount' has a wrong offset!");
static_assert(offsetof(I_FOVAble_C_SetCameraFOV, Speed) == 0x000008, "Member 'I_FOVAble_C_SetCameraFOV::Speed' has a wrong offset!");
static_assert(offsetof(I_FOVAble_C_SetCameraFOV, OptionalCameraShake) == 0x000010, "Member 'I_FOVAble_C_SetCameraFOV::OptionalCameraShake' has a wrong offset!");
static_assert(offsetof(I_FOVAble_C_SetCameraFOV, Scale) == 0x000018, "Member 'I_FOVAble_C_SetCameraFOV::Scale' has a wrong offset!");

}

