#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Leloi

#include "Basic.hpp"

#include "E_LeloiStates_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function I_Leloi.I_Leloi_C.GetDogHouse
// 0x0008 (0x0008 - 0x0000)
struct I_Leloi_C_GetDogHouse final
{
public:
	class ABP_DogHouse_V2_C*                      DogHouse;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Leloi_C_GetDogHouse) == 0x000008, "Wrong alignment on I_Leloi_C_GetDogHouse");
static_assert(sizeof(I_Leloi_C_GetDogHouse) == 0x000008, "Wrong size on I_Leloi_C_GetDogHouse");
static_assert(offsetof(I_Leloi_C_GetDogHouse, DogHouse) == 0x000000, "Member 'I_Leloi_C_GetDogHouse::DogHouse' has a wrong offset!");

// Function I_Leloi.I_Leloi_C.GetEQSPropertyBlocker
// 0x0008 (0x0008 - 0x0000)
struct I_Leloi_C_GetEQSPropertyBlocker final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Leloi_C_GetEQSPropertyBlocker) == 0x000008, "Wrong alignment on I_Leloi_C_GetEQSPropertyBlocker");
static_assert(sizeof(I_Leloi_C_GetEQSPropertyBlocker) == 0x000008, "Wrong size on I_Leloi_C_GetEQSPropertyBlocker");
static_assert(offsetof(I_Leloi_C_GetEQSPropertyBlocker, Actor) == 0x000000, "Member 'I_Leloi_C_GetEQSPropertyBlocker::Actor' has a wrong offset!");

// Function I_Leloi.I_Leloi_C.JumpToLocation
// 0x0018 (0x0018 - 0x0000)
struct I_Leloi_C_JumpToLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Leloi_C_JumpToLocation) == 0x000008, "Wrong alignment on I_Leloi_C_JumpToLocation");
static_assert(sizeof(I_Leloi_C_JumpToLocation) == 0x000018, "Wrong size on I_Leloi_C_JumpToLocation");
static_assert(offsetof(I_Leloi_C_JumpToLocation, Location) == 0x000000, "Member 'I_Leloi_C_JumpToLocation::Location' has a wrong offset!");

// Function I_Leloi.I_Leloi_C.SetMovementSpeed
// 0x0002 (0x0002 - 0x0000)
struct I_Leloi_C_SetMovementSpeed final
{
public:
	E_LeloiStates                                 State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Void;                                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Leloi_C_SetMovementSpeed) == 0x000001, "Wrong alignment on I_Leloi_C_SetMovementSpeed");
static_assert(sizeof(I_Leloi_C_SetMovementSpeed) == 0x000002, "Wrong size on I_Leloi_C_SetMovementSpeed");
static_assert(offsetof(I_Leloi_C_SetMovementSpeed, State) == 0x000000, "Member 'I_Leloi_C_SetMovementSpeed::State' has a wrong offset!");
static_assert(offsetof(I_Leloi_C_SetMovementSpeed, Void) == 0x000001, "Member 'I_Leloi_C_SetMovementSpeed::Void' has a wrong offset!");

}

