#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_PlayerControllerMessage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function I_PlayerControllerMessage.I_PlayerControllerMessage_C.OwnerSendItemPickUpMessageToPlayerController
// 0x0008 (0x0008 - 0x0000)
struct I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController final
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController) == 0x000004, "Wrong alignment on I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController");
static_assert(sizeof(I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController) == 0x000008, "Wrong size on I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController");
static_assert(offsetof(I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController, ItemTag) == 0x000000, "Member 'I_PlayerControllerMessage_C_OwnerSendItemPickUpMessageToPlayerController::ItemTag' has a wrong offset!");

// Function I_PlayerControllerMessage.I_PlayerControllerMessage_C.OwnerSendMessageToPlayerController
// 0x0058 (0x0058 - 0x0000)
struct I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController final
{
public:
	struct FPlayerMessage                         Message;                                           // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController) == 0x000008, "Wrong alignment on I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController");
static_assert(sizeof(I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController) == 0x000058, "Wrong size on I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController");
static_assert(offsetof(I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController, Message) == 0x000000, "Member 'I_PlayerControllerMessage_C_OwnerSendMessageToPlayerController::Message' has a wrong offset!");

// Function I_PlayerControllerMessage.I_PlayerControllerMessage_C.OwnerSendPlayerLeftMessage
// 0x0008 (0x0008 - 0x0000)
struct I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage final
{
public:
	class APlayerState*                           PlayerWhoLeft;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage) == 0x000008, "Wrong alignment on I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage");
static_assert(sizeof(I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage) == 0x000008, "Wrong size on I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage");
static_assert(offsetof(I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage, PlayerWhoLeft) == 0x000000, "Member 'I_PlayerControllerMessage_C_OwnerSendPlayerLeftMessage::PlayerWhoLeft' has a wrong offset!");

}

