#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_ShieldBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function I_ShieldBlock.I_ShieldBlock_C.BlockedTrace
// 0x0100 (0x0100 - 0x0000)
struct I_ShieldBlock_C_BlockedTrace final
{
public:
	int32                                         IncomingDamage;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0008(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(I_ShieldBlock_C_BlockedTrace) == 0x000008, "Wrong alignment on I_ShieldBlock_C_BlockedTrace");
static_assert(sizeof(I_ShieldBlock_C_BlockedTrace) == 0x000100, "Wrong size on I_ShieldBlock_C_BlockedTrace");
static_assert(offsetof(I_ShieldBlock_C_BlockedTrace, IncomingDamage) == 0x000000, "Member 'I_ShieldBlock_C_BlockedTrace::IncomingDamage' has a wrong offset!");
static_assert(offsetof(I_ShieldBlock_C_BlockedTrace, HitResult) == 0x000008, "Member 'I_ShieldBlock_C_BlockedTrace::HitResult' has a wrong offset!");

// Function I_ShieldBlock.I_ShieldBlock_C.ProjectileImpact
// 0x0100 (0x0100 - 0x0000)
struct I_ShieldBlock_C_ProjectileImpact final
{
public:
	int32                                         Incoming_Damage;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0008(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(I_ShieldBlock_C_ProjectileImpact) == 0x000008, "Wrong alignment on I_ShieldBlock_C_ProjectileImpact");
static_assert(sizeof(I_ShieldBlock_C_ProjectileImpact) == 0x000100, "Wrong size on I_ShieldBlock_C_ProjectileImpact");
static_assert(offsetof(I_ShieldBlock_C_ProjectileImpact, Incoming_Damage) == 0x000000, "Member 'I_ShieldBlock_C_ProjectileImpact::Incoming_Damage' has a wrong offset!");
static_assert(offsetof(I_ShieldBlock_C_ProjectileImpact, HitResult) == 0x000008, "Member 'I_ShieldBlock_C_ProjectileImpact::HitResult' has a wrong offset!");

}

