#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Soundable

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_Soundable.I_Soundable_C.GetAudioComponent
// 0x0010 (0x0010 - 0x0000)
struct I_Soundable_C_GetAudioComponent final
{
public:
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(I_Soundable_C_GetAudioComponent) == 0x000008, "Wrong alignment on I_Soundable_C_GetAudioComponent");
static_assert(sizeof(I_Soundable_C_GetAudioComponent) == 0x000010, "Wrong size on I_Soundable_C_GetAudioComponent");
static_assert(offsetof(I_Soundable_C_GetAudioComponent, AudioComponents) == 0x000000, "Member 'I_Soundable_C_GetAudioComponent::AudioComponents' has a wrong offset!");

// Function I_Soundable.I_Soundable_C.PlayMaterialLayerSound
// 0x0008 (0x0008 - 0x0000)
struct I_Soundable_C_PlayMaterialLayerSound final
{
public:
	class UPhysicalMaterial*                      PhysicalMaterial;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Soundable_C_PlayMaterialLayerSound) == 0x000008, "Wrong alignment on I_Soundable_C_PlayMaterialLayerSound");
static_assert(sizeof(I_Soundable_C_PlayMaterialLayerSound) == 0x000008, "Wrong size on I_Soundable_C_PlayMaterialLayerSound");
static_assert(offsetof(I_Soundable_C_PlayMaterialLayerSound, PhysicalMaterial) == 0x000000, "Member 'I_Soundable_C_PlayMaterialLayerSound::PhysicalMaterial' has a wrong offset!");

// Function I_Soundable.I_Soundable_C.PlaySound
// 0x0008 (0x0008 - 0x0000)
struct I_Soundable_C_PlaySound final
{
public:
	class USoundCue*                              Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Soundable_C_PlaySound) == 0x000008, "Wrong alignment on I_Soundable_C_PlaySound");
static_assert(sizeof(I_Soundable_C_PlaySound) == 0x000008, "Wrong size on I_Soundable_C_PlaySound");
static_assert(offsetof(I_Soundable_C_PlaySound, Sound) == 0x000000, "Member 'I_Soundable_C_PlaySound::Sound' has a wrong offset!");

}

