#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_SpecialAbility_Interactable

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_SpecialAbility_Interactable.I_SpecialAbility_Interactable_C.SpecialAbilityStartInteraction
// 0x0001 (0x0001 - 0x0000)
struct I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction final
{
public:
	bool                                          CouldInteract;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction) == 0x000001, "Wrong alignment on I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction");
static_assert(sizeof(I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction) == 0x000001, "Wrong size on I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction");
static_assert(offsetof(I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction, CouldInteract) == 0x000000, "Member 'I_SpecialAbility_Interactable_C_SpecialAbilityStartInteraction::CouldInteract' has a wrong offset!");

// Function I_SpecialAbility_Interactable.I_SpecialAbility_Interactable_C.SpecialAbilityStopInteraction
// 0x0001 (0x0001 - 0x0000)
struct I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction final
{
public:
	bool                                          StoppedInteract;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction) == 0x000001, "Wrong alignment on I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction");
static_assert(sizeof(I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction) == 0x000001, "Wrong size on I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction");
static_assert(offsetof(I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction, StoppedInteract) == 0x000000, "Member 'I_SpecialAbility_Interactable_C_SpecialAbilityStopInteraction::StoppedInteract' has a wrong offset!");

}

