#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Stealth

#include "Basic.hpp"


namespace SDK::Params
{

// Function I_Stealth.I_Stealth_C.GetStealthActive
// 0x0001 (0x0001 - 0x0000)
struct I_Stealth_C_GetStealthActive final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Stealth_C_GetStealthActive) == 0x000001, "Wrong alignment on I_Stealth_C_GetStealthActive");
static_assert(sizeof(I_Stealth_C_GetStealthActive) == 0x000001, "Wrong size on I_Stealth_C_GetStealthActive");
static_assert(offsetof(I_Stealth_C_GetStealthActive, Return) == 0x000000, "Member 'I_Stealth_C_GetStealthActive::Return' has a wrong offset!");

// Function I_Stealth.I_Stealth_C.OnStealthToggle
// 0x0002 (0x0002 - 0x0000)
struct I_Stealth_C_OnStealthToggle final
{
public:
	bool                                          StealthActive;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnemyToLocalPlayer;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Stealth_C_OnStealthToggle) == 0x000001, "Wrong alignment on I_Stealth_C_OnStealthToggle");
static_assert(sizeof(I_Stealth_C_OnStealthToggle) == 0x000002, "Wrong size on I_Stealth_C_OnStealthToggle");
static_assert(offsetof(I_Stealth_C_OnStealthToggle, StealthActive) == 0x000000, "Member 'I_Stealth_C_OnStealthToggle::StealthActive' has a wrong offset!");
static_assert(offsetof(I_Stealth_C_OnStealthToggle, IsEnemyToLocalPlayer) == 0x000001, "Member 'I_Stealth_C_OnStealthToggle::IsEnemyToLocalPlayer' has a wrong offset!");

// Function I_Stealth.I_Stealth_C.SetForcedStealth
// 0x0001 (0x0001 - 0x0000)
struct I_Stealth_C_SetForcedStealth final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Stealth_C_SetForcedStealth) == 0x000001, "Wrong alignment on I_Stealth_C_SetForcedStealth");
static_assert(sizeof(I_Stealth_C_SetForcedStealth) == 0x000001, "Wrong size on I_Stealth_C_SetForcedStealth");
static_assert(offsetof(I_Stealth_C_SetForcedStealth, Enable) == 0x000000, "Member 'I_Stealth_C_SetForcedStealth::Enable' has a wrong offset!");

}

