#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: I_Trajectoryable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function I_Trajectoryable.I_Trajectoryable_C.GetGravityScale
// 0x0008 (0x0008 - 0x0000)
struct I_Trajectoryable_C_GetGravityScale final
{
public:
	double                                        GravityScale;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Trajectoryable_C_GetGravityScale) == 0x000008, "Wrong alignment on I_Trajectoryable_C_GetGravityScale");
static_assert(sizeof(I_Trajectoryable_C_GetGravityScale) == 0x000008, "Wrong size on I_Trajectoryable_C_GetGravityScale");
static_assert(offsetof(I_Trajectoryable_C_GetGravityScale, GravityScale) == 0x000000, "Member 'I_Trajectoryable_C_GetGravityScale::GravityScale' has a wrong offset!");

// Function I_Trajectoryable.I_Trajectoryable_C.GetStartPositionTransform
// 0x0060 (0x0060 - 0x0000)
struct I_Trajectoryable_C_GetStartPositionTransform final
{
public:
	struct FTransform                             StartTransform;                                    // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Trajectoryable_C_GetStartPositionTransform) == 0x000010, "Wrong alignment on I_Trajectoryable_C_GetStartPositionTransform");
static_assert(sizeof(I_Trajectoryable_C_GetStartPositionTransform) == 0x000060, "Wrong size on I_Trajectoryable_C_GetStartPositionTransform");
static_assert(offsetof(I_Trajectoryable_C_GetStartPositionTransform, StartTransform) == 0x000000, "Member 'I_Trajectoryable_C_GetStartPositionTransform::StartTransform' has a wrong offset!");

// Function I_Trajectoryable.I_Trajectoryable_C.GetVelocity
// 0x0018 (0x0018 - 0x0000)
struct I_Trajectoryable_C_GetVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(I_Trajectoryable_C_GetVelocity) == 0x000008, "Wrong alignment on I_Trajectoryable_C_GetVelocity");
static_assert(sizeof(I_Trajectoryable_C_GetVelocity) == 0x000018, "Wrong size on I_Trajectoryable_C_GetVelocity");
static_assert(offsetof(I_Trajectoryable_C_GetVelocity, Velocity) == 0x000000, "Member 'I_Trajectoryable_C_GetVelocity::Velocity' has a wrong offset!");

}

