#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InviteFriendsWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function InviteFriendsWI.InviteFriendsWI_C.ExecuteUbergraph_InviteFriendsWI
// 0x0038 (0x0038 - 0x0000)
struct InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInviteFriendEntryWI_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI) == 0x000008, "Wrong alignment on InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI");
static_assert(sizeof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI) == 0x000038, "Wrong size on InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, EntryPoint) == 0x000000, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, Temp_int_Variable) == 0x000010, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, Temp_text_Variable) == 0x000020, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'InviteFriendsWI_C_ExecuteUbergraph_InviteFriendsWI::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function InviteFriendsWI.InviteFriendsWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct InviteFriendsWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InviteFriendsWI_C_PreConstruct) == 0x000001, "Wrong alignment on InviteFriendsWI_C_PreConstruct");
static_assert(sizeof(InviteFriendsWI_C_PreConstruct) == 0x000001, "Wrong size on InviteFriendsWI_C_PreConstruct");
static_assert(offsetof(InviteFriendsWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'InviteFriendsWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

