#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCompatibleInfoWI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemCompatibleInfoWI.ItemCompatibleInfoWI_C.ExecuteUbergraph_ItemCompatibleInfoWI
// 0x0040 (0x0040 - 0x0000)
struct ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_Value_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_RangeMax_ImplicitCast;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI) == 0x000008, "Wrong alignment on ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI");
static_assert(sizeof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI) == 0x000040, "Wrong size on ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, EntryPoint) == 0x000000, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000018, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00001C, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000020, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000024, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_NormalizeToRange_ReturnValue) == 0x000028, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_NormalizeToRange_Value_ImplicitCast) == 0x000030, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_NormalizeToRange_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI, CallFunc_NormalizeToRange_RangeMax_ImplicitCast) == 0x000038, "Member 'ItemCompatibleInfoWI_C_ExecuteUbergraph_ItemCompatibleInfoWI::CallFunc_NormalizeToRange_RangeMax_ImplicitCast' has a wrong offset!");

// Function ItemCompatibleInfoWI.ItemCompatibleInfoWI_C.SetFullyWrecked
// 0x0034 (0x0034 - 0x0000)
struct ItemCompatibleInfoWI_C_SetFullyWrecked final
{
public:
	bool                                          Wrecked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCompatibleInfoWI_C_SetFullyWrecked) == 0x000004, "Wrong alignment on ItemCompatibleInfoWI_C_SetFullyWrecked");
static_assert(sizeof(ItemCompatibleInfoWI_C_SetFullyWrecked) == 0x000034, "Wrong size on ItemCompatibleInfoWI_C_SetFullyWrecked");
static_assert(offsetof(ItemCompatibleInfoWI_C_SetFullyWrecked, Wrecked) == 0x000000, "Member 'ItemCompatibleInfoWI_C_SetFullyWrecked::Wrecked' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_SetFullyWrecked, Temp_bool_Variable) == 0x000001, "Member 'ItemCompatibleInfoWI_C_SetFullyWrecked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_SetFullyWrecked, Temp_struct_Variable) == 0x000004, "Member 'ItemCompatibleInfoWI_C_SetFullyWrecked::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_SetFullyWrecked, Temp_struct_Variable_1) == 0x000014, "Member 'ItemCompatibleInfoWI_C_SetFullyWrecked::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemCompatibleInfoWI_C_SetFullyWrecked, K2Node_Select_Default) == 0x000024, "Member 'ItemCompatibleInfoWI_C_SetFullyWrecked::K2Node_Select_Default' has a wrong offset!");

}

