#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWheelWI

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ItemWheelWI.ItemWheelWI_C.AddBuffIcon
// 0x0090 (0x0090 - 0x0000)
struct ItemWheelWI_C_AddBuffIcon final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconToUse;                                         // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UWI_BuffInShop_C*                       CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsGameplay_Effect_IW;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetExpectedDuration_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGameplayEffectComponent*>       CallFunc_FindComponents_ReturnValue;               // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayEffectComponent*         CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffectUIData_Icon*       K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon;  // 0x0070(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_AddBuffIcon) == 0x000008, "Wrong alignment on ItemWheelWI_C_AddBuffIcon");
static_assert(sizeof(ItemWheelWI_C_AddBuffIcon) == 0x000090, "Wrong size on ItemWheelWI_C_AddBuffIcon");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, Class_0) == 0x000000, "Member 'ItemWheelWI_C_AddBuffIcon::Class_0' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, IconToUse) == 0x000008, "Member 'ItemWheelWI_C_AddBuffIcon::IconToUse' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, K2Node_ClassDynamicCast_AsGameplay_Effect_IW) == 0x000038, "Member 'ItemWheelWI_C_AddBuffIcon::K2Node_ClassDynamicCast_AsGameplay_Effect_IW' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, K2Node_ClassDynamicCast_bSuccess) == 0x000040, "Member 'ItemWheelWI_C_AddBuffIcon::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_GetExpectedDuration_ReturnValue) == 0x000044, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_GetExpectedDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_FindComponents_ReturnValue) == 0x000048, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_FindComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'ItemWheelWI_C_AddBuffIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'ItemWheelWI_C_AddBuffIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_Array_Get_Item) == 0x000068, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon) == 0x000070, "Member 'ItemWheelWI_C_AddBuffIcon::K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'ItemWheelWI_C_AddBuffIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_AddBuffIcon, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000088, "Member 'ItemWheelWI_C_AddBuffIcon::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.ExecuteUbergraph_ItemWheelWI
// 0x02F0 (0x02F0 - 0x0000)
struct ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterItemWheelComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0030(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0068(0x0010)(ReferenceParm)
	double                                        Temp_real_Variable_0;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemWheelEntryWI_C*                    CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddChildToRadialMenu_Success;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Selected_Option_OutIndex;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemWheelInfo                         CallFunc_Get_Selected_Option_Info;                 // 0x0108(0x0020)()
	bool                                          CallFunc_Get_Selected_Option_Valid;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Selected_Option_OutIndex_1;           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWheelInfo                         CallFunc_Get_Selected_Option_Info_1;               // 0x0140(0x0020)()
	bool                                          CallFunc_Get_Selected_Option_Valid_1;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemWheelEntryWI_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddChildToRadialMenu_Success_1;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0010)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_CustomEvent_HoveredItemDefinition;          // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemAction*                            CallFunc_Array_Get_Item_1;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemAction_AppliedBuffs*               K2Node_DynamicCast_AsItem_Action_Applied_Buffs;    // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppliedBuffInfo                       CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkManagerComponent*                  CallFunc_GetPerkManagerComponentFromPawn_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPerkAction*>                    CallFunc_K2_GetAllActionsOfType_ReturnValue;       // 0x0218(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPerkAction*                            CallFunc_Array_Get_Item_3;                         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPA_ReplaceItemDescription_C*           K2Node_DynamicCast_AsPA_Replace_Item_Description;  // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ReplaceDescription_Description;           // 0x0248(0x0010)()
	TDelegate<void(class UItemDefinition* HoveredItemDefinition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorDead_Return;                       // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetOwningPlayerInputType_ReturnValue;     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          CallFunc_Array_Get_Item_4;                         // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemWheelInfo                         CallFunc_ConstructItemWheelInfo_ReturnValue;       // 0x0298(0x0020)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI) == 0x000008, "Wrong alignment on ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI");
static_assert(sizeof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI) == 0x0002F0, "Wrong size on ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, EntryPoint) == 0x000000, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_object_Variable) == 0x000010, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_real_Variable) == 0x000018, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_real_Variable_1) == 0x000020, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_bool_Variable) == 0x000028, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000030, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000050, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000054, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000058, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000060, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000068, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_real_Variable_0) == 0x000078, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_real_Variable_1_0) == 0x000080, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000088, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Array_Index_Variable_1) == 0x000098, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Loop_Counter_Variable_1) == 0x00009C, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Array_Index_Variable_2) == 0x0000A4, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Loop_Counter_Variable_2) == 0x0000A8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000AC, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_Event_MyGeometry) == 0x0000B0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_Event_InDeltaTime) == 0x0000E8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000F0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_AddChildToRadialMenu_Success) == 0x000100, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_AddChildToRadialMenu_Success' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_OutIndex) == 0x000104, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_OutIndex' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_Info) == 0x000108, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_Info' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_Valid) == 0x000128, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_Valid' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPlayerController_ReturnValue) == 0x000130, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_OutIndex_1) == 0x000138, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_OutIndex_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_Info_1) == 0x000140, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_Info_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Get_Selected_Option_Valid_1) == 0x000160, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Get_Selected_Option_Valid_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_Event_IsDesignTime) == 0x000161, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000168, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Create_ReturnValue_1) == 0x000170, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_AddChildToRadialMenu_Success_1) == 0x000178, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_AddChildToRadialMenu_Success_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_bool_Has_Been_Initd_Variable) == 0x000190, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_IsValid_ReturnValue) == 0x000191, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPlayerController_ReturnValue_1) == 0x000198, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001A0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0001B0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_AsItem_Definition) == 0x0001B8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_CustomEvent_HoveredItemDefinition) == 0x0001C8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_CustomEvent_HoveredItemDefinition' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Get_Item_1) == 0x0001D0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Length_ReturnValue) == 0x0001D8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_AsItem_Action_Applied_Buffs) == 0x0001E0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_AsItem_Action_Applied_Buffs' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Less_IntInt_ReturnValue) == 0x0001E9, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Length_ReturnValue_1) == 0x000200, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Less_IntInt_ReturnValue_1) == 0x000204, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPerkManagerComponentFromPawn_ReturnValue) == 0x000208, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPerkManagerComponentFromPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_IsValid_ReturnValue_1) == 0x000210, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_K2_GetAllActionsOfType_ReturnValue) == 0x000218, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_K2_GetAllActionsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Get_Item_3) == 0x000228, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000230, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_AsPA_Replace_Item_Description) == 0x000238, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_AsPA_Replace_Item_Description' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_bSuccess_2) == 0x000240, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_ReplaceDescription_Description) == 0x000248, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_ReplaceDescription_Description' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_CreateDelegate_OutputDelegate) == 0x000258, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_bool_IsClosed_Variable) == 0x000268, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_IsActorDead_Return) == 0x000269, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_IsActorDead_Return' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPlayerController_ReturnValue_3) == 0x000270, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetOwningPlayerInputType_ReturnValue) == 0x000278, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetOwningPlayerInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetPlayerController_ReturnValue_4) == 0x000280, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_SwitchEnum_CmpSuccess) == 0x000288, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, Temp_int_Variable) == 0x00028C, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Get_Item_4) == 0x000290, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_ConstructItemWheelInfo_ReturnValue) == 0x000298, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_ConstructItemWheelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002B8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Add_ReturnValue) == 0x0002BC, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002C0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Array_Length_ReturnValue_2) == 0x0002C4, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002C8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0002D0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, CallFunc_K2_GetPawn_ReturnValue) == 0x0002D8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_AsBP_Resident_Character) == 0x0002E0, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI, K2Node_DynamicCast_bSuccess_3) == 0x0002E8, "Member 'ItemWheelWI_C_ExecuteUbergraph_ItemWheelWI::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.Get Selected Option
// 0x00B0 (0x00B0 - 0x0000)
struct ItemWheelWI_C_Get_Selected_Option final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWheelInfo                         Info;                                              // 0x0008(0x0020)(Parm, OutParm)
	bool                                          Valid;                                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWheelInfo                         K2Node_MakeStruct_ItemWheelInfo;                   // 0x0030(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Index;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentIndex_Valid;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWheelInfo                         CallFunc_Array_Get_Item;                           // 0x0060(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWheelInfo                         K2Node_Select_Default;                             // 0x0088(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_Get_Selected_Option) == 0x000008, "Wrong alignment on ItemWheelWI_C_Get_Selected_Option");
static_assert(sizeof(ItemWheelWI_C_Get_Selected_Option) == 0x0000B0, "Wrong size on ItemWheelWI_C_Get_Selected_Option");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, OutIndex) == 0x000000, "Member 'ItemWheelWI_C_Get_Selected_Option::OutIndex' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, Info) == 0x000008, "Member 'ItemWheelWI_C_Get_Selected_Option::Info' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, Valid) == 0x000028, "Member 'ItemWheelWI_C_Get_Selected_Option::Valid' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, K2Node_MakeStruct_ItemWheelInfo) == 0x000030, "Member 'ItemWheelWI_C_Get_Selected_Option::K2Node_MakeStruct_ItemWheelInfo' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, Temp_bool_Variable) == 0x000050, "Member 'ItemWheelWI_C_Get_Selected_Option::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_GetCurrentIndex_Index) == 0x000058, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_GetCurrentIndex_Index' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_GetCurrentIndex_Valid) == 0x00005C, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_GetCurrentIndex_Valid' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_Array_Get_Item) == 0x000060, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, K2Node_Select_Default) == 0x000088, "Member 'ItemWheelWI_C_Get_Selected_Option::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Get_Selected_Option, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'ItemWheelWI_C_Get_Selected_Option::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.GetDamageMultiplierValues
// 0x0020 (0x0020 - 0x0000)
struct ItemWheelWI_C_GetDamageMultiplierValues final
{
public:
	class UItemInstance*                          ItemInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMultiplier;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Damage_Multiplier;                                 // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_DamageMultiplierStructures* CallFunc_FindActionByType_ReturnValue;             // 0x0010(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_GetDamageMultiplierValues) == 0x000008, "Wrong alignment on ItemWheelWI_C_GetDamageMultiplierValues");
static_assert(sizeof(ItemWheelWI_C_GetDamageMultiplierValues) == 0x000020, "Wrong size on ItemWheelWI_C_GetDamageMultiplierValues");
static_assert(offsetof(ItemWheelWI_C_GetDamageMultiplierValues, ItemInstance) == 0x000000, "Member 'ItemWheelWI_C_GetDamageMultiplierValues::ItemInstance' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_GetDamageMultiplierValues, HasMultiplier) == 0x000008, "Member 'ItemWheelWI_C_GetDamageMultiplierValues::HasMultiplier' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_GetDamageMultiplierValues, Damage_Multiplier) == 0x00000C, "Member 'ItemWheelWI_C_GetDamageMultiplierValues::Damage_Multiplier' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_GetDamageMultiplierValues, CallFunc_FindActionByType_ReturnValue) == 0x000010, "Member 'ItemWheelWI_C_GetDamageMultiplierValues::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_GetDamageMultiplierValues, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ItemWheelWI_C_GetDamageMultiplierValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.HoveredEntryChanged
// 0x0008 (0x0008 - 0x0000)
struct ItemWheelWI_C_HoveredEntryChanged final
{
public:
	class UItemDefinition*                        HoveredItemDefinition;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_HoveredEntryChanged) == 0x000008, "Wrong alignment on ItemWheelWI_C_HoveredEntryChanged");
static_assert(sizeof(ItemWheelWI_C_HoveredEntryChanged) == 0x000008, "Wrong size on ItemWheelWI_C_HoveredEntryChanged");
static_assert(offsetof(ItemWheelWI_C_HoveredEntryChanged, HoveredItemDefinition) == 0x000000, "Member 'ItemWheelWI_C_HoveredEntryChanged::HoveredItemDefinition' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'ItemWheelWI_C_InpActEvt_IA_ItemWheel_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemWheelWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_PreConstruct) == 0x000001, "Wrong alignment on ItemWheelWI_C_PreConstruct");
static_assert(sizeof(ItemWheelWI_C_PreConstruct) == 0x000001, "Wrong size on ItemWheelWI_C_PreConstruct");
static_assert(offsetof(ItemWheelWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ItemWheelWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ItemWheelWI.ItemWheelWI_C.Tick
// 0x003C (0x003C - 0x0000)
struct ItemWheelWI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemWheelWI_C_Tick) == 0x000004, "Wrong alignment on ItemWheelWI_C_Tick");
static_assert(sizeof(ItemWheelWI_C_Tick) == 0x00003C, "Wrong size on ItemWheelWI_C_Tick");
static_assert(offsetof(ItemWheelWI_C_Tick, MyGeometry) == 0x000000, "Member 'ItemWheelWI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemWheelWI_C_Tick, InDeltaTime) == 0x000038, "Member 'ItemWheelWI_C_Tick::InDeltaTime' has a wrong offset!");

}

