#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWAnalyticsBasicImpl

#include "Basic.hpp"

#include "IWAnalyticsBasicImpl_structs.hpp"
#include "IWAnalytics_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class IWAnalyticsBasicImpl.IWAnalyticsBasicImplSettings
// 0x0058 (0x0080 - 0x0028)
class UIWAnalyticsBasicImplSettings final : public UObject
{
public:
	struct FPlayerLevelLoadedAnalyticsEventSettings PlayerLevelLoaded;                                 // 0x0028(0x0058)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IWAnalyticsBasicImplSettings">();
	}
	static class UIWAnalyticsBasicImplSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIWAnalyticsBasicImplSettings>();
	}
};
static_assert(alignof(UIWAnalyticsBasicImplSettings) == 0x000008, "Wrong alignment on UIWAnalyticsBasicImplSettings");
static_assert(sizeof(UIWAnalyticsBasicImplSettings) == 0x000080, "Wrong size on UIWAnalyticsBasicImplSettings");
static_assert(offsetof(UIWAnalyticsBasicImplSettings, PlayerLevelLoaded) == 0x000028, "Member 'UIWAnalyticsBasicImplSettings::PlayerLevelLoaded' has a wrong offset!");

// Class IWAnalyticsBasicImpl.PlayerLevelLoadedAnalyticsEvent
// 0x0010 (0x0070 - 0x0060)
class UPlayerLevelLoadedAnalyticsEvent final : public UIWAnalyticsEvent
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerLevelLoadedAnalyticsEvent">();
	}
	static class UPlayerLevelLoadedAnalyticsEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerLevelLoadedAnalyticsEvent>();
	}
};
static_assert(alignof(UPlayerLevelLoadedAnalyticsEvent) == 0x000008, "Wrong alignment on UPlayerLevelLoadedAnalyticsEvent");
static_assert(sizeof(UPlayerLevelLoadedAnalyticsEvent) == 0x000070, "Wrong size on UPlayerLevelLoadedAnalyticsEvent");

// Class IWAnalyticsBasicImpl.PlayerLevelLoadedAnalyticsEventWorldSubsystem
// 0x0018 (0x0048 - 0x0030)
class UPlayerLevelLoadedAnalyticsEventWorldSubsystem final : public UBaseAnalyticsEventWorldSubsystem
{
public:
	class UPlayerLevelLoadedAnalyticsEvent*       AnalyticsEvent;                                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSendError(int32 ErrorCode, const class FString& ErrorMessage);
	void HandleSendSuccees();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerLevelLoadedAnalyticsEventWorldSubsystem">();
	}
	static class UPlayerLevelLoadedAnalyticsEventWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerLevelLoadedAnalyticsEventWorldSubsystem>();
	}
};
static_assert(alignof(UPlayerLevelLoadedAnalyticsEventWorldSubsystem) == 0x000008, "Wrong alignment on UPlayerLevelLoadedAnalyticsEventWorldSubsystem");
static_assert(sizeof(UPlayerLevelLoadedAnalyticsEventWorldSubsystem) == 0x000048, "Wrong size on UPlayerLevelLoadedAnalyticsEventWorldSubsystem");
static_assert(offsetof(UPlayerLevelLoadedAnalyticsEventWorldSubsystem, AnalyticsEvent) == 0x000030, "Member 'UPlayerLevelLoadedAnalyticsEventWorldSubsystem::AnalyticsEvent' has a wrong offset!");

}

