#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWChat

#include "Basic.hpp"

#include "IWChat_structs.hpp"


namespace SDK::Params
{

// Function IWChat.ChatMessageWidget.ApplyViewModel
// 0x0028 (0x0028 - 0x0000)
struct ChatMessageWidget_ApplyViewModel final
{
public:
	struct FChatMessageWidgetViewModel            InViewModel;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatMessageWidget_ApplyViewModel) == 0x000008, "Wrong alignment on ChatMessageWidget_ApplyViewModel");
static_assert(sizeof(ChatMessageWidget_ApplyViewModel) == 0x000028, "Wrong size on ChatMessageWidget_ApplyViewModel");
static_assert(offsetof(ChatMessageWidget_ApplyViewModel, InViewModel) == 0x000000, "Member 'ChatMessageWidget_ApplyViewModel::InViewModel' has a wrong offset!");

// Function IWChat.ChatReplicationComponent.Multicast_Message
// 0x0038 (0x0038 - 0x0000)
struct ChatReplicationComponent_Multicast_Message final
{
public:
	struct FChatMessage                           InMessage;                                         // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatReplicationComponent_Multicast_Message) == 0x000008, "Wrong alignment on ChatReplicationComponent_Multicast_Message");
static_assert(sizeof(ChatReplicationComponent_Multicast_Message) == 0x000038, "Wrong size on ChatReplicationComponent_Multicast_Message");
static_assert(offsetof(ChatReplicationComponent_Multicast_Message, InMessage) == 0x000000, "Member 'ChatReplicationComponent_Multicast_Message::InMessage' has a wrong offset!");

// Function IWChat.ChatReplicationComponent.Server_Message
// 0x0038 (0x0038 - 0x0000)
struct ChatReplicationComponent_Server_Message final
{
public:
	struct FChatMessage                           InMessage;                                         // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatReplicationComponent_Server_Message) == 0x000008, "Wrong alignment on ChatReplicationComponent_Server_Message");
static_assert(sizeof(ChatReplicationComponent_Server_Message) == 0x000038, "Wrong size on ChatReplicationComponent_Server_Message");
static_assert(offsetof(ChatReplicationComponent_Server_Message, InMessage) == 0x000000, "Member 'ChatReplicationComponent_Server_Message::InMessage' has a wrong offset!");

// Function IWChat.ChatWidget.Catchup
// 0x0004 (0x0004 - 0x0000)
struct ChatWidget_Catchup final
{
public:
	int32                                         InCount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWidget_Catchup) == 0x000004, "Wrong alignment on ChatWidget_Catchup");
static_assert(sizeof(ChatWidget_Catchup) == 0x000004, "Wrong size on ChatWidget_Catchup");
static_assert(offsetof(ChatWidget_Catchup, InCount) == 0x000000, "Member 'ChatWidget_Catchup::InCount' has a wrong offset!");

// Function IWChat.ChatWidget.OnMessageAdded
// 0x0038 (0x0038 - 0x0000)
struct ChatWidget_OnMessageAdded final
{
public:
	struct FChatMessage                           InMessage;                                         // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWidget_OnMessageAdded) == 0x000008, "Wrong alignment on ChatWidget_OnMessageAdded");
static_assert(sizeof(ChatWidget_OnMessageAdded) == 0x000038, "Wrong size on ChatWidget_OnMessageAdded");
static_assert(offsetof(ChatWidget_OnMessageAdded, InMessage) == 0x000000, "Member 'ChatWidget_OnMessageAdded::InMessage' has a wrong offset!");

// Function IWChat.ChatWidget.SendMessage
// 0x0018 (0x0018 - 0x0000)
struct ChatWidget_SendMessage final
{
public:
	class FText                                   InMessage;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EChatMessageType                              InScope;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatWidget_SendMessage) == 0x000008, "Wrong alignment on ChatWidget_SendMessage");
static_assert(sizeof(ChatWidget_SendMessage) == 0x000018, "Wrong size on ChatWidget_SendMessage");
static_assert(offsetof(ChatWidget_SendMessage, InMessage) == 0x000000, "Member 'ChatWidget_SendMessage::InMessage' has a wrong offset!");
static_assert(offsetof(ChatWidget_SendMessage, InScope) == 0x000010, "Member 'ChatWidget_SendMessage::InScope' has a wrong offset!");

}

