#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWEpicOnlineServices

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct IWEpicOnlineServices.PlayerSanctionData
// 0x0018 (0x0018 - 0x0000)
struct FPlayerSanctionData final
{
public:
	struct FDateTime                              StartTime;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndTime;                                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPermanent;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerSanctionData) == 0x000008, "Wrong alignment on FPlayerSanctionData");
static_assert(sizeof(FPlayerSanctionData) == 0x000018, "Wrong size on FPlayerSanctionData");
static_assert(offsetof(FPlayerSanctionData, StartTime) == 0x000000, "Member 'FPlayerSanctionData::StartTime' has a wrong offset!");
static_assert(offsetof(FPlayerSanctionData, EndTime) == 0x000008, "Member 'FPlayerSanctionData::EndTime' has a wrong offset!");
static_assert(offsetof(FPlayerSanctionData, bIsPermanent) == 0x000010, "Member 'FPlayerSanctionData::bIsPermanent' has a wrong offset!");

}

