#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWGamepadCursor

#include "Basic.hpp"


namespace SDK::Params
{

// Function IWGamepadCursor.GamepadCursorFunctionLibrary.DisableVirtualCursor
// 0x0008 (0x0008 - 0x0000)
struct GamepadCursorFunctionLibrary_DisableVirtualCursor final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamepadCursorFunctionLibrary_DisableVirtualCursor) == 0x000008, "Wrong alignment on GamepadCursorFunctionLibrary_DisableVirtualCursor");
static_assert(sizeof(GamepadCursorFunctionLibrary_DisableVirtualCursor) == 0x000008, "Wrong size on GamepadCursorFunctionLibrary_DisableVirtualCursor");
static_assert(offsetof(GamepadCursorFunctionLibrary_DisableVirtualCursor, PC) == 0x000000, "Member 'GamepadCursorFunctionLibrary_DisableVirtualCursor::PC' has a wrong offset!");

// Function IWGamepadCursor.GamepadCursorFunctionLibrary.EnableVirtualCursor
// 0x0008 (0x0008 - 0x0000)
struct GamepadCursorFunctionLibrary_EnableVirtualCursor final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamepadCursorFunctionLibrary_EnableVirtualCursor) == 0x000008, "Wrong alignment on GamepadCursorFunctionLibrary_EnableVirtualCursor");
static_assert(sizeof(GamepadCursorFunctionLibrary_EnableVirtualCursor) == 0x000008, "Wrong size on GamepadCursorFunctionLibrary_EnableVirtualCursor");
static_assert(offsetof(GamepadCursorFunctionLibrary_EnableVirtualCursor, PC) == 0x000000, "Member 'GamepadCursorFunctionLibrary_EnableVirtualCursor::PC' has a wrong offset!");

// Function IWGamepadCursor.GamepadCursorFunctionLibrary.IsCursorOverInteractableWidget
// 0x0001 (0x0001 - 0x0000)
struct GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget) == 0x000001, "Wrong alignment on GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget");
static_assert(sizeof(GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget) == 0x000001, "Wrong size on GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget");
static_assert(offsetof(GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget, ReturnValue) == 0x000000, "Member 'GamepadCursorFunctionLibrary_IsCursorOverInteractableWidget::ReturnValue' has a wrong offset!");

}

