#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWInitialization

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function IWInitialization.InitializationStateStarted.ListenToInitializationStateStarted
// 0x0018 (0x0018 - 0x0000)
struct InitializationStateStarted_ListenToInitializationStateStarted final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Identifier;                                        // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInitializationStateStarted*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InitializationStateStarted_ListenToInitializationStateStarted) == 0x000008, "Wrong alignment on InitializationStateStarted_ListenToInitializationStateStarted");
static_assert(sizeof(InitializationStateStarted_ListenToInitializationStateStarted) == 0x000018, "Wrong size on InitializationStateStarted_ListenToInitializationStateStarted");
static_assert(offsetof(InitializationStateStarted_ListenToInitializationStateStarted, WorldContextObject) == 0x000000, "Member 'InitializationStateStarted_ListenToInitializationStateStarted::WorldContextObject' has a wrong offset!");
static_assert(offsetof(InitializationStateStarted_ListenToInitializationStateStarted, Identifier) == 0x000008, "Member 'InitializationStateStarted_ListenToInitializationStateStarted::Identifier' has a wrong offset!");
static_assert(offsetof(InitializationStateStarted_ListenToInitializationStateStarted, ReturnValue) == 0x000010, "Member 'InitializationStateStarted_ListenToInitializationStateStarted::ReturnValue' has a wrong offset!");

// Function IWInitialization.InitializationStateEnded.ListenToInitializationStateEnded
// 0x0018 (0x0018 - 0x0000)
struct InitializationStateEnded_ListenToInitializationStateEnded final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Identifier;                                        // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInitializationStateEnded*              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InitializationStateEnded_ListenToInitializationStateEnded) == 0x000008, "Wrong alignment on InitializationStateEnded_ListenToInitializationStateEnded");
static_assert(sizeof(InitializationStateEnded_ListenToInitializationStateEnded) == 0x000018, "Wrong size on InitializationStateEnded_ListenToInitializationStateEnded");
static_assert(offsetof(InitializationStateEnded_ListenToInitializationStateEnded, WorldContextObject) == 0x000000, "Member 'InitializationStateEnded_ListenToInitializationStateEnded::WorldContextObject' has a wrong offset!");
static_assert(offsetof(InitializationStateEnded_ListenToInitializationStateEnded, Identifier) == 0x000008, "Member 'InitializationStateEnded_ListenToInitializationStateEnded::Identifier' has a wrong offset!");
static_assert(offsetof(InitializationStateEnded_ListenToInitializationStateEnded, ReturnValue) == 0x000010, "Member 'InitializationStateEnded_ListenToInitializationStateEnded::ReturnValue' has a wrong offset!");

// Function IWInitialization.InitializationStateExecution.ExecuteInitializationState
// 0x0038 (0x0038 - 0x0000)
struct InitializationStateExecution_ExecuteInitializationState final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInitializationState>    State;                                             // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInitializationStateExecution*          ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InitializationStateExecution_ExecuteInitializationState) == 0x000008, "Wrong alignment on InitializationStateExecution_ExecuteInitializationState");
static_assert(sizeof(InitializationStateExecution_ExecuteInitializationState) == 0x000038, "Wrong size on InitializationStateExecution_ExecuteInitializationState");
static_assert(offsetof(InitializationStateExecution_ExecuteInitializationState, WorldContextObject) == 0x000000, "Member 'InitializationStateExecution_ExecuteInitializationState::WorldContextObject' has a wrong offset!");
static_assert(offsetof(InitializationStateExecution_ExecuteInitializationState, State) == 0x000008, "Member 'InitializationStateExecution_ExecuteInitializationState::State' has a wrong offset!");
static_assert(offsetof(InitializationStateExecution_ExecuteInitializationState, ReturnValue) == 0x000030, "Member 'InitializationStateExecution_ExecuteInitializationState::ReturnValue' has a wrong offset!");

// Function IWInitialization.InitializationWorldSubsystem.HasInitializationStateEnded
// 0x0018 (0x0018 - 0x0000)
struct InitializationWorldSubsystem_HasInitializationStateEnded final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InitializationWorldSubsystem_HasInitializationStateEnded) == 0x000008, "Wrong alignment on InitializationWorldSubsystem_HasInitializationStateEnded");
static_assert(sizeof(InitializationWorldSubsystem_HasInitializationStateEnded) == 0x000018, "Wrong size on InitializationWorldSubsystem_HasInitializationStateEnded");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateEnded, WorldContextObject) == 0x000000, "Member 'InitializationWorldSubsystem_HasInitializationStateEnded::WorldContextObject' has a wrong offset!");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateEnded, Tag) == 0x000008, "Member 'InitializationWorldSubsystem_HasInitializationStateEnded::Tag' has a wrong offset!");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateEnded, ReturnValue) == 0x000010, "Member 'InitializationWorldSubsystem_HasInitializationStateEnded::ReturnValue' has a wrong offset!");

// Function IWInitialization.InitializationWorldSubsystem.HasInitializationStateStarted
// 0x0018 (0x0018 - 0x0000)
struct InitializationWorldSubsystem_HasInitializationStateStarted final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(InitializationWorldSubsystem_HasInitializationStateStarted) == 0x000008, "Wrong alignment on InitializationWorldSubsystem_HasInitializationStateStarted");
static_assert(sizeof(InitializationWorldSubsystem_HasInitializationStateStarted) == 0x000018, "Wrong size on InitializationWorldSubsystem_HasInitializationStateStarted");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateStarted, WorldContextObject) == 0x000000, "Member 'InitializationWorldSubsystem_HasInitializationStateStarted::WorldContextObject' has a wrong offset!");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateStarted, Tag) == 0x000008, "Member 'InitializationWorldSubsystem_HasInitializationStateStarted::Tag' has a wrong offset!");
static_assert(offsetof(InitializationWorldSubsystem_HasInitializationStateStarted, ReturnValue) == 0x000010, "Member 'InitializationWorldSubsystem_HasInitializationStateStarted::ReturnValue' has a wrong offset!");

// Function IWInitialization.InitializationWorldSubsystem.FinishStateStep
// 0x0008 (0x0008 - 0x0000)
struct InitializationWorldSubsystem_FinishStateStep final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InitializationWorldSubsystem_FinishStateStep) == 0x000004, "Wrong alignment on InitializationWorldSubsystem_FinishStateStep");
static_assert(sizeof(InitializationWorldSubsystem_FinishStateStep) == 0x000008, "Wrong size on InitializationWorldSubsystem_FinishStateStep");
static_assert(offsetof(InitializationWorldSubsystem_FinishStateStep, Tag) == 0x000000, "Member 'InitializationWorldSubsystem_FinishStateStep::Tag' has a wrong offset!");

}

