#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IWOnlineServices

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "IWOnlineServices_structs.hpp"


namespace SDK
{

// Class IWOnlineServices.OnlineServiceHandler
// 0x0008 (0x0030 - 0x0028)
class UOnlineServiceHandler : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineServiceHandler">();
	}
	static class UOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineServiceHandler>();
	}
};
static_assert(alignof(UOnlineServiceHandler) == 0x000008, "Wrong alignment on UOnlineServiceHandler");
static_assert(sizeof(UOnlineServiceHandler) == 0x000030, "Wrong size on UOnlineServiceHandler");

// Class IWOnlineServices.AchievementsOnlineServiceHandler
// 0x0028 (0x0058 - 0x0030)
class UAchievementsOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementsOnlineServiceHandler">();
	}
	static class UAchievementsOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementsOnlineServiceHandler>();
	}
};
static_assert(alignof(UAchievementsOnlineServiceHandler) == 0x000008, "Wrong alignment on UAchievementsOnlineServiceHandler");
static_assert(sizeof(UAchievementsOnlineServiceHandler) == 0x000058, "Wrong size on UAchievementsOnlineServiceHandler");

// Class IWOnlineServices.AnalyticsOnlineServiceHandler
// 0x00D0 (0x0100 - 0x0030)
class alignas(0x10) UAnalyticsOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     RequestJsonObj;                                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayFabJsonObject*                     ResponseJsonObj;                                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x70];                                      // 0x0090(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalyticsOnlineServiceHandler">();
	}
	static class UAnalyticsOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyticsOnlineServiceHandler>();
	}
};
static_assert(alignof(UAnalyticsOnlineServiceHandler) == 0x000010, "Wrong alignment on UAnalyticsOnlineServiceHandler");
static_assert(sizeof(UAnalyticsOnlineServiceHandler) == 0x000100, "Wrong size on UAnalyticsOnlineServiceHandler");
static_assert(offsetof(UAnalyticsOnlineServiceHandler, CustomData) == 0x000060, "Member 'UAnalyticsOnlineServiceHandler::CustomData' has a wrong offset!");
static_assert(offsetof(UAnalyticsOnlineServiceHandler, RequestJsonObj) == 0x000080, "Member 'UAnalyticsOnlineServiceHandler::RequestJsonObj' has a wrong offset!");
static_assert(offsetof(UAnalyticsOnlineServiceHandler, ResponseJsonObj) == 0x000088, "Member 'UAnalyticsOnlineServiceHandler::ResponseJsonObj' has a wrong offset!");

// Class IWOnlineServices.ArmadaOnlineServiceHandler
// 0x00A8 (0x00D8 - 0x0030)
class UArmadaOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xA8];                                      // 0x0030(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OnGSDKHealthCheck();
	void OnGSDKReadyForPlayers();
	void OnGSDKServerActive();
	void OnGSDKShutdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArmadaOnlineServiceHandler">();
	}
	static class UArmadaOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmadaOnlineServiceHandler>();
	}
};
static_assert(alignof(UArmadaOnlineServiceHandler) == 0x000008, "Wrong alignment on UArmadaOnlineServiceHandler");
static_assert(sizeof(UArmadaOnlineServiceHandler) == 0x0000D8, "Wrong size on UArmadaOnlineServiceHandler");

// Class IWOnlineServices.AsyncAction_OnlineServicesBase
// 0x0000 (0x0030 - 0x0030)
class UAsyncAction_OnlineServicesBase : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_OnlineServicesBase">();
	}
	static class UAsyncAction_OnlineServicesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_OnlineServicesBase>();
	}
};
static_assert(alignof(UAsyncAction_OnlineServicesBase) == 0x000008, "Wrong alignment on UAsyncAction_OnlineServicesBase");
static_assert(sizeof(UAsyncAction_OnlineServicesBase) == 0x000030, "Wrong size on UAsyncAction_OnlineServicesBase");

// Class IWOnlineServices.AsyncAction_ResolvePartyState
// 0x0040 (0x0070 - 0x0030)
class UAsyncAction_ResolvePartyState final : public UAsyncAction_OnlineServicesBase
{
public:
	FMulticastInlineDelegateProperty_             OnFoundParty;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNoParty;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ResolvePartyState* ResolvePartyState(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ResolvePartyState">();
	}
	static class UAsyncAction_ResolvePartyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ResolvePartyState>();
	}
};
static_assert(alignof(UAsyncAction_ResolvePartyState) == 0x000008, "Wrong alignment on UAsyncAction_ResolvePartyState");
static_assert(sizeof(UAsyncAction_ResolvePartyState) == 0x000070, "Wrong size on UAsyncAction_ResolvePartyState");
static_assert(offsetof(UAsyncAction_ResolvePartyState, OnFoundParty) == 0x000030, "Member 'UAsyncAction_ResolvePartyState::OnFoundParty' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ResolvePartyState, OnNoParty) == 0x000040, "Member 'UAsyncAction_ResolvePartyState::OnNoParty' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ResolvePartyState, OnError) == 0x000050, "Member 'UAsyncAction_ResolvePartyState::OnError' has a wrong offset!");

// Class IWOnlineServices.AuthenticationActionBase
// 0x00D0 (0x00F8 - 0x0028)
class UAuthenticationActionBase : public UObject
{
public:
	uint8                                         Pad_28[0xD0];                                      // 0x0028(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AuthenticationActionBase">();
	}
	static class UAuthenticationActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationActionBase>();
	}
};
static_assert(alignof(UAuthenticationActionBase) == 0x000008, "Wrong alignment on UAuthenticationActionBase");
static_assert(sizeof(UAuthenticationActionBase) == 0x0000F8, "Wrong size on UAuthenticationActionBase");

// Class IWOnlineServices.BackfillingOnlineServiceHandler
// 0x0070 (0x00A0 - 0x0030)
class UBackfillingOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	class UArmadaOnlineServiceHandler*            Armada;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOnlineServicesErrorSubsystem*          ErrorSubsystem;                                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BackfillingOnlineServiceHandler">();
	}
	static class UBackfillingOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackfillingOnlineServiceHandler>();
	}
};
static_assert(alignof(UBackfillingOnlineServiceHandler) == 0x000008, "Wrong alignment on UBackfillingOnlineServiceHandler");
static_assert(sizeof(UBackfillingOnlineServiceHandler) == 0x0000A0, "Wrong size on UBackfillingOnlineServiceHandler");
static_assert(offsetof(UBackfillingOnlineServiceHandler, Armada) == 0x000030, "Member 'UBackfillingOnlineServiceHandler::Armada' has a wrong offset!");
static_assert(offsetof(UBackfillingOnlineServiceHandler, ErrorSubsystem) == 0x000038, "Member 'UBackfillingOnlineServiceHandler::ErrorSubsystem' has a wrong offset!");

// Class IWOnlineServices.BlockedPlayersOnlineServiceHandler
// 0x00B0 (0x00E0 - 0x0030)
class UBlockedPlayersOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlockedPlayersOnlineServiceHandler">();
	}
	static class UBlockedPlayersOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockedPlayersOnlineServiceHandler>();
	}
};
static_assert(alignof(UBlockedPlayersOnlineServiceHandler) == 0x000008, "Wrong alignment on UBlockedPlayersOnlineServiceHandler");
static_assert(sizeof(UBlockedPlayersOnlineServiceHandler) == 0x0000E0, "Wrong size on UBlockedPlayersOnlineServiceHandler");

// Class IWOnlineServices.CachedTitleIdContainer
// 0x0050 (0x0078 - 0x0028)
class UCachedTitleIdContainer final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CachedTitleIdContainer">();
	}
	static class UCachedTitleIdContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCachedTitleIdContainer>();
	}
};
static_assert(alignof(UCachedTitleIdContainer) == 0x000008, "Wrong alignment on UCachedTitleIdContainer");
static_assert(sizeof(UCachedTitleIdContainer) == 0x000078, "Wrong size on UCachedTitleIdContainer");

// Class IWOnlineServices.ClientEconomyOnlineServiceHandler
// 0x0028 (0x0058 - 0x0030)
class UClientEconomyOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClientEconomyOnlineServiceHandler">();
	}
	static class UClientEconomyOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientEconomyOnlineServiceHandler>();
	}
};
static_assert(alignof(UClientEconomyOnlineServiceHandler) == 0x000008, "Wrong alignment on UClientEconomyOnlineServiceHandler");
static_assert(sizeof(UClientEconomyOnlineServiceHandler) == 0x000058, "Wrong size on UClientEconomyOnlineServiceHandler");

// Class IWOnlineServices.CloudSaveOnlineServiceHandler
// 0x0010 (0x0040 - 0x0030)
class UCloudSaveOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CloudSaveOnlineServiceHandler">();
	}
	static class UCloudSaveOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCloudSaveOnlineServiceHandler>();
	}
};
static_assert(alignof(UCloudSaveOnlineServiceHandler) == 0x000008, "Wrong alignment on UCloudSaveOnlineServiceHandler");
static_assert(sizeof(UCloudSaveOnlineServiceHandler) == 0x000040, "Wrong size on UCloudSaveOnlineServiceHandler");

// Class IWOnlineServices.CloudScriptOnlineServiceHandler
// 0x0010 (0x0040 - 0x0030)
class UCloudScriptOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CloudScriptOnlineServiceHandler">();
	}
	static class UCloudScriptOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCloudScriptOnlineServiceHandler>();
	}
};
static_assert(alignof(UCloudScriptOnlineServiceHandler) == 0x000008, "Wrong alignment on UCloudScriptOnlineServiceHandler");
static_assert(sizeof(UCloudScriptOnlineServiceHandler) == 0x000040, "Wrong size on UCloudScriptOnlineServiceHandler");

// Class IWOnlineServices.CustomIdAuthenticationAction
// 0x0000 (0x00F8 - 0x00F8)
class UCustomIdAuthenticationAction final : public UAuthenticationActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomIdAuthenticationAction">();
	}
	static class UCustomIdAuthenticationAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomIdAuthenticationAction>();
	}
};
static_assert(alignof(UCustomIdAuthenticationAction) == 0x000008, "Wrong alignment on UCustomIdAuthenticationAction");
static_assert(sizeof(UCustomIdAuthenticationAction) == 0x0000F8, "Wrong size on UCustomIdAuthenticationAction");

// Class IWOnlineServices.PlatformStoreBase
// 0x0090 (0x00B8 - 0x0028)
class UPlatformStoreBase : public UObject
{
public:
	uint8                                         Pad_28[0x90];                                      // 0x0028(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformStoreBase">();
	}
	static class UPlatformStoreBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformStoreBase>();
	}
};
static_assert(alignof(UPlatformStoreBase) == 0x000008, "Wrong alignment on UPlatformStoreBase");
static_assert(sizeof(UPlatformStoreBase) == 0x0000B8, "Wrong size on UPlatformStoreBase");

// Class IWOnlineServices.CustomIdPlatformStore
// 0x0000 (0x00B8 - 0x00B8)
class UCustomIdPlatformStore final : public UPlatformStoreBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomIdPlatformStore">();
	}
	static class UCustomIdPlatformStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomIdPlatformStore>();
	}
};
static_assert(alignof(UCustomIdPlatformStore) == 0x000008, "Wrong alignment on UCustomIdPlatformStore");
static_assert(sizeof(UCustomIdPlatformStore) == 0x0000B8, "Wrong size on UCustomIdPlatformStore");

// Class IWOnlineServices.EASAuthenticationAction
// 0x0010 (0x0108 - 0x00F8)
class UEASAuthenticationAction final : public UAuthenticationActionBase
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EASAuthenticationAction">();
	}
	static class UEASAuthenticationAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEASAuthenticationAction>();
	}
};
static_assert(alignof(UEASAuthenticationAction) == 0x000008, "Wrong alignment on UEASAuthenticationAction");
static_assert(sizeof(UEASAuthenticationAction) == 0x000108, "Wrong size on UEASAuthenticationAction");

// Class IWOnlineServices.EASPlatformStore
// 0x0000 (0x00B8 - 0x00B8)
class UEASPlatformStore final : public UPlatformStoreBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EASPlatformStore">();
	}
	static class UEASPlatformStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEASPlatformStore>();
	}
};
static_assert(alignof(UEASPlatformStore) == 0x000008, "Wrong alignment on UEASPlatformStore");
static_assert(sizeof(UEASPlatformStore) == 0x0000B8, "Wrong size on UEASPlatformStore");

// Class IWOnlineServices.FriendsOnlineServiceHandler
// 0x0080 (0x00B0 - 0x0030)
class UFriendsOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x80];                                      // 0x0030(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FriendsOnlineServiceHandler">();
	}
	static class UFriendsOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendsOnlineServiceHandler>();
	}
};
static_assert(alignof(UFriendsOnlineServiceHandler) == 0x000008, "Wrong alignment on UFriendsOnlineServiceHandler");
static_assert(sizeof(UFriendsOnlineServiceHandler) == 0x0000B0, "Wrong size on UFriendsOnlineServiceHandler");

// Class IWOnlineServices.IdentityOnlineServiceHandler
// 0x00A8 (0x00D8 - 0x0030)
class UIdentityOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x88];                                      // 0x0030(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UCachedTitleIdContainer*                SteamIdsToTitleIds;                                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             UserAvatarTexture;                                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthenticationActionBase*              AuthenticationAction;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static EClientIdentityLoginState GetClientLoginState(const class UObject* WorldContextObject);
	static class FString K2_GetMasterAccountId(const class UObject* WorldContextObject);
	static bool K2_IsLoggedIn(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IdentityOnlineServiceHandler">();
	}
	static class UIdentityOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIdentityOnlineServiceHandler>();
	}
};
static_assert(alignof(UIdentityOnlineServiceHandler) == 0x000008, "Wrong alignment on UIdentityOnlineServiceHandler");
static_assert(sizeof(UIdentityOnlineServiceHandler) == 0x0000D8, "Wrong size on UIdentityOnlineServiceHandler");
static_assert(offsetof(UIdentityOnlineServiceHandler, SteamIdsToTitleIds) == 0x0000B8, "Member 'UIdentityOnlineServiceHandler::SteamIdsToTitleIds' has a wrong offset!");
static_assert(offsetof(UIdentityOnlineServiceHandler, UserAvatarTexture) == 0x0000C8, "Member 'UIdentityOnlineServiceHandler::UserAvatarTexture' has a wrong offset!");
static_assert(offsetof(UIdentityOnlineServiceHandler, AuthenticationAction) == 0x0000D0, "Member 'UIdentityOnlineServiceHandler::AuthenticationAction' has a wrong offset!");

// Class IWOnlineServices.IWOnlineServicesGameInstanceSubsystem
// 0x00C0 (0x00F0 - 0x0030)
class UIWOnlineServicesGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	class UQualityOfServiceOnlineServiceHandler*  QualityOfService;                                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAchievementsOnlineServiceHandler*      Achievements;                                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCloudSaveOnlineServiceHandler*         CloudSave;                                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UIdentityOnlineServiceHandler*          Identity;                                          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPartyOnlineServiceHandler*             Party;                                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFriendsOnlineServiceHandler*           Friends;                                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserAgreementOnlineServiceHandler*     Eula;                                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URecentPlayersOnlineServiceHandler*     RecentPlayers;                                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlockedPlayersOnlineServiceHandler*    BlockedPlayers;                                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UServerEconomyOnlineServiceHandler*     ServerEconomy;                                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UServerAuthOnlineServiceHandler*        ServerAuth;                                        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UServerCloudSaveOnlineServiceHandler*   ServerCloudSave;                                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArmadaOnlineServiceHandler*            Armada;                                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBackfillingOnlineServiceHandler*       Backfilling;                                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnalyticsOnlineServiceHandler*         Analytics;                                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USessionOnlineServiceHandler*           Session;                                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserOnlineServiceHandler*              UserHandler;                                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USharedEconomyOnlineServiceHandler*     Economy;                                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCloudScriptOnlineServiceHandler*       CloudScript;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClientEconomyOnlineServiceHandler*     ClientEconomy;                                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStorePurchaseOnlineServiceHandler*     StorePurchase;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UOnlineServiceHandler*>          ActiveHandlers;                                    // 0x00D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UUserWidget>             DebugWidget;                                       // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FString GetLocalUserID();
	void OnLoginSucceeded();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IWOnlineServicesGameInstanceSubsystem">();
	}
	static class UIWOnlineServicesGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIWOnlineServicesGameInstanceSubsystem>();
	}
};
static_assert(alignof(UIWOnlineServicesGameInstanceSubsystem) == 0x000008, "Wrong alignment on UIWOnlineServicesGameInstanceSubsystem");
static_assert(sizeof(UIWOnlineServicesGameInstanceSubsystem) == 0x0000F0, "Wrong size on UIWOnlineServicesGameInstanceSubsystem");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, QualityOfService) == 0x000030, "Member 'UIWOnlineServicesGameInstanceSubsystem::QualityOfService' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Achievements) == 0x000038, "Member 'UIWOnlineServicesGameInstanceSubsystem::Achievements' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, CloudSave) == 0x000040, "Member 'UIWOnlineServicesGameInstanceSubsystem::CloudSave' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Identity) == 0x000048, "Member 'UIWOnlineServicesGameInstanceSubsystem::Identity' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Party) == 0x000050, "Member 'UIWOnlineServicesGameInstanceSubsystem::Party' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Friends) == 0x000058, "Member 'UIWOnlineServicesGameInstanceSubsystem::Friends' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Eula) == 0x000060, "Member 'UIWOnlineServicesGameInstanceSubsystem::Eula' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, RecentPlayers) == 0x000068, "Member 'UIWOnlineServicesGameInstanceSubsystem::RecentPlayers' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, BlockedPlayers) == 0x000070, "Member 'UIWOnlineServicesGameInstanceSubsystem::BlockedPlayers' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, ServerEconomy) == 0x000078, "Member 'UIWOnlineServicesGameInstanceSubsystem::ServerEconomy' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, ServerAuth) == 0x000080, "Member 'UIWOnlineServicesGameInstanceSubsystem::ServerAuth' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, ServerCloudSave) == 0x000088, "Member 'UIWOnlineServicesGameInstanceSubsystem::ServerCloudSave' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Armada) == 0x000090, "Member 'UIWOnlineServicesGameInstanceSubsystem::Armada' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Backfilling) == 0x000098, "Member 'UIWOnlineServicesGameInstanceSubsystem::Backfilling' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Analytics) == 0x0000A0, "Member 'UIWOnlineServicesGameInstanceSubsystem::Analytics' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Session) == 0x0000A8, "Member 'UIWOnlineServicesGameInstanceSubsystem::Session' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, UserHandler) == 0x0000B0, "Member 'UIWOnlineServicesGameInstanceSubsystem::UserHandler' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, Economy) == 0x0000B8, "Member 'UIWOnlineServicesGameInstanceSubsystem::Economy' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, CloudScript) == 0x0000C0, "Member 'UIWOnlineServicesGameInstanceSubsystem::CloudScript' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, ClientEconomy) == 0x0000C8, "Member 'UIWOnlineServicesGameInstanceSubsystem::ClientEconomy' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, StorePurchase) == 0x0000D0, "Member 'UIWOnlineServicesGameInstanceSubsystem::StorePurchase' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, ActiveHandlers) == 0x0000D8, "Member 'UIWOnlineServicesGameInstanceSubsystem::ActiveHandlers' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesGameInstanceSubsystem, DebugWidget) == 0x0000E8, "Member 'UIWOnlineServicesGameInstanceSubsystem::DebugWidget' has a wrong offset!");

// Class IWOnlineServices.IWOnlineServicesSettings
// 0x0060 (0x0088 - 0x0028)
class UIWOnlineServicesSettings final : public UObject
{
public:
	class FString                                 ServerMatchmakingQueue;                            // 0x0028(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              FallbackUserAvatar;                                // 0x0038(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPartyMembers;                                   // 0x0060(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FollowStringKey;                                   // 0x0068(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaderMatchmakingStateKey;                         // 0x0078(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IWOnlineServicesSettings">();
	}
	static class UIWOnlineServicesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIWOnlineServicesSettings>();
	}
};
static_assert(alignof(UIWOnlineServicesSettings) == 0x000008, "Wrong alignment on UIWOnlineServicesSettings");
static_assert(sizeof(UIWOnlineServicesSettings) == 0x000088, "Wrong size on UIWOnlineServicesSettings");
static_assert(offsetof(UIWOnlineServicesSettings, ServerMatchmakingQueue) == 0x000028, "Member 'UIWOnlineServicesSettings::ServerMatchmakingQueue' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesSettings, FallbackUserAvatar) == 0x000038, "Member 'UIWOnlineServicesSettings::FallbackUserAvatar' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesSettings, MaxPartyMembers) == 0x000060, "Member 'UIWOnlineServicesSettings::MaxPartyMembers' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesSettings, FollowStringKey) == 0x000068, "Member 'UIWOnlineServicesSettings::FollowStringKey' has a wrong offset!");
static_assert(offsetof(UIWOnlineServicesSettings, LeaderMatchmakingStateKey) == 0x000078, "Member 'UIWOnlineServicesSettings::LeaderMatchmakingStateKey' has a wrong offset!");

// Class IWOnlineServices.MatchmakingSession
// 0x0188 (0x01B0 - 0x0028)
class UMatchmakingSession final : public UObject
{
public:
	uint8                                         Pad_28[0x160];                                     // 0x0028(0x0160)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineServicesErrorSubsystem*          ErrorSubsystem;                                    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_190[0x20];                                     // 0x0190(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchmakingSession">();
	}
	static class UMatchmakingSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingSession>();
	}
};
static_assert(alignof(UMatchmakingSession) == 0x000008, "Wrong alignment on UMatchmakingSession");
static_assert(sizeof(UMatchmakingSession) == 0x0001B0, "Wrong size on UMatchmakingSession");
static_assert(offsetof(UMatchmakingSession, ErrorSubsystem) == 0x000188, "Member 'UMatchmakingSession::ErrorSubsystem' has a wrong offset!");

// Class IWOnlineServices.OnlineServicesErrorSubsystem
// 0x0008 (0x0038 - 0x0030)
class UOnlineServicesErrorSubsystem final : public UGameInstanceSubsystem
{
public:
	class USentrySubsystem*                       SentrySubsystem;                                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineServicesErrorSubsystem">();
	}
	static class UOnlineServicesErrorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineServicesErrorSubsystem>();
	}
};
static_assert(alignof(UOnlineServicesErrorSubsystem) == 0x000008, "Wrong alignment on UOnlineServicesErrorSubsystem");
static_assert(sizeof(UOnlineServicesErrorSubsystem) == 0x000038, "Wrong size on UOnlineServicesErrorSubsystem");
static_assert(offsetof(UOnlineServicesErrorSubsystem, SentrySubsystem) == 0x000030, "Member 'UOnlineServicesErrorSubsystem::SentrySubsystem' has a wrong offset!");

// Class IWOnlineServices.OnlineServicesUtility
// 0x0000 (0x0028 - 0x0028)
class UOnlineServicesUtility final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineServicesUtility">();
	}
	static class UOnlineServicesUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineServicesUtility>();
	}
};
static_assert(alignof(UOnlineServicesUtility) == 0x000008, "Wrong alignment on UOnlineServicesUtility");
static_assert(sizeof(UOnlineServicesUtility) == 0x000028, "Wrong size on UOnlineServicesUtility");

// Class IWOnlineServices.PartyOnlineServiceHandler
// 0x0220 (0x0250 - 0x0030)
class UPartyOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x220];                                     // 0x0030(0x0220)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartyOnlineServiceHandler">();
	}
	static class UPartyOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyOnlineServiceHandler>();
	}
};
static_assert(alignof(UPartyOnlineServiceHandler) == 0x000008, "Wrong alignment on UPartyOnlineServiceHandler");
static_assert(sizeof(UPartyOnlineServiceHandler) == 0x000250, "Wrong size on UPartyOnlineServiceHandler");

// Class IWOnlineServices.PlayFabTitlePlayerAccountIdGetter
// 0x0000 (0x0028 - 0x0028)
class IPlayFabTitlePlayerAccountIdGetter final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayFabTitlePlayerAccountIdGetter">();
	}
	static class IPlayFabTitlePlayerAccountIdGetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPlayFabTitlePlayerAccountIdGetter>();
	}
};
static_assert(alignof(IPlayFabTitlePlayerAccountIdGetter) == 0x000008, "Wrong alignment on IPlayFabTitlePlayerAccountIdGetter");
static_assert(sizeof(IPlayFabTitlePlayerAccountIdGetter) == 0x000028, "Wrong size on IPlayFabTitlePlayerAccountIdGetter");

// Class IWOnlineServices.PlayFabTitlePlayerAccountIdSetter
// 0x0000 (0x0028 - 0x0028)
class IPlayFabTitlePlayerAccountIdSetter final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayFabTitlePlayerAccountIdSetter">();
	}
	static class IPlayFabTitlePlayerAccountIdSetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPlayFabTitlePlayerAccountIdSetter>();
	}
};
static_assert(alignof(IPlayFabTitlePlayerAccountIdSetter) == 0x000008, "Wrong alignment on IPlayFabTitlePlayerAccountIdSetter");
static_assert(sizeof(IPlayFabTitlePlayerAccountIdSetter) == 0x000028, "Wrong size on IPlayFabTitlePlayerAccountIdSetter");

// Class IWOnlineServices.QualityOfServiceOnlineServiceHandler
// 0x00D0 (0x0100 - 0x0030)
class UQualityOfServiceOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xD0];                                      // 0x0030(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class FString GetRegionName(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QualityOfServiceOnlineServiceHandler">();
	}
	static class UQualityOfServiceOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityOfServiceOnlineServiceHandler>();
	}
};
static_assert(alignof(UQualityOfServiceOnlineServiceHandler) == 0x000008, "Wrong alignment on UQualityOfServiceOnlineServiceHandler");
static_assert(sizeof(UQualityOfServiceOnlineServiceHandler) == 0x000100, "Wrong size on UQualityOfServiceOnlineServiceHandler");

// Class IWOnlineServices.RecentPlayersOnlineServiceHandler
// 0x0040 (0x0070 - 0x0030)
class URecentPlayersOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RecentPlayersOnlineServiceHandler">();
	}
	static class URecentPlayersOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecentPlayersOnlineServiceHandler>();
	}
};
static_assert(alignof(URecentPlayersOnlineServiceHandler) == 0x000008, "Wrong alignment on URecentPlayersOnlineServiceHandler");
static_assert(sizeof(URecentPlayersOnlineServiceHandler) == 0x000070, "Wrong size on URecentPlayersOnlineServiceHandler");

// Class IWOnlineServices.SaveGameEULA
// 0x0010 (0x0038 - 0x0028)
class USaveGameEULA final : public USaveGame
{
public:
	TArray<struct FAgreedUserAgreement>           AgreedUserAgreements;                              // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SaveGameEULA">();
	}
	static class USaveGameEULA* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveGameEULA>();
	}
};
static_assert(alignof(USaveGameEULA) == 0x000008, "Wrong alignment on USaveGameEULA");
static_assert(sizeof(USaveGameEULA) == 0x000038, "Wrong size on USaveGameEULA");
static_assert(offsetof(USaveGameEULA, AgreedUserAgreements) == 0x000028, "Member 'USaveGameEULA::AgreedUserAgreements' has a wrong offset!");

// Class IWOnlineServices.ServerAuthOnlineServiceHandler
// 0x0060 (0x0090 - 0x0030)
class UServerAuthOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static EServerAuthLoginState GetServerLoginState(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerAuthOnlineServiceHandler">();
	}
	static class UServerAuthOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerAuthOnlineServiceHandler>();
	}
};
static_assert(alignof(UServerAuthOnlineServiceHandler) == 0x000008, "Wrong alignment on UServerAuthOnlineServiceHandler");
static_assert(sizeof(UServerAuthOnlineServiceHandler) == 0x000090, "Wrong size on UServerAuthOnlineServiceHandler");

// Class IWOnlineServices.ServerCloudSaveOnlineServiceHandler
// 0x0000 (0x0030 - 0x0030)
class UServerCloudSaveOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerCloudSaveOnlineServiceHandler">();
	}
	static class UServerCloudSaveOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerCloudSaveOnlineServiceHandler>();
	}
};
static_assert(alignof(UServerCloudSaveOnlineServiceHandler) == 0x000008, "Wrong alignment on UServerCloudSaveOnlineServiceHandler");
static_assert(sizeof(UServerCloudSaveOnlineServiceHandler) == 0x000030, "Wrong size on UServerCloudSaveOnlineServiceHandler");

// Class IWOnlineServices.ServerEconomyOnlineServiceHandler
// 0x0010 (0x0040 - 0x0030)
class UServerEconomyOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerEconomyOnlineServiceHandler">();
	}
	static class UServerEconomyOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerEconomyOnlineServiceHandler>();
	}
};
static_assert(alignof(UServerEconomyOnlineServiceHandler) == 0x000008, "Wrong alignment on UServerEconomyOnlineServiceHandler");
static_assert(sizeof(UServerEconomyOnlineServiceHandler) == 0x000040, "Wrong size on UServerEconomyOnlineServiceHandler");

// Class IWOnlineServices.SessionOnlineServiceHandler
// 0x01C0 (0x01F0 - 0x0030)
class USessionOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xC0];                                      // 0x0030(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineServicesErrorSubsystem*          ErrorSubsystem;                                    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPartyOnlineServiceHandler*             Party;                                             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x28];                                     // 0x0100(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UIdentityOnlineServiceHandler*          IdentityHandler;                                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMatchmakingSession*                    MatchmakingSession;                                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0xB8];                                     // 0x0138(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static EMatchmakingState K2_GetMatchmakingState(class UObject* WorldContextObject);
	static bool K2_IsMatchmaking(class UObject* WorldContextObject);
	static void K2_StartMatchmaking(const struct FMatchmakingSettings& InSettings, class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SessionOnlineServiceHandler">();
	}
	static class USessionOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USessionOnlineServiceHandler>();
	}
};
static_assert(alignof(USessionOnlineServiceHandler) == 0x000008, "Wrong alignment on USessionOnlineServiceHandler");
static_assert(sizeof(USessionOnlineServiceHandler) == 0x0001F0, "Wrong size on USessionOnlineServiceHandler");
static_assert(offsetof(USessionOnlineServiceHandler, ErrorSubsystem) == 0x0000F0, "Member 'USessionOnlineServiceHandler::ErrorSubsystem' has a wrong offset!");
static_assert(offsetof(USessionOnlineServiceHandler, Party) == 0x0000F8, "Member 'USessionOnlineServiceHandler::Party' has a wrong offset!");
static_assert(offsetof(USessionOnlineServiceHandler, IdentityHandler) == 0x000128, "Member 'USessionOnlineServiceHandler::IdentityHandler' has a wrong offset!");
static_assert(offsetof(USessionOnlineServiceHandler, MatchmakingSession) == 0x000130, "Member 'USessionOnlineServiceHandler::MatchmakingSession' has a wrong offset!");

// Class IWOnlineServices.SharedEconomyOnlineServiceHandler
// 0x0010 (0x0040 - 0x0030)
class USharedEconomyOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SharedEconomyOnlineServiceHandler">();
	}
	static class USharedEconomyOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharedEconomyOnlineServiceHandler>();
	}
};
static_assert(alignof(USharedEconomyOnlineServiceHandler) == 0x000008, "Wrong alignment on USharedEconomyOnlineServiceHandler");
static_assert(sizeof(USharedEconomyOnlineServiceHandler) == 0x000040, "Wrong size on USharedEconomyOnlineServiceHandler");

// Class IWOnlineServices.SteamAuthenticationAction
// 0x0028 (0x0120 - 0x00F8)
class USteamAuthenticationAction final : public UAuthenticationActionBase
{
public:
	class USanctionsSubsystem*                    SanctionSubsystem;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamAuthenticationAction">();
	}
	static class USteamAuthenticationAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamAuthenticationAction>();
	}
};
static_assert(alignof(USteamAuthenticationAction) == 0x000008, "Wrong alignment on USteamAuthenticationAction");
static_assert(sizeof(USteamAuthenticationAction) == 0x000120, "Wrong size on USteamAuthenticationAction");
static_assert(offsetof(USteamAuthenticationAction, SanctionSubsystem) == 0x0000F8, "Member 'USteamAuthenticationAction::SanctionSubsystem' has a wrong offset!");

// Class IWOnlineServices.SteamPlatformStore
// 0x0078 (0x0130 - 0x00B8)
class USteamPlatformStore final : public UPlatformStoreBase
{
public:
	uint8                                         Pad_B8[0x78];                                      // 0x00B8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamPlatformStore">();
	}
	static class USteamPlatformStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamPlatformStore>();
	}
};
static_assert(alignof(USteamPlatformStore) == 0x000008, "Wrong alignment on USteamPlatformStore");
static_assert(sizeof(USteamPlatformStore) == 0x000130, "Wrong size on USteamPlatformStore");

// Class IWOnlineServices.StorePurchaseOnlineServiceHandler
// 0x00A8 (0x00D8 - 0x0030)
class UStorePurchaseOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformStoreBase*                     PlatformStore;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StorePurchaseOnlineServiceHandler">();
	}
	static class UStorePurchaseOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStorePurchaseOnlineServiceHandler>();
	}
};
static_assert(alignof(UStorePurchaseOnlineServiceHandler) == 0x000008, "Wrong alignment on UStorePurchaseOnlineServiceHandler");
static_assert(sizeof(UStorePurchaseOnlineServiceHandler) == 0x0000D8, "Wrong size on UStorePurchaseOnlineServiceHandler");
static_assert(offsetof(UStorePurchaseOnlineServiceHandler, PlatformStore) == 0x0000D0, "Member 'UStorePurchaseOnlineServiceHandler::PlatformStore' has a wrong offset!");

// Class IWOnlineServices.UserAgreementOnlineServiceHandler
// 0x0150 (0x0180 - 0x0030)
class UUserAgreementOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0xC8];                                      // 0x0030(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserAgreementTextRequest*              UserAgreementConfigRequest;                        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UUserAgreementTextRequest*>      UserAgreementTextRequests;                         // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x70];                                     // 0x0110(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserAgreementOnlineServiceHandler">();
	}
	static class UUserAgreementOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserAgreementOnlineServiceHandler>();
	}
};
static_assert(alignof(UUserAgreementOnlineServiceHandler) == 0x000008, "Wrong alignment on UUserAgreementOnlineServiceHandler");
static_assert(sizeof(UUserAgreementOnlineServiceHandler) == 0x000180, "Wrong size on UUserAgreementOnlineServiceHandler");
static_assert(offsetof(UUserAgreementOnlineServiceHandler, UserAgreementConfigRequest) == 0x0000F8, "Member 'UUserAgreementOnlineServiceHandler::UserAgreementConfigRequest' has a wrong offset!");
static_assert(offsetof(UUserAgreementOnlineServiceHandler, UserAgreementTextRequests) == 0x000100, "Member 'UUserAgreementOnlineServiceHandler::UserAgreementTextRequests' has a wrong offset!");

// Class IWOnlineServices.UserAgreementTextRequest
// 0x0110 (0x0138 - 0x0028)
class UUserAgreementTextRequest final : public UObject
{
public:
	uint8                                         Pad_28[0x110];                                     // 0x0028(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserAgreementTextRequest">();
	}
	static class UUserAgreementTextRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserAgreementTextRequest>();
	}
};
static_assert(alignof(UUserAgreementTextRequest) == 0x000008, "Wrong alignment on UUserAgreementTextRequest");
static_assert(sizeof(UUserAgreementTextRequest) == 0x000138, "Wrong size on UUserAgreementTextRequest");

// Class IWOnlineServices.UserOnlineServiceHandler
// 0x0028 (0x0058 - 0x0030)
class UUserOnlineServiceHandler final : public UOnlineServiceHandler
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserOnlineServiceHandler">();
	}
	static class UUserOnlineServiceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserOnlineServiceHandler>();
	}
};
static_assert(alignof(UUserOnlineServiceHandler) == 0x000008, "Wrong alignment on UUserOnlineServiceHandler");
static_assert(sizeof(UUserOnlineServiceHandler) == 0x000058, "Wrong size on UUserOnlineServiceHandler");

}

