#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JP

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "IWCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GASIW_structs.hpp"

#undef ERROR

namespace SDK
{

// Enum JP.ECharacterRole
// NumValues: 0x0007
enum class ECharacterRole : uint8
{
	None                                     = 0,
	Gardener                                 = 1,
	Cook                                     = 2,
	Carpenter                                = 3,
	Mechanic                                 = 4,
	Maid                                     = 5,
	ECharacterRole_MAX                       = 6,
};

// Enum JP.ECharacterName
// NumValues: 0x000C
enum class ECharacterName : uint8
{
	None                                     = 0,
	Chad                                     = 1,
	Gramps                                   = 2,
	Doreen                                   = 3,
	Kim                                      = 4,
	Louie                                    = 5,
	Kevin                                    = 6,
	Mary                                     = 7,
	PerArne                                  = 8,
	Stacy                                    = 9,
	Cookie                                   = 10,
	ECharacterName_MAX                       = 11,
};

// Enum JP.EJPOnJoinSessionCompleteResult
// NumValues: 0x0007
enum class EJPOnJoinSessionCompleteResult : uint8
{
	Success                                  = 0,
	SessionIsFull                            = 1,
	SessionDoesNotExist                      = 2,
	CouldNotRetrieveAddress                  = 3,
	AlreadyInSession                         = 4,
	UnknownError                             = 5,
	EJPOnJoinSessionCompleteResult_MAX       = 6,
};

// Enum JP.EOnlineItemUnlockRequirement
// NumValues: 0x0004
enum class EOnlineItemUnlockRequirement : uint8
{
	None                                     = 0,
	VirtualCurrency                          = 1,
	BattlePass                               = 2,
	EOnlineItemUnlockRequirement_MAX         = 3,
};

// Enum JP.EShopItemCategory
// NumValues: 0x0005
enum class EShopItemCategory : uint8
{
	Offense                                  = 0,
	Defense                                  = 1,
	Support                                  = 2,
	Delivery                                 = 3,
	EShopItemCategory_MAX                    = 4,
};

// Enum JP.ERegionOverride
// NumValues: 0x0009
enum class ERegionOverride : uint32
{
	Auto                                     = 0,
	WestEurope                               = 1,
	NorthEurope                              = 2,
	EastUs                                   = 3,
	WestUs                                   = 4,
	EastAsia                                 = 5,
	BrazilSouth                              = 6,
	AustraliaEast                            = 7,
	ERegionOverride_MAX                      = 8,
};

// Enum JP.ELyraDisplayablePerformanceStat
// NumValues: 0x0011
enum class ELyraDisplayablePerformanceStat : uint8
{
	ClientFPS                                = 0,
	ServerFPS                                = 1,
	IdleTime                                 = 2,
	FrameTime                                = 3,
	FrameTime_GameThread                     = 4,
	FrameTime_RenderThread                   = 5,
	FrameTime_RHIThread                      = 6,
	FrameTime_GPU                            = 7,
	Ping                                     = 8,
	PacketLoss_Incoming                      = 9,
	PacketLoss_Outgoing                      = 10,
	PacketRate_Incoming                      = 11,
	PacketRate_Outgoing                      = 12,
	PacketSize_Incoming                      = 13,
	PacketSize_Outgoing                      = 14,
	Count                                    = 15,
	ELyraDisplayablePerformanceStat_MAX      = 16,
};

// Enum JP.ELyraStatDisplayMode
// NumValues: 0x0005
enum class ELyraStatDisplayMode : uint8
{
	Hidden                                   = 0,
	TextOnly                                 = 1,
	GraphOnly                                = 2,
	TextAndGraph                             = 3,
	ELyraStatDisplayMode_MAX                 = 4,
};

// Enum JP.EAchievementStatUpdateMethod
// NumValues: 0x0003
enum class EAchievementStatUpdateMethod : uint8
{
	Sum                                      = 0,
	Highest                                  = 1,
	EAchievementStatUpdateMethod_MAX         = 2,
};

// Enum JP.EArithmeticOperators
// NumValues: 0x0005
enum class EArithmeticOperators : uint8
{
	Add                                      = 0,
	Subtract                                 = 1,
	Multiply                                 = 2,
	Divide                                   = 3,
	EArithmeticOperators_MAX                 = 4,
};

// Enum JP.ECharacterInput
// NumValues: 0x0005
enum class ECharacterInput : uint8
{
	None                                     = 0,
	PrimaryAction                            = 1,
	SecondaryAction                          = 2,
	Sprint                                   = 3,
	ECharacterInput_MAX                      = 4,
};

// Enum JP.ECharacterSize
// NumValues: 0x0006
enum class ECharacterSize : uint8
{
	None                                     = 0,
	Small                                    = 1,
	Medium                                   = 2,
	MediumLarge                              = 3,
	Large                                    = 4,
	ECharacterSize_MAX                       = 5,
};

// Enum JP.ECurrencies
// NumValues: 0x0003
enum class ECurrencies : uint8
{
	Money                                    = 0,
	Resources                                = 1,
	ECurrencies_MAX                          = 2,
};

// Enum JP.EDirectionAxis
// NumValues: 0x0005
enum class EDirectionAxis : uint8
{
	Up                                       = 0,
	Horizontal                               = 1,
	Down                                     = 2,
	Count                                    = 3,
	EDirectionAxis_MAX                       = 4,
};

// Enum JP.EDeathType
// NumValues: 0x0005
enum class EDeathType : uint8
{
	PlayerKnockedOutPlayer                   = 0,
	NonPlayerKnockedOutPlayer                = 1,
	PlayerDestroyedHouseEssential            = 2,
	None                                     = 3,
	EDeathType_MAX                           = 4,
};

// Enum JP.EGaitJP
// NumValues: 0x0007
enum class EGaitJP : uint8
{
	Walk                                     = 0,
	Run                                      = 1,
	Sprint                                   = 2,
	Crouch                                   = 3,
	Trapped                                  = 4,
	Count                                    = 5,
	EGaitJP_MAX                              = 6,
};

// Enum JP.EItemsJP
// NumValues: 0x0045
enum class EItemsJP : uint8
{
	Empty                                    = 0,
	Mop                                      = 1,
	FryingPan                                = 2,
	GolfClub                                 = 3,
	BaseballBat                              = 4,
	Egg                                      = 5,
	Tincan                                   = 6,
	Twohand                                  = 7,
	Singlehand                               = 8,
	Stick                                    = 9,
	Beartrap                                 = 10,
	OrangeCanon                              = 11,
	Lockpick                                 = 12,
	Mud                                      = 13,
	MasterVibrator                           = 14,
	HedgeTrimmer                             = 15,
	SabotageTool                             = 16,
	Wrench                                   = 17,
	WaterBucket                              = 18,
	RepairKit                                = 19,
	Pie                                      = 20,
	Shield                                   = 21,
	Slingshot                                = 22,
	BoxingGloves                             = 23,
	Medkit                                   = 24,
	PopGun                                   = 25,
	VacuumCleaner                            = 26,
	LeafBlower                               = 27,
	ChainHedgeTrimmer                        = 28,
	WaterPistol                              = 29,
	Binoculars                               = 30,
	WateringCan                              = 31,
	SpringTrap                               = 32,
	TrashBag                                 = 33,
	Barricade                                = 34,
	AlarmClock                               = 35,
	Branch                                   = 36,
	Apple                                    = 37,
	Tomato                                   = 38,
	Saw                                      = 39,
	Ladder                                   = 40,
	FireworkBox                              = 41,
	GrappleHook                              = 42,
	Hammer                                   = 43,
	BarbedWire                               = 44,
	Seagull130                               = 45,
	SeedPack                                 = 46,
	HouseAdditionDeployable                  = 47,
	ThrowableHands                           = 48,
	Umbrella                                 = 49,
	Rake                                     = 50,
	Banana                                   = 51,
	Carrot                                   = 52,
	Sledgehammer                             = 53,
	Knittingneedles                          = 54,
	Steak                                    = 55,
	Potato                                   = 56,
	PlungerGun                               = 57,
	ResourceCrate                            = 58,
	Firewood                                 = 59,
	Jetpack                                  = 60,
	Crowbar                                  = 61,
	Jackhammer                               = 62,
	Cane                                     = 63,
	RollingPin                               = 64,
	Iron                                     = 65,
	PAHelmet                                 = 66,
	Count                                    = 67,
	EItemsJP_MAX                             = 68,
};

// Enum JP.EStanceJP
// NumValues: 0x0004
enum class EStanceJP : uint8
{
	Standing                                 = 0,
	Crouching                                = 1,
	Count                                    = 2,
	EStanceJP_MAX                            = 3,
};

// Enum JP.EFacialStatesJP
// NumValues: 0x0009
enum class EFacialStatesJP : uint8
{
	Angry                                    = 0,
	Dead                                     = 1,
	Happy                                    = 2,
	Neutral                                  = 3,
	Pain                                     = 4,
	Sad                                      = 5,
	Surprise                                 = 6,
	Count                                    = 7,
	EFacialStatesJP_MAX                      = 8,
};

// Enum JP.EVoteState
// NumValues: 0x0004
enum class EVoteState : uint8
{
	NotStarted                               = 0,
	InProgress                               = 1,
	Finished                                 = 2,
	EVoteState_MAX                           = 3,
};

// Enum JP.EListenServerBackfillingState
// NumValues: 0x0007
enum class EListenServerBackfillingState : uint8
{
	None                                     = 0,
	StartingSearch                           = 1,
	Searching                                = 2,
	GettingMatch                             = 3,
	WaitingForPlayers                        = 4,
	MatchFull                                = 5,
	EListenServerBackfillingState_MAX        = 6,
};

// Enum JP.EDeadzoneStick
// NumValues: 0x0003
enum class EDeadzoneStick : uint8
{
	MoveStick                                = 0,
	LookStick                                = 1,
	EDeadzoneStick_MAX                       = 2,
};

// Enum JP.ELyraTargetingType
// NumValues: 0x0003
enum class ELyraTargetingType : uint8
{
	Normal                                   = 0,
	ADS                                      = 1,
	ELyraTargetingType_MAX                   = 2,
};

// Enum JP.ELyraPlaystationDPadButton
// NumValues: 0x0005
enum class ELyraPlaystationDPadButton : uint8
{
	Up                                       = 0,
	Down                                     = 1,
	Left                                     = 2,
	Right                                    = 3,
	ELyraPlaystationDPadButton_MAX           = 4,
};

// Enum JP.EColorBlindMode
// NumValues: 0x0005
enum class EColorBlindMode : uint8
{
	Off                                      = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
	EColorBlindMode_MAX                      = 4,
};

// Enum JP.ELyraAllowBackgroundAudioSetting
// NumValues: 0x0004
enum class ELyraAllowBackgroundAudioSetting : uint8
{
	Off                                      = 0,
	AllSounds                                = 1,
	Num                                      = 2,
	ELyraAllowBackgroundAudioSetting_MAX     = 3,
};

// Enum JP.ELyraGamepadSensitivity
// NumValues: 0x000C
enum class ELyraGamepadSensitivity : uint8
{
	Invalid                                  = 0,
	Slow                                     = 1,
	SlowPlus                                 = 2,
	SlowPlusPlus                             = 3,
	Normal                                   = 4,
	NormalPlus                               = 5,
	NormalPlusPlus                           = 6,
	Fast                                     = 7,
	FastPlus                                 = 8,
	FastPlusPlus                             = 9,
	Insane                                   = 10,
	MAX                                      = 11,
};

// Enum JP.EMessageType
// NumValues: 0x0002
enum class EMessageType : uint8
{
	All                                      = 0,
	EMessageType_MAX                         = 1,
};

// Enum JP.EMusicStates
// NumValues: 0x0006
enum class EMusicStates : uint8
{
	NoMusic                                  = 0,
	Day                                      = 1,
	Night                                    = 2,
	SuddenDeath                              = 3,
	Combat                                   = 4,
	EMusicStates_MAX                         = 5,
};

// Enum JP.EObjectiveState
// NumValues: 0x0004
enum class EObjectiveState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Finished                                 = 2,
	EObjectiveState_MAX                      = 3,
};

// Enum JP.EOnlineServicesBooleanQuerySetting
// NumValues: 0x0004
enum class EOnlineServicesBooleanQuerySetting : uint8
{
	Disabled                                 = 0,
	EqualsTrue                               = 1,
	EqualsFalse                              = 2,
	EOnlineServicesBooleanQuerySetting_MAX   = 3,
};

// Enum JP.EOnlineServicesFriendStatus
// NumValues: 0x0006
enum class EOnlineServicesFriendStatus : uint8
{
	None                                     = 0,
	Offline                                  = 1,
	Online                                   = 2,
	PlayingOtherGame                         = 3,
	PlayingJP                                = 4,
	EOnlineServicesFriendStatus_MAX          = 5,
};

// Enum JP.EOnlineServicesInviteStatus
// NumValues: 0x0007
enum class EOnlineServicesInviteStatus : uint8
{
	Unknown                                  = 0,
	Accepted                                 = 1,
	PendingInbound                           = 2,
	PendingOutbound                          = 3,
	Blocked                                  = 4,
	Suggested                                = 5,
	EOnlineServicesInviteStatus_MAX          = 6,
};

// Enum JP.EPartyMatchState
// NumValues: 0x0007
enum class EPartyMatchState : uint8
{
	None                                     = 0,
	InLobby                                  = 1,
	LeavingLobby                             = 2,
	InMatch                                  = 3,
	LeavingMatch                             = 4,
	PostMatch                                = 5,
	EPartyMatchState_MAX                     = 6,
};

// Enum JP.EPerkCategories
// NumValues: 0x0005
enum class EPerkCategories : uint8
{
	None                                     = 0,
	Offense                                  = 1,
	Defense                                  = 2,
	Maintenance                              = 3,
	EPerkCategories_MAX                      = 4,
};

// Enum JP.MessageCategory
// NumValues: 0x0007
enum class EMessageCategory : uint8
{
	General                                  = 0,
	Item                                     = 1,
	Warning                                  = 2,
	Event                                    = 3,
	Trap                                     = 4,
	DeleteInAllCategories                    = 5,
	MessageCategory_MAX                      = 6,
};

// Enum JP.MessageRecipient
// NumValues: 0x0005
enum class EMessageRecipient : uint8
{
	PlayerOnly                               = 0,
	PlayersTeam                              = 1,
	EnemyTeam                                = 2,
	EveryPlayer                              = 3,
	MessageRecipient_MAX                     = 4,
};

// Enum JP.ERequestedSpawnType
// NumValues: 0x0005
enum class ERequestedSpawnType : uint8
{
	None                                     = 0,
	Home                                     = 1,
	BusStop                                  = 2,
	FrontYard                                = 3,
	ERequestedSpawnType_MAX                  = 4,
};

// Enum JP.EPlayerStateJoinStatus
// NumValues: 0x0004
enum class EPlayerStateJoinStatus : uint8
{
	NotJoined                                = 0,
	PendingConfirm                           = 1,
	ClearedToJoin                            = 2,
	EPlayerStateJoinStatus_MAX               = 3,
};

// Enum JP.EPreLobbyServerBrowserListSortMode
// NumValues: 0x0007
enum class EPreLobbyServerBrowserListSortMode : uint8
{
	NAME                                     = 0,
	NUM_PLAYERS_ASC                          = 1,
	NUM_PLAYERS_DESC                         = 2,
	GAMEMODE                                 = 3,
	COUNT                                    = 4,
	PASSWORD                                 = 5,
	EPreLobbyServerBrowserListSortMode_MAX   = 6,
};

// Enum JP.EPreLobbyServerBrowserState
// NumValues: 0x0005
enum class EPreLobbyServerBrowserState : uint8
{
	LOADING                                  = 0,
	LIST                                     = 1,
	ERROR                                    = 2,
	EMPTY                                    = 3,
	EPreLobbyServerBrowserState_MAX          = 4,
};

// Enum JP.EReceptacleType
// NumValues: 0x0016
enum class EReceptacleType : uint8
{
	None                                     = 0,
	Sofa                                     = 1,
	Bookshelf                                = 2,
	BedsideTable                             = 3,
	TelevisionTable                          = 4,
	DiningTable                              = 5,
	Drawer                                   = 6,
	ArmChair                                 = 7,
	Bed                                      = 8,
	Desk                                     = 9,
	ShelfHouse                               = 10,
	ShelfShed                                = 11,
	Fireplace                                = 12,
	Table                                    = 13,
	Terrace                                  = 14,
	Counterspace                             = 15,
	ChristmasTree                            = 16,
	Snowperson                               = 17,
	ResourceHolder                           = 18,
	Valuable                                 = 19,
	Count                                    = 20,
	EReceptacleType_MAX                      = 21,
};

// Enum JP.EResourceType
// NumValues: 0x0007
enum class EResourceType : uint8
{
	Money                                    = 0,
	Wood                                     = 1,
	Metal                                    = 2,
	Perfectness                              = 3,
	PassiveIncome                            = 4,
	None                                     = 5,
	EResourceType_MAX                        = 6,
};

// Enum JP.EResourceValueChange
// NumValues: 0x0008
enum class EResourceValueChange : uint8
{
	None                                     = 0,
	HighIncrease                             = 1,
	MediumIncrease                           = 2,
	LowIncrease                              = 3,
	LowDecrease                              = 4,
	MediumDecrease                           = 5,
	HighDecrease                             = 6,
	EResourceValueChange_MAX                 = 7,
};

// Enum JP.EResourceReceiver
// NumValues: 0x0004
enum class EResourceReceiver : uint8
{
	None                                     = 0,
	Personal                                 = 1,
	TeamBased                                = 2,
	EResourceReceiver_MAX                    = 3,
};

// Enum JP.ERooms
// NumValues: 0x000C
enum class ERooms : uint8
{
	None                                     = 0,
	Garage                                   = 1,
	ToolShed                                 = 2,
	Kitchen                                  = 3,
	Toilet                                   = 4,
	LivingRoom                               = 5,
	Bedroom                                  = 6,
	WashingRoom                              = 7,
	RoomCount                                = 8,
	Utility                                  = 9,
	Telephone                                = 10,
	ERooms_MAX                               = 11,
};

// Enum JP.ESeasonPassRewardType
// NumValues: 0x0004
enum class ESeasonPassRewardType : uint8
{
	None                                     = 0,
	CatalogItem                              = 1,
	Perk                                     = 2,
	ESeasonPassRewardType_MAX                = 3,
};

// Enum JP.ESocialListState
// NumValues: 0x0005
enum class ESocialListState : uint8
{
	Collapsed                                = 0,
	Party                                    = 1,
	Fill                                     = 2,
	Full                                     = 4,
	ESocialListState_MAX                     = 5,
};

// Enum JP.ETag
// NumValues: 0x0005
enum class ETag : uint8
{
	None                                     = 0,
	Effect_SetByCaller_StaminaDepletion      = 1,
	Effect_SetByCaller_StaminaRegeneration   = 2,
	Character_Location_AtHome                = 3,
	ETag_MAX                                 = 4,
};

// Enum JP.ETeamType
// NumValues: 0x0005
enum class ETeamType : uint8
{
	None                                     = 0,
	BlueTeam                                 = 1,
	RedTeam                                  = 2,
	YellowTeam                               = 3,
	ETeamType_MAX                            = 4,
};

// Enum JP.EVerbosity
// NumValues: 0x0006
enum class EVerbosity : uint8
{
	Error                                    = 5,
	Warning                                  = 4,
	Log                                      = 3,
	Verbose                                  = 2,
	VeryVerbose                              = 1,
	EVerbosity_MAX                           = 6,
};

// Enum JP.ELyraFramePacingMode
// NumValues: 0x0004
enum class ELyraFramePacingMode : uint8
{
	DesktopStyle                             = 0,
	ConsoleStyle                             = 1,
	MobileStyle                              = 2,
	ELyraFramePacingMode_MAX                 = 3,
};

// Enum JP.EActorCanvasProjectionMode
// NumValues: 0x0006
enum class EActorCanvasProjectionMode : uint8
{
	ComponentPoint                           = 0,
	ComponentBoundingBox                     = 1,
	ComponentScreenBoundingBox               = 2,
	ActorBoundingBox                         = 3,
	ActorScreenBoundingBox                   = 4,
	EActorCanvasProjectionMode_MAX           = 5,
};

// Enum JP.ELyraWidgetInputMode
// NumValues: 0x0005
enum class ELyraWidgetInputMode : uint8
{
	Default                                  = 0,
	GameAndMenu                              = 1,
	Game                                     = 2,
	Menu                                     = 3,
	ELyraWidgetInputMode_MAX                 = 4,
};

// ScriptStruct JP.LobbyLevelVoteSelectedLevelViewModel
// 0x0038 (0x0038 - 0x0000)
struct FLobbyLevelVoteSelectedLevelViewModel final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLobbyLevelVoteSelectedLevelViewModel) == 0x000008, "Wrong alignment on FLobbyLevelVoteSelectedLevelViewModel");
static_assert(sizeof(FLobbyLevelVoteSelectedLevelViewModel) == 0x000038, "Wrong size on FLobbyLevelVoteSelectedLevelViewModel");
static_assert(offsetof(FLobbyLevelVoteSelectedLevelViewModel, DisplayName) == 0x000000, "Member 'FLobbyLevelVoteSelectedLevelViewModel::DisplayName' has a wrong offset!");
static_assert(offsetof(FLobbyLevelVoteSelectedLevelViewModel, Image) == 0x000010, "Member 'FLobbyLevelVoteSelectedLevelViewModel::Image' has a wrong offset!");

// ScriptStruct JP.CharacterRoleData
// 0x0058 (0x0060 - 0x0008)
struct FCharacterRoleData final : public FTableRowBase
{
public:
	ECharacterName                                ClassDisplayName;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterRole                                CharacterRole;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemDefinition>            StartItemActor;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   StartItemDisplayName;                              // 0x0040(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         StaminaRegenerationPerSecondMultiplier;            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TEMP_NeighborIdentifier;                           // 0x0054(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterRoleData) == 0x000008, "Wrong alignment on FCharacterRoleData");
static_assert(sizeof(FCharacterRoleData) == 0x000060, "Wrong size on FCharacterRoleData");
static_assert(offsetof(FCharacterRoleData, ClassDisplayName) == 0x000008, "Member 'FCharacterRoleData::ClassDisplayName' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, CharacterRole) == 0x000009, "Member 'FCharacterRoleData::CharacterRole' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, Icon) == 0x000010, "Member 'FCharacterRoleData::Icon' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, StartItemActor) == 0x000038, "Member 'FCharacterRoleData::StartItemActor' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, StartItemDisplayName) == 0x000040, "Member 'FCharacterRoleData::StartItemDisplayName' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, StaminaRegenerationPerSecondMultiplier) == 0x000050, "Member 'FCharacterRoleData::StaminaRegenerationPerSecondMultiplier' has a wrong offset!");
static_assert(offsetof(FCharacterRoleData, TEMP_NeighborIdentifier) == 0x000054, "Member 'FCharacterRoleData::TEMP_NeighborIdentifier' has a wrong offset!");

// ScriptStruct JP.TicketMemberAttributesDataObject
// 0x0018 (0x0018 - 0x0000)
struct FTicketMemberAttributesDataObject final
{
public:
	class FString                                 Region;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IsServer;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTicketMemberAttributesDataObject) == 0x000008, "Wrong alignment on FTicketMemberAttributesDataObject");
static_assert(sizeof(FTicketMemberAttributesDataObject) == 0x000018, "Wrong size on FTicketMemberAttributesDataObject");
static_assert(offsetof(FTicketMemberAttributesDataObject, Region) == 0x000000, "Member 'FTicketMemberAttributesDataObject::Region' has a wrong offset!");
static_assert(offsetof(FTicketMemberAttributesDataObject, IsServer) == 0x000010, "Member 'FTicketMemberAttributesDataObject::IsServer' has a wrong offset!");

// ScriptStruct JP.DeathRespawnTimeWindow
// 0x0010 (0x0010 - 0x0000)
struct FDeathRespawnTimeWindow final
{
public:
	double                                        StartServerWorldTimeSeconds;                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndServerWorldTimeSeconds;                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDeathRespawnTimeWindow) == 0x000008, "Wrong alignment on FDeathRespawnTimeWindow");
static_assert(sizeof(FDeathRespawnTimeWindow) == 0x000010, "Wrong size on FDeathRespawnTimeWindow");
static_assert(offsetof(FDeathRespawnTimeWindow, StartServerWorldTimeSeconds) == 0x000000, "Member 'FDeathRespawnTimeWindow::StartServerWorldTimeSeconds' has a wrong offset!");
static_assert(offsetof(FDeathRespawnTimeWindow, EndServerWorldTimeSeconds) == 0x000008, "Member 'FDeathRespawnTimeWindow::EndServerWorldTimeSeconds' has a wrong offset!");

// ScriptStruct JP.OnlineStoreItemCost
// 0x000C (0x000C - 0x0000)
struct FOnlineStoreItemCost final
{
public:
	struct FGameplayTag                           CurrencyID;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnlineStoreItemCost) == 0x000004, "Wrong alignment on FOnlineStoreItemCost");
static_assert(sizeof(FOnlineStoreItemCost) == 0x00000C, "Wrong size on FOnlineStoreItemCost");
static_assert(offsetof(FOnlineStoreItemCost, CurrencyID) == 0x000000, "Member 'FOnlineStoreItemCost::CurrencyID' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemCost, Amount) == 0x000008, "Member 'FOnlineStoreItemCost::Amount' has a wrong offset!");

// ScriptStruct JP.OnlineStoreItemBattlePassRequirement
// 0x0010 (0x0010 - 0x0000)
struct FOnlineStoreItemBattlePassRequirement final
{
public:
	struct FGameplayTag                           BattlePassID;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPremium;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOnlineStoreItemBattlePassRequirement) == 0x000004, "Wrong alignment on FOnlineStoreItemBattlePassRequirement");
static_assert(sizeof(FOnlineStoreItemBattlePassRequirement) == 0x000010, "Wrong size on FOnlineStoreItemBattlePassRequirement");
static_assert(offsetof(FOnlineStoreItemBattlePassRequirement, BattlePassID) == 0x000000, "Member 'FOnlineStoreItemBattlePassRequirement::BattlePassID' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemBattlePassRequirement, Level) == 0x000008, "Member 'FOnlineStoreItemBattlePassRequirement::Level' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemBattlePassRequirement, IsPremium) == 0x00000C, "Member 'FOnlineStoreItemBattlePassRequirement::IsPremium' has a wrong offset!");

// ScriptStruct JP.OnlineStoreItemData
// 0x0048 (0x0048 - 0x0000)
struct FOnlineStoreItemData final
{
public:
	class FString                                 OnlineServicesID;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AssetID;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOnlineItemUnlockRequirement                  UnlockRequirement;                                 // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOwned;                                           // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemCost                   Cost;                                              // 0x001C(0x000C)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FOnlineStoreItemBattlePassRequirement  BattlePassRequirement;                             // 0x0028(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnlineStoreItemData) == 0x000008, "Wrong alignment on FOnlineStoreItemData");
static_assert(sizeof(FOnlineStoreItemData) == 0x000048, "Wrong size on FOnlineStoreItemData");
static_assert(offsetof(FOnlineStoreItemData, OnlineServicesID) == 0x000000, "Member 'FOnlineStoreItemData::OnlineServicesID' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, AssetID) == 0x000010, "Member 'FOnlineStoreItemData::AssetID' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, UnlockRequirement) == 0x000018, "Member 'FOnlineStoreItemData::UnlockRequirement' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, IsOwned) == 0x000019, "Member 'FOnlineStoreItemData::IsOwned' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, Cost) == 0x00001C, "Member 'FOnlineStoreItemData::Cost' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, BattlePassRequirement) == 0x000028, "Member 'FOnlineStoreItemData::BattlePassRequirement' has a wrong offset!");
static_assert(offsetof(FOnlineStoreItemData, Tags) == 0x000038, "Member 'FOnlineStoreItemData::Tags' has a wrong offset!");

// ScriptStruct JP.CosmeticsOnlineServicesDataContainer
// 0x0068 (0x0068 - 0x0000)
struct FCosmeticsOnlineServicesDataContainer final
{
public:
	TArray<struct FOnlineStoreItemData>           OwnedNeighborSkins;                                // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOnlineStoreItemData>           StoreNeighborSkins;                                // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOnlineStoreItemData>           OwnedItemSkins;                                    // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOnlineStoreItemData>           StoreItemSkins;                                    // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOnlineStoreItemData>           OwnedEmotes;                                       // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOnlineStoreItemData>           StoreEmotes;                                       // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCosmeticsOnlineServicesDataContainer) == 0x000008, "Wrong alignment on FCosmeticsOnlineServicesDataContainer");
static_assert(sizeof(FCosmeticsOnlineServicesDataContainer) == 0x000068, "Wrong size on FCosmeticsOnlineServicesDataContainer");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, OwnedNeighborSkins) == 0x000000, "Member 'FCosmeticsOnlineServicesDataContainer::OwnedNeighborSkins' has a wrong offset!");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, StoreNeighborSkins) == 0x000010, "Member 'FCosmeticsOnlineServicesDataContainer::StoreNeighborSkins' has a wrong offset!");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, OwnedItemSkins) == 0x000020, "Member 'FCosmeticsOnlineServicesDataContainer::OwnedItemSkins' has a wrong offset!");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, StoreItemSkins) == 0x000030, "Member 'FCosmeticsOnlineServicesDataContainer::StoreItemSkins' has a wrong offset!");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, OwnedEmotes) == 0x000040, "Member 'FCosmeticsOnlineServicesDataContainer::OwnedEmotes' has a wrong offset!");
static_assert(offsetof(FCosmeticsOnlineServicesDataContainer, StoreEmotes) == 0x000050, "Member 'FCosmeticsOnlineServicesDataContainer::StoreEmotes' has a wrong offset!");

// ScriptStruct JP.ServerDebugInformation
// 0x0030 (0x0030 - 0x0000)
struct FServerDebugInformation final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VmId;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FServerDebugInformation) == 0x000008, "Wrong alignment on FServerDebugInformation");
static_assert(sizeof(FServerDebugInformation) == 0x000030, "Wrong size on FServerDebugInformation");
static_assert(offsetof(FServerDebugInformation, Name) == 0x000000, "Member 'FServerDebugInformation::Name' has a wrong offset!");
static_assert(offsetof(FServerDebugInformation, VmId) == 0x000010, "Member 'FServerDebugInformation::VmId' has a wrong offset!");
static_assert(offsetof(FServerDebugInformation, ServerId) == 0x000020, "Member 'FServerDebugInformation::ServerId' has a wrong offset!");

// ScriptStruct JP.EndOfMatchPlayerData
// 0x0001 (0x0001 - 0x0000)
struct FEndOfMatchPlayerData final
{
public:
	bool                                          bDidWin;                                           // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEndOfMatchPlayerData) == 0x000001, "Wrong alignment on FEndOfMatchPlayerData");
static_assert(sizeof(FEndOfMatchPlayerData) == 0x000001, "Wrong size on FEndOfMatchPlayerData");
static_assert(offsetof(FEndOfMatchPlayerData, bDidWin) == 0x000000, "Member 'FEndOfMatchPlayerData::bDidWin' has a wrong offset!");

// ScriptStruct JP.RoomData
// 0x0018 (0x0018 - 0x0000)
struct FRoomData final
{
public:
	ERooms                                        Room;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RoomLevel;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RoomName;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoomData) == 0x000008, "Wrong alignment on FRoomData");
static_assert(sizeof(FRoomData) == 0x000018, "Wrong size on FRoomData");
static_assert(offsetof(FRoomData, Room) == 0x000000, "Member 'FRoomData::Room' has a wrong offset!");
static_assert(offsetof(FRoomData, RoomLevel) == 0x000004, "Member 'FRoomData::RoomLevel' has a wrong offset!");
static_assert(offsetof(FRoomData, RoomName) == 0x000008, "Member 'FRoomData::RoomName' has a wrong offset!");

// ScriptStruct JP.ItemTier
// 0x0050 (0x0050 - 0x0000)
struct FItemTier final
{
public:
	TSoftObjectPtr<class UObject>                 ItemDefinition;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredHouseLevel;                                // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRoomData                              RequiredRoom;                                      // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UEconomyDefinition*                     Cost;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FItemTier) == 0x000008, "Wrong alignment on FItemTier");
static_assert(sizeof(FItemTier) == 0x000050, "Wrong size on FItemTier");
static_assert(offsetof(FItemTier, ItemDefinition) == 0x000000, "Member 'FItemTier::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FItemTier, RequiredHouseLevel) == 0x000028, "Member 'FItemTier::RequiredHouseLevel' has a wrong offset!");
static_assert(offsetof(FItemTier, RequiredRoom) == 0x000030, "Member 'FItemTier::RequiredRoom' has a wrong offset!");
static_assert(offsetof(FItemTier, Cost) == 0x000048, "Member 'FItemTier::Cost' has a wrong offset!");

// ScriptStruct JP.DefaultCharacterSettings
// 0x0008 (0x0008 - 0x0000)
struct FDefaultCharacterSettings final
{
public:
	struct FGameplayTag                           DefaultCharacterTag;                               // 0x0000(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDefaultCharacterSettings) == 0x000004, "Wrong alignment on FDefaultCharacterSettings");
static_assert(sizeof(FDefaultCharacterSettings) == 0x000008, "Wrong size on FDefaultCharacterSettings");
static_assert(offsetof(FDefaultCharacterSettings, DefaultCharacterTag) == 0x000000, "Member 'FDefaultCharacterSettings::DefaultCharacterTag' has a wrong offset!");

// ScriptStruct JP.ItemDeliveryRewardMessage
// 0x0010 (0x0010 - 0x0000)
struct FItemDeliveryRewardMessage final
{
public:
	class UDataAsset*                             ActorToDeliver;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Team;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FItemDeliveryRewardMessage) == 0x000008, "Wrong alignment on FItemDeliveryRewardMessage");
static_assert(sizeof(FItemDeliveryRewardMessage) == 0x000010, "Wrong size on FItemDeliveryRewardMessage");
static_assert(offsetof(FItemDeliveryRewardMessage, ActorToDeliver) == 0x000000, "Member 'FItemDeliveryRewardMessage::ActorToDeliver' has a wrong offset!");
static_assert(offsetof(FItemDeliveryRewardMessage, Team) == 0x000008, "Member 'FItemDeliveryRewardMessage::Team' has a wrong offset!");

// ScriptStruct JP.LevelVoteData
// 0x0068 (0x0068 - 0x0000)
struct FLevelVoteData final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  LevelPath;                                         // 0x0010(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelectionWeight;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLevelVoteData) == 0x000008, "Wrong alignment on FLevelVoteData");
static_assert(sizeof(FLevelVoteData) == 0x000068, "Wrong size on FLevelVoteData");
static_assert(offsetof(FLevelVoteData, DisplayName) == 0x000000, "Member 'FLevelVoteData::DisplayName' has a wrong offset!");
static_assert(offsetof(FLevelVoteData, LevelPath) == 0x000010, "Member 'FLevelVoteData::LevelPath' has a wrong offset!");
static_assert(offsetof(FLevelVoteData, SelectionWeight) == 0x000038, "Member 'FLevelVoteData::SelectionWeight' has a wrong offset!");
static_assert(offsetof(FLevelVoteData, Image) == 0x000040, "Member 'FLevelVoteData::Image' has a wrong offset!");

// ScriptStruct JP.EndOfMatchGrantedStatistic
// 0x0018 (0x0018 - 0x0000)
struct FEndOfMatchGrantedStatistic final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEndOfMatchGrantedStatistic) == 0x000008, "Wrong alignment on FEndOfMatchGrantedStatistic");
static_assert(sizeof(FEndOfMatchGrantedStatistic) == 0x000018, "Wrong size on FEndOfMatchGrantedStatistic");
static_assert(offsetof(FEndOfMatchGrantedStatistic, ID) == 0x000000, "Member 'FEndOfMatchGrantedStatistic::ID' has a wrong offset!");
static_assert(offsetof(FEndOfMatchGrantedStatistic, Amount) == 0x000010, "Member 'FEndOfMatchGrantedStatistic::Amount' has a wrong offset!");

// ScriptStruct JP.GameModeData
// 0x0038 (0x0038 - 0x0000)
struct FGameModeData final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   GameModeClass;                                     // 0x0010(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameModeData) == 0x000008, "Wrong alignment on FGameModeData");
static_assert(sizeof(FGameModeData) == 0x000038, "Wrong size on FGameModeData");
static_assert(offsetof(FGameModeData, DisplayName) == 0x000000, "Member 'FGameModeData::DisplayName' has a wrong offset!");
static_assert(offsetof(FGameModeData, GameModeClass) == 0x000010, "Member 'FGameModeData::GameModeClass' has a wrong offset!");

// ScriptStruct JP.ItemLoadout
// 0x0010 (0x0010 - 0x0000)
struct FItemLoadout final
{
public:
	struct FGameplayTag                           ItemIdentifier;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SkinIdentifier;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FItemLoadout) == 0x000004, "Wrong alignment on FItemLoadout");
static_assert(sizeof(FItemLoadout) == 0x000010, "Wrong size on FItemLoadout");
static_assert(offsetof(FItemLoadout, ItemIdentifier) == 0x000000, "Member 'FItemLoadout::ItemIdentifier' has a wrong offset!");
static_assert(offsetof(FItemLoadout, SkinIdentifier) == 0x000008, "Member 'FItemLoadout::SkinIdentifier' has a wrong offset!");

// ScriptStruct JP.NeighborLoadout
// 0x0030 (0x0030 - 0x0000)
struct FNeighborLoadout final
{
public:
	struct FGameplayTag                           NeighborIdentifier;                                // 0x0000(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NeighborPerk;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GeneralPerk;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NeighborSkin;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemLoadout>                   Items;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNeighborLoadout) == 0x000008, "Wrong alignment on FNeighborLoadout");
static_assert(sizeof(FNeighborLoadout) == 0x000030, "Wrong size on FNeighborLoadout");
static_assert(offsetof(FNeighborLoadout, NeighborIdentifier) == 0x000000, "Member 'FNeighborLoadout::NeighborIdentifier' has a wrong offset!");
static_assert(offsetof(FNeighborLoadout, NeighborPerk) == 0x000008, "Member 'FNeighborLoadout::NeighborPerk' has a wrong offset!");
static_assert(offsetof(FNeighborLoadout, GeneralPerk) == 0x000010, "Member 'FNeighborLoadout::GeneralPerk' has a wrong offset!");
static_assert(offsetof(FNeighborLoadout, NeighborSkin) == 0x000018, "Member 'FNeighborLoadout::NeighborSkin' has a wrong offset!");
static_assert(offsetof(FNeighborLoadout, Items) == 0x000020, "Member 'FNeighborLoadout::Items' has a wrong offset!");

// ScriptStruct JP.PlayerLoadout
// 0x0028 (0x0028 - 0x0000)
struct FPlayerLoadout final
{
public:
	struct FGameplayTag                           DefaultNeighborID;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           HouseID;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeighborLoadout>               NeighborLoadouts;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0020(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerLoadout) == 0x000008, "Wrong alignment on FPlayerLoadout");
static_assert(sizeof(FPlayerLoadout) == 0x000028, "Wrong size on FPlayerLoadout");
static_assert(offsetof(FPlayerLoadout, DefaultNeighborID) == 0x000000, "Member 'FPlayerLoadout::DefaultNeighborID' has a wrong offset!");
static_assert(offsetof(FPlayerLoadout, HouseID) == 0x000008, "Member 'FPlayerLoadout::HouseID' has a wrong offset!");
static_assert(offsetof(FPlayerLoadout, NeighborLoadouts) == 0x000010, "Member 'FPlayerLoadout::NeighborLoadouts' has a wrong offset!");
static_assert(offsetof(FPlayerLoadout, bIsValid) == 0x000020, "Member 'FPlayerLoadout::bIsValid' has a wrong offset!");

// ScriptStruct JP.CombatParticipant
// 0x0060 (0x0060 - 0x0000)
struct FCombatParticipant final
{
public:
	struct FGameplayTag                           Type;                                              // 0x0000(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Name;                                              // 0x0008(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0018(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamId;                                            // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerMatchRecord*                     PlayerMatchRecord;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>    AffectingGameplayEffects;                          // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCombatParticipant) == 0x000008, "Wrong alignment on FCombatParticipant");
static_assert(sizeof(FCombatParticipant) == 0x000060, "Wrong size on FCombatParticipant");
static_assert(offsetof(FCombatParticipant, Type) == 0x000000, "Member 'FCombatParticipant::Type' has a wrong offset!");
static_assert(offsetof(FCombatParticipant, Name) == 0x000008, "Member 'FCombatParticipant::Name' has a wrong offset!");
static_assert(offsetof(FCombatParticipant, Icon) == 0x000018, "Member 'FCombatParticipant::Icon' has a wrong offset!");
static_assert(offsetof(FCombatParticipant, TeamId) == 0x000040, "Member 'FCombatParticipant::TeamId' has a wrong offset!");
static_assert(offsetof(FCombatParticipant, PlayerMatchRecord) == 0x000048, "Member 'FCombatParticipant::PlayerMatchRecord' has a wrong offset!");
static_assert(offsetof(FCombatParticipant, AffectingGameplayEffects) == 0x000050, "Member 'FCombatParticipant::AffectingGameplayEffects' has a wrong offset!");

// ScriptStruct JP.KillMethod
// 0x02E8 (0x02E8 - 0x0000)
struct FKillMethod final
{
public:
	TSoftObjectPtr<class UObject>                 ItemDefinition;                                    // 0x0000(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpec                    GameplayEffect;                                    // 0x0028(0x0298)(BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   GameplayAbility;                                   // 0x02C0(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKillMethod) == 0x000008, "Wrong alignment on FKillMethod");
static_assert(sizeof(FKillMethod) == 0x0002E8, "Wrong size on FKillMethod");
static_assert(offsetof(FKillMethod, ItemDefinition) == 0x000000, "Member 'FKillMethod::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FKillMethod, GameplayEffect) == 0x000028, "Member 'FKillMethod::GameplayEffect' has a wrong offset!");
static_assert(offsetof(FKillMethod, GameplayAbility) == 0x0002C0, "Member 'FKillMethod::GameplayAbility' has a wrong offset!");

// ScriptStruct JP.GameplayEffectContextJP
// 0x0408 (0x04B0 - 0x00A8)
struct FGameplayEffectContextJP final : public FGameplayEffectContextIW
{
public:
	uint8                                         Pad_A8[0xC0];                                      // 0x00A8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
