#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Leloi_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Leloi_PostProcess_AnimBP.Leloi_PostProcess_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Leloi_PostProcess_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Leloi_PostProcess_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Leloi_PostProcess_AnimBP_C_AnimGraph");
static_assert(sizeof(Leloi_PostProcess_AnimBP_C_AnimGraph) == 0x000020, "Wrong size on Leloi_PostProcess_AnimBP_C_AnimGraph");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Leloi_PostProcess_AnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Leloi_PostProcess_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Leloi_PostProcess_AnimBP.Leloi_PostProcess_AnimBP_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong alignment on Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong size on Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'Leloi_PostProcess_AnimBP_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");

// Function Leloi_PostProcess_AnimBP.Leloi_PostProcess_AnimBP_C.ExecuteUbergraph_Leloi_PostProcess_AnimBP
// 0x0040 (0x0040 - 0x0000)
struct Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_LeloiFootstep_C>    K2Node_DynamicCast_AsI_Leloi_Footstep;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP) == 0x000008, "Wrong alignment on Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP");
static_assert(sizeof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP) == 0x000040, "Wrong size on Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, EntryPoint) == 0x000000, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, K2Node_DynamicCast_AsI_Leloi_Footstep) == 0x000018, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::K2Node_DynamicCast_AsI_Leloi_Footstep' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x000038, "Member 'Leloi_PostProcess_AnimBP_C_ExecuteUbergraph_Leloi_PostProcess_AnimBP::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");

// Function Leloi_PostProcess_AnimBP.Leloi_PostProcess_AnimBP_C.UpdateLayerData
// 0x0004 (0x0004 - 0x0000)
struct Leloi_PostProcess_AnimBP_C_UpdateLayerData final
{
public:
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Leloi_PostProcess_AnimBP_C_UpdateLayerData) == 0x000004, "Wrong alignment on Leloi_PostProcess_AnimBP_C_UpdateLayerData");
static_assert(sizeof(Leloi_PostProcess_AnimBP_C_UpdateLayerData) == 0x000004, "Wrong size on Leloi_PostProcess_AnimBP_C_UpdateLayerData");
static_assert(offsetof(Leloi_PostProcess_AnimBP_C_UpdateLayerData, CallFunc_GetCurveValue_ReturnValue) == 0x000000, "Member 'Leloi_PostProcess_AnimBP_C_UpdateLayerData::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");

}

