#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingWI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingWI.LoadingWI_C
// 0x0060 (0x0340 - 0x02E0)
class ULoadingWI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextText;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SciMinusficircle02_02;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTip;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        TextBlur;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        LoadingSound;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoadingMusic;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             TipsDataTable;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowTip;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingWI(int32 EntryPoint);
	void GetRandomTip(class FText* Return);
	void Hide();
	void PreConstruct(bool IsDesignTime);
	void UpdateBackground(class UTexture2D* Texture);
	void UpdateBackgroundRemoved();
	void UpdateMessage(const class FText& Message);
	void UpdateSound(class USoundBase* Sound, bool StopMenuMusic);
	void UpdateSoundLoadingScreenHidden(bool StartMenuMusic);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingWI_C">();
	}
	static class ULoadingWI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingWI_C>();
	}
};
static_assert(alignof(ULoadingWI_C) == 0x000008, "Wrong alignment on ULoadingWI_C");
static_assert(sizeof(ULoadingWI_C) == 0x000340, "Wrong size on ULoadingWI_C");
static_assert(offsetof(ULoadingWI_C, UberGraphFrame) == 0x0002E0, "Member 'ULoadingWI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, Anim) == 0x0002E8, "Member 'ULoadingWI_C::Anim' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, Image_Background) == 0x0002F0, "Member 'ULoadingWI_C::Image_Background' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, RichTextText) == 0x0002F8, "Member 'ULoadingWI_C::RichTextText' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, SciMinusficircle02_02) == 0x000300, "Member 'ULoadingWI_C::SciMinusficircle02_02' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, SizeBoxTip) == 0x000308, "Member 'ULoadingWI_C::SizeBoxTip' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, TextBlock_2) == 0x000310, "Member 'ULoadingWI_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, TextBlur) == 0x000318, "Member 'ULoadingWI_C::TextBlur' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, LoadingSound) == 0x000320, "Member 'ULoadingWI_C::LoadingSound' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, LoadingMusic) == 0x000328, "Member 'ULoadingWI_C::LoadingMusic' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, TipsDataTable) == 0x000330, "Member 'ULoadingWI_C::TipsDataTable' has a wrong offset!");
static_assert(offsetof(ULoadingWI_C, ShowTip) == 0x000338, "Member 'ULoadingWI_C::ShowTip' has a wrong offset!");

}

