#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerListSectionWI

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyPlayerListSectionWI.LobbyPlayerListSectionWI_C.Add Child Entry
// 0x0008 (0x0008 - 0x0000)
struct LobbyPlayerListSectionWI_C_Add_Child_Entry final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerListSectionWI_C_Add_Child_Entry) == 0x000008, "Wrong alignment on LobbyPlayerListSectionWI_C_Add_Child_Entry");
static_assert(sizeof(LobbyPlayerListSectionWI_C_Add_Child_Entry) == 0x000008, "Wrong size on LobbyPlayerListSectionWI_C_Add_Child_Entry");
static_assert(offsetof(LobbyPlayerListSectionWI_C_Add_Child_Entry, Content) == 0x000000, "Member 'LobbyPlayerListSectionWI_C_Add_Child_Entry::Content' has a wrong offset!");

// Function LobbyPlayerListSectionWI.LobbyPlayerListSectionWI_C.ExecuteUbergraph_LobbyPlayerListSectionWI
// 0x0020 (0x0020 - 0x0000)
struct LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Content;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI) == 0x000008, "Wrong alignment on LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI");
static_assert(sizeof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI) == 0x000020, "Wrong size on LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI");
static_assert(offsetof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI, EntryPoint) == 0x000000, "Member 'LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI, K2Node_CustomEvent_Content) == 0x000008, "Member 'LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI::K2Node_CustomEvent_Content' has a wrong offset!");
static_assert(offsetof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI, K2Node_Event_IsDesignTime) == 0x000018, "Member 'LobbyPlayerListSectionWI_C_ExecuteUbergraph_LobbyPlayerListSectionWI::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function LobbyPlayerListSectionWI.LobbyPlayerListSectionWI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LobbyPlayerListSectionWI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerListSectionWI_C_PreConstruct) == 0x000001, "Wrong alignment on LobbyPlayerListSectionWI_C_PreConstruct");
static_assert(sizeof(LobbyPlayerListSectionWI_C_PreConstruct) == 0x000001, "Wrong size on LobbyPlayerListSectionWI_C_PreConstruct");
static_assert(offsetof(LobbyPlayerListSectionWI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LobbyPlayerListSectionWI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

