#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MailBox

#include "Basic.hpp"

#include "E_MaterialTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_ImpactEffect_structs.hpp"


namespace SDK::Params
{

// Function MailBox.MailBox_C.ExecuteUbergraph_MailBox
// 0x0090 (0x0090 - 0x0000)
struct MailBox_C_ExecuteUbergraph_MailBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SabotagingActor;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitImpulse;                           // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                K2Node_Event_ImpactEffect;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailBox_C_ExecuteUbergraph_MailBox) == 0x000008, "Wrong alignment on MailBox_C_ExecuteUbergraph_MailBox");
static_assert(sizeof(MailBox_C_ExecuteUbergraph_MailBox) == 0x000090, "Wrong size on MailBox_C_ExecuteUbergraph_MailBox");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, EntryPoint) == 0x000000, "Member 'MailBox_C_ExecuteUbergraph_MailBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'MailBox_C_ExecuteUbergraph_MailBox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'MailBox_C_ExecuteUbergraph_MailBox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, Temp_bool_Has_Been_Initd_Variable_1) == 0x000021, "Member 'MailBox_C_ExecuteUbergraph_MailBox::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_HasAuthority_ReturnValue) == 0x000022, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_HasAuthority_ReturnValue_1) == 0x000030, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, K2Node_Event_SabotagingActor) == 0x000038, "Member 'MailBox_C_ExecuteUbergraph_MailBox::K2Node_Event_SabotagingActor' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000041, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, Temp_bool_IsClosed_Variable_1) == 0x000042, "Member 'MailBox_C_ExecuteUbergraph_MailBox::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000048, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue) == 0x000050, "Member 'MailBox_C_ExecuteUbergraph_MailBox::CallFunc_WithdrawEconomyFromTeamAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, K2Node_Event_Location) == 0x000058, "Member 'MailBox_C_ExecuteUbergraph_MailBox::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, K2Node_Event_HitImpulse) == 0x000070, "Member 'MailBox_C_ExecuteUbergraph_MailBox::K2Node_Event_HitImpulse' has a wrong offset!");
static_assert(offsetof(MailBox_C_ExecuteUbergraph_MailBox, K2Node_Event_ImpactEffect) == 0x000088, "Member 'MailBox_C_ExecuteUbergraph_MailBox::K2Node_Event_ImpactEffect' has a wrong offset!");

// Function MailBox.MailBox_C.GetMaterialType
// 0x0001 (0x0001 - 0x0000)
struct MailBox_C_GetMaterialType final
{
public:
	E_MaterialTypes                               MaterialType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailBox_C_GetMaterialType) == 0x000001, "Wrong alignment on MailBox_C_GetMaterialType");
static_assert(sizeof(MailBox_C_GetMaterialType) == 0x000001, "Wrong size on MailBox_C_GetMaterialType");
static_assert(offsetof(MailBox_C_GetMaterialType, MaterialType) == 0x000000, "Member 'MailBox_C_GetMaterialType::MaterialType' has a wrong offset!");

// Function MailBox.MailBox_C.House Actor Impact Cosmetics
// 0x0038 (0x0038 - 0x0000)
struct MailBox_C_House_Actor_Impact_Cosmetics final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ImpactEffect                                ImpactEffect;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailBox_C_House_Actor_Impact_Cosmetics) == 0x000008, "Wrong alignment on MailBox_C_House_Actor_Impact_Cosmetics");
static_assert(sizeof(MailBox_C_House_Actor_Impact_Cosmetics) == 0x000038, "Wrong size on MailBox_C_House_Actor_Impact_Cosmetics");
static_assert(offsetof(MailBox_C_House_Actor_Impact_Cosmetics, Location) == 0x000000, "Member 'MailBox_C_House_Actor_Impact_Cosmetics::Location' has a wrong offset!");
static_assert(offsetof(MailBox_C_House_Actor_Impact_Cosmetics, HitImpulse) == 0x000018, "Member 'MailBox_C_House_Actor_Impact_Cosmetics::HitImpulse' has a wrong offset!");
static_assert(offsetof(MailBox_C_House_Actor_Impact_Cosmetics, ImpactEffect) == 0x000030, "Member 'MailBox_C_House_Actor_Impact_Cosmetics::ImpactEffect' has a wrong offset!");

// Function MailBox.MailBox_C.Sabotage
// 0x0008 (0x0008 - 0x0000)
struct MailBox_C_Sabotage final
{
public:
	class AActor*                                 SabotagingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailBox_C_Sabotage) == 0x000008, "Wrong alignment on MailBox_C_Sabotage");
static_assert(sizeof(MailBox_C_Sabotage) == 0x000008, "Wrong size on MailBox_C_Sabotage");
static_assert(offsetof(MailBox_C_Sabotage, SabotagingActor) == 0x000000, "Member 'MailBox_C_Sabotage::SabotagingActor' has a wrong offset!");

// Function MailBox.MailBox_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct MailBox_C_UserConstructionScript final
{
public:
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(MailBox_C_UserConstructionScript) == 0x000008, "Wrong alignment on MailBox_C_UserConstructionScript");
static_assert(sizeof(MailBox_C_UserConstructionScript) == 0x000010, "Wrong size on MailBox_C_UserConstructionScript");
static_assert(offsetof(MailBox_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'MailBox_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

}

