#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MailBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HouseActorBase_classes.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "E_ImpactEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MailBox.MailBox_C
// 0x0030 (0x0420 - 0x03F0)
class AMailBox_C final : public AHouseActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MailBox_C;                          // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGroundskeeperReference*                GroundskeeperReference;                            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Sabotaged_Light;                                // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box_0;                                             // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerJP_MatchBP_C*          Latest_Damaging_Controller;                        // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Cosmetics_State_Repaired();
	void Cosmetics_State_Sabotaged();
	void ExecuteUbergraph_MailBox(int32 EntryPoint);
	void GetMaterialType(E_MaterialTypes* MaterialType);
	void House_Actor_Impact_Cosmetics(const struct FVector& Location, const struct FVector& HitImpulse, E_ImpactEffect ImpactEffect);
	void Repair();
	void Sabotage(class AActor* SabotagingActor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MailBox_C">();
	}
	static class AMailBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMailBox_C>();
	}
};
static_assert(alignof(AMailBox_C) == 0x000008, "Wrong alignment on AMailBox_C");
static_assert(sizeof(AMailBox_C) == 0x000420, "Wrong size on AMailBox_C");
static_assert(offsetof(AMailBox_C, UberGraphFrame_MailBox_C) == 0x0003F0, "Member 'AMailBox_C::UberGraphFrame_MailBox_C' has a wrong offset!");
static_assert(offsetof(AMailBox_C, GroundskeeperReference) == 0x0003F8, "Member 'AMailBox_C::GroundskeeperReference' has a wrong offset!");
static_assert(offsetof(AMailBox_C, PS_Sabotaged_Light) == 0x000400, "Member 'AMailBox_C::PS_Sabotaged_Light' has a wrong offset!");
static_assert(offsetof(AMailBox_C, Box_0) == 0x000408, "Member 'AMailBox_C::Box_0' has a wrong offset!");
static_assert(offsetof(AMailBox_C, StaticMesh) == 0x000410, "Member 'AMailBox_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMailBox_C, Latest_Damaging_Controller) == 0x000418, "Member 'AMailBox_C::Latest_Damaging_Controller' has a wrong offset!");

}

