#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBounceComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MeshBounceComponent.MeshBounceComponent_C.ExecuteUbergraph_MeshBounceComponent
// 0x01F0 (0x01F0 - 0x0000)
struct MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_CustomEvent_Meshes;                         // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0038(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0098(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0158(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0168(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent) == 0x000008, "Wrong alignment on MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent");
static_assert(sizeof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent) == 0x0001F0, "Wrong size on MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, EntryPoint) == 0x000000, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, K2Node_CustomEvent_Meshes) == 0x000008, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::K2Node_CustomEvent_Meshes' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, Temp_int_Array_Index_Variable) == 0x000028, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x00002C, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Get_Item) == 0x000030, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000038, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_GetMaterials_ReturnValue) == 0x000098, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, Temp_int_Loop_Counter_Variable_1) == 0x0000AC, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, Temp_int_Array_Index_Variable_1) == 0x0000B8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, K2Node_Event_DeltaSeconds) == 0x0000D8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Add_ReturnValue) == 0x0000DC, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000E0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, Temp_int_Variable) == 0x0000E8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000F8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000FC, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_GetFloatValue_ReturnValue) == 0x000100, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Get_Item_2) == 0x000108, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000110, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Less_IntInt_ReturnValue_2) == 0x000114, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000118, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000130, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_GetOwner_ReturnValue) == 0x000140, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Get_ClassLog_Name_name) == 0x000148, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000158, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, K2Node_MakeStruct_FormatArgumentData_1) == 0x000168, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, K2Node_MakeArray_Array) == 0x0001B0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Format_ReturnValue) == 0x0001C0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Conv_TextToString_ReturnValue) == 0x0001D0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0001E0, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x0001E8, "Member 'MeshBounceComponent_C_ExecuteUbergraph_MeshBounceComponent::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");

// Function MeshBounceComponent.MeshBounceComponent_C.HitBounce
// 0x00B0 (0x00B0 - 0x0000)
struct MeshBounceComponent_C_HitBounce final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpact;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitRadius;                                         // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshBounceComponent_C_HitBounce) == 0x000008, "Wrong alignment on MeshBounceComponent_C_HitBounce");
static_assert(sizeof(MeshBounceComponent_C_HitBounce) == 0x0000B0, "Wrong size on MeshBounceComponent_C_HitBounce");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, HitLocation) == 0x000000, "Member 'MeshBounceComponent_C_HitBounce::HitLocation' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, HitImpact) == 0x000018, "Member 'MeshBounceComponent_C_HitBounce::HitImpact' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, HitRadius) == 0x000030, "Member 'MeshBounceComponent_C_HitBounce::HitRadius' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, Temp_int_Variable) == 0x000038, "Member 'MeshBounceComponent_C_HitBounce::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, Temp_int_Variable_1) == 0x00003C, "Member 'MeshBounceComponent_C_HitBounce::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, Temp_int_Variable_2) == 0x000048, "Member 'MeshBounceComponent_C_HitBounce::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_IsDedicatedServer_ReturnValue) == 0x00004C, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000054, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000064, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Get_Item) == 0x000078, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Array_Length_ReturnValue_2) == 0x0000A4, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000A8, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshBounceComponent_C_HitBounce, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000AC, "Member 'MeshBounceComponent_C_HitBounce::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function MeshBounceComponent.MeshBounceComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MeshBounceComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshBounceComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on MeshBounceComponent_C_ReceiveTick");
static_assert(sizeof(MeshBounceComponent_C_ReceiveTick) == 0x000004, "Wrong size on MeshBounceComponent_C_ReceiveTick");
static_assert(offsetof(MeshBounceComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MeshBounceComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MeshBounceComponent.MeshBounceComponent_C.StartBounceTimeline
// 0x0008 (0x0008 - 0x0000)
struct MeshBounceComponent_C_StartBounceTimeline final
{
public:
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshBounceComponent_C_StartBounceTimeline) == 0x000008, "Wrong alignment on MeshBounceComponent_C_StartBounceTimeline");
static_assert(sizeof(MeshBounceComponent_C_StartBounceTimeline) == 0x000008, "Wrong size on MeshBounceComponent_C_StartBounceTimeline");
static_assert(offsetof(MeshBounceComponent_C_StartBounceTimeline, CallFunc_GetTimeSeconds_ReturnValue) == 0x000000, "Member 'MeshBounceComponent_C_StartBounceTimeline::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");

// Function MeshBounceComponent.MeshBounceComponent_C.StopBounceTimeline
// 0x0008 (0x0008 - 0x0000)
struct MeshBounceComponent_C_StopBounceTimeline final
{
public:
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshBounceComponent_C_StopBounceTimeline) == 0x000008, "Wrong alignment on MeshBounceComponent_C_StopBounceTimeline");
static_assert(sizeof(MeshBounceComponent_C_StopBounceTimeline) == 0x000008, "Wrong size on MeshBounceComponent_C_StopBounceTimeline");
static_assert(offsetof(MeshBounceComponent_C_StopBounceTimeline, CallFunc_GetTimeSeconds_ReturnValue) == 0x000000, "Member 'MeshBounceComponent_C_StopBounceTimeline::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");

// Function MeshBounceComponent.MeshBounceComponent_C.Update Meshes
// 0x0010 (0x0010 - 0x0000)
struct MeshBounceComponent_C_Update_Meshes final
{
public:
	TArray<class UMeshComponent*>                 Meshes_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(MeshBounceComponent_C_Update_Meshes) == 0x000008, "Wrong alignment on MeshBounceComponent_C_Update_Meshes");
static_assert(sizeof(MeshBounceComponent_C_Update_Meshes) == 0x000010, "Wrong size on MeshBounceComponent_C_Update_Meshes");
static_assert(offsetof(MeshBounceComponent_C_Update_Meshes, Meshes_0) == 0x000000, "Member 'MeshBounceComponent_C_Update_Meshes::Meshes_0' has a wrong offset!");

}

