#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ApplyEffectToCharacterWithHighHealth

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function PA_ApplyEffectToCharacterWithHighHealth.PA_ApplyEffectToCharacterWithHighHealth_C.ApplyGameplayEffectIfHealthHigh
// 0x0038 (0x0038 - 0x0000)
struct PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh final
{
public:
	class UAbilitySystemComponentIW*              TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealthPercentage;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EffectApplied;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0018(0x0010)()
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh) == 0x000008, "Wrong alignment on PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh");
static_assert(sizeof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh) == 0x000038, "Wrong size on PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, TargetASC) == 0x000000, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::TargetASC' has a wrong offset!");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, CurrentHealthPercentage) == 0x000008, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::CurrentHealthPercentage' has a wrong offset!");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, EffectApplied) == 0x000010, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::EffectApplied' has a wrong offset!");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000018, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000028, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x00002C, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ApplyGameplayEffectIfHealthHigh::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");

// Function PA_ApplyEffectToCharacterWithHighHealth.PA_ApplyEffectToCharacterWithHighHealth_C.ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth
// 0x0004 (0x0004 - 0x0000)
struct PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth) == 0x000004, "Wrong alignment on PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth");
static_assert(sizeof(PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth) == 0x000004, "Wrong size on PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth");
static_assert(offsetof(PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth, EntryPoint) == 0x000000, "Member 'PA_ApplyEffectToCharacterWithHighHealth_C_ExecuteUbergraph_PA_ApplyEffectToCharacterWithHighHealth::EntryPoint' has a wrong offset!");

}

