#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ChangeItemIconsOnEquip

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function PA_ChangeItemIconsOnEquip.PA_ChangeItemIconsOnEquip_C.FindCorrectIcon
// 0x0030 (0x0030 - 0x0000)
struct PA_ChangeItemIconsOnEquip_C_FindCorrectIcon final
{
public:
	class UEquipmentInstance*                     Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InputTag_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IconFound;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NewIcon_0;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon) == 0x000008, "Wrong alignment on PA_ChangeItemIconsOnEquip_C_FindCorrectIcon");
static_assert(sizeof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon) == 0x000030, "Wrong size on PA_ChangeItemIconsOnEquip_C_FindCorrectIcon");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, Instance) == 0x000000, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::Instance' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, InputTag_0) == 0x000008, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::InputTag_0' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, IconFound) == 0x000010, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::IconFound' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, NewIcon_0) == 0x000018, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::NewIcon_0' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000028, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000029, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ChangeItemIconsOnEquip_C_FindCorrectIcon, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'PA_ChangeItemIconsOnEquip_C_FindCorrectIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

