#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PA_ReplaceSpecialAbility

#include "Basic.hpp"


namespace SDK::Params
{

// Function PA_ReplaceSpecialAbility.PA_ReplaceSpecialAbility_C.ReplaceSpecialAbility
// 0x0018 (0x0018 - 0x0000)
struct PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborSpecialAbilitiesComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNeighborSpecialAbilityInstance*        CallFunc_ReplaceSpecialAbility_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility) == 0x000008, "Wrong alignment on PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility");
static_assert(sizeof(PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility) == 0x000018, "Wrong size on PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility");
static_assert(offsetof(PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility, OwningActor) == 0x000000, "Member 'PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility::OwningActor' has a wrong offset!");
static_assert(offsetof(PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility, CallFunc_ReplaceSpecialAbility_ReturnValue) == 0x000010, "Member 'PA_ReplaceSpecialAbility_C_ReplaceSpecialAbility::CallFunc_ReplaceSpecialAbility_ReturnValue' has a wrong offset!");

}

