#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintMessageWI

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function PrintMessageWI.PrintMessageWI_C.Add Message
// 0x0058 (0x0058 - 0x0000)
struct PrintMessageWI_C_Add_Message final
{
public:
	struct FPlayerMessage                         Message;                                           // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PrintMessageWI_C_Add_Message) == 0x000008, "Wrong alignment on PrintMessageWI_C_Add_Message");
static_assert(sizeof(PrintMessageWI_C_Add_Message) == 0x000058, "Wrong size on PrintMessageWI_C_Add_Message");
static_assert(offsetof(PrintMessageWI_C_Add_Message, Message) == 0x000000, "Member 'PrintMessageWI_C_Add_Message::Message' has a wrong offset!");

// Function PrintMessageWI.PrintMessageWI_C.ExecuteUbergraph_PrintMessageWI
// 0x00A0 (0x00A0 - 0x0000)
struct PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PrintPlayerMessageEntry_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayerMessage                         K2Node_CustomEvent_Message;                        // 0x0010(0x0058)()
	TArray<class UObject*>                        CallFunc_InsertListItemsToTempArray_Items;         // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0080(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI) == 0x000008, "Wrong alignment on PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI");
static_assert(sizeof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI) == 0x0000A0, "Wrong size on PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, EntryPoint) == 0x000000, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, K2Node_CustomEvent_Message) == 0x000010, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_InsertListItemsToTempArray_Items) == 0x000068, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_InsertListItemsToTempArray_Items' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_GetNumItems_ReturnValue) == 0x000078, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_GetListItems_ReturnValue) == 0x000080, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_Array_LastIndex_ReturnValue) == 0x000094, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI, CallFunc_Array_Get_Item) == 0x000098, "Member 'PrintMessageWI_C_ExecuteUbergraph_PrintMessageWI::CallFunc_Array_Get_Item' has a wrong offset!");

// Function PrintMessageWI.PrintMessageWI_C.InsertListItemsToTempArray
// 0x0038 (0x0038 - 0x0000)
struct PrintMessageWI_C_InsertListItemsToTempArray final
{
public:
	const class UObject*                          NewItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Items;                                             // 0x0008(0x0010)(Parm, OutParm)
	TArray<class UObject*>                        L_TempItemList;                                    // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0028(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(PrintMessageWI_C_InsertListItemsToTempArray) == 0x000008, "Wrong alignment on PrintMessageWI_C_InsertListItemsToTempArray");
static_assert(sizeof(PrintMessageWI_C_InsertListItemsToTempArray) == 0x000038, "Wrong size on PrintMessageWI_C_InsertListItemsToTempArray");
static_assert(offsetof(PrintMessageWI_C_InsertListItemsToTempArray, NewItem) == 0x000000, "Member 'PrintMessageWI_C_InsertListItemsToTempArray::NewItem' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_InsertListItemsToTempArray, Items) == 0x000008, "Member 'PrintMessageWI_C_InsertListItemsToTempArray::Items' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_InsertListItemsToTempArray, L_TempItemList) == 0x000018, "Member 'PrintMessageWI_C_InsertListItemsToTempArray::L_TempItemList' has a wrong offset!");
static_assert(offsetof(PrintMessageWI_C_InsertListItemsToTempArray, CallFunc_GetListItems_ReturnValue) == 0x000028, "Member 'PrintMessageWI_C_InsertListItemsToTempArray::CallFunc_GetListItems_ReturnValue' has a wrong offset!");

}

