#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PU_Catapult

#include "Basic.hpp"


namespace SDK::Params
{

// Function PU_Catapult.PU_Catapult_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct PU_Catapult_C_UserConstructionScript final
{
public:
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PU_Catapult_C_UserConstructionScript) == 0x000004, "Wrong alignment on PU_Catapult_C_UserConstructionScript");
static_assert(sizeof(PU_Catapult_C_UserConstructionScript) == 0x000010, "Wrong size on PU_Catapult_C_UserConstructionScript");
static_assert(offsetof(PU_Catapult_C_UserConstructionScript, K2Node_MultiGate_FirstRun) == 0x000000, "Member 'PU_Catapult_C_UserConstructionScript::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(PU_Catapult_C_UserConstructionScript, K2Node_MultiGate_Data) == 0x000004, "Member 'PU_Catapult_C_UserConstructionScript::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(PU_Catapult_C_UserConstructionScript, K2Node_MultiGate_ScratchBool) == 0x000008, "Member 'PU_Catapult_C_UserConstructionScript::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(PU_Catapult_C_UserConstructionScript, K2Node_MultiGate_ScratchIndex) == 0x00000C, "Member 'PU_Catapult_C_UserConstructionScript::K2Node_MultiGate_ScratchIndex' has a wrong offset!");

}

