#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AudioSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct s_AudioSettings.s_AudioSettings
// 0x0010 (0x0010 - 0x0000)
struct FS_AudioSettings final
{
public:
	float                                         Master_2_171169204DA2764A69BA3BA5E2D6E5F3;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SFX_4_DDBFC2C846A04C865302A2A860FF50EE;            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MUSIC_6_5F2282C147529E17C5E37C88FD65DF55;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UI_8_807E4CBB43748EDBC099679E0729304C;             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AudioSettings) == 0x000004, "Wrong alignment on FS_AudioSettings");
static_assert(sizeof(FS_AudioSettings) == 0x000010, "Wrong size on FS_AudioSettings");
static_assert(offsetof(FS_AudioSettings, Master_2_171169204DA2764A69BA3BA5E2D6E5F3) == 0x000000, "Member 'FS_AudioSettings::Master_2_171169204DA2764A69BA3BA5E2D6E5F3' has a wrong offset!");
static_assert(offsetof(FS_AudioSettings, SFX_4_DDBFC2C846A04C865302A2A860FF50EE) == 0x000004, "Member 'FS_AudioSettings::SFX_4_DDBFC2C846A04C865302A2A860FF50EE' has a wrong offset!");
static_assert(offsetof(FS_AudioSettings, MUSIC_6_5F2282C147529E17C5E37C88FD65DF55) == 0x000008, "Member 'FS_AudioSettings::MUSIC_6_5F2282C147529E17C5E37C88FD65DF55' has a wrong offset!");
static_assert(offsetof(FS_AudioSettings, UI_8_807E4CBB43748EDBC099679E0729304C) == 0x00000C, "Member 'FS_AudioSettings::UI_8_807E4CBB43748EDBC099679E0729304C' has a wrong offset!");

}

