#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DeathTimerDetails

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_DeathTimerDetails.S_DeathTimerDetails
// 0x0028 (0x0028 - 0x0000)
struct FS_DeathTimerDetails final
{
public:
	double                                        RespawnTime_BeforeLocationMultiplier_21_991761A94E5A87950E60D8B618D4C301; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RespawnTime_AfterLocationMultiplier_22_7888B2954A02F2E78B27E6954E8BBEB7; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RespawnTime_BeforePerkMultiplier_25_51F512EB4C7612E6C83C0A83D5697D26; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RespawnTime_AfterPerkMultiplier_27_F6809E0A41D0DE50532C1CA66E43E885; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAtHome_Value_9_E5099B3041EF06969DE656809069C6BA; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPerkBonus_30_36F901934C9C78ECC8DAB586DBC86941;  // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DeathTimerDetails) == 0x000008, "Wrong alignment on FS_DeathTimerDetails");
static_assert(sizeof(FS_DeathTimerDetails) == 0x000028, "Wrong size on FS_DeathTimerDetails");
static_assert(offsetof(FS_DeathTimerDetails, RespawnTime_BeforeLocationMultiplier_21_991761A94E5A87950E60D8B618D4C301) == 0x000000, "Member 'FS_DeathTimerDetails::RespawnTime_BeforeLocationMultiplier_21_991761A94E5A87950E60D8B618D4C301' has a wrong offset!");
static_assert(offsetof(FS_DeathTimerDetails, RespawnTime_AfterLocationMultiplier_22_7888B2954A02F2E78B27E6954E8BBEB7) == 0x000008, "Member 'FS_DeathTimerDetails::RespawnTime_AfterLocationMultiplier_22_7888B2954A02F2E78B27E6954E8BBEB7' has a wrong offset!");
static_assert(offsetof(FS_DeathTimerDetails, RespawnTime_BeforePerkMultiplier_25_51F512EB4C7612E6C83C0A83D5697D26) == 0x000010, "Member 'FS_DeathTimerDetails::RespawnTime_BeforePerkMultiplier_25_51F512EB4C7612E6C83C0A83D5697D26' has a wrong offset!");
static_assert(offsetof(FS_DeathTimerDetails, RespawnTime_AfterPerkMultiplier_27_F6809E0A41D0DE50532C1CA66E43E885) == 0x000018, "Member 'FS_DeathTimerDetails::RespawnTime_AfterPerkMultiplier_27_F6809E0A41D0DE50532C1CA66E43E885' has a wrong offset!");
static_assert(offsetof(FS_DeathTimerDetails, IsAtHome_Value_9_E5099B3041EF06969DE656809069C6BA) == 0x000020, "Member 'FS_DeathTimerDetails::IsAtHome_Value_9_E5099B3041EF06969DE656809069C6BA' has a wrong offset!");
static_assert(offsetof(FS_DeathTimerDetails, HasPerkBonus_30_36F901934C9C78ECC8DAB586DBC86941) == 0x000021, "Member 'FS_DeathTimerDetails::HasPerkBonus_30_36F901934C9C78ECC8DAB586DBC86941' has a wrong offset!");

}

