#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DeployItem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_DeployItem.S_DeployItem
// 0x0018 (0x0018 - 0x0000)
struct FS_DeployItem final
{
public:
	struct FGameplayTag                           DeployedItem_9_C1BF9B354C615CBB8C8AEA841B50F19A;   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocal_11_0C61C68E4DCC4219599B85B9DB3DAB38;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerID_19_171F007141EC8AE6ACAFAD88451012A4;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DeployItem) == 0x000008, "Wrong alignment on FS_DeployItem");
static_assert(sizeof(FS_DeployItem) == 0x000018, "Wrong size on FS_DeployItem");
static_assert(offsetof(FS_DeployItem, DeployedItem_9_C1BF9B354C615CBB8C8AEA841B50F19A) == 0x000000, "Member 'FS_DeployItem::DeployedItem_9_C1BF9B354C615CBB8C8AEA841B50F19A' has a wrong offset!");
static_assert(offsetof(FS_DeployItem, IsLocal_11_0C61C68E4DCC4219599B85B9DB3DAB38) == 0x000008, "Member 'FS_DeployItem::IsLocal_11_0C61C68E4DCC4219599B85B9DB3DAB38' has a wrong offset!");
static_assert(offsetof(FS_DeployItem, PlayerID_19_171F007141EC8AE6ACAFAD88451012A4) == 0x000010, "Member 'FS_DeployItem::PlayerID_19_171F007141EC8AE6ACAFAD88451012A4' has a wrong offset!");

}

