#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EliminationData_EliminatedByEnvironment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EliminationData_EliminatedByEnvironment.S_EliminationData_EliminatedByEnvironment
// 0x0040 (0x0040 - 0x0000)
struct FS_EliminationData_EliminatedByEnvironment final
{
public:
	class FString                                 NameOfAttacker_17_84AD65C14C3A797376FB99AC3C466759; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Item_13_0CE2B1BD4374B2BC6BA107B4563D6F7D;          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             Image_10_0D11D6694264A5D5A80C388E04DF6A90;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OptionalLaunchVelocity_20_99E5179C45FF7811EFC0F08AB94149A1; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EliminationData_EliminatedByEnvironment) == 0x000008, "Wrong alignment on FS_EliminationData_EliminatedByEnvironment");
static_assert(sizeof(FS_EliminationData_EliminatedByEnvironment) == 0x000040, "Wrong size on FS_EliminationData_EliminatedByEnvironment");
static_assert(offsetof(FS_EliminationData_EliminatedByEnvironment, NameOfAttacker_17_84AD65C14C3A797376FB99AC3C466759) == 0x000000, "Member 'FS_EliminationData_EliminatedByEnvironment::NameOfAttacker_17_84AD65C14C3A797376FB99AC3C466759' has a wrong offset!");
static_assert(offsetof(FS_EliminationData_EliminatedByEnvironment, Item_13_0CE2B1BD4374B2BC6BA107B4563D6F7D) == 0x000010, "Member 'FS_EliminationData_EliminatedByEnvironment::Item_13_0CE2B1BD4374B2BC6BA107B4563D6F7D' has a wrong offset!");
static_assert(offsetof(FS_EliminationData_EliminatedByEnvironment, Image_10_0D11D6694264A5D5A80C388E04DF6A90) == 0x000020, "Member 'FS_EliminationData_EliminatedByEnvironment::Image_10_0D11D6694264A5D5A80C388E04DF6A90' has a wrong offset!");
static_assert(offsetof(FS_EliminationData_EliminatedByEnvironment, OptionalLaunchVelocity_20_99E5179C45FF7811EFC0F08AB94149A1) == 0x000028, "Member 'FS_EliminationData_EliminatedByEnvironment::OptionalLaunchVelocity_20_99E5179C45FF7811EFC0F08AB94149A1' has a wrong offset!");

}

