#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EliminationDataForPlayers

#include "Basic.hpp"

#include "E_Eliminator_structs.hpp"
#include "S_EliminationData_EliminatedByPlayer_structs.hpp"
#include "S_EliminationData_EliminatedByEnvironment_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_EliminationDataForPlayers.S_EliminationDataForPlayers
// 0x0068 (0x0068 - 0x0000)
struct FS_EliminationDataForPlayers final
{
public:
	E_Eliminator                                  Eliminator_19_5BF923B14F600CA49226D1ABFE097C2D;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EliminationData_EliminatedByPlayer  EliminationData_EliminatedByPlayer_28_6889DF7D42936FDADF9858ADCC1AB388; // 0x0008(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_EliminationData_EliminatedByEnvironment EliminationData_EliminatedByEnvironment_29_E16C04BD45BC31165B9D3CB288D436B7; // 0x0028(0x0040)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_EliminationDataForPlayers) == 0x000008, "Wrong alignment on FS_EliminationDataForPlayers");
static_assert(sizeof(FS_EliminationDataForPlayers) == 0x000068, "Wrong size on FS_EliminationDataForPlayers");
static_assert(offsetof(FS_EliminationDataForPlayers, Eliminator_19_5BF923B14F600CA49226D1ABFE097C2D) == 0x000000, "Member 'FS_EliminationDataForPlayers::Eliminator_19_5BF923B14F600CA49226D1ABFE097C2D' has a wrong offset!");
static_assert(offsetof(FS_EliminationDataForPlayers, EliminationData_EliminatedByPlayer_28_6889DF7D42936FDADF9858ADCC1AB388) == 0x000008, "Member 'FS_EliminationDataForPlayers::EliminationData_EliminatedByPlayer_28_6889DF7D42936FDADF9858ADCC1AB388' has a wrong offset!");
static_assert(offsetof(FS_EliminationDataForPlayers, EliminationData_EliminatedByEnvironment_29_E16C04BD45BC31165B9D3CB288D436B7) == 0x000028, "Member 'FS_EliminationDataForPlayers::EliminationData_EliminatedByEnvironment_29_E16C04BD45BC31165B9D3CB288D436B7' has a wrong offset!");

}

