#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LobbyCharacterSelectorOption

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LobbyCharacterSelectorOption.S_LobbyCharacterSelectorOption
// 0x0020 (0x0020 - 0x0000)
struct FS_LobbyCharacterSelectorOption final
{
public:
	class FName                                   CharacterId_4_A9BDC8894EFE458E530950BEB9FF8731;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CharacterNameText_7_1C8B7C7143E10D9C97A7CC93747F271F; // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FGameplayTag                           NeighborIdentifier_10_1263535D468110D5D0F5C7833DCA76D1; // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LobbyCharacterSelectorOption) == 0x000008, "Wrong alignment on FS_LobbyCharacterSelectorOption");
static_assert(sizeof(FS_LobbyCharacterSelectorOption) == 0x000020, "Wrong size on FS_LobbyCharacterSelectorOption");
static_assert(offsetof(FS_LobbyCharacterSelectorOption, CharacterId_4_A9BDC8894EFE458E530950BEB9FF8731) == 0x000000, "Member 'FS_LobbyCharacterSelectorOption::CharacterId_4_A9BDC8894EFE458E530950BEB9FF8731' has a wrong offset!");
static_assert(offsetof(FS_LobbyCharacterSelectorOption, CharacterNameText_7_1C8B7C7143E10D9C97A7CC93747F271F) == 0x000008, "Member 'FS_LobbyCharacterSelectorOption::CharacterNameText_7_1C8B7C7143E10D9C97A7CC93747F271F' has a wrong offset!");
static_assert(offsetof(FS_LobbyCharacterSelectorOption, NeighborIdentifier_10_1263535D468110D5D0F5C7833DCA76D1) == 0x000018, "Member 'FS_LobbyCharacterSelectorOption::NeighborIdentifier_10_1263535D468110D5D0F5C7833DCA76D1' has a wrong offset!");

}

