#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Music

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Music.S_Music
// 0x0018 (0x0018 - 0x0000)
struct FS_Music final
{
public:
	bool                                          PlaySoundPlaylist_22_2091A2904D2B944B0A11219E2195F636; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              SoundsCuePlaylist_16_2B964F7E43AB3563A265CBB8741E2215; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFadeIn_29_F7DE87744F6CFE6A8CF36180B02025E7;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeInDuration_32_C5DEA3BE4636D41E1B10488F6B444056; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Music) == 0x000008, "Wrong alignment on FS_Music");
static_assert(sizeof(FS_Music) == 0x000018, "Wrong size on FS_Music");
static_assert(offsetof(FS_Music, PlaySoundPlaylist_22_2091A2904D2B944B0A11219E2195F636) == 0x000000, "Member 'FS_Music::PlaySoundPlaylist_22_2091A2904D2B944B0A11219E2195F636' has a wrong offset!");
static_assert(offsetof(FS_Music, SoundsCuePlaylist_16_2B964F7E43AB3563A265CBB8741E2215) == 0x000008, "Member 'FS_Music::SoundsCuePlaylist_16_2B964F7E43AB3563A265CBB8741E2215' has a wrong offset!");
static_assert(offsetof(FS_Music, UseFadeIn_29_F7DE87744F6CFE6A8CF36180B02025E7) == 0x000010, "Member 'FS_Music::UseFadeIn_29_F7DE87744F6CFE6A8CF36180B02025E7' has a wrong offset!");
static_assert(offsetof(FS_Music, FadeInDuration_32_C5DEA3BE4636D41E1B10488F6B444056) == 0x000014, "Member 'FS_Music::FadeInDuration_32_C5DEA3BE4636D41E1B10488F6B444056' has a wrong offset!");

}

