#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PlayerScoreboardStats

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PlayerScoreboardStats.S_PlayerScoreboardStats
// 0x0050 (0x0050 - 0x0000)
struct FS_PlayerScoreboardStats final
{
public:
	TSoftObjectPtr<class UTexture2D>              PlayerPortrait_29_9239DB934471520046A9D7A7262B03FF; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   PlayerName_11_AD33AC3E4E3BD2DC7B4097857B6DA193;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerKills_27_D8CD86014A95E9B4331EC78EF35D1748;   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerAssists_26_C697A1AB45572881296A2ABE5AE84E45; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerDeaths_25_965471F240BA902CB851D2BF8EED556D;  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerDamage_24_9A6D6EA2468A8E10331680AFBD29CB01;  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerHealing_23_7EBADFF040B6FEBF2B79FB82E7504C14; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIncome_22_C101D80D49718FFDAA459082A06CF040;  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerResources_21_BB25132147751CD1FEE047A3FC9A7FBB; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PlayerScoreboardStats) == 0x000008, "Wrong alignment on FS_PlayerScoreboardStats");
static_assert(sizeof(FS_PlayerScoreboardStats) == 0x000050, "Wrong size on FS_PlayerScoreboardStats");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerPortrait_29_9239DB934471520046A9D7A7262B03FF) == 0x000000, "Member 'FS_PlayerScoreboardStats::PlayerPortrait_29_9239DB934471520046A9D7A7262B03FF' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerName_11_AD33AC3E4E3BD2DC7B4097857B6DA193) == 0x000028, "Member 'FS_PlayerScoreboardStats::PlayerName_11_AD33AC3E4E3BD2DC7B4097857B6DA193' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerKills_27_D8CD86014A95E9B4331EC78EF35D1748) == 0x000030, "Member 'FS_PlayerScoreboardStats::PlayerKills_27_D8CD86014A95E9B4331EC78EF35D1748' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerAssists_26_C697A1AB45572881296A2ABE5AE84E45) == 0x000034, "Member 'FS_PlayerScoreboardStats::PlayerAssists_26_C697A1AB45572881296A2ABE5AE84E45' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerDeaths_25_965471F240BA902CB851D2BF8EED556D) == 0x000038, "Member 'FS_PlayerScoreboardStats::PlayerDeaths_25_965471F240BA902CB851D2BF8EED556D' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerDamage_24_9A6D6EA2468A8E10331680AFBD29CB01) == 0x00003C, "Member 'FS_PlayerScoreboardStats::PlayerDamage_24_9A6D6EA2468A8E10331680AFBD29CB01' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerHealing_23_7EBADFF040B6FEBF2B79FB82E7504C14) == 0x000040, "Member 'FS_PlayerScoreboardStats::PlayerHealing_23_7EBADFF040B6FEBF2B79FB82E7504C14' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerIncome_22_C101D80D49718FFDAA459082A06CF040) == 0x000044, "Member 'FS_PlayerScoreboardStats::PlayerIncome_22_C101D80D49718FFDAA459082A06CF040' has a wrong offset!");
static_assert(offsetof(FS_PlayerScoreboardStats, PlayerResources_21_BB25132147751CD1FEE047A3FC9A7FBB) == 0x000048, "Member 'FS_PlayerScoreboardStats::PlayerResources_21_BB25132147751CD1FEE047A3FC9A7FBB' has a wrong offset!");

}

