#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SessionsFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonUser_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.Create Default Host Lobby Request
// 0x0048 (0x0048 - 0x0000)
struct SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      HostRequest;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProjectSettingsJP*                     CallFunc_GetProjectSettings_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_CreateHostRequest_HostRequest;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request");
static_assert(sizeof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request) == 0x000048, "Wrong size on SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, __WorldContext) == 0x000000, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, HostRequest) == 0x000008, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::HostRequest' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, CallFunc_GetProjectSettings_ReturnValue) == 0x000010, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::CallFunc_GetProjectSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, K2Node_DynamicCast_AsBP_GI) == 0x000020, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue) == 0x00002C, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers) == 0x00003C, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::CallFunc_GetMaxPlayersFromMatchSettings_MaxPlayers' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request, CallFunc_CreateHostRequest_HostRequest) == 0x000040, "Member 'SessionsFunctionLibrary_C_Create_Default_Host_Lobby_Request::CallFunc_CreateHostRequest_HostRequest' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.CreateDefaultSessionSearchRequest
// 0x0020 (0x0020 - 0x0000)
struct SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchSessionRequest*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchSessionRequest*    CallFunc_CreateOnlineSearchSessionRequest_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest");
static_assert(sizeof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest) == 0x000020, "Wrong size on SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest, __WorldContext) == 0x000000, "Member 'SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest, ReturnValue) == 0x000008, "Member 'SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest::ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest, CallFunc_CreateOnlineSearchSessionRequest_ReturnValue) == 0x000018, "Member 'SessionsFunctionLibrary_C_CreateDefaultSessionSearchRequest::CallFunc_CreateOnlineSearchSessionRequest_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.Dump Session Search Result To String
// 0x0540 (0x0540 - 0x0000)
struct SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String final
{
public:
	class UCommonSession_SearchResult*            Session;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 SessionDebugString;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AdditionalParametersString;                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringSetting_Value;                   // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStringSetting_bFoundValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringSetting_Value_1;                 // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStringSetting_bFoundValue_1;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x00C8(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0130(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0178(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0188(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0198(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01E0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOpenPrivateConnections_ReturnValue; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOpenPublicConnections_ReturnValue;  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0240(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0288(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPublicConnections_ReturnValue;      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPingInMs_ReturnValue;                  // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x02E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0330(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDescription_ReturnValue;               // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0388(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0398(0x0010)()
	class FName                                   CallFunc_Array_Get_Item;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x03B0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x03F8(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0408(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0418(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0460(0x0010)()
	class FString                                 CallFunc_GetStringSetting_Value_2;                 // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStringSetting_bFoundValue_2;           // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0498(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x04B0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0500(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0510(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String");
static_assert(sizeof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String) == 0x000540, "Wrong size on SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, Session) == 0x000000, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::Session' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, __WorldContext) == 0x000008, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, SessionDebugString) == 0x000010, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::SessionDebugString' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, AdditionalParametersString) == 0x000020, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::AdditionalParametersString' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, Temp_int_Array_Index_Variable) == 0x000030, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_Value) == 0x000098, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_Value' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_bFoundValue) == 0x0000A8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_bFoundValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_Value_1) == 0x0000B0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_Value_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_bFoundValue_1) == 0x0000C0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_bFoundValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_BoolToText_ReturnValue) == 0x0000C8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x0000D8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_2) == 0x000130, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000178, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000188, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_3) == 0x000198, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001E0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetNumOpenPrivateConnections_ReturnValue) == 0x000228, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetNumOpenPrivateConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetNumOpenPublicConnections_ReturnValue) == 0x00022C, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetNumOpenPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000230, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000238, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_5) == 0x000240, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_6) == 0x000288, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetMaxPublicConnections_ReturnValue) == 0x0002D0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetMaxPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetPingInMs_ReturnValue) == 0x0002D4, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetPingInMs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0002D8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x0002E0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_7) == 0x0002E8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_8) == 0x000330, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetDescription_ReturnValue) == 0x000378, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeArray_Array) == 0x000388, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000398, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Array_Get_Item) == 0x0003A8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_9) == 0x0003B0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_NameToText_ReturnValue) == 0x0003F8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeArray_Array_1) == 0x000408, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_10) == 0x000418, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Format_ReturnValue) == 0x000460, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_Value_2) == 0x000470, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_Value_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_GetStringSetting_bFoundValue_2) == 0x000480, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_GetStringSetting_bFoundValue_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_TextToString_ReturnValue) == 0x000488, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000498, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Array_Length_ReturnValue) == 0x0004A8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeStruct_FormatArgumentData_11) == 0x0004B0, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeStruct_FormatArgumentData_11' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Less_IntInt_ReturnValue) == 0x0004F8, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, K2Node_MakeArray_Array_2) == 0x000500, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Format_ReturnValue_1) == 0x000510, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000520, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000530, "Member 'SessionsFunctionLibrary_C_Dump_Session_Search_Result_To_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.FindSessions
// 0x0020 (0x0020 - 0x0000)
struct SessionsFunctionLibrary_C_FindSessions final
{
public:
	class UCommonSession_SearchSessionRequest*    SearchRequest;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_FindSessions) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_FindSessions");
static_assert(sizeof(SessionsFunctionLibrary_C_FindSessions) == 0x000020, "Wrong size on SessionsFunctionLibrary_C_FindSessions");
static_assert(offsetof(SessionsFunctionLibrary_C_FindSessions, SearchRequest) == 0x000000, "Member 'SessionsFunctionLibrary_C_FindSessions::SearchRequest' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_FindSessions, __WorldContext) == 0x000008, "Member 'SessionsFunctionLibrary_C_FindSessions::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_FindSessions, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'SessionsFunctionLibrary_C_FindSessions::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_FindSessions, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'SessionsFunctionLibrary_C_FindSessions::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.HostLobbySession
// 0x0020 (0x0020 - 0x0000)
struct SessionsFunctionLibrary_C_HostLobbySession final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Default_Host_Lobby_Request_HostRequest; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_HostLobbySession) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_HostLobbySession");
static_assert(sizeof(SessionsFunctionLibrary_C_HostLobbySession) == 0x000020, "Wrong size on SessionsFunctionLibrary_C_HostLobbySession");
static_assert(offsetof(SessionsFunctionLibrary_C_HostLobbySession, __WorldContext) == 0x000000, "Member 'SessionsFunctionLibrary_C_HostLobbySession::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_HostLobbySession, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'SessionsFunctionLibrary_C_HostLobbySession::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_HostLobbySession, CallFunc_Create_Default_Host_Lobby_Request_HostRequest) == 0x000010, "Member 'SessionsFunctionLibrary_C_HostLobbySession::CallFunc_Create_Default_Host_Lobby_Request_HostRequest' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_HostLobbySession, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'SessionsFunctionLibrary_C_HostLobbySession::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.QuickPlayOrHostLobbySession
// 0x0020 (0x0020 - 0x0000)
struct SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_Create_Default_Host_Lobby_Request_HostRequest; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession");
static_assert(sizeof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession) == 0x000020, "Wrong size on SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession");
static_assert(offsetof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession, __WorldContext) == 0x000000, "Member 'SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession, CallFunc_Create_Default_Host_Lobby_Request_HostRequest) == 0x000010, "Member 'SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession::CallFunc_Create_Default_Host_Lobby_Request_HostRequest' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'SessionsFunctionLibrary_C_QuickPlayOrHostLobbySession::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.SelectBestAvailableSession
// 0x0060 (0x0060 - 0x0000)
struct SessionsFunctionLibrary_C_SelectBestAvailableSession final
{
public:
	class UCommonSession_SearchSessionRequest*    AvailableSessions;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            BestAvailableSession;                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonSession_SearchResult*>    ValidSessions;                                     // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOpenPublicConnections_ReturnValue;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPublicConnections_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_SearchResult*            CallFunc_Array_Random_OutItem;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SessionsFunctionLibrary_C_SelectBestAvailableSession) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_SelectBestAvailableSession");
static_assert(sizeof(SessionsFunctionLibrary_C_SelectBestAvailableSession) == 0x000060, "Wrong size on SessionsFunctionLibrary_C_SelectBestAvailableSession");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, AvailableSessions) == 0x000000, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::AvailableSessions' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, __WorldContext) == 0x000008, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::__WorldContext' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, BestAvailableSession) == 0x000010, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::BestAvailableSession' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, ValidSessions) == 0x000018, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::ValidSessions' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, Temp_int_Array_Index_Variable) == 0x000028, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Array_Get_Item) == 0x000030, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_GetNumOpenPublicConnections_ReturnValue) == 0x000038, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_GetNumOpenPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_GetMaxPublicConnections_ReturnValue) == 0x00003C, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_GetMaxPublicConnections_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Array_Random_OutItem) == 0x000048, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Array_Random_OutIndex) == 0x000050, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_SelectBestAvailableSession, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'SessionsFunctionLibrary_C_SelectBestAvailableSession::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function SessionsFunctionLibrary.SessionsFunctionLibrary_C.CreateHostRequest
// 0x00A0 (0x00A0 - 0x0000)
struct SessionsFunctionLibrary_C_CreateHostRequest final
{
public:
	class FString                                 GameModeNameForAdvertisement;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ECommonSessionOnlineMode                      OnlineMode;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        MapID;                                             // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPlayerCount;                                    // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLobbies;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      HostRequest;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSessionSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonSession_HostSessionRequest*      CallFunc_CreateOnlineHostSessionRequest_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0050(0x0050)()
};
static_assert(alignof(SessionsFunctionLibrary_C_CreateHostRequest) == 0x000008, "Wrong alignment on SessionsFunctionLibrary_C_CreateHostRequest");
static_assert(sizeof(SessionsFunctionLibrary_C_CreateHostRequest) == 0x0000A0, "Wrong size on SessionsFunctionLibrary_C_CreateHostRequest");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateHostRequest, GameModeNameForAdvertisement) == 0x000000, "Member 'SessionsFunctionLibrary_C_CreateHostRequest::GameModeNameForAdvertisement' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateHostRequest, OnlineMode) == 0x000010, "Member 'SessionsFunctionLibrary_C_CreateHostRequest::OnlineMode' has a wrong offset!");
static_assert(offsetof(SessionsFunctionLibrary_C_CreateHostRequest, MapID) == 0x000014, "Member 'SessionsFunctionLibrary_C_CreateHostRequest::MapID' has a wrong offset!");
