#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopInteractionAC

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ItemPurchasedPayload_structs.hpp"
#include "JP_structs.hpp"
#include "E_ShopType_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_MatchItemPurchase_structs.hpp"
#include "S_ShopItem_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ShopInteractionAC.ShopInteractionAC_C.AddAmmo
// 0x00E8 (0x00E8 - 0x0000)
struct ShopInteractionAC_C_AddAmmo final
{
public:
	class UItemDefinition*                        ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShopItemViewModel                     ShopItemViewModel;                                 // 0x0008(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    Temp_byte_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddAmmo_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	E_ShopType                                    Temp_byte_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    Temp_byte_Variable_2;                              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    Temp_byte_Variable_3;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             Temp_byte_Variable_4;                              // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UItemAction_BuyAmmoBehavior*      CallFunc_FindActionByType_ReturnValue;             // 0x00D8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoToAdd_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddAmmo_AddedAmmo;                     // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_AddAmmo) == 0x000008, "Wrong alignment on ShopInteractionAC_C_AddAmmo");
static_assert(sizeof(ShopInteractionAC_C_AddAmmo) == 0x0000E8, "Wrong size on ShopInteractionAC_C_AddAmmo");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, ItemDefinition) == 0x000000, "Member 'ShopInteractionAC_C_AddAmmo::ItemDefinition' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, ShopItemViewModel) == 0x000008, "Member 'ShopInteractionAC_C_AddAmmo::ShopItemViewModel' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, ReturnValue) == 0x000088, "Member 'ShopInteractionAC_C_AddAmmo::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, Temp_byte_Variable) == 0x000089, "Member 'ShopInteractionAC_C_AddAmmo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_AddAmmo_ReturnValue) == 0x00008A, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_AddAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000090, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, Temp_byte_Variable_1) == 0x0000B8, "Member 'ShopInteractionAC_C_AddAmmo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, Temp_byte_Variable_2) == 0x0000B9, "Member 'ShopInteractionAC_C_AddAmmo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, Temp_byte_Variable_3) == 0x0000BA, "Member 'ShopInteractionAC_C_AddAmmo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, Temp_byte_Variable_4) == 0x0000BB, "Member 'ShopInteractionAC_C_AddAmmo::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x0000C0, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, K2Node_Select_Default) == 0x0000C8, "Member 'ShopInteractionAC_C_AddAmmo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_GetFirstItemOfType_ReturnValue) == 0x0000D0, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_FindActionByType_ReturnValue) == 0x0000D8, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_GetAmmoToAdd_ReturnValue) == 0x0000E0, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_GetAmmoToAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AddAmmo, CallFunc_TryAddAmmo_AddedAmmo) == 0x0000E4, "Member 'ShopInteractionAC_C_AddAmmo::CallFunc_TryAddAmmo_AddedAmmo' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.AttemptItemPurchase
// 0x0060 (0x0060 - 0x0000)
struct ShopInteractionAC_C_AttemptItemPurchase final
{
public:
	class UItemDefinition*                        ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          OptionalItemToDropFromInventory;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DeliveryOrderConfirmed;                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttemptItemPurchase_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FS_ItemPurchasedPayload                K2Node_MakeStruct_S_ItemPurchasedPayload;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_AttemptItemPurchase) == 0x000008, "Wrong alignment on ShopInteractionAC_C_AttemptItemPurchase");
static_assert(sizeof(ShopInteractionAC_C_AttemptItemPurchase) == 0x000060, "Wrong size on ShopInteractionAC_C_AttemptItemPurchase");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, ItemDefinition) == 0x000000, "Member 'ShopInteractionAC_C_AttemptItemPurchase::ItemDefinition' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, OptionalItemToDropFromInventory) == 0x000008, "Member 'ShopInteractionAC_C_AttemptItemPurchase::OptionalItemToDropFromInventory' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, DeliveryOrderConfirmed) == 0x000010, "Member 'ShopInteractionAC_C_AttemptItemPurchase::DeliveryOrderConfirmed' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, ReturnValue) == 0x000011, "Member 'ShopInteractionAC_C_AttemptItemPurchase::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x000018, "Member 'ShopInteractionAC_C_AttemptItemPurchase::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, CallFunc_AttemptItemPurchase_ReturnValue) == 0x000020, "Member 'ShopInteractionAC_C_AttemptItemPurchase::CallFunc_AttemptItemPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000028, "Member 'ShopInteractionAC_C_AttemptItemPurchase::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, K2Node_MakeStruct_S_ItemPurchasedPayload) == 0x000050, "Member 'ShopInteractionAC_C_AttemptItemPurchase::K2Node_MakeStruct_S_ItemPurchasedPayload' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_AttemptItemPurchase, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'ShopInteractionAC_C_AttemptItemPurchase::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.CanAddAmmo
// 0x0050 (0x0050 - 0x0000)
struct ShopInteractionAC_C_CanAddAmmo final
{
public:
	class UItemDefinition*                        ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddAmmo_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsingAmmo_Return_Value;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_UsingAmmo_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxAmmo_Return_Value;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_CanAddAmmo) == 0x000008, "Wrong alignment on ShopInteractionAC_C_CanAddAmmo");
static_assert(sizeof(ShopInteractionAC_C_CanAddAmmo) == 0x000050, "Wrong size on ShopInteractionAC_C_CanAddAmmo");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, ItemDefinition) == 0x000000, "Member 'ShopInteractionAC_C_CanAddAmmo::ItemDefinition' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, ReturnValue) == 0x000008, "Member 'ShopInteractionAC_C_CanAddAmmo::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_CanAddAmmo_ReturnValue) == 0x000038, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_CanAddAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_UsingAmmo_Return_Value) == 0x000039, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_UsingAmmo_Return_Value' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_UsingAmmo_Item) == 0x000040, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_UsingAmmo_Item' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_HasMaxAmmo_Return_Value) == 0x000049, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_HasMaxAmmo_Return_Value' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddAmmo, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'ShopInteractionAC_C_CanAddAmmo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.CanAddItem
// 0x0038 (0x0038 - 0x0000)
struct ShopInteractionAC_C_CanAddItem final
{
public:
	class UInventoryComponent*                    Inventory_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemInstance*>                  CallFunc_GetAllItemsWithAction_ReturnValue;        // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetInventorySize_ModifiedSize;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_CanAddItem) == 0x000008, "Wrong alignment on ShopInteractionAC_C_CanAddItem");
static_assert(sizeof(ShopInteractionAC_C_CanAddItem) == 0x000038, "Wrong size on ShopInteractionAC_C_CanAddItem");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, Inventory_0) == 0x000000, "Member 'ShopInteractionAC_C_CanAddItem::Inventory_0' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, PlayerState) == 0x000008, "Member 'ShopInteractionAC_C_CanAddItem::PlayerState' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, ReturnValue) == 0x000010, "Member 'ShopInteractionAC_C_CanAddItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, CallFunc_GetAllItemsWithAction_ReturnValue) == 0x000018, "Member 'ShopInteractionAC_C_CanAddItem::CallFunc_GetAllItemsWithAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, CallFunc_GetInventorySize_ModifiedSize) == 0x000028, "Member 'ShopInteractionAC_C_CanAddItem::CallFunc_GetInventorySize_ModifiedSize' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ShopInteractionAC_C_CanAddItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanAddItem, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ShopInteractionAC_C_CanAddItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.CanPurchaseItem
// 0x0040 (0x0040 - 0x0000)
struct ShopInteractionAC_C_CanPurchaseItem final
{
public:
	class UItemDefinition*                        ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddAmmo_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchaseItem_ReturnValue;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddItem_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_CanPurchaseItem) == 0x000008, "Wrong alignment on ShopInteractionAC_C_CanPurchaseItem");
static_assert(sizeof(ShopInteractionAC_C_CanPurchaseItem) == 0x000040, "Wrong size on ShopInteractionAC_C_CanPurchaseItem");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, ItemDefinition) == 0x000000, "Member 'ShopInteractionAC_C_CanPurchaseItem::ItemDefinition' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, ReturnValue) == 0x000008, "Member 'ShopInteractionAC_C_CanPurchaseItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_GetAssetIdentifier_ReturnValue) == 0x000018, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_GetAssetIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, K2Node_DynamicCast_AsPawn) == 0x000020, "Member 'ShopInteractionAC_C_CanPurchaseItem::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ShopInteractionAC_C_CanPurchaseItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_CanAddAmmo_ReturnValue) == 0x000029, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_CanAddAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_CanPurchaseItem_ReturnValue) == 0x00002A, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_CanPurchaseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x000030, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_CanAddItem_ReturnValue) == 0x000038, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_CanAddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CanPurchaseItem, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'ShopInteractionAC_C_CanPurchaseItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.Client_ShowDeliveryConfirmationPrompt
// 0x0008 (0x0008 - 0x0000)
struct ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt final
{
public:
	struct FGameplayTag                           OrderedDelivery;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt) == 0x000004, "Wrong alignment on ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt");
static_assert(sizeof(ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt) == 0x000008, "Wrong size on ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt");
static_assert(offsetof(ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt, OrderedDelivery) == 0x000000, "Member 'ShopInteractionAC_C_Client_ShowDeliveryConfirmationPrompt::OrderedDelivery' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.CouldNotCastToItemDefinitionError
// 0x0028 (0x0028 - 0x0000)
struct ShopInteractionAC_C_CouldNotCastToItemDefinitionError final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_CouldNotCastToItemDefinitionError) == 0x000008, "Wrong alignment on ShopInteractionAC_C_CouldNotCastToItemDefinitionError");
static_assert(sizeof(ShopInteractionAC_C_CouldNotCastToItemDefinitionError) == 0x000028, "Wrong size on ShopInteractionAC_C_CouldNotCastToItemDefinitionError");
static_assert(offsetof(ShopInteractionAC_C_CouldNotCastToItemDefinitionError, Object) == 0x000000, "Member 'ShopInteractionAC_C_CouldNotCastToItemDefinitionError::Object' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CouldNotCastToItemDefinitionError, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'ShopInteractionAC_C_CouldNotCastToItemDefinitionError::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_CouldNotCastToItemDefinitionError, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'ShopInteractionAC_C_CouldNotCastToItemDefinitionError::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.DisplayFullAmmoMessage_Auth
// 0x0010 (0x0010 - 0x0000)
struct ShopInteractionAC_C_DisplayFullAmmoMessage_Auth final
{
public:
	class UItemDefinition*                        Definition;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_DisplayFullAmmoMessage_Auth) == 0x000008, "Wrong alignment on ShopInteractionAC_C_DisplayFullAmmoMessage_Auth");
static_assert(sizeof(ShopInteractionAC_C_DisplayFullAmmoMessage_Auth) == 0x000010, "Wrong size on ShopInteractionAC_C_DisplayFullAmmoMessage_Auth");
static_assert(offsetof(ShopInteractionAC_C_DisplayFullAmmoMessage_Auth, Definition) == 0x000000, "Member 'ShopInteractionAC_C_DisplayFullAmmoMessage_Auth::Definition' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_DisplayFullAmmoMessage_Auth, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x000008, "Member 'ShopInteractionAC_C_DisplayFullAmmoMessage_Auth::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.DisplayFullInventoryMessage_Auth
// 0x0008 (0x0008 - 0x0000)
struct ShopInteractionAC_C_DisplayFullInventoryMessage_Auth final
{
public:
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_DisplayFullInventoryMessage_Auth) == 0x000008, "Wrong alignment on ShopInteractionAC_C_DisplayFullInventoryMessage_Auth");
static_assert(sizeof(ShopInteractionAC_C_DisplayFullInventoryMessage_Auth) == 0x000008, "Wrong size on ShopInteractionAC_C_DisplayFullInventoryMessage_Auth");
static_assert(offsetof(ShopInteractionAC_C_DisplayFullInventoryMessage_Auth, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x000000, "Member 'ShopInteractionAC_C_DisplayFullInventoryMessage_Auth::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.DropItem
// 0x0008 (0x0008 - 0x0000)
struct ShopInteractionAC_C_DropItem final
{
public:
	class UItemInstance*                          ItemToDropFromInventory;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_DropItem) == 0x000008, "Wrong alignment on ShopInteractionAC_C_DropItem");
static_assert(sizeof(ShopInteractionAC_C_DropItem) == 0x000008, "Wrong size on ShopInteractionAC_C_DropItem");
static_assert(offsetof(ShopInteractionAC_C_DropItem, ItemToDropFromInventory) == 0x000000, "Member 'ShopInteractionAC_C_DropItem::ItemToDropFromInventory' has a wrong offset!");

// Function ShopInteractionAC.ShopInteractionAC_C.ExecuteUbergraph_ShopInteractionAC
// 0x0650 (0x0650 - 0x0000)
struct ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_ShopItem                            K2Node_CustomEvent_ShopItem;                       // 0x0058(0x0020)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FRoomData                              K2Node_CustomEvent_RoomData;                       // 0x0078(0x0018)()
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentItemTierIndex_ItemTierIndex;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x00B0(0x0050)()
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     K2Node_Event_Actor;                                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FShopItemViewModel                     K2Node_Event_ShopItemViewModel;                    // 0x0118(0x0080)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Base_World_Event_Runner; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_1; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_2; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_3; // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Base_WorldEventRunner_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_CustomEvent_ItemDefinition_1;               // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0258(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    K2Node_CustomEvent_ShopType;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_CustomEvent_AdditionalSound;                // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemDefinition>         K2Node_CustomEvent_ItemDefinition;                 // 0x02A0(0x0028)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawnStinna_C*                 K2Node_DynamicCast_AsSpectator_Pawn_Stinna;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_MainShopV2_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0308(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FGameplayTag                           K2Node_CustomEvent_ItemToExchangeFor;              // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWI_MainShopV2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_MainShopV2_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0330(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_MainShopV2_C*                       CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_ShopType                                    Temp_byte_Variable;                                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          K2Node_Event_ItemToDropFromInventory;              // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindDropLocation_Location;                // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0380(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x03E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B[0x5];                                      // 0x044B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UItemAction_Droppable*            CallFunc_FindActionByType_ReturnValue;             // 0x0450(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PickupBase_C*                       K2Node_DynamicCast_AsBP_Pickup_Base;               // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTagStack_ReturnValue;             // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_4; // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition_1;            // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_5; // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopItemViewModel                     CallFunc_GetShopItemViewModel_ReturnValue;         // 0x04F8(0x0080)(ConstParm)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                CallFunc_GetParentCharacter_AsBP_Resident_Character_6; // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTraceFrom_Location;                    // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTraceFrom_Rotation;                    // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpectatorPawnStinna_C*                 K2Node_DynamicCast_AsSpectator_Pawn_Stinna_1;      // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2[0x6];                                      // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_Event_ItemDefinition;                       // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_OrderedDelivery;                // 0x05F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x05F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UWI_MainShopV2_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x0600(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_MainShopV2_C*                       CallFunc_Array_Get_Item_3;                         // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x061C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleServersideBoughtInShop_HandleBoughtSuccess; // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC) == 0x000010, "Wrong alignment on ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC");
static_assert(sizeof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC) == 0x000650, "Wrong size on ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, EntryPoint) == 0x000000, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable) == 0x000008, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable_1) == 0x000010, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable_2) == 0x000018, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable_3) == 0x000020, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable_4) == 0x000028, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_int_Variable) == 0x000040, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_CustomEvent_ShopItem) == 0x000058, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_CustomEvent_ShopItem' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_CustomEvent_RoomData) == 0x000078, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_CustomEvent_RoomData' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_GetParentCharacter_AsBP_Resident_Character) == 0x000090, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_GetParentCharacter_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_GetController_ReturnValue) == 0x000098, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_DynamicCast_AsPlayer_Controller) == 0x0000A0, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_GetCurrentItemTierIndex_ItemTierIndex) == 0x0000AC, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_GetCurrentItemTierIndex_ItemTierIndex' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_CustomEvent_Loaded) == 0x000100, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, Temp_object_Variable_5) == 0x000108, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_Event_Actor) == 0x000110, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, K2Node_Event_ShopItemViewModel) == 0x000118, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::K2Node_Event_ShopItemViewModel' has a wrong offset!");
static_assert(offsetof(ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000198, "Member 'ShopInteractionAC_C_ExecuteUbergraph_ShopInteractionAC::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
