#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopCar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HouseActorBase_classes.hpp"
#include "E_MaterialTypes_structs.hpp"
#include "E_ImpactEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ShopCar.ShopCar_C
// 0x0048 (0x0438 - 0x03F0)
class AShopCar_C final : public AHouseActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ShopCar_C;                          // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Car;                                            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_Sabotaged;                                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent_C*                InteractionComponent1;                             // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Smoke;                                             // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent_C*                SabotageComponent;                                 // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InteractLocation;                                  // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent_C*                InteractionComponent;                              // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerJP_MatchBP_C*          Latest_Damaging_Controller;                        // 0x0430(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Cosmetics_State_Repaired();
	void Cosmetics_State_Sabotaged();
	void ExecuteUbergraph_ShopCar(int32 EntryPoint);
	void GetMaterialType(E_MaterialTypes* MaterialType);
	void GetOptionalText(class FText* Return, class FText* Optional_Second_Line);
	void GetPriority(int32* Priority);
	void GetWidgetLocation(struct FVector* Location);
	void House_Actor_Impact_Cosmetics(const struct FVector& Location, const struct FVector& HitImpulse, E_ImpactEffect ImpactEffect);
	void IsInteractable(bool* Interactable);
	void ReceiveBeginPlay();
	void ReloadAfterHousesLoaded(bool* Return);
	void Repair();
	void Sabotage(class AActor* SabotagingActor);
	void Toggle_Focus_Highlight(bool Show);
	void Toggle_Item_Highlight(bool Show);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShopCar_C">();
	}
	static class AShopCar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShopCar_C>();
	}
};
static_assert(alignof(AShopCar_C) == 0x000008, "Wrong alignment on AShopCar_C");
static_assert(sizeof(AShopCar_C) == 0x000438, "Wrong size on AShopCar_C");
static_assert(offsetof(AShopCar_C, UberGraphFrame_ShopCar_C) == 0x0003F0, "Member 'AShopCar_C::UberGraphFrame_ShopCar_C' has a wrong offset!");
static_assert(offsetof(AShopCar_C, SK_Car) == 0x0003F8, "Member 'AShopCar_C::SK_Car' has a wrong offset!");
static_assert(offsetof(AShopCar_C, PS_Sabotaged) == 0x000400, "Member 'AShopCar_C::PS_Sabotaged' has a wrong offset!");
static_assert(offsetof(AShopCar_C, InteractionComponent1) == 0x000408, "Member 'AShopCar_C::InteractionComponent1' has a wrong offset!");
static_assert(offsetof(AShopCar_C, Smoke) == 0x000410, "Member 'AShopCar_C::Smoke' has a wrong offset!");
static_assert(offsetof(AShopCar_C, SabotageComponent) == 0x000418, "Member 'AShopCar_C::SabotageComponent' has a wrong offset!");
static_assert(offsetof(AShopCar_C, InteractLocation) == 0x000420, "Member 'AShopCar_C::InteractLocation' has a wrong offset!");
static_assert(offsetof(AShopCar_C, InteractionComponent) == 0x000428, "Member 'AShopCar_C::InteractionComponent' has a wrong offset!");
static_assert(offsetof(AShopCar_C, Latest_Damaging_Controller) == 0x000430, "Member 'AShopCar_C::Latest_Damaging_Controller' has a wrong offset!");

}

