#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_DefendAndUpgrade

#include "Basic.hpp"


namespace SDK::Params
{

// Function SOA_DefendAndUpgrade.SOA_DefendAndUpgrade_C.ExecuteUbergraph_SOA_DefendAndUpgrade
// 0x0058 (0x0058 - 0x0000)
struct SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* InteractingActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_InteractingActor;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ShopInteraction_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class ABP_ShopInteraction_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade) == 0x000008, "Wrong alignment on SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade");
static_assert(sizeof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade) == 0x000058, "Wrong size on SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, EntryPoint) == 0x000000, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, K2Node_CustomEvent_InteractingActor) == 0x000020, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::K2Node_CustomEvent_InteractingActor' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000028, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000031, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_Array_Get_Item) == 0x000048, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade, K2Node_SwitchEnum_CmpSuccess) == 0x000055, "Member 'SOA_DefendAndUpgrade_C_ExecuteUbergraph_SOA_DefendAndUpgrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SOA_DefendAndUpgrade.SOA_DefendAndUpgrade_C.OnCompletedObjective
// 0x0001 (0x0001 - 0x0000)
struct SOA_DefendAndUpgrade_C_OnCompletedObjective final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_DefendAndUpgrade_C_OnCompletedObjective) == 0x000001, "Wrong alignment on SOA_DefendAndUpgrade_C_OnCompletedObjective");
static_assert(sizeof(SOA_DefendAndUpgrade_C_OnCompletedObjective) == 0x000001, "Wrong size on SOA_DefendAndUpgrade_C_OnCompletedObjective");
static_assert(offsetof(SOA_DefendAndUpgrade_C_OnCompletedObjective, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'SOA_DefendAndUpgrade_C_OnCompletedObjective::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function SOA_DefendAndUpgrade.SOA_DefendAndUpgrade_C.OnUtilityClosetOpened
// 0x0008 (0x0008 - 0x0000)
struct SOA_DefendAndUpgrade_C_OnUtilityClosetOpened final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_DefendAndUpgrade_C_OnUtilityClosetOpened) == 0x000008, "Wrong alignment on SOA_DefendAndUpgrade_C_OnUtilityClosetOpened");
static_assert(sizeof(SOA_DefendAndUpgrade_C_OnUtilityClosetOpened) == 0x000008, "Wrong size on SOA_DefendAndUpgrade_C_OnUtilityClosetOpened");
static_assert(offsetof(SOA_DefendAndUpgrade_C_OnUtilityClosetOpened, InteractingActor) == 0x000000, "Member 'SOA_DefendAndUpgrade_C_OnUtilityClosetOpened::InteractingActor' has a wrong offset!");

}

