#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_Tutorial_03_BearTraps

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SOA_Tutorial_03_BearTraps.SOA_Tutorial_03_BearTraps_C.GetText
// 0x00D0 (0x00D0 - 0x0000)
struct SOA_Tutorial_03_BearTraps_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0010)()
};
static_assert(alignof(SOA_Tutorial_03_BearTraps_C_GetText) == 0x000008, "Wrong alignment on SOA_Tutorial_03_BearTraps_C_GetText");
static_assert(sizeof(SOA_Tutorial_03_BearTraps_C_GetText) == 0x0000D0, "Wrong size on SOA_Tutorial_03_BearTraps_C_GetText");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000018, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, K2Node_MakeArray_Array) == 0x0000B0, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_03_BearTraps_C_GetText, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'SOA_Tutorial_03_BearTraps_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

