#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_WhackAMole

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function SOA_WhackAMole.SOA_WhackAMole_C.CheckIfSubObjectiveFinished
// 0x0008 (0x0008 - 0x0000)
struct SOA_WhackAMole_C_CheckIfSubObjectiveFinished final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_CheckIfSubObjectiveFinished) == 0x000004, "Wrong alignment on SOA_WhackAMole_C_CheckIfSubObjectiveFinished");
static_assert(sizeof(SOA_WhackAMole_C_CheckIfSubObjectiveFinished) == 0x000008, "Wrong size on SOA_WhackAMole_C_CheckIfSubObjectiveFinished");
static_assert(offsetof(SOA_WhackAMole_C_CheckIfSubObjectiveFinished, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'SOA_WhackAMole_C_CheckIfSubObjectiveFinished::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CheckIfSubObjectiveFinished, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'SOA_WhackAMole_C_CheckIfSubObjectiveFinished::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.CreateRemainingTasks
// 0x00D0 (0x00D0 - 0x0000)
struct SOA_WhackAMole_C_CreateRemainingTasks final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Mole)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MoleSpawner_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Mole_Cluster;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USOD_WhackAMole_C*                      K2Node_DynamicCast_AsSOD_Whack_AMole;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MoleCluster_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_CreateRemainingTasks) == 0x000010, "Wrong alignment on SOA_WhackAMole_C_CreateRemainingTasks");
static_assert(sizeof(SOA_WhackAMole_C_CreateRemainingTasks) == 0x0000D0, "Wrong size on SOA_WhackAMole_C_CreateRemainingTasks");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, Temp_int_Variable) == 0x000000, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Array_Get_Item) == 0x000020, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, K2Node_ClassDynamicCast_AsBP_Mole_Cluster) == 0x000090, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::K2Node_ClassDynamicCast_AsBP_Mole_Cluster' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, K2Node_ClassDynamicCast_bSuccess) == 0x000098, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, K2Node_DynamicCast_AsSOD_Whack_AMole) == 0x0000A8, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::K2Node_DynamicCast_AsSOD_Whack_AMole' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C5, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_CreateRemainingTasks, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'SOA_WhackAMole_C_CreateRemainingTasks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.ExecuteUbergraph_SOA_WhackAMole
// 0x0020 (0x0020 - 0x0000)
struct SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Mole_C*                             K2Node_DynamicCast_AsBP_Mole;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole) == 0x000008, "Wrong alignment on SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole");
static_assert(sizeof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole) == 0x000020, "Wrong size on SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, EntryPoint) == 0x000000, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, K2Node_CustomEvent_DestroyedActor) == 0x000008, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, K2Node_DynamicCast_AsBP_Mole) == 0x000010, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::K2Node_DynamicCast_AsBP_Mole' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole, CallFunc_Array_RemoveItem_ReturnValue) == 0x00001A, "Member 'SOA_WhackAMole_C_ExecuteUbergraph_SOA_WhackAMole::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.Find Fitting Spawn Positions
// 0x0078 (0x0078 - 0x0000)
struct SOA_WhackAMole_C_Find_Fitting_Spawn_Positions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MoleSpawner_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MoleSpawner_C*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0038(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions) == 0x000008, "Wrong alignment on SOA_WhackAMole_C_Find_Fitting_Spawn_Positions");
static_assert(sizeof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions) == 0x000078, "Wrong size on SOA_WhackAMole_C_Find_Fitting_Spawn_Positions");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Array_Get_Item) == 0x000028, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_GetTeam_ReturnValue) == 0x000038, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_Find_Fitting_Spawn_Positions, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'SOA_WhackAMole_C_Find_Fitting_Spawn_Positions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.GetText
// 0x0080 (0x0080 - 0x0000)
struct SOA_WhackAMole_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
};
static_assert(alignof(SOA_WhackAMole_C_GetText) == 0x000008, "Wrong alignment on SOA_WhackAMole_C_GetText");
static_assert(sizeof(SOA_WhackAMole_C_GetText) == 0x000080, "Wrong size on SOA_WhackAMole_C_GetText");
static_assert(offsetof(SOA_WhackAMole_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_WhackAMole_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_GetText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'SOA_WhackAMole_C_GetText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_GetText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'SOA_WhackAMole_C_GetText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_GetText, K2Node_MakeArray_Array) == 0x000060, "Member 'SOA_WhackAMole_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_GetText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'SOA_WhackAMole_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.Mole Destroyed
// 0x0008 (0x0008 - 0x0000)
struct SOA_WhackAMole_C_Mole_Destroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_Mole_Destroyed) == 0x000008, "Wrong alignment on SOA_WhackAMole_C_Mole_Destroyed");
static_assert(sizeof(SOA_WhackAMole_C_Mole_Destroyed) == 0x000008, "Wrong size on SOA_WhackAMole_C_Mole_Destroyed");
static_assert(offsetof(SOA_WhackAMole_C_Mole_Destroyed, DestroyedActor) == 0x000000, "Member 'SOA_WhackAMole_C_Mole_Destroyed::DestroyedActor' has a wrong offset!");

// Function SOA_WhackAMole.SOA_WhackAMole_C.SaveMolesAssociatedWithTeam
// 0x0038 (0x0038 - 0x0000)
struct SOA_WhackAMole_C_SaveMolesAssociatedWithTeam final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Mole_C*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mole_C*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam) == 0x000008, "Wrong alignment on SOA_WhackAMole_C_SaveMolesAssociatedWithTeam");
static_assert(sizeof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam) == 0x000038, "Wrong size on SOA_WhackAMole_C_SaveMolesAssociatedWithTeam");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_Array_Get_Item) == 0x000028, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_WhackAMole_C_SaveMolesAssociatedWithTeam, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'SOA_WhackAMole_C_SaveMolesAssociatedWithTeam::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

