#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_OpenInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SOA_DefaultItemTip_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOA_OpenInventory.SOA_OpenInventory_C
// 0x0018 (0x02E8 - 0x02D0)
class ASOA_OpenInventory_C final : public ASOA_DefaultItemTip_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_ObjectiveList_C*                    RemoveWidget;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCompleted;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckIfSubObjectiveIsCompleted();
	void ExecuteUbergraph_SOA_OpenInventory(int32 EntryPoint);
	void InventoryOpened_Event(class APlayerController* PlayerController);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SOA_OpenInventory_C">();
	}
	static class ASOA_OpenInventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOA_OpenInventory_C>();
	}
};
static_assert(alignof(ASOA_OpenInventory_C) == 0x000008, "Wrong alignment on ASOA_OpenInventory_C");
static_assert(sizeof(ASOA_OpenInventory_C) == 0x0002E8, "Wrong size on ASOA_OpenInventory_C");
static_assert(offsetof(ASOA_OpenInventory_C, UberGraphFrame) == 0x0002D0, "Member 'ASOA_OpenInventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASOA_OpenInventory_C, RemoveWidget) == 0x0002D8, "Member 'ASOA_OpenInventory_C::RemoveWidget' has a wrong offset!");
static_assert(offsetof(ASOA_OpenInventory_C, IsCompleted) == 0x0002E0, "Member 'ASOA_OpenInventory_C::IsCompleted' has a wrong offset!");

}

