#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_OpenInventory

#include "Basic.hpp"


namespace SDK::Params
{

// Function SOA_OpenInventory.SOA_OpenInventory_C.CheckIfSubObjectiveIsCompleted
// 0x0001 (0x0001 - 0x0000)
struct SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted) == 0x000001, "Wrong alignment on SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted");
static_assert(sizeof(SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted) == 0x000001, "Wrong size on SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted");
static_assert(offsetof(SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'SOA_OpenInventory_C_CheckIfSubObjectiveIsCompleted::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function SOA_OpenInventory.SOA_OpenInventory_C.ExecuteUbergraph_SOA_OpenInventory
// 0x0040 (0x0040 - 0x0000)
struct SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerJP_MatchBP_C*          K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory) == 0x000008, "Wrong alignment on SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory");
static_assert(sizeof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory) == 0x000040, "Wrong size on SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, EntryPoint) == 0x000000, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, K2Node_CustomEvent_PlayerController) == 0x000008, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP) == 0x000030, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::K2Node_DynamicCast_AsPlayer_Controller_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SOA_OpenInventory_C_ExecuteUbergraph_SOA_OpenInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SOA_OpenInventory.SOA_OpenInventory_C.InventoryOpened_Event
// 0x0008 (0x0008 - 0x0000)
struct SOA_OpenInventory_C_InventoryOpened_Event final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_OpenInventory_C_InventoryOpened_Event) == 0x000008, "Wrong alignment on SOA_OpenInventory_C_InventoryOpened_Event");
static_assert(sizeof(SOA_OpenInventory_C_InventoryOpened_Event) == 0x000008, "Wrong size on SOA_OpenInventory_C_InventoryOpened_Event");
static_assert(offsetof(SOA_OpenInventory_C_InventoryOpened_Event, PlayerController) == 0x000000, "Member 'SOA_OpenInventory_C_InventoryOpened_Event::PlayerController' has a wrong offset!");

}

