#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_ItemTip

#include "Basic.hpp"

#include "S_ItemToolTips_structs.hpp"


namespace SDK::Params
{

// Function SOA_ItemTip.SOA_ItemTip_C.GetText
// 0x0040 (0x0040 - 0x0000)
struct SOA_ItemTip_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObjectiveAction_ItemName*              K2Node_DynamicCast_AsObjective_Action_Item_Name;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemToolTips                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_ItemTip_C_GetText) == 0x000008, "Wrong alignment on SOA_ItemTip_C_GetText");
static_assert(sizeof(SOA_ItemTip_C_GetText) == 0x000040, "Wrong size on SOA_ItemTip_C_GetText");
static_assert(offsetof(SOA_ItemTip_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_ItemTip_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ItemTip_C_GetText, CallFunc_FindActionByType_ReturnValue) == 0x000010, "Member 'SOA_ItemTip_C_GetText::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_ItemTip_C_GetText, K2Node_DynamicCast_AsObjective_Action_Item_Name) == 0x000018, "Member 'SOA_ItemTip_C_GetText::K2Node_DynamicCast_AsObjective_Action_Item_Name' has a wrong offset!");
static_assert(offsetof(SOA_ItemTip_C_GetText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SOA_ItemTip_C_GetText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_ItemTip_C_GetText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'SOA_ItemTip_C_GetText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SOA_ItemTip_C_GetText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000038, "Member 'SOA_ItemTip_C_GetText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

