#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_AttackYourNeighbor

#include "Basic.hpp"


namespace SDK::Params
{

// Function SOA_AttackYourNeighbor.SOA_AttackYourNeighbor_C.ExecuteUbergraph_SOA_AttackYourNeighbor
// 0x0070 (0x0070 - 0x0000)
struct SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HouseEssential_Cube_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HouseEssential_Cube_C*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CaptureTheFlagDeedSafe_C*>   CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0050(0x0010)(ReferenceParm)
	class ABP_CaptureTheFlagDeedSafe_C*           CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor) == 0x000008, "Wrong alignment on SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor");
static_assert(sizeof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor) == 0x000070, "Wrong size on SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, EntryPoint) == 0x000000, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Array_Get_Item) == 0x000030, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000050, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'SOA_AttackYourNeighbor_C_ExecuteUbergraph_SOA_AttackYourNeighbor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function SOA_AttackYourNeighbor.SOA_AttackYourNeighbor_C.Sub Objective Completed After Resources
// 0x0001 (0x0001 - 0x0000)
struct SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources) == 0x000001, "Wrong alignment on SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources");
static_assert(sizeof(SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources) == 0x000001, "Wrong size on SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources");
static_assert(offsetof(SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'SOA_AttackYourNeighbor_C_Sub_Objective_Completed_After_Resources::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

