#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_Tutorial_13_CrateDelivery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "S_TutorialTaskCompletedPayload_structs.hpp"


namespace SDK::Params
{

// Function SOA_Tutorial_13_CrateDelivery.SOA_Tutorial_13_CrateDelivery_C.ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery
// 0x00E0 (0x00E0 - 0x0000)
struct SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCompleted_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResourcePayload                       Temp_struct_Variable;                              // 0x0008(0x0028)(NoDestructor)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResourcePayload                       Temp_struct_Variable_1;                            // 0x0050(0x0028)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USOD_Tutorial_13_CrateDelivery_C*       K2Node_DynamicCast_AsSOD_Tutorial_13_Crate_Delivery; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsSOD_Tutorial_Task;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialTaskCompletedPayload        K2Node_MakeStruct_S_TutorialTaskCompletedPayload;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery) == 0x000008, "Wrong alignment on SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery");
static_assert(sizeof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery) == 0x0000E0, "Wrong size on SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, EntryPoint) == 0x000000, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::EntryPoint' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_GetIsCompleted_ReturnValue) == 0x000004, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_GetIsCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, Temp_struct_Variable) == 0x000008, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_CustomEvent_ProxyObject) == 0x000030, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_CustomEvent_ActualChannel) == 0x000038, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, Temp_struct_Variable_1) == 0x000050, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, Temp_struct_Variable_2) == 0x000078, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, Temp_object_Variable) == 0x000080, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_GetPayload_ReturnValue) == 0x000088, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_Round_ReturnValue) == 0x00008C, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000098, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A0, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_DynamicCast_AsSOD_Tutorial_13_Crate_Delivery) == 0x0000B0, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_DynamicCast_AsSOD_Tutorial_13_Crate_Delivery' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_ClassDynamicCast_AsSOD_Tutorial_Task) == 0x0000C0, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_ClassDynamicCast_AsSOD_Tutorial_Task' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_ClassDynamicCast_bSuccess) == 0x0000C8, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, K2Node_MakeStruct_S_TutorialTaskCompletedPayload) == 0x0000D0, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::K2Node_MakeStruct_S_TutorialTaskCompletedPayload' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery, CallFunc_Round_A_ImplicitCast) == 0x0000D8, "Member 'SOA_Tutorial_13_CrateDelivery_C_ExecuteUbergraph_SOA_Tutorial_13_CrateDelivery::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function SOA_Tutorial_13_CrateDelivery.SOA_Tutorial_13_CrateDelivery_C.GetText
// 0x0030 (0x0030 - 0x0000)
struct SOA_Tutorial_13_CrateDelivery_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0010)()
};
static_assert(alignof(SOA_Tutorial_13_CrateDelivery_C_GetText) == 0x000008, "Wrong alignment on SOA_Tutorial_13_CrateDelivery_C_GetText");
static_assert(sizeof(SOA_Tutorial_13_CrateDelivery_C_GetText) == 0x000030, "Wrong size on SOA_Tutorial_13_CrateDelivery_C_GetText");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_GetText, ReturnValue) == 0x000000, "Member 'SOA_Tutorial_13_CrateDelivery_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_GetText, K2Node_MakeArray_Array) == 0x000010, "Member 'SOA_Tutorial_13_CrateDelivery_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_GetText, CallFunc_Format_ReturnValue) == 0x000020, "Member 'SOA_Tutorial_13_CrateDelivery_C_GetText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SOA_Tutorial_13_CrateDelivery.SOA_Tutorial_13_CrateDelivery_C.OnMessageReceived_576E97214F2D9154E355F697E986B696
// 0x0010 (0x0010 - 0x0000)
struct SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696) == 0x000008, "Wrong alignment on SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696");
static_assert(sizeof(SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696) == 0x000010, "Wrong size on SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696, ProxyObject) == 0x000000, "Member 'SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696::ProxyObject' has a wrong offset!");
static_assert(offsetof(SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696, ActualChannel) == 0x000008, "Member 'SOA_Tutorial_13_CrateDelivery_C_OnMessageReceived_576E97214F2D9154E355F697E986B696::ActualChannel' has a wrong offset!");

}

