#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOA_WhackAMole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOA_WhackAMole.SOA_WhackAMole_C
// 0x0030 (0x0300 - 0x02D0)
class ASOA_WhackAMole_C final : public ASubObjective
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         MolesLeftToWhack;                                  // 0x02D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MoleSpawner_C*>              SpawnPositions;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_Mole_C*>                     MolesAssociatedWithTeam;                           // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void CheckIfSubObjectiveFinished();
	void CreateRemainingTasks();
	void ExecuteUbergraph_SOA_WhackAMole(int32 EntryPoint);
	void Find_Fitting_Spawn_Positions();
	class FText GetText();
	void Mole_Destroyed(class AActor* DestroyedActor);
	void OnRep_MolesLeftToWhack();
	void ReceiveBeginPlay();
	void SaveMolesAssociatedWithTeam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SOA_WhackAMole_C">();
	}
	static class ASOA_WhackAMole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOA_WhackAMole_C>();
	}
};
static_assert(alignof(ASOA_WhackAMole_C) == 0x000008, "Wrong alignment on ASOA_WhackAMole_C");
static_assert(sizeof(ASOA_WhackAMole_C) == 0x000300, "Wrong size on ASOA_WhackAMole_C");
static_assert(offsetof(ASOA_WhackAMole_C, UberGraphFrame) == 0x0002D0, "Member 'ASOA_WhackAMole_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASOA_WhackAMole_C, MolesLeftToWhack) == 0x0002D8, "Member 'ASOA_WhackAMole_C::MolesLeftToWhack' has a wrong offset!");
static_assert(offsetof(ASOA_WhackAMole_C, SpawnPositions) == 0x0002E0, "Member 'ASOA_WhackAMole_C::SpawnPositions' has a wrong offset!");
static_assert(offsetof(ASOA_WhackAMole_C, MolesAssociatedWithTeam) == 0x0002F0, "Member 'ASOA_WhackAMole_C::MolesAssociatedWithTeam' has a wrong offset!");

}

