#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectatorPawnStinna

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpectatorPawnStinna.SpectatorPawnStinna_C.ExecuteUbergraph_SpectatorPawnStinna
// 0x0580 (0x0580 - 0x0000)
struct SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0028(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0090(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00F8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9_0;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0178(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11_0;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12;                             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTargetingRequestHandle                K2Node_CustomEvent_TargetingHandle;                // 0x01E0(0x0004)(NoDestructor)
	TDelegate<void(const struct FTargetingRequestHandle& TargetingHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTargetingRequestHandle                Temp_struct_Variable;                              // 0x01F4(0x0004)(NoDestructor)
	class UTargetingSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetTargetingResultsActors_Targets;        // 0x0200(0x0010)(ReferenceParm)
	struct FKey                                   K2Node_InputDebugKeyEvent_Key;                     // 0x0210(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_InputDebugKeyEvent_ActionValue;             // 0x0228(0x0020)(NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0268(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0290(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_13;                             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15;                             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_16;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x02D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x0300(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_16_0;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15_0;                           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_3; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacter*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0350(0x0010)(ReferenceParm)
	double                                        Temp_real_Variable_17;                             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_Array_Get_Item_1;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x03B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_18;                             // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x04C0(0x0010)(ReferenceParm)
	double                                        Temp_real_Variable_19;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_6;                            // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0510(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0538(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PerformTargeting*          CallFunc_PerformFilteringRequest_ReturnValue;      // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_19_0;                           // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_18_0;                           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_4; // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveRight_Val_ImplicitCast;               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveForward_Val_ImplicitCast;             // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveUp_World_Val_ImplicitCast;            // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MoveUp_World_Val_ImplicitCast_1;          // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TurnAtRate_Rate_ImplicitCast;             // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LookUpAtRate_Rate_ImplicitCast;           // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna) == 0x000008, "Wrong alignment on SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna");
static_assert(sizeof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna) == 0x000580, "Wrong size on SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, EntryPoint) == 0x000000, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable) == 0x000008, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable) == 0x000010, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_1) == 0x000018, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_2) == 0x000020, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000028, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x000048, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x00004C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x000050, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000058, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_1) == 0x000060, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_3) == 0x000068, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_3_0) == 0x000070, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_4) == 0x000078, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_5) == 0x000080, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_4_0) == 0x000088, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000090, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x0000B0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x0000B4, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x0000B8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_2) == 0x0000C0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000C8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_6) == 0x0000D0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_7) == 0x0000D8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_6_0) == 0x0000E0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_7_0) == 0x0000E8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_7_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_bool_Variable) == 0x0000F0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000F8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000118, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00011C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000120, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000128, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000130, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_3) == 0x000138, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_8) == 0x000140, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_8_0) == 0x000148, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_8_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_9) == 0x000150, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_bool_Variable_1) == 0x000158, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_9_0) == 0x000160, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_9_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000168, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000170, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000178, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000198, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00019C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0001A0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_4) == 0x0001A8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x0001B0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_10) == 0x0001B8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_11) == 0x0001C0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_10_0) == 0x0001C8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_10_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_11_0) == 0x0001D0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_11_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_12) == 0x0001D8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_12' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_CustomEvent_TargetingHandle) == 0x0001E0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_CustomEvent_TargetingHandle' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_CreateDelegate_OutputDelegate) == 0x0001E4, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_struct_Variable) == 0x0001F4, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0001F8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetTargetingResultsActors_Targets) == 0x000200, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetTargetingResultsActors_Targets' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_InputDebugKeyEvent_Key) == 0x000210, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_InputDebugKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_InputDebugKeyEvent_ActionValue) == 0x000228, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_InputDebugKeyEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Array_Get_Item) == 0x000248, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_AsCharacter) == 0x000258, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_byte_Variable) == 0x000261, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000268, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000288, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00028C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x000290, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_13) == 0x000298, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_13' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_0) == 0x0002A0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_1_0) == 0x0002A8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2) == 0x0002B0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_14) == 0x0002B8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_14' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_15) == 0x0002C0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_15' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_16) == 0x0002C8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_16' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_5) == 0x0002D0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_6) == 0x0002D8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_6) == 0x0002F8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_6) == 0x0002FC, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_6) == 0x000300, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetPlayerController_ReturnValue) == 0x000308, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_IsValid_ReturnValue) == 0x000310, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_K2_GetPawn_ReturnValue) == 0x000318, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_16_0) == 0x000320, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_16_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_15_0) == 0x000328, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_15_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_3) == 0x000330, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000338, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_bSuccess_1) == 0x000340, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_Event_DeltaSeconds) == 0x000344, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000348, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetAllActorsOfClass_OutActors) == 0x000350, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_17) == 0x000360, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_17' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Array_Get_Item_1) == 0x000368, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_IsValid_ReturnValue_1) == 0x000370, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000378, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Add_IntInt_ReturnValue) == 0x000390, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Add_VectorVector_ReturnValue) == 0x000398, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Percent_IntInt_ReturnValue) == 0x0003B0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0003B8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0004B0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_18) == 0x0004B8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_18' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0004C0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_19) == 0x0004D0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_19' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_AsTeamable_Interface) == 0x0004D8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_bSuccess_2) == 0x0004E8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_AsCharacter_1) == 0x0004F0, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_DynamicCast_bSuccess_3) == 0x0004F8, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_GetTeamID_ReturnValue) == 0x0004F9, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Array_Find_ReturnValue) == 0x0004FC, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000500, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_object_Variable_6) == 0x000508, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ActionValue_5) == 0x000510, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ActionValue_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_ElapsedTime_5) == 0x000530, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_ElapsedTime_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_TriggeredTime_5) == 0x000534, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_TriggeredTime_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, K2Node_EnhancedInputActionEvent_SourceAction_5) == 0x000538, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::K2Node_EnhancedInputActionEvent_SourceAction_5' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_PerformFilteringRequest_ReturnValue) == 0x000540, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_PerformFilteringRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_IsValid_ReturnValue_2) == 0x000548, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_19_0) == 0x000550, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_19_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, Temp_real_Variable_18_0) == 0x000558, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::Temp_real_Variable_18_0' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_4) == 0x000560, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_MoveRight_Val_ImplicitCast) == 0x000568, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_MoveRight_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_MoveForward_Val_ImplicitCast) == 0x00056C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_MoveForward_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_MoveUp_World_Val_ImplicitCast) == 0x000570, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_MoveUp_World_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_MoveUp_World_Val_ImplicitCast_1) == 0x000574, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_MoveUp_World_Val_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_TurnAtRate_Rate_ImplicitCast) == 0x000578, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_TurnAtRate_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna, CallFunc_LookUpAtRate_Rate_ImplicitCast) == 0x00057C, "Member 'SpectatorPawnStinna_C_ExecuteUbergraph_SpectatorPawnStinna::CallFunc_LookUpAtRate_Rate_ImplicitCast' has a wrong offset!");

// Function SpectatorPawnStinna.SpectatorPawnStinna_C.InpActEvt_IA_Crouch_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct SpectatorPawnStinna_C_InpActEvt_IA_Crouch_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpectatorPawnStinna_C_InpActEvt_IA_Crouch_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on SpectatorPawnStinna_C_InpActEvt_IA_Crouch_K2Node_EnhancedInputActionEvent_1");
