#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StaminaComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StaminaComponent.StaminaComponent_C
// 0x0030 (0x00D0 - 0x00A0)
class UStaminaComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaxStamina;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentStamina;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_Character_Attributes_C*             WI_CharacterAttributes;                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PC;                                                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWI_StaminaBar_C*                       W_StaminaBar;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StaminaComponent(int32 EntryPoint);
	void Get_Attributes(class UWI_StaminaBar_C** WI_Attributes);
	void Initialize(double MaxStamina_0, class APlayerController* Owner);
	void SetVisiblity(bool Visible);
	void StaminaChanged(double NewStamina, double MaxStamina_0);
	void Update_Max_Stamina(double Max_Health);
	void Update_Stamina_Bar_Percentage();
	void Update_Stamina_Bar_Widget_Text();
	void UpdateStaminaBarColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StaminaComponent_C">();
	}
	static class UStaminaComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaminaComponent_C>();
	}
};
static_assert(alignof(UStaminaComponent_C) == 0x000008, "Wrong alignment on UStaminaComponent_C");
static_assert(sizeof(UStaminaComponent_C) == 0x0000D0, "Wrong size on UStaminaComponent_C");
static_assert(offsetof(UStaminaComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UStaminaComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStaminaComponent_C, MaxStamina) == 0x0000A8, "Member 'UStaminaComponent_C::MaxStamina' has a wrong offset!");
static_assert(offsetof(UStaminaComponent_C, CurrentStamina) == 0x0000B0, "Member 'UStaminaComponent_C::CurrentStamina' has a wrong offset!");
static_assert(offsetof(UStaminaComponent_C, WI_CharacterAttributes) == 0x0000B8, "Member 'UStaminaComponent_C::WI_CharacterAttributes' has a wrong offset!");
static_assert(offsetof(UStaminaComponent_C, PC) == 0x0000C0, "Member 'UStaminaComponent_C::PC' has a wrong offset!");
static_assert(offsetof(UStaminaComponent_C, W_StaminaBar) == 0x0000C8, "Member 'UStaminaComponent_C::W_StaminaBar' has a wrong offset!");

}

