#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Steak_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Steak_PostProcess_AnimBP.Steak_PostProcess_AnimBP_C
// 0x0AB0 (0x0E20 - 0x0370)
class USteak_PostProcess_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x03B0(0x0970)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D40(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0D60(0x00B8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Steak_PostProcess_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Steak_PostProcess_AnimBP_C">();
	}
	static class USteak_PostProcess_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteak_PostProcess_AnimBP_C>();
	}
};
static_assert(alignof(USteak_PostProcess_AnimBP_C) == 0x000010, "Wrong alignment on USteak_PostProcess_AnimBP_C");
static_assert(sizeof(USteak_PostProcess_AnimBP_C) == 0x000E20, "Wrong size on USteak_PostProcess_AnimBP_C");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'USteak_PostProcess_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'USteak_PostProcess_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'USteak_PostProcess_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'USteak_PostProcess_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimGraphNode_RigidBody) == 0x0003B0, "Member 'USteak_PostProcess_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000D20, "Member 'USteak_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000D40, "Member 'USteak_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USteak_PostProcess_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000D60, "Member 'USteak_PostProcess_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

