#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_FullFenceDetatils

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_FullFenceDetatils.Struct_FullFenceDetatils
// 0x0078 (0x0078 - 0x0000)
struct FStruct_FullFenceDetatils final
{
public:
	bool                                          EndWithSmallFence_4_898A89F8464A94B164442E9E131A7F79; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddFirstColumn_7_457D5689429CE2E309819B9742717CFA; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddMiddleColumns_8_B6608B1945CA3F10276207B78569A867; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddLastColumn_11_2EB7DF76484D5F0AA570F58FFD3CBE2C; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            FenceMesh_26_D16BF9404EE99FB7673E0CB9056B1CD3;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SmallFenceMesh_25_D2A781BB41556AF1BCEE218311484054; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FenceMaterial_23_4760610D45C4A9BC3D9903AAC1BC5B2E; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ColumnMesh_24_08AE10474F9F959F28791590E81F7A32;    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ColumnMaterial_22_CD6A216C4AB07757BA5E9E9D7420C5D8; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LastColumnOffset_31_1ABCEF2945FA67BE53F6E8A6D611FF96; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ColumnScale_32_6BD0A63D416B7E91A33F648FD02CE911;   // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalFenceOffset_39_2C13B2C14927EA1FE6AA4FAD3D0272B8; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SmallerFenceOffset_40_936E55EB4F14E0A78EF0549BE6986E1D; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FenceScale_38_6709CC84475D0FEB02D6A5B3A64C5DDA;    // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_FullFenceDetatils) == 0x000008, "Wrong alignment on FStruct_FullFenceDetatils");
static_assert(sizeof(FStruct_FullFenceDetatils) == 0x000078, "Wrong size on FStruct_FullFenceDetatils");
static_assert(offsetof(FStruct_FullFenceDetatils, EndWithSmallFence_4_898A89F8464A94B164442E9E131A7F79) == 0x000000, "Member 'FStruct_FullFenceDetatils::EndWithSmallFence_4_898A89F8464A94B164442E9E131A7F79' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, AddFirstColumn_7_457D5689429CE2E309819B9742717CFA) == 0x000001, "Member 'FStruct_FullFenceDetatils::AddFirstColumn_7_457D5689429CE2E309819B9742717CFA' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, AddMiddleColumns_8_B6608B1945CA3F10276207B78569A867) == 0x000002, "Member 'FStruct_FullFenceDetatils::AddMiddleColumns_8_B6608B1945CA3F10276207B78569A867' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, AddLastColumn_11_2EB7DF76484D5F0AA570F58FFD3CBE2C) == 0x000003, "Member 'FStruct_FullFenceDetatils::AddLastColumn_11_2EB7DF76484D5F0AA570F58FFD3CBE2C' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, FenceMesh_26_D16BF9404EE99FB7673E0CB9056B1CD3) == 0x000008, "Member 'FStruct_FullFenceDetatils::FenceMesh_26_D16BF9404EE99FB7673E0CB9056B1CD3' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, SmallFenceMesh_25_D2A781BB41556AF1BCEE218311484054) == 0x000010, "Member 'FStruct_FullFenceDetatils::SmallFenceMesh_25_D2A781BB41556AF1BCEE218311484054' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, FenceMaterial_23_4760610D45C4A9BC3D9903AAC1BC5B2E) == 0x000018, "Member 'FStruct_FullFenceDetatils::FenceMaterial_23_4760610D45C4A9BC3D9903AAC1BC5B2E' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, ColumnMesh_24_08AE10474F9F959F28791590E81F7A32) == 0x000020, "Member 'FStruct_FullFenceDetatils::ColumnMesh_24_08AE10474F9F959F28791590E81F7A32' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, ColumnMaterial_22_CD6A216C4AB07757BA5E9E9D7420C5D8) == 0x000028, "Member 'FStruct_FullFenceDetatils::ColumnMaterial_22_CD6A216C4AB07757BA5E9E9D7420C5D8' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, LastColumnOffset_31_1ABCEF2945FA67BE53F6E8A6D611FF96) == 0x000030, "Member 'FStruct_FullFenceDetatils::LastColumnOffset_31_1ABCEF2945FA67BE53F6E8A6D611FF96' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, ColumnScale_32_6BD0A63D416B7E91A33F648FD02CE911) == 0x000038, "Member 'FStruct_FullFenceDetatils::ColumnScale_32_6BD0A63D416B7E91A33F648FD02CE911' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, NormalFenceOffset_39_2C13B2C14927EA1FE6AA4FAD3D0272B8) == 0x000050, "Member 'FStruct_FullFenceDetatils::NormalFenceOffset_39_2C13B2C14927EA1FE6AA4FAD3D0272B8' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, SmallerFenceOffset_40_936E55EB4F14E0A78EF0549BE6986E1D) == 0x000058, "Member 'FStruct_FullFenceDetatils::SmallerFenceOffset_40_936E55EB4F14E0A78EF0549BE6986E1D' has a wrong offset!");
static_assert(offsetof(FStruct_FullFenceDetatils, FenceScale_38_6709CC84475D0FEB02D6A5B3A64C5DDA) == 0x000060, "Member 'FStruct_FullFenceDetatils::FenceScale_38_6709CC84475D0FEB02D6A5B3A64C5DDA' has a wrong offset!");

}

