#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeEndCondition

#include "Basic.hpp"


namespace SDK::Params
{

// Function TimeEndCondition.TimeEndCondition_C.CreateWidget
// 0x0010 (0x0010 - 0x0000)
struct TimeEndCondition_C_CreateWidget final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeEndConditionWI_C*                  CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndCondition_C_CreateWidget) == 0x000008, "Wrong alignment on TimeEndCondition_C_CreateWidget");
static_assert(sizeof(TimeEndCondition_C_CreateWidget) == 0x000010, "Wrong size on TimeEndCondition_C_CreateWidget");
static_assert(offsetof(TimeEndCondition_C_CreateWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'TimeEndCondition_C_CreateWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndCondition_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'TimeEndCondition_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function TimeEndCondition.TimeEndCondition_C.ExecuteUbergraph_TimeEndCondition
// 0x0008 (0x0008 - 0x0000)
struct TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition) == 0x000004, "Wrong alignment on TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition");
static_assert(sizeof(TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition) == 0x000008, "Wrong size on TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition");
static_assert(offsetof(TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition, EntryPoint) == 0x000000, "Member 'TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'TimeEndCondition_C_ExecuteUbergraph_TimeEndCondition::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function TimeEndCondition.TimeEndCondition_C.OnRep_EndTime
// 0x0001 (0x0001 - 0x0000)
struct TimeEndCondition_C_OnRep_EndTime final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndCondition_C_OnRep_EndTime) == 0x000001, "Wrong alignment on TimeEndCondition_C_OnRep_EndTime");
static_assert(sizeof(TimeEndCondition_C_OnRep_EndTime) == 0x000001, "Wrong size on TimeEndCondition_C_OnRep_EndTime");
static_assert(offsetof(TimeEndCondition_C_OnRep_EndTime, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'TimeEndCondition_C_OnRep_EndTime::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function TimeEndCondition.TimeEndCondition_C.SetEndTime
// 0x0018 (0x0018 - 0x0000)
struct TimeEndCondition_C_SetEndTime final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeEndCondition_C_SetEndTime) == 0x000008, "Wrong alignment on TimeEndCondition_C_SetEndTime");
static_assert(sizeof(TimeEndCondition_C_SetEndTime) == 0x000018, "Wrong size on TimeEndCondition_C_SetEndTime");
static_assert(offsetof(TimeEndCondition_C_SetEndTime, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'TimeEndCondition_C_SetEndTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndCondition_C_SetEndTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000008, "Member 'TimeEndCondition_C_SetEndTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeEndCondition_C_SetEndTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'TimeEndCondition_C_SetEndTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

}

