#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TreeRustler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TreeRustler.TreeRustler_C
// 0x0018 (0x02A8 - 0x0290)
class ATreeRustler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TreeRustler(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Rustle_Tree();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TreeRustler_C">();
	}
	static class ATreeRustler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATreeRustler_C>();
	}
};
static_assert(alignof(ATreeRustler_C) == 0x000008, "Wrong alignment on ATreeRustler_C");
static_assert(sizeof(ATreeRustler_C) == 0x0002A8, "Wrong size on ATreeRustler_C");
static_assert(offsetof(ATreeRustler_C, UberGraphFrame) == 0x000290, "Member 'ATreeRustler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATreeRustler_C, Audio) == 0x000298, "Member 'ATreeRustler_C::Audio' has a wrong offset!");
static_assert(offsetof(ATreeRustler_C, DefaultSceneRoot) == 0x0002A0, "Member 'ATreeRustler_C::DefaultSceneRoot' has a wrong offset!");

}

