#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TT_InteractionTrace

#include "Basic.hpp"

#include "TargetingSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TT_InteractionTrace.TT_InteractionTrace_C.GetSourceOffset
// 0x0060 (0x0060 - 0x0000)
struct TT_InteractionTrace_C_GetSourceOffset final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetingSubsystem*                    CallFunc_GetTargetingSubsystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_InteractionTraceOffset_C> K2Node_DynamicCast_AsI_Interaction_Trace_Offset;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractionTraceOffset_Return;         // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TT_InteractionTrace_C_GetSourceOffset) == 0x000008, "Wrong alignment on TT_InteractionTrace_C_GetSourceOffset");
static_assert(sizeof(TT_InteractionTrace_C_GetSourceOffset) == 0x000060, "Wrong size on TT_InteractionTrace_C_GetSourceOffset");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, TargetingHandle) == 0x000000, "Member 'TT_InteractionTrace_C_GetSourceOffset::TargetingHandle' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, ReturnValue) == 0x000008, "Member 'TT_InteractionTrace_C_GetSourceOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, CallFunc_GetTargetingSubsystem_ReturnValue) == 0x000020, "Member 'TT_InteractionTrace_C_GetSourceOffset::CallFunc_GetTargetingSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'TT_InteractionTrace_C_GetSourceOffset::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, K2Node_DynamicCast_AsI_Interaction_Trace_Offset) == 0x000030, "Member 'TT_InteractionTrace_C_GetSourceOffset::K2Node_DynamicCast_AsI_Interaction_Trace_Offset' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'TT_InteractionTrace_C_GetSourceOffset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetSourceOffset, CallFunc_GetInteractionTraceOffset_Return) == 0x000048, "Member 'TT_InteractionTrace_C_GetSourceOffset::CallFunc_GetInteractionTraceOffset_Return' has a wrong offset!");

// Function TT_InteractionTrace.TT_InteractionTrace_C.GetTraceLength
// 0x0040 (0x0040 - 0x0000)
struct TT_InteractionTrace_C_GetTraceLength final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetingSubsystem*                    CallFunc_GetTargetingSubsystem_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_InteractionTraceOffset_C> K2Node_DynamicCast_AsI_Interaction_Trace_Offset;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetInteractionTraceLength_Return;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TT_InteractionTrace_C_GetTraceLength) == 0x000008, "Wrong alignment on TT_InteractionTrace_C_GetTraceLength");
static_assert(sizeof(TT_InteractionTrace_C_GetTraceLength) == 0x000040, "Wrong size on TT_InteractionTrace_C_GetTraceLength");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, TargetingHandle) == 0x000000, "Member 'TT_InteractionTrace_C_GetTraceLength::TargetingHandle' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, ReturnValue) == 0x000004, "Member 'TT_InteractionTrace_C_GetTraceLength::ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, CallFunc_GetTargetingSubsystem_ReturnValue) == 0x000008, "Member 'TT_InteractionTrace_C_GetTraceLength::CallFunc_GetTargetingSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'TT_InteractionTrace_C_GetTraceLength::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, K2Node_DynamicCast_AsI_Interaction_Trace_Offset) == 0x000018, "Member 'TT_InteractionTrace_C_GetTraceLength::K2Node_DynamicCast_AsI_Interaction_Trace_Offset' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TT_InteractionTrace_C_GetTraceLength::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, CallFunc_GetInteractionTraceLength_Return) == 0x000030, "Member 'TT_InteractionTrace_C_GetTraceLength::CallFunc_GetInteractionTraceLength_Return' has a wrong offset!");
static_assert(offsetof(TT_InteractionTrace_C_GetTraceLength, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000038, "Member 'TT_InteractionTrace_C_GetTraceLength::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

}

