#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Role

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_Section_structs.hpp"
#include "S_ImageInsertion_structs.hpp"


namespace SDK::Params
{

// Function UI_Role.UI_Role_C.ExecuteUbergraph_UI_Role
// 0x0138 (0x0138 - 0x0000)
struct UI_Role_C_ExecuteUbergraph_UI_Role final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_SectionWithoutTitle_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Spacer_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Image_C*                            CallFunc_Create_ReturnValue_2;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Spacer_C*                           CallFunc_Create_ReturnValue_3;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Spacer_C*                           CallFunc_Create_ReturnValue_4;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Section_C*                          CallFunc_Create_ReturnValue_5;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_Section                             CallFunc_Array_Get_Item;                           // 0x0060(0x0058)(HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_ImageInsertion                      CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0028)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_4;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_5;      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Role_C_ExecuteUbergraph_UI_Role) == 0x000008, "Wrong alignment on UI_Role_C_ExecuteUbergraph_UI_Role");
static_assert(sizeof(UI_Role_C_ExecuteUbergraph_UI_Role) == 0x000138, "Wrong size on UI_Role_C_ExecuteUbergraph_UI_Role");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, EntryPoint) == 0x000000, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue_2) == 0x000020, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue_3) == 0x000028, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue_4) == 0x000030, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Create_ReturnValue_5) == 0x000048, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, K2Node_Event_IsDesignTime) == 0x000050, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000058, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Array_Get_Item) == 0x000060, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0000B8, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x0000C8, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue_3) == 0x0000F8, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_Less_IntInt_ReturnValue_1) == 0x000104, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue_4) == 0x000108, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_AddChildToVerticalBox_ReturnValue_5) == 0x000110, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_AddChildToVerticalBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_MakeVector2D_ReturnValue) == 0x000118, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x000128, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Role_C_ExecuteUbergraph_UI_Role, CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1) == 0x000130, "Member 'UI_Role_C_ExecuteUbergraph_UI_Role::CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1' has a wrong offset!");

// Function UI_Role.UI_Role_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Role_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Role_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Role_C_PreConstruct");
static_assert(sizeof(UI_Role_C_PreConstruct) == 0x000001, "Wrong size on UI_Role_C_PreConstruct");
static_assert(offsetof(UI_Role_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Role_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

