#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Role

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "S_ImageInsertion_structs.hpp"
#include "S_Section_structs.hpp"
#include "E_SectionLocation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Role.UI_Role_C
// 0x0060 (0x0340 - 0x02E0)
class UUI_Role_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                Spacer;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Space_Between_Role_Title_and_Section;              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Space_Between_Section_and_Names;                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Space_Between_Sections;                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Space_Between_Lines;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FS_ImageInsertion>              ImagesBetweenRoleAndSections;                      // 0x0318(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TArray<struct FS_Section>                     Sections;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	E_SectionLocation                             SectionPosition;                                   // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Role(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Role_C">();
	}
	static class UUI_Role_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Role_C>();
	}
};
static_assert(alignof(UUI_Role_C) == 0x000008, "Wrong alignment on UUI_Role_C");
static_assert(sizeof(UUI_Role_C) == 0x000340, "Wrong size on UUI_Role_C");
static_assert(offsetof(UUI_Role_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_Role_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Spacer) == 0x0002E8, "Member 'UUI_Role_C::Spacer' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, VerticalBox) == 0x0002F0, "Member 'UUI_Role_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Space_Between_Role_Title_and_Section) == 0x0002F8, "Member 'UUI_Role_C::Space_Between_Role_Title_and_Section' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Space_Between_Section_and_Names) == 0x000300, "Member 'UUI_Role_C::Space_Between_Section_and_Names' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Space_Between_Sections) == 0x000308, "Member 'UUI_Role_C::Space_Between_Sections' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Space_Between_Lines) == 0x000310, "Member 'UUI_Role_C::Space_Between_Lines' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, ImagesBetweenRoleAndSections) == 0x000318, "Member 'UUI_Role_C::ImagesBetweenRoleAndSections' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, Sections) == 0x000328, "Member 'UUI_Role_C::Sections' has a wrong offset!");
static_assert(offsetof(UUI_Role_C, SectionPosition) == 0x000338, "Member 'UUI_Role_C::SectionPosition' has a wrong offset!");

}

