#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SectionWithoutTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_SectionWithoutTitle.UI_SectionWithoutTitle_C.ExecuteUbergraph_UI_SectionWithoutTitle
// 0x0068 (0x0068 - 0x0000)
struct UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Name_C*                             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetNamesArray_NamesArray;                 // 0x0018(0x0010)(ReferenceParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle) == 0x000008, "Wrong alignment on UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle");
static_assert(sizeof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle) == 0x000068, "Wrong size on UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, EntryPoint) == 0x000000, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, K2Node_Event_IsDesignTime) == 0x000014, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_GetNamesArray_NamesArray) == 0x000018, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_GetNamesArray_NamesArray' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Array_Get_Item) == 0x000030, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'UI_SectionWithoutTitle_C_ExecuteUbergraph_UI_SectionWithoutTitle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UI_SectionWithoutTitle.UI_SectionWithoutTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_SectionWithoutTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SectionWithoutTitle_C_PreConstruct) == 0x000001, "Wrong alignment on UI_SectionWithoutTitle_C_PreConstruct");
static_assert(sizeof(UI_SectionWithoutTitle_C_PreConstruct) == 0x000001, "Wrong size on UI_SectionWithoutTitle_C_PreConstruct");
static_assert(offsetof(UI_SectionWithoutTitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_SectionWithoutTitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

