#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SectionWithoutTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SectionWithoutTitle.UI_SectionWithoutTitle_C
// 0x0058 (0x0338 - 0x02E0)
class UUI_SectionWithoutTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           NamesVerticalBox;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Names;                                             // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Delimiter;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   SectionText;                                       // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        Space_Between_Lines;                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FDataTableRowHandle                    NamesTextAppearanceDTHandle;                       // 0x0328(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_SectionWithoutTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_SectionWithoutTitle_C">();
	}
	static class UUI_SectionWithoutTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SectionWithoutTitle_C>();
	}
};
static_assert(alignof(UUI_SectionWithoutTitle_C) == 0x000008, "Wrong alignment on UUI_SectionWithoutTitle_C");
static_assert(sizeof(UUI_SectionWithoutTitle_C) == 0x000338, "Wrong size on UUI_SectionWithoutTitle_C");
static_assert(offsetof(UUI_SectionWithoutTitle_C, UberGraphFrame) == 0x0002E0, "Member 'UUI_SectionWithoutTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, NamesVerticalBox) == 0x0002E8, "Member 'UUI_SectionWithoutTitle_C::NamesVerticalBox' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, Names) == 0x0002F0, "Member 'UUI_SectionWithoutTitle_C::Names' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, Delimiter) == 0x000300, "Member 'UUI_SectionWithoutTitle_C::Delimiter' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, SectionText) == 0x000310, "Member 'UUI_SectionWithoutTitle_C::SectionText' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, Space_Between_Lines) == 0x000320, "Member 'UUI_SectionWithoutTitle_C::Space_Between_Lines' has a wrong offset!");
static_assert(offsetof(UUI_SectionWithoutTitle_C, NamesTextAppearanceDTHandle) == 0x000328, "Member 'UUI_SectionWithoutTitle_C::NamesTextAppearanceDTHandle' has a wrong offset!");

}

