#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_RadialMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EJoystickTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_RadialMenu.UMG_RadialMenu_C
// 0x0150 (0x0430 - 0x02E0)
class UUMG_RadialMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RadialBackground;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadiusDebug;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialBase;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        IndexRaw;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynaMat;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    Children;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          AllowResizing;                                     // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ItemOffsetRadius;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SelectionChanged;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APlayerController*                      InputController;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EJoystickTypes                                JoystickToUse;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInDeadzone;                                       // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EnteredDeadzone;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ExitedDeadzone;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              CurrentInput;                                      // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JoystickDeadzone;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultToMouseIfNoJoystick;                        // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultPlayerIndex;                                // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          UseDeadzoneEvents;                                 // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SelectionChangedSound;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoCenterMouse;                                   // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          AutoRotateForUp;                                   // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCustomInput;                                   // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CustomInput;                                       // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomTexture;                                  // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               RadialTexture;                                     // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomColors;                                   // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           InnterRingColor;                                   // 0x03E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OuterRingColor;                                    // 0x03F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RingMainColor;                                     // 0x0404(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhighlightColor;                                  // 0x0414(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          JoystickBeingUsed;                                 // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MouseDeadzone;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddChildToRadialMenu(class UUserWidget* Content, bool* Success);
	void AutoRegisterToInput();
	void ClearChildren();
	void Construct();
	class FText DebugIndex();
	void EnteredDeadzone__DelegateSignature();
	void ExecuteUbergraph_UMG_RadialMenu(int32 EntryPoint);
	void ExitedDeadzone__DelegateSignature();
	struct FVector2D FixInputRotation(const struct FVector2D& Input);
	void FixMainRotation();
	void GetChild(int32 Index_0, class UUserWidget** Output, bool* Success);
	void GetCurrentIndex(int32* Index_0, bool* Valid);
	void GetCustomInput(struct FVector2D* Input, bool* Valid);
	double GetSectionDegreeSize();
	void GetSelectedWidget(class UUserWidget** Output);
	void InDeadZone(bool InDeadZone_0);
	void IsJoystickBeingUsed(const struct FVector2D& LookStickValue1, struct FVector2D* LookStickValue, bool* JoystickIsBeingUsed);
	void PreConstruct(bool IsDesignTime);
	void RegisterPlayerInput(class APlayerController* Controller, bool* Success);
	void RemoveChildIndexFromRadialMenu(int32 IndexToRemove);
	void RemoveChildWidgetFromRadialMenu(const class UUserWidget*& ItemToFind);
	void SelectionChanged__DelegateSignature(int32 NewSelection, int32 OldSelection);
	void SetCustomInput(const struct FVector2D& CustomInput_0);
	void SetIndex(int32 Index_0);
	void SetInputDirection(const struct FVector2D& Direction);
	void Update_Direction_With_Joystick();
	void UpdateAllChildrenPositions();
	void UpdateChildPosition(int32 Index_0);
	void UpdateDirectionWithCustomInput();
	void UpdateDirectionWithMouseCursor();
	void UpdateInput();
	void UpdateMaterials();
	void UpdateMaterialVisuals();
	void UpdateSegments(int32 Segments_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_RadialMenu_C">();
	}
	static class UUMG_RadialMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_RadialMenu_C>();
	}
};
static_assert(alignof(UUMG_RadialMenu_C) == 0x000008, "Wrong alignment on UUMG_RadialMenu_C");
static_assert(sizeof(UUMG_RadialMenu_C) == 0x000430, "Wrong size on UUMG_RadialMenu_C");
static_assert(offsetof(UUMG_RadialMenu_C, UberGraphFrame) == 0x0002E0, "Member 'UUMG_RadialMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, RadialBackground) == 0x0002E8, "Member 'UUMG_RadialMenu_C::RadialBackground' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, RadiusDebug) == 0x0002F0, "Member 'UUMG_RadialMenu_C::RadiusDebug' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, RootOverlay) == 0x0002F8, "Member 'UUMG_RadialMenu_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, Segments) == 0x000300, "Member 'UUMG_RadialMenu_C::Segments' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, MaterialBase) == 0x000308, "Member 'UUMG_RadialMenu_C::MaterialBase' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, IndexRaw) == 0x000310, "Member 'UUMG_RadialMenu_C::IndexRaw' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, Index_0) == 0x000318, "Member 'UUMG_RadialMenu_C::Index_0' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, DynaMat) == 0x000320, "Member 'UUMG_RadialMenu_C::DynaMat' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, Children) == 0x000328, "Member 'UUMG_RadialMenu_C::Children' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, AllowResizing) == 0x000338, "Member 'UUMG_RadialMenu_C::AllowResizing' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, ItemOffsetRadius) == 0x000340, "Member 'UUMG_RadialMenu_C::ItemOffsetRadius' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, SelectionChanged) == 0x000348, "Member 'UUMG_RadialMenu_C::SelectionChanged' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, InputController) == 0x000358, "Member 'UUMG_RadialMenu_C::InputController' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, JoystickToUse) == 0x000360, "Member 'UUMG_RadialMenu_C::JoystickToUse' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, bInDeadzone) == 0x000361, "Member 'UUMG_RadialMenu_C::bInDeadzone' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, EnteredDeadzone) == 0x000368, "Member 'UUMG_RadialMenu_C::EnteredDeadzone' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, ExitedDeadzone) == 0x000378, "Member 'UUMG_RadialMenu_C::ExitedDeadzone' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, CurrentInput) == 0x000388, "Member 'UUMG_RadialMenu_C::CurrentInput' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, JoystickDeadzone) == 0x000398, "Member 'UUMG_RadialMenu_C::JoystickDeadzone' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, DefaultToMouseIfNoJoystick) == 0x0003A0, "Member 'UUMG_RadialMenu_C::DefaultToMouseIfNoJoystick' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, DefaultPlayerIndex) == 0x0003A4, "Member 'UUMG_RadialMenu_C::DefaultPlayerIndex' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, UseDeadzoneEvents) == 0x0003A8, "Member 'UUMG_RadialMenu_C::UseDeadzoneEvents' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, SelectionChangedSound) == 0x0003B0, "Member 'UUMG_RadialMenu_C::SelectionChangedSound' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, AutoCenterMouse) == 0x0003B8, "Member 'UUMG_RadialMenu_C::AutoCenterMouse' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, AutoRotateForUp) == 0x0003B9, "Member 'UUMG_RadialMenu_C::AutoRotateForUp' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, bUseCustomInput) == 0x0003BA, "Member 'UUMG_RadialMenu_C::bUseCustomInput' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, CustomInput) == 0x0003C0, "Member 'UUMG_RadialMenu_C::CustomInput' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, UseCustomTexture) == 0x0003D0, "Member 'UUMG_RadialMenu_C::UseCustomTexture' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, RadialTexture) == 0x0003D8, "Member 'UUMG_RadialMenu_C::RadialTexture' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, UseCustomColors) == 0x0003E0, "Member 'UUMG_RadialMenu_C::UseCustomColors' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, InnterRingColor) == 0x0003E4, "Member 'UUMG_RadialMenu_C::InnterRingColor' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, OuterRingColor) == 0x0003F4, "Member 'UUMG_RadialMenu_C::OuterRingColor' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, RingMainColor) == 0x000404, "Member 'UUMG_RadialMenu_C::RingMainColor' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, UnhighlightColor) == 0x000414, "Member 'UUMG_RadialMenu_C::UnhighlightColor' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, JoystickBeingUsed) == 0x000424, "Member 'UUMG_RadialMenu_C::JoystickBeingUsed' has a wrong offset!");
static_assert(offsetof(UUMG_RadialMenu_C, MouseDeadzone) == 0x000428, "Member 'UUMG_RadialMenu_C::MouseDeadzone' has a wrong offset!");

}

