#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LyraStartup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "CommonUser_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LyraStartup.W_LyraStartup_C
// 0x0018 (0x0450 - 0x0438)
class UW_LyraStartup_C final : public ULyraActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_LyraMenuButton_C*                    PressStartButton;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bWaitingForPlayerInitialize;                       // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWaitingForLoginInput;                             // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BW_LyraFrontEnd_PressStartButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_W_LyraStartup(int32 EntryPoint);
	void HandleUserInitialize(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void OnInitializationComplete_BDA751BF4AA7E4B214571CBDA29F8482(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void SetListenForLoginInput(bool bShouldListen);
	void SwitchToFullMenu();
	void SwitchToPressStart();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LyraStartup_C">();
	}
	static class UW_LyraStartup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LyraStartup_C>();
	}
};
static_assert(alignof(UW_LyraStartup_C) == 0x000008, "Wrong alignment on UW_LyraStartup_C");
static_assert(sizeof(UW_LyraStartup_C) == 0x000450, "Wrong size on UW_LyraStartup_C");
static_assert(offsetof(UW_LyraStartup_C, UberGraphFrame) == 0x000438, "Member 'UW_LyraStartup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LyraStartup_C, PressStartButton) == 0x000440, "Member 'UW_LyraStartup_C::PressStartButton' has a wrong offset!");
static_assert(offsetof(UW_LyraStartup_C, bWaitingForPlayerInitialize) == 0x000448, "Member 'UW_LyraStartup_C::bWaitingForPlayerInitialize' has a wrong offset!");
static_assert(offsetof(UW_LyraStartup_C, bWaitingForLoginInput) == 0x000449, "Member 'UW_LyraStartup_C::bWaitingForLoginInput' has a wrong offset!");

}

