#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerInfo.W_PlayerInfo_C
// 0x0048 (0x0328 - 0x02E0)
class UW_PlayerInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Mute;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Mute;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Team;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_VOIPAnim_C*                          W_VOIPAnim;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerList_C*                        MainRef;                                           // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CharacterRef;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Button_Mute_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_PlayerInfo(int32 EntryPoint);
	void GetUsername(class FText* Username);
	void RefreshInfos();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayerInfo_C">();
	}
	static class UW_PlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerInfo_C>();
	}
};
static_assert(alignof(UW_PlayerInfo_C) == 0x000008, "Wrong alignment on UW_PlayerInfo_C");
static_assert(sizeof(UW_PlayerInfo_C) == 0x000328, "Wrong size on UW_PlayerInfo_C");
static_assert(offsetof(UW_PlayerInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UW_PlayerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, Button_Mute) == 0x0002E8, "Member 'UW_PlayerInfo_C::Button_Mute' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, TextBlock_Mute) == 0x0002F0, "Member 'UW_PlayerInfo_C::TextBlock_Mute' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, TextBlock_PlayerName) == 0x0002F8, "Member 'UW_PlayerInfo_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, TextBlock_Team) == 0x000300, "Member 'UW_PlayerInfo_C::TextBlock_Team' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, W_VOIPAnim) == 0x000308, "Member 'UW_PlayerInfo_C::W_VOIPAnim' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, MainRef) == 0x000310, "Member 'UW_PlayerInfo_C::MainRef' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, PlayerIndex) == 0x000318, "Member 'UW_PlayerInfo_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UW_PlayerInfo_C, CharacterRef) == 0x000320, "Member 'UW_PlayerInfo_C::CharacterRef' has a wrong offset!");

}

