#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerList

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerList.W_PlayerList_C.ExecuteUbergraph_W_PlayerList
// 0x0240 (0x0240 - 0x0000)
struct W_PlayerList_C_ExecuteUbergraph_W_PlayerList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PlayerInfo_C*                        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0058(0x0010)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0070(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_IgnoreInput_;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_VOIPInterface_C>   K2Node_DynamicCast_AsBP_VOIPInterface;             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MSG_AVP_GetPlayerUsername_Success_;       // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MSG_AVP_GetPlayerUsername_Username;       // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0150(0x0010)()
	bool                                          Temp_bool_Variable_2;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamID_ByActorRef_TeamID;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamID_ByActorRef_TeamID_1;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01A0(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01B8(0x0010)()
	class FText                                   K2Node_Select_Default_2;                           // 0x01C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01D8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0220(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0230(0x0010)()
};
static_assert(alignof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList) == 0x000008, "Wrong alignment on W_PlayerList_C_ExecuteUbergraph_W_PlayerList");
static_assert(sizeof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList) == 0x000240, "Wrong size on W_PlayerList_C_ExecuteUbergraph_W_PlayerList");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, EntryPoint) == 0x000000, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_int_Variable) == 0x000004, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_int_Variable_1) == 0x000008, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_bool_Variable) == 0x00000C, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_text_Variable) == 0x000010, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Create_ReturnValue) == 0x000028, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_text_Variable_1) == 0x000058, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000070, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_CustomEvent_IgnoreInput_) == 0x000080, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_CustomEvent_IgnoreInput_' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_DynamicCast_AsCharacter) == 0x0000A8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_DynamicCast_AsBP_VOIPInterface) == 0x0000B8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_DynamicCast_AsBP_VOIPInterface' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000C9, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_MSG_AVP_GetPlayerUsername_Success_) == 0x0000CA, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_MSG_AVP_GetPlayerUsername_Success_' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_MSG_AVP_GetPlayerUsername_Username) == 0x0000D0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_MSG_AVP_GetPlayerUsername_Username' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_MakeArray_Array) == 0x000128, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Format_ReturnValue) == 0x000138, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_bool_Variable_1) == 0x000148, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_text_Variable_2) == 0x000150, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, Temp_bool_Variable_2) == 0x000160, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000168, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000178, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000180, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_IsValid_ReturnValue_2) == 0x000188, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_IsValid_ReturnValue_3) == 0x000189, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetTeamID_ByActorRef_TeamID) == 0x00018C, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetTeamID_ByActorRef_TeamID' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GetTeamID_ByActorRef_TeamID_1) == 0x000190, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GetTeamID_ByActorRef_TeamID_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000194, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000195, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_Select_Default) == 0x000198, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_Select_Default_1) == 0x0001A0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B0, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Conv_IntToText_ReturnValue) == 0x0001B8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_Select_Default_2) == 0x0001C8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001D8, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, K2Node_MakeArray_Array_1) == 0x000220, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_PlayerList_C_ExecuteUbergraph_W_PlayerList, CallFunc_Format_ReturnValue_1) == 0x000230, "Member 'W_PlayerList_C_ExecuteUbergraph_W_PlayerList::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function W_PlayerList.W_PlayerList_C.ShowHide
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerList_C_ShowHide final
{
public:
	bool                                          IgnoreInput_;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerList_C_ShowHide) == 0x000001, "Wrong alignment on W_PlayerList_C_ShowHide");
static_assert(sizeof(W_PlayerList_C_ShowHide) == 0x000001, "Wrong size on W_PlayerList_C_ShowHide");
static_assert(offsetof(W_PlayerList_C_ShowHide, IgnoreInput_) == 0x000000, "Member 'W_PlayerList_C_ShowHide::IgnoreInput_' has a wrong offset!");

}

