#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerInfo.W_PlayerInfo_C.ExecuteUbergraph_W_PlayerInfo
// 0x00B8 (0x00B8 - 0x0000)
struct W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamID_ByActorRef_TeamID;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	double                                        Temp_real_Variable;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0048(0x0010)()
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsMuted_ByActorRef_IsMuted_;           // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUsername_Username;                     // 0x0078(0x0010)()
	bool                                          CallFunc_GetIsVOIPActivated_ByActorRef_IsVOIPActivated_; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0090(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x00A0(0x0010)()
	float                                         CallFunc_SetOpacity_InOpacity_ImplicitCast;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo) == 0x000008, "Wrong alignment on W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo");
static_assert(sizeof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo) == 0x0000B8, "Wrong size on W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, EntryPoint) == 0x000000, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GetTeamID_ByActorRef_TeamID) == 0x000004, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GetTeamID_ByActorRef_TeamID' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_bool_Variable) == 0x000010, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_real_Variable) == 0x000028, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_real_Variable_1) == 0x000030, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, K2Node_Select_Default) == 0x000040, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_text_Variable) == 0x000048, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000058, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_bool_IsClosed_Variable) == 0x000070, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_bool_Variable_1) == 0x000071, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_IsValid_ReturnValue_2) == 0x000072, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GetIsMuted_ByActorRef_IsMuted_) == 0x000073, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GetIsMuted_ByActorRef_IsMuted_' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GetUsername_Username) == 0x000078, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GetUsername_Username' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_GetIsVOIPActivated_ByActorRef_IsVOIPActivated_) == 0x000088, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_GetIsVOIPActivated_ByActorRef_IsVOIPActivated_' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, Temp_text_Variable_1) == 0x000090, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, K2Node_Select_Default_1) == 0x0000A0, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo, CallFunc_SetOpacity_InOpacity_ImplicitCast) == 0x0000B0, "Member 'W_PlayerInfo_C_ExecuteUbergraph_W_PlayerInfo::CallFunc_SetOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_PlayerInfo.W_PlayerInfo_C.GetUsername
// 0x00F8 (0x00F8 - 0x0000)
struct W_PlayerInfo_C_GetUsername final
{
public:
	class FText                                   Username;                                          // 0x0000(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_VOIPInterface_C>   K2Node_DynamicCast_AsBP_VOIPInterface;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MSG_AVP_GetPlayerUsername_Success_;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MSG_AVP_GetPlayerUsername_Username;       // 0x0030(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x00E8(0x0010)()
};
static_assert(alignof(W_PlayerInfo_C_GetUsername) == 0x000008, "Wrong alignment on W_PlayerInfo_C_GetUsername");
static_assert(sizeof(W_PlayerInfo_C_GetUsername) == 0x0000F8, "Wrong size on W_PlayerInfo_C_GetUsername");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, Username) == 0x000000, "Member 'W_PlayerInfo_C_GetUsername::Username' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, Temp_bool_Variable) == 0x000010, "Member 'W_PlayerInfo_C_GetUsername::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, K2Node_DynamicCast_AsBP_VOIPInterface) == 0x000018, "Member 'W_PlayerInfo_C_GetUsername::K2Node_DynamicCast_AsBP_VOIPInterface' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_PlayerInfo_C_GetUsername::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_MSG_AVP_GetPlayerUsername_Success_) == 0x000029, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_MSG_AVP_GetPlayerUsername_Success_' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_MSG_AVP_GetPlayerUsername_Username) == 0x000030, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_MSG_AVP_GetPlayerUsername_Username' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_GetSubstring_ReturnValue) == 0x000050, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_Len_ReturnValue) == 0x000060, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'W_PlayerInfo_C_GetUsername::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, K2Node_MakeArray_Array) == 0x0000C8, "Member 'W_PlayerInfo_C_GetUsername::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'W_PlayerInfo_C_GetUsername::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerInfo_C_GetUsername, K2Node_Select_Default) == 0x0000E8, "Member 'W_PlayerInfo_C_GetUsername::K2Node_Select_Default' has a wrong offset!");

}

