#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsListEntry_Scalar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.ExecuteUbergraph_W_SettingsListEntry_Scalar
// 0x0178 (0x0178 - 0x0000)
struct W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DefaultValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	bool                                          CallFunc_IsOwningPlayerUsingTouch_ReturnValue;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar) == 0x000008, "Wrong alignment on W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar) == 0x000178, "Wrong size on W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, EntryPoint) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, K2Node_Event_Value) == 0x000004, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, K2Node_Event_DefaultValue) == 0x000008, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::K2Node_Event_DefaultValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, K2Node_Event_MyGeometry) == 0x000028, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_IsOwningPlayerUsingTouch_ReturnValue) == 0x000150, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_IsOwningPlayerUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000158, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000160, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000168, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar, CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast) == 0x000170, "Member 'W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar::CallFunc_PlaySound2D_PitchMultiplier_ImplicitCast' has a wrong offset!");

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong alignment on W_SettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong size on W_SettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_OnDefaultValueChanged, DefaultValue) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_OnDefaultValueChanged::DefaultValue' has a wrong offset!");

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_SettingsListEntry_Scalar_C_OnMouseEnter");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_SettingsListEntry_Scalar_C_OnMouseEnter");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_SettingsListEntry_Scalar_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_SettingsListEntry_Scalar_C_OnMouseLeave");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_OnMouseLeave) == 0x000078, "Wrong size on W_SettingsListEntry_Scalar_C_OnMouseLeave");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong alignment on W_SettingsListEntry_Scalar_C_OnValueChanged");
static_assert(sizeof(W_SettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong size on W_SettingsListEntry_Scalar_C_OnValueChanged");
static_assert(offsetof(W_SettingsListEntry_Scalar_C_OnValueChanged, Value) == 0x000000, "Member 'W_SettingsListEntry_Scalar_C_OnValueChanged::Value' has a wrong offset!");

}

