#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Settings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Settings.W_Settings_C
// 0x0058 (0x0338 - 0x02E0)
class UW_Settings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Settings;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_BarreSettings;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_0;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_1;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_2;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_3;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_4;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_5;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingsBar_C*                       W_SettingsBar_C_6;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerList_C*                        PlayerListRef;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Settings_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_W_Settings(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Settings_C">();
	}
	static class UW_Settings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Settings_C>();
	}
};
static_assert(alignof(UW_Settings_C) == 0x000008, "Wrong alignment on UW_Settings_C");
static_assert(sizeof(UW_Settings_C) == 0x000338, "Wrong size on UW_Settings_C");
static_assert(offsetof(UW_Settings_C, UberGraphFrame) == 0x0002E0, "Member 'UW_Settings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, Button_Settings) == 0x0002E8, "Member 'UW_Settings_C::Button_Settings' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_BarreSettings) == 0x0002F0, "Member 'UW_Settings_C::W_BarreSettings' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_0) == 0x0002F8, "Member 'UW_Settings_C::W_SettingsBar_C_0' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_1) == 0x000300, "Member 'UW_Settings_C::W_SettingsBar_C_1' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_2) == 0x000308, "Member 'UW_Settings_C::W_SettingsBar_C_2' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_3) == 0x000310, "Member 'UW_Settings_C::W_SettingsBar_C_3' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_4) == 0x000318, "Member 'UW_Settings_C::W_SettingsBar_C_4' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_5) == 0x000320, "Member 'UW_Settings_C::W_SettingsBar_C_5' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, W_SettingsBar_C_6) == 0x000328, "Member 'UW_Settings_C::W_SettingsBar_C_6' has a wrong offset!");
static_assert(offsetof(UW_Settings_C, PlayerListRef) == 0x000330, "Member 'UW_Settings_C::PlayerListRef' has a wrong offset!");

}

