#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingEntryBackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingEntryBackground.W_SettingEntryBackground_C
// 0x0028 (0x0308 - 0x02E0)
class UW_SettingEntryBackground_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMouseEnterChanged;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_W_SettingEntryBackground(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnterChanged__DelegateSignature(bool IsEnterEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingEntryBackground_C">();
	}
	static class UW_SettingEntryBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingEntryBackground_C>();
	}
};
static_assert(alignof(UW_SettingEntryBackground_C) == 0x000008, "Wrong alignment on UW_SettingEntryBackground_C");
static_assert(sizeof(UW_SettingEntryBackground_C) == 0x000308, "Wrong size on UW_SettingEntryBackground_C");
static_assert(offsetof(UW_SettingEntryBackground_C, UberGraphFrame) == 0x0002E0, "Member 'UW_SettingEntryBackground_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingEntryBackground_C, OnHovered) == 0x0002E8, "Member 'UW_SettingEntryBackground_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UW_SettingEntryBackground_C, Content) == 0x0002F0, "Member 'UW_SettingEntryBackground_C::Content' has a wrong offset!");
static_assert(offsetof(UW_SettingEntryBackground_C, OnMouseEnterChanged) == 0x0002F8, "Member 'UW_SettingEntryBackground_C::OnMouseEnterChanged' has a wrong offset!");

}

