#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsListEntry_Action

#include "Basic.hpp"

#include "GameSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingsListEntry_Action.W_SettingsListEntry_Action_C
// 0x0018 (0x0368 - 0x0350)
class UW_SettingsListEntry_Action_C final : public UGameSettingListEntrySetting_Action
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               EntryHeightSB;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SettingsListEntry_Action(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingsListEntry_Action_C">();
	}
	static class UW_SettingsListEntry_Action_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingsListEntry_Action_C>();
	}
};
static_assert(alignof(UW_SettingsListEntry_Action_C) == 0x000008, "Wrong alignment on UW_SettingsListEntry_Action_C");
static_assert(sizeof(UW_SettingsListEntry_Action_C) == 0x000368, "Wrong size on UW_SettingsListEntry_Action_C");
static_assert(offsetof(UW_SettingsListEntry_Action_C, UberGraphFrame) == 0x000350, "Member 'UW_SettingsListEntry_Action_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_Action_C, OnHover) == 0x000358, "Member 'UW_SettingsListEntry_Action_C::OnHover' has a wrong offset!");
static_assert(offsetof(UW_SettingsListEntry_Action_C, EntryHeightSB) == 0x000360, "Member 'UW_SettingsListEntry_Action_C::EntryHeightSB' has a wrong offset!");

}

