#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UserWatermark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UserWatermark.W_UserWatermark_C
// 0x0020 (0x0300 - 0x02E0)
class UW_UserWatermark_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       PlayerIDWidget;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerNameWidget;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_UserWatermark(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UserWatermark_C">();
	}
	static class UW_UserWatermark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UserWatermark_C>();
	}
};
static_assert(alignof(UW_UserWatermark_C) == 0x000008, "Wrong alignment on UW_UserWatermark_C");
static_assert(sizeof(UW_UserWatermark_C) == 0x000300, "Wrong size on UW_UserWatermark_C");
static_assert(offsetof(UW_UserWatermark_C, UberGraphFrame) == 0x0002E0, "Member 'UW_UserWatermark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UserWatermark_C, PlayerIDWidget) == 0x0002E8, "Member 'UW_UserWatermark_C::PlayerIDWidget' has a wrong offset!");
static_assert(offsetof(UW_UserWatermark_C, PlayerNameWidget) == 0x0002F0, "Member 'UW_UserWatermark_C::PlayerNameWidget' has a wrong offset!");
static_assert(offsetof(UW_UserWatermark_C, Visible) == 0x0002F8, "Member 'UW_UserWatermark_C::Visible' has a wrong offset!");

}

