#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VOIPIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VOIPIndicator.W_VOIPIndicator_C
// 0x0028 (0x0308 - 0x02E0)
class UW_VOIPIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Username;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_VOIPAnim_C*                          W_VOIPStatus;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 ActorRef;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Attempt;                                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_VOIPIndicator(int32 EntryPoint);
	void RefreshUsername();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_VOIPIndicator_C">();
	}
	static class UW_VOIPIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_VOIPIndicator_C>();
	}
};
static_assert(alignof(UW_VOIPIndicator_C) == 0x000008, "Wrong alignment on UW_VOIPIndicator_C");
static_assert(sizeof(UW_VOIPIndicator_C) == 0x000308, "Wrong size on UW_VOIPIndicator_C");
static_assert(offsetof(UW_VOIPIndicator_C, UberGraphFrame) == 0x0002E0, "Member 'UW_VOIPIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_VOIPIndicator_C, TextBlock_Username) == 0x0002E8, "Member 'UW_VOIPIndicator_C::TextBlock_Username' has a wrong offset!");
static_assert(offsetof(UW_VOIPIndicator_C, W_VOIPStatus) == 0x0002F0, "Member 'UW_VOIPIndicator_C::W_VOIPStatus' has a wrong offset!");
static_assert(offsetof(UW_VOIPIndicator_C, ActorRef) == 0x0002F8, "Member 'UW_VOIPIndicator_C::ActorRef' has a wrong offset!");
static_assert(offsetof(UW_VOIPIndicator_C, Attempt) == 0x000300, "Member 'UW_VOIPIndicator_C::Attempt' has a wrong offset!");

}

