#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ButtonWithCheckbox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_BndEvt__WB_ButtonWithCheckbox_CheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.ExecuteUbergraph_WB_ButtonWithCheckbox
// 0x00E8 (0x00E8 - 0x0000)
struct WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0028(0x0060)(HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0088(0x0010)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0098(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00A8(0x0014)()
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x00C0(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox) == 0x000008, "Wrong alignment on WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox");
static_assert(sizeof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox) == 0x0000E8, "Wrong size on WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, EntryPoint) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_ComponentBoundEvent_bIsChecked) == 0x000004, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, Temp_bool_Variable) == 0x00001C, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, Temp_byte_Variable) == 0x00001D, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, Temp_byte_Variable_1) == 0x00001E, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_MakeStruct_SlateFontInfo) == 0x000028, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_CustomEvent_InText) == 0x000088, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_TextToUpper_ReturnValue) == 0x000098, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_MakeStruct_SlateColor_1) == 0x0000A8, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_TextToUpper_ReturnValue_1) == 0x0000C0, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_Event_IsDesignTime) == 0x0000D8, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_Select_Default) == 0x0000D9, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_IsChecked_ReturnValue) == 0x0000DA, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_Not_PreBool_ReturnValue) == 0x0000DB, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0000DC, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, K2Node_MakeStruct_Size_ImplicitCast) == 0x0000E0, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000E4, "Member 'WB_ButtonWithCheckbox_C_ExecuteUbergraph_WB_ButtonWithCheckbox::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.IsChecked
// 0x0002 (0x0002 - 0x0000)
struct WB_ButtonWithCheckbox_C_IsChecked final
{
public:
	bool                                          IsChecked_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_IsChecked) == 0x000001, "Wrong alignment on WB_ButtonWithCheckbox_C_IsChecked");
static_assert(sizeof(WB_ButtonWithCheckbox_C_IsChecked) == 0x000002, "Wrong size on WB_ButtonWithCheckbox_C_IsChecked");
static_assert(offsetof(WB_ButtonWithCheckbox_C_IsChecked, IsChecked_0) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_IsChecked::IsChecked_0' has a wrong offset!");
static_assert(offsetof(WB_ButtonWithCheckbox_C_IsChecked, CallFunc_IsChecked_ReturnValue) == 0x000001, "Member 'WB_ButtonWithCheckbox_C_IsChecked::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature, IsChecked_0) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_OnCheckStateChanged__DelegateSignature::IsChecked_0' has a wrong offset!");

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ButtonWithCheckbox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ButtonWithCheckbox_C_PreConstruct");
static_assert(sizeof(WB_ButtonWithCheckbox_C_PreConstruct) == 0x000001, "Wrong size on WB_ButtonWithCheckbox_C_PreConstruct");
static_assert(offsetof(WB_ButtonWithCheckbox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ButtonWithCheckbox.WB_ButtonWithCheckbox_C.SetButtonText
// 0x0010 (0x0010 - 0x0000)
struct WB_ButtonWithCheckbox_C_SetButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_ButtonWithCheckbox_C_SetButtonText) == 0x000008, "Wrong alignment on WB_ButtonWithCheckbox_C_SetButtonText");
static_assert(sizeof(WB_ButtonWithCheckbox_C_SetButtonText) == 0x000010, "Wrong size on WB_ButtonWithCheckbox_C_SetButtonText");
static_assert(offsetof(WB_ButtonWithCheckbox_C_SetButtonText, InText) == 0x000000, "Member 'WB_ButtonWithCheckbox_C_SetButtonText::InText' has a wrong offset!");

}

