#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Countdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Countdown.WB_Countdown_C
// 0x0020 (0x0300 - 0x02E0)
class UWB_Countdown_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULoadingWI_C*                           LoadingWI;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Countdown;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CountdownStart;                                    // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Countdown(int32 EntryPoint);
	void ShowNextNumber();
	void Start_Countdown(int32 CountdownTime);
	void Stop_Countdown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Countdown_C">();
	}
	static class UWB_Countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Countdown_C>();
	}
};
static_assert(alignof(UWB_Countdown_C) == 0x000008, "Wrong alignment on UWB_Countdown_C");
static_assert(sizeof(UWB_Countdown_C) == 0x000300, "Wrong size on UWB_Countdown_C");
static_assert(offsetof(UWB_Countdown_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_Countdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Countdown_C, LoadingWI) == 0x0002E8, "Member 'UWB_Countdown_C::LoadingWI' has a wrong offset!");
static_assert(offsetof(UWB_Countdown_C, Text_Countdown) == 0x0002F0, "Member 'UWB_Countdown_C::Text_Countdown' has a wrong offset!");
static_assert(offsetof(UWB_Countdown_C, CountdownStart) == 0x0002F8, "Member 'UWB_Countdown_C::CountdownStart' has a wrong offset!");

}

