#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DialogBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_DialogBox.WB_DialogBox_C.ExecuteUbergraph_WB_DialogBox
// 0x0020 (0x0020 - 0x0000)
struct WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox) == 0x000008, "Wrong alignment on WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox");
static_assert(sizeof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox) == 0x000020, "Wrong size on WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox");
static_assert(offsetof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox, EntryPoint) == 0x000000, "Member 'WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox, K2Node_DynamicCast_AsBP_GI) == 0x000010, "Member 'WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_DialogBox_C_ExecuteUbergraph_WB_DialogBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WB_DialogBox.WB_DialogBox_C.SetupDialog
// 0x0048 (0x0048 - 0x0000)
struct WB_DialogBox_C_SetupDialog final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LeftButtonLabel;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bHasRightButton;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RightButtonLabel;                                  // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_DialogBox_C_SetupDialog) == 0x000008, "Wrong alignment on WB_DialogBox_C_SetupDialog");
static_assert(sizeof(WB_DialogBox_C_SetupDialog) == 0x000048, "Wrong size on WB_DialogBox_C_SetupDialog");
static_assert(offsetof(WB_DialogBox_C_SetupDialog, Title) == 0x000000, "Member 'WB_DialogBox_C_SetupDialog::Title' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_SetupDialog, Message) == 0x000010, "Member 'WB_DialogBox_C_SetupDialog::Message' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_SetupDialog, LeftButtonLabel) == 0x000020, "Member 'WB_DialogBox_C_SetupDialog::LeftButtonLabel' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_SetupDialog, bHasRightButton) == 0x000030, "Member 'WB_DialogBox_C_SetupDialog::bHasRightButton' has a wrong offset!");
static_assert(offsetof(WB_DialogBox_C_SetupDialog, RightButtonLabel) == 0x000038, "Member 'WB_DialogBox_C_SetupDialog::RightButtonLabel' has a wrong offset!");

}

