#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_InGameMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_InGameMenu.WB_InGameMenu_C
// 0x0078 (0x0358 - 0x02E0)
class UWB_InGameMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Settings;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_1;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vert_MenuButtons;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Quit;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_RestartLevel;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Resume;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Set_Apply;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Set_Back;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Set_Defaults;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_Settings;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_C*                           WB_Button_ToLobby;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MainMenu_Settings_C*                WB_MainMenu_Settings;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_InGameMenu;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WB_Button_2_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_RestartLevel_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_Set_Apply_1_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_Set_Apply_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_Set_Back_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WB_Button_ToLobby_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WB_InGameMenu(int32 EntryPoint);
	class FString GetTravelToLobbyCommand();
	bool IsActiveWidgetSubMenu();
	void RemoveButtonsForNonServer();
	void Resume();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_InGameMenu_C">();
	}
	static class UWB_InGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_InGameMenu_C>();
	}
};
static_assert(alignof(UWB_InGameMenu_C) == 0x000008, "Wrong alignment on UWB_InGameMenu_C");
static_assert(sizeof(UWB_InGameMenu_C) == 0x000358, "Wrong size on UWB_InGameMenu_C");
static_assert(offsetof(UWB_InGameMenu_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_InGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, Canvas_Settings) == 0x0002E8, "Member 'UWB_InGameMenu_C::Canvas_Settings' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, Spacer) == 0x0002F0, "Member 'UWB_InGameMenu_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, Spacer_1) == 0x0002F8, "Member 'UWB_InGameMenu_C::Spacer_1' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, Vert_MenuButtons) == 0x000300, "Member 'UWB_InGameMenu_C::Vert_MenuButtons' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Quit) == 0x000308, "Member 'UWB_InGameMenu_C::WB_Button_Quit' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_RestartLevel) == 0x000310, "Member 'UWB_InGameMenu_C::WB_Button_RestartLevel' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Resume) == 0x000318, "Member 'UWB_InGameMenu_C::WB_Button_Resume' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Set_Apply) == 0x000320, "Member 'UWB_InGameMenu_C::WB_Button_Set_Apply' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Set_Back) == 0x000328, "Member 'UWB_InGameMenu_C::WB_Button_Set_Back' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Set_Defaults) == 0x000330, "Member 'UWB_InGameMenu_C::WB_Button_Set_Defaults' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_Settings) == 0x000338, "Member 'UWB_InGameMenu_C::WB_Button_Settings' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_Button_ToLobby) == 0x000340, "Member 'UWB_InGameMenu_C::WB_Button_ToLobby' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WB_MainMenu_Settings) == 0x000348, "Member 'UWB_InGameMenu_C::WB_MainMenu_Settings' has a wrong offset!");
static_assert(offsetof(UWB_InGameMenu_C, WidgetSwitcher_InGameMenu) == 0x000350, "Member 'UWB_InGameMenu_C::WidgetSwitcher_InGameMenu' has a wrong offset!");

}

