#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MainMenu_Settings_Session

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MainMenu_Settings_Session.WB_MainMenu_Settings_Session_C
// 0x0028 (0x0308 - 0x02E0)
class UWB_MainMenu_Settings_Session_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       TextBox_ServerName;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_Lan;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_HorizontalComboBox_C*               WB_HCB_MaxPlayers;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxLengthServerName;                               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WB_HCB_Lan_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_HCB_NumConnections_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature(class FName NewSelection);
	void BndEvt__WB_MainMenu_Settings_Session_TextBox_IP_One_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_WB_MainMenu_Settings_Session(int32 EntryPoint);
	void TruncateString(const class FText& InText, int32 MaxLength, class FString* String, bool* Truncated);
	void Update_Server_Name();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MainMenu_Settings_Session_C">();
	}
	static class UWB_MainMenu_Settings_Session_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MainMenu_Settings_Session_C>();
	}
};
static_assert(alignof(UWB_MainMenu_Settings_Session_C) == 0x000008, "Wrong alignment on UWB_MainMenu_Settings_Session_C");
static_assert(sizeof(UWB_MainMenu_Settings_Session_C) == 0x000308, "Wrong size on UWB_MainMenu_Settings_Session_C");
static_assert(offsetof(UWB_MainMenu_Settings_Session_C, UberGraphFrame) == 0x0002E0, "Member 'UWB_MainMenu_Settings_Session_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_Session_C, TextBox_ServerName) == 0x0002E8, "Member 'UWB_MainMenu_Settings_Session_C::TextBox_ServerName' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_Session_C, WB_HCB_Lan) == 0x0002F0, "Member 'UWB_MainMenu_Settings_Session_C::WB_HCB_Lan' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_Session_C, WB_HCB_MaxPlayers) == 0x0002F8, "Member 'UWB_MainMenu_Settings_Session_C::WB_HCB_MaxPlayers' has a wrong offset!");
static_assert(offsetof(UWB_MainMenu_Settings_Session_C, MaxLengthServerName) == 0x000300, "Member 'UWB_MainMenu_Settings_Session_C::MaxLengthServerName' has a wrong offset!");

}

