#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BenchmarkOverlayText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_BenchmarkOverlayText.WI_BenchmarkOverlayText_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_BenchmarkOverlayText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextValue;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WI_BenchmarkOverlayText(int32 EntryPoint);
	void GetText(class FText* In_Text);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_BenchmarkOverlayText_C">();
	}
	static class UWI_BenchmarkOverlayText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_BenchmarkOverlayText_C>();
	}
};
static_assert(alignof(UWI_BenchmarkOverlayText_C) == 0x000008, "Wrong alignment on UWI_BenchmarkOverlayText_C");
static_assert(sizeof(UWI_BenchmarkOverlayText_C) == 0x000300, "Wrong size on UWI_BenchmarkOverlayText_C");
static_assert(offsetof(UWI_BenchmarkOverlayText_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_BenchmarkOverlayText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlayText_C, TextBlock) == 0x0002E8, "Member 'UWI_BenchmarkOverlayText_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWI_BenchmarkOverlayText_C, TextValue) == 0x0002F0, "Member 'UWI_BenchmarkOverlayText_C::TextValue' has a wrong offset!");

}

