#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BuffInShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_BuffInShop.WI_BuffInShop_C
// 0x0100 (0x03E0 - 0x02E0)
class UWI_BuffInShop_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Buff_Description;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CooldownTimerLabel;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TextSizeBox;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconSoftTexture;                                   // 0x0308(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	double                                        TotalTime;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasDuration;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               OngoingTagRequirements;                            // 0x0340(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInstanceDynamic*               OverlayMaterial;                                   // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   DescriptionText;                                   // 0x03D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WI_BuffInShop(int32 EntryPoint);
	void SetCooldownText(int64 Cooldown_Text);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D> SoftTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_BuffInShop_C">();
	}
	static class UWI_BuffInShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_BuffInShop_C>();
	}
};
static_assert(alignof(UWI_BuffInShop_C) == 0x000008, "Wrong alignment on UWI_BuffInShop_C");
static_assert(sizeof(UWI_BuffInShop_C) == 0x0003E0, "Wrong size on UWI_BuffInShop_C");
static_assert(offsetof(UWI_BuffInShop_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_BuffInShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, Buff_Description) == 0x0002E8, "Member 'UWI_BuffInShop_C::Buff_Description' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, CooldownTimerLabel) == 0x0002F0, "Member 'UWI_BuffInShop_C::CooldownTimerLabel' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, Icon) == 0x0002F8, "Member 'UWI_BuffInShop_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, TextSizeBox) == 0x000300, "Member 'UWI_BuffInShop_C::TextSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, IconSoftTexture) == 0x000308, "Member 'UWI_BuffInShop_C::IconSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, TotalTime) == 0x000330, "Member 'UWI_BuffInShop_C::TotalTime' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, HasDuration) == 0x000338, "Member 'UWI_BuffInShop_C::HasDuration' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, OngoingTagRequirements) == 0x000340, "Member 'UWI_BuffInShop_C::OngoingTagRequirements' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, OverlayMaterial) == 0x0003C8, "Member 'UWI_BuffInShop_C::OverlayMaterial' has a wrong offset!");
static_assert(offsetof(UWI_BuffInShop_C, DescriptionText) == 0x0003D0, "Member 'UWI_BuffInShop_C::DescriptionText' has a wrong offset!");

}

