#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_BuffList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_BuffList.WI_BuffList_C
// 0x0090 (0x0370 - 0x02E0)
class UWI_BuffList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BuffList;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowExtraInfo;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              TempBuffIcon;                                      // 0x02F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   TempBuffDescription;                               // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TempBuffCooldownColor;                             // 0x0330(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NegativeBuffCooldownBarColor;                      // 0x0344(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            PositiveBuffCooldownBarColor;                      // 0x0358(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WI_BuffList(int32 EntryPoint);
	void InpActEvt_IA_UpgradeOverview_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnMessageReceived_EE349EB94D78DBC4E6B5C79B898BA7DC(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void UpdateAllBuffs();
	void UpdateBuffs();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_BuffList_C">();
	}
	static class UWI_BuffList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_BuffList_C>();
	}
};
static_assert(alignof(UWI_BuffList_C) == 0x000008, "Wrong alignment on UWI_BuffList_C");
static_assert(sizeof(UWI_BuffList_C) == 0x000370, "Wrong size on UWI_BuffList_C");
static_assert(offsetof(UWI_BuffList_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_BuffList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, BuffList) == 0x0002E8, "Member 'UWI_BuffList_C::BuffList' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, ShowExtraInfo) == 0x0002F0, "Member 'UWI_BuffList_C::ShowExtraInfo' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, TempBuffIcon) == 0x0002F8, "Member 'UWI_BuffList_C::TempBuffIcon' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, TempBuffDescription) == 0x000320, "Member 'UWI_BuffList_C::TempBuffDescription' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, TempBuffCooldownColor) == 0x000330, "Member 'UWI_BuffList_C::TempBuffCooldownColor' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, NegativeBuffCooldownBarColor) == 0x000344, "Member 'UWI_BuffList_C::NegativeBuffCooldownBarColor' has a wrong offset!");
static_assert(offsetof(UWI_BuffList_C, PositiveBuffCooldownBarColor) == 0x000358, "Member 'UWI_BuffList_C::PositiveBuffCooldownBarColor' has a wrong offset!");

}

