#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ButtonHoverEffectBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ButtonHoverEffectBase.WI_ButtonHoverEffectBase_C
// 0x0100 (0x03E0 - 0x02E0)
class UWI_ButtonHoverEffectBase_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HoverInnerOutlineBase;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverInnerOutlineShadow;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverOuterOutline;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NegativePaddingOverlay;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                NegativePadding;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            InnerFrameColor;                                   // 0x0328(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            InnerFrameShadowColor;                             // 0x033C(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateColor                            OuterFrameColor;                                   // 0x0350(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              InnerOutlineSoftTexture;                           // 0x0368(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              InnerOutlineShadowSoftTexture;                     // 0x0390(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              OuterOutlineSoftTexture;                           // 0x03B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ButtonHoverEffectBase(int32 EntryPoint);
	void HoverAnimateIn();
	void HoverAnimateOut();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ButtonHoverEffectBase_C">();
	}
	static class UWI_ButtonHoverEffectBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ButtonHoverEffectBase_C>();
	}
};
static_assert(alignof(UWI_ButtonHoverEffectBase_C) == 0x000008, "Wrong alignment on UWI_ButtonHoverEffectBase_C");
static_assert(sizeof(UWI_ButtonHoverEffectBase_C) == 0x0003E0, "Wrong size on UWI_ButtonHoverEffectBase_C");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ButtonHoverEffectBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, Hover) == 0x0002E8, "Member 'UWI_ButtonHoverEffectBase_C::Hover' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, HoverInnerOutlineBase) == 0x0002F0, "Member 'UWI_ButtonHoverEffectBase_C::HoverInnerOutlineBase' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, HoverInnerOutlineShadow) == 0x0002F8, "Member 'UWI_ButtonHoverEffectBase_C::HoverInnerOutlineShadow' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, HoverOuterOutline) == 0x000300, "Member 'UWI_ButtonHoverEffectBase_C::HoverOuterOutline' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, NegativePaddingOverlay) == 0x000308, "Member 'UWI_ButtonHoverEffectBase_C::NegativePaddingOverlay' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, RootOverlay) == 0x000310, "Member 'UWI_ButtonHoverEffectBase_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, NegativePadding) == 0x000318, "Member 'UWI_ButtonHoverEffectBase_C::NegativePadding' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, InnerFrameColor) == 0x000328, "Member 'UWI_ButtonHoverEffectBase_C::InnerFrameColor' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, InnerFrameShadowColor) == 0x00033C, "Member 'UWI_ButtonHoverEffectBase_C::InnerFrameShadowColor' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, OuterFrameColor) == 0x000350, "Member 'UWI_ButtonHoverEffectBase_C::OuterFrameColor' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, InnerOutlineSoftTexture) == 0x000368, "Member 'UWI_ButtonHoverEffectBase_C::InnerOutlineSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, InnerOutlineShadowSoftTexture) == 0x000390, "Member 'UWI_ButtonHoverEffectBase_C::InnerOutlineShadowSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_ButtonHoverEffectBase_C, OuterOutlineSoftTexture) == 0x0003B8, "Member 'UWI_ButtonHoverEffectBase_C::OuterOutlineSoftTexture' has a wrong offset!");

}

