#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Buff

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_Buff.WI_Buff_C.CreateProgressBarMaterial
// 0x0008 (0x0008 - 0x0000)
struct WI_Buff_C_CreateProgressBarMaterial final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_CreateProgressBarMaterial) == 0x000008, "Wrong alignment on WI_Buff_C_CreateProgressBarMaterial");
static_assert(sizeof(WI_Buff_C_CreateProgressBarMaterial) == 0x000008, "Wrong size on WI_Buff_C_CreateProgressBarMaterial");
static_assert(offsetof(WI_Buff_C_CreateProgressBarMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'WI_Buff_C_CreateProgressBarMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.ExecuteUbergraph_WI_Buff
// 0x00A8 (0x00A8 - 0x0000)
struct WI_Buff_C_ExecuteUbergraph_WI_Buff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowTooltip;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSafe_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainingTime_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainingTime_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	double                                        CallFunc_Round64_A_ImplicitCast;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetProgressBarFillFraction_InPercent_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_ExecuteUbergraph_WI_Buff) == 0x000008, "Wrong alignment on WI_Buff_C_ExecuteUbergraph_WI_Buff");
static_assert(sizeof(WI_Buff_C_ExecuteUbergraph_WI_Buff) == 0x0000A8, "Wrong size on WI_Buff_C_ExecuteUbergraph_WI_Buff");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, EntryPoint) == 0x000000, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, Temp_bool_Variable) == 0x000004, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, Temp_byte_Variable) == 0x000005, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, Temp_byte_Variable_1) == 0x000006, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, K2Node_CustomEvent_ShowTooltip) == 0x000007, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::K2Node_CustomEvent_ShowTooltip' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, K2Node_Select_Default) == 0x000008, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_GetServerWorldTimeSafe_ReturnValue) == 0x000010, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_GetServerWorldTimeSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_GetRemainingTime_ReturnValue) == 0x000030, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_GetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_GetRemainingTime_ReturnValue_1) == 0x000034, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_GetRemainingTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Round64_ReturnValue) == 0x000038, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Round64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000048, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x000058, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Round64_A_ImplicitCast) == 0x000090, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Round64_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_ExecuteUbergraph_WI_Buff, CallFunc_SetProgressBarFillFraction_InPercent_ImplicitCast) == 0x0000A0, "Member 'WI_Buff_C_ExecuteUbergraph_WI_Buff::CallFunc_SetProgressBarFillFraction_InPercent_ImplicitCast' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.GetRemainingTime
// 0x0008 (0x0008 - 0x0000)
struct WI_Buff_C_GetRemainingTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_GetRemainingTime) == 0x000004, "Wrong alignment on WI_Buff_C_GetRemainingTime");
static_assert(sizeof(WI_Buff_C_GetRemainingTime) == 0x000008, "Wrong size on WI_Buff_C_GetRemainingTime");
static_assert(offsetof(WI_Buff_C_GetRemainingTime, ReturnValue) == 0x000000, "Member 'WI_Buff_C_GetRemainingTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_GetRemainingTime, CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue) == 0x000004, "Member 'WI_Buff_C_GetRemainingTime::CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.HideIfTagRequirementsNotMet
// 0x0030 (0x0030 - 0x0000)
struct WI_Buff_C_HideIfTagRequirementsNotMet final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_HideIfTagRequirementsNotMet) == 0x000008, "Wrong alignment on WI_Buff_C_HideIfTagRequirementsNotMet");
static_assert(sizeof(WI_Buff_C_HideIfTagRequirementsNotMet) == 0x000030, "Wrong size on WI_Buff_C_HideIfTagRequirementsNotMet");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, Temp_bool_Variable) == 0x000000, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, Temp_byte_Variable) == 0x000001, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, Temp_byte_Variable_1) == 0x000002, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x000018, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000028, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_HideIfTagRequirementsNotMet, K2Node_Select_Default) == 0x00002A, "Member 'WI_Buff_C_HideIfTagRequirementsNotMet::K2Node_Select_Default' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.SetCooldownText
// 0x0020 (0x0020 - 0x0000)
struct WI_Buff_C_SetCooldownText final
{
public:
	class FString                                 Cooldown_Text;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WI_Buff_C_SetCooldownText) == 0x000008, "Wrong alignment on WI_Buff_C_SetCooldownText");
static_assert(sizeof(WI_Buff_C_SetCooldownText) == 0x000020, "Wrong size on WI_Buff_C_SetCooldownText");
static_assert(offsetof(WI_Buff_C_SetCooldownText, Cooldown_Text) == 0x000000, "Member 'WI_Buff_C_SetCooldownText::Cooldown_Text' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_SetCooldownText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WI_Buff_C_SetCooldownText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.SetIconTexture
// 0x0028 (0x0028 - 0x0000)
struct WI_Buff_C_SetIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_SetIconTexture) == 0x000008, "Wrong alignment on WI_Buff_C_SetIconTexture");
static_assert(sizeof(WI_Buff_C_SetIconTexture) == 0x000028, "Wrong size on WI_Buff_C_SetIconTexture");
static_assert(offsetof(WI_Buff_C_SetIconTexture, SoftTexture) == 0x000000, "Member 'WI_Buff_C_SetIconTexture::SoftTexture' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.SetProgressBarFillFraction
// 0x0008 (0x0008 - 0x0000)
struct WI_Buff_C_SetProgressBarFillFraction final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_SetProgressBarFillFraction) == 0x000004, "Wrong alignment on WI_Buff_C_SetProgressBarFillFraction");
static_assert(sizeof(WI_Buff_C_SetProgressBarFillFraction) == 0x000008, "Wrong size on WI_Buff_C_SetProgressBarFillFraction");
static_assert(offsetof(WI_Buff_C_SetProgressBarFillFraction, InPercent) == 0x000000, "Member 'WI_Buff_C_SetProgressBarFillFraction::InPercent' has a wrong offset!");
static_assert(offsetof(WI_Buff_C_SetProgressBarFillFraction, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WI_Buff_C_SetProgressBarFillFraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_Buff.WI_Buff_C.Update
// 0x0001 (0x0001 - 0x0000)
struct WI_Buff_C_Update final
{
public:
	bool                                          ShowTooltip;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Buff_C_Update) == 0x000001, "Wrong alignment on WI_Buff_C_Update");
static_assert(sizeof(WI_Buff_C_Update) == 0x000001, "Wrong size on WI_Buff_C_Update");
static_assert(offsetof(WI_Buff_C_Update, ShowTooltip) == 0x000000, "Member 'WI_Buff_C_Update::ShowTooltip' has a wrong offset!");

}

