#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Buff

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Buff.WI_Buff_C
// 0x0160 (0x0440 - 0x02E0)
class UWI_Buff_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Buff_Description;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CooldownTimerLabel;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBG;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayNotTimed;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StackCount;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ProgressBarFillFraction;                           // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CooldownText;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconSoftTexture;                                   // 0x0338(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	double                                        TotalTime;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasDuration;                                       // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               OngoingTagRequirements;                            // 0x0378(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInstanceDynamic*               OverlayMaterial;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingTime;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DescriptionText;                                   // 0x0410(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShowTooltipOnCreation;                             // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            ActiveBuffEffectHandle;                            // 0x0424(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            CooldownBarTint;                                   // 0x042C(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void CreateProgressBarMaterial();
	void ExecuteUbergraph_WI_Buff(int32 EntryPoint);
	float GetRemainingTime();
	void HideIfTagRequirementsNotMet();
	void SetCooldownText(const class FString& Cooldown_Text);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D> SoftTexture);
	void SetProgressBarFillFraction(float InPercent);
	void Update(bool ShowTooltip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Buff_C">();
	}
	static class UWI_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Buff_C>();
	}
};
static_assert(alignof(UWI_Buff_C) == 0x000008, "Wrong alignment on UWI_Buff_C");
static_assert(sizeof(UWI_Buff_C) == 0x000440, "Wrong size on UWI_Buff_C");
static_assert(offsetof(UWI_Buff_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, Buff_Description) == 0x0002E8, "Member 'UWI_Buff_C::Buff_Description' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, CooldownTimerLabel) == 0x0002F0, "Member 'UWI_Buff_C::CooldownTimerLabel' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, Icon) == 0x0002F8, "Member 'UWI_Buff_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, Overlay) == 0x000300, "Member 'UWI_Buff_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, OverlayBG) == 0x000308, "Member 'UWI_Buff_C::OverlayBG' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, OverlayNotTimed) == 0x000310, "Member 'UWI_Buff_C::OverlayNotTimed' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, StackCount) == 0x000318, "Member 'UWI_Buff_C::StackCount' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, ProgressBarFillFraction) == 0x000320, "Member 'UWI_Buff_C::ProgressBarFillFraction' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, CooldownText) == 0x000328, "Member 'UWI_Buff_C::CooldownText' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, IconSoftTexture) == 0x000338, "Member 'UWI_Buff_C::IconSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, TotalTime) == 0x000360, "Member 'UWI_Buff_C::TotalTime' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, StartTime) == 0x000368, "Member 'UWI_Buff_C::StartTime' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, HasDuration) == 0x000370, "Member 'UWI_Buff_C::HasDuration' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, OngoingTagRequirements) == 0x000378, "Member 'UWI_Buff_C::OngoingTagRequirements' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, OverlayMaterial) == 0x000400, "Member 'UWI_Buff_C::OverlayMaterial' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, RemainingTime) == 0x000408, "Member 'UWI_Buff_C::RemainingTime' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, DescriptionText) == 0x000410, "Member 'UWI_Buff_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, ShowTooltipOnCreation) == 0x000420, "Member 'UWI_Buff_C::ShowTooltipOnCreation' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, ActiveBuffEffectHandle) == 0x000424, "Member 'UWI_Buff_C::ActiveBuffEffectHandle' has a wrong offset!");
static_assert(offsetof(UWI_Buff_C, CooldownBarTint) == 0x00042C, "Member 'UWI_Buff_C::CooldownBarTint' has a wrong offset!");

}

