#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Cooldown_Bar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_Cooldown_Bar.WI_Cooldown_Bar_C.ExecuteUbergraph_WI_Cooldown_Bar
// 0x0110 (0x0110 - 0x0000)
struct WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InDuration;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InStartTimestamp;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_InIcon;                         // 0x0068(0x0028)(HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00E8(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar) == 0x000008, "Wrong alignment on WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar");
static_assert(sizeof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar) == 0x000110, "Wrong size on WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, EntryPoint) == 0x000000, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_Event_MyGeometry) == 0x000018, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_CustomEvent_InDuration) == 0x000058, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_CustomEvent_InDuration' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_CustomEvent_InStartTimestamp) == 0x000060, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_CustomEvent_InStartTimestamp' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_CustomEvent_InIcon) == 0x000068, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_CustomEvent_InIcon' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_CustomEvent_Tag) == 0x000090, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000098, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, Temp_byte_Variable) == 0x0000A8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, Temp_byte_Variable_1) == 0x0000A9, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, Temp_bool_Has_Been_Initd_Variable) == 0x0000B8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000C0, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, Temp_bool_Variable) == 0x0000C8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, K2Node_Select_Default) == 0x0000E0, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000E8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000F8, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000100, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000108, "Member 'WI_Cooldown_Bar_C_ExecuteUbergraph_WI_Cooldown_Bar::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WI_Cooldown_Bar.WI_Cooldown_Bar_C.Init
// 0x0040 (0x0040 - 0x0000)
struct WI_Cooldown_Bar_C_Init final
{
public:
	double                                        InDuration;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InStartTimestamp;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              InIcon;                                            // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_0;                                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Cooldown_Bar_C_Init) == 0x000008, "Wrong alignment on WI_Cooldown_Bar_C_Init");
static_assert(sizeof(WI_Cooldown_Bar_C_Init) == 0x000040, "Wrong size on WI_Cooldown_Bar_C_Init");
static_assert(offsetof(WI_Cooldown_Bar_C_Init, InDuration) == 0x000000, "Member 'WI_Cooldown_Bar_C_Init::InDuration' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_Init, InStartTimestamp) == 0x000008, "Member 'WI_Cooldown_Bar_C_Init::InStartTimestamp' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_Init, InIcon) == 0x000010, "Member 'WI_Cooldown_Bar_C_Init::InIcon' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_Init, Tag_0) == 0x000038, "Member 'WI_Cooldown_Bar_C_Init::Tag_0' has a wrong offset!");

// Function WI_Cooldown_Bar.WI_Cooldown_Bar_C.OnRemoveFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature final
{
public:
	class UWI_Cooldown_Bar_C*                     InSelf;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature) == 0x000008, "Wrong alignment on WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature");
static_assert(sizeof(WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature) == 0x000008, "Wrong size on WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature");
static_assert(offsetof(WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature, InSelf) == 0x000000, "Member 'WI_Cooldown_Bar_C_OnRemoveFinished__DelegateSignature::InSelf' has a wrong offset!");

// Function WI_Cooldown_Bar.WI_Cooldown_Bar_C.Tick
// 0x003C (0x003C - 0x0000)
struct WI_Cooldown_Bar_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Cooldown_Bar_C_Tick) == 0x000004, "Wrong alignment on WI_Cooldown_Bar_C_Tick");
static_assert(sizeof(WI_Cooldown_Bar_C_Tick) == 0x00003C, "Wrong size on WI_Cooldown_Bar_C_Tick");
static_assert(offsetof(WI_Cooldown_Bar_C_Tick, MyGeometry) == 0x000000, "Member 'WI_Cooldown_Bar_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_Cooldown_Bar_C_Tick, InDeltaTime) == 0x000038, "Member 'WI_Cooldown_Bar_C_Tick::InDeltaTime' has a wrong offset!");

}

