#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Chat_Match

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_Chat_Match.WI_Chat_Match_C.ExecuteUbergraph_WI_Chat_Match
// 0x0028 (0x0028 - 0x0000)
struct WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_MatchBP_C*                 K2Node_DynamicCast_AsGame_State_JP_Match_BP;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match) == 0x000008, "Wrong alignment on WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match");
static_assert(sizeof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match) == 0x000028, "Wrong size on WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match");
static_assert(offsetof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match, EntryPoint) == 0x000000, "Member 'WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000010, "Member 'WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match, K2Node_DynamicCast_AsGame_State_JP_Match_BP) == 0x000018, "Member 'WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match::K2Node_DynamicCast_AsGame_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WI_Chat_Match_C_ExecuteUbergraph_WI_Chat_Match::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_Chat_Match.WI_Chat_Match_C.OnPreviewKeyDown
// 0x0208 (0x0208 - 0x0000)
struct WI_Chat_Match_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Chat_Match_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on WI_Chat_Match_C_OnPreviewKeyDown");
static_assert(sizeof(WI_Chat_Match_C_OnPreviewKeyDown) == 0x000208, "Wrong size on WI_Chat_Match_C_OnPreviewKeyDown");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, K2Node_MakeStruct_EventReply) == 0x000148, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WI_Chat_Match_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'WI_Chat_Match_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

}

