#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CharacterProgression_Portrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_CharacterProgression_Portrait.WI_CharacterProgression_Portrait_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_CharacterProgression_Portrait_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_Frame;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_CharacterProgression_Portrait(int32 EntryPoint);
	void SetPortrait(const struct FGameplayTag& NeighborTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_CharacterProgression_Portrait_C">();
	}
	static class UWI_CharacterProgression_Portrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_CharacterProgression_Portrait_C>();
	}
};
static_assert(alignof(UWI_CharacterProgression_Portrait_C) == 0x000008, "Wrong alignment on UWI_CharacterProgression_Portrait_C");
static_assert(sizeof(UWI_CharacterProgression_Portrait_C) == 0x000300, "Wrong size on UWI_CharacterProgression_Portrait_C");
static_assert(offsetof(UWI_CharacterProgression_Portrait_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_CharacterProgression_Portrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_CharacterProgression_Portrait_C, Image_BG) == 0x0002E8, "Member 'UWI_CharacterProgression_Portrait_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWI_CharacterProgression_Portrait_C, Image_BG_Frame) == 0x0002F0, "Member 'UWI_CharacterProgression_Portrait_C::Image_BG_Frame' has a wrong offset!");
static_assert(offsetof(UWI_CharacterProgression_Portrait_C, Portrait) == 0x0002F8, "Member 'UWI_CharacterProgression_Portrait_C::Portrait' has a wrong offset!");

}

