#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CenteredAbilityContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_CenteredAbilityContainer.WI_CenteredAbilityContainer_C.AddNewAbility
// 0x0018 (0x0018 - 0x0000)
struct WI_CenteredAbilityContainer_C_AddNewAbility final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UInputAction*                           InputAction;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CenteredAbilityContainer_C_AddNewAbility) == 0x000008, "Wrong alignment on WI_CenteredAbilityContainer_C_AddNewAbility");
static_assert(sizeof(WI_CenteredAbilityContainer_C_AddNewAbility) == 0x000018, "Wrong size on WI_CenteredAbilityContainer_C_AddNewAbility");
static_assert(offsetof(WI_CenteredAbilityContainer_C_AddNewAbility, Description) == 0x000000, "Member 'WI_CenteredAbilityContainer_C_AddNewAbility::Description' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_AddNewAbility, InputAction) == 0x000010, "Member 'WI_CenteredAbilityContainer_C_AddNewAbility::InputAction' has a wrong offset!");

// Function WI_CenteredAbilityContainer.WI_CenteredAbilityContainer_C.ExecuteUbergraph_WI_CenteredAbilityContainer
// 0x0038 (0x0038 - 0x0000)
struct WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0008(0x0010)()
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ItemInfo_Single_Center_C*           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer) == 0x000008, "Wrong alignment on WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer");
static_assert(sizeof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer) == 0x000038, "Wrong size on WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, EntryPoint) == 0x000000, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, K2Node_CustomEvent_Description) == 0x000008, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, K2Node_CustomEvent_InputAction) == 0x000018, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WI_CenteredAbilityContainer_C_ExecuteUbergraph_WI_CenteredAbilityContainer::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

}

