#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ChargeBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ChargeBar.WI_ChargeBar_C
// 0x0058 (0x0338 - 0x02E0)
class UWI_ChargeBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_23;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              OwnerASC;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     Equipped_Equipment;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          Equipped_Item;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayCharge;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeStartedTime;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeFullTime;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ChargeBar(int32 EntryPoint);
	float GetPercent();
	ESlateVisibility GetVisibility_0();
	void LerpDisplayCharge(double Alpha);
	void OnMessageReceived_52F534E4467EF413C58B1489488F3EF5(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_DA5450904A1C77AC87933AAA5D6A6403(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void Reconstruct(class APawn* OldPawn, class APawn* NewPawn);
	void SetEquipmentAndItemInstance(class UEquipmentInstance* Equipped_Equipment_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ChargeBar_C">();
	}
	static class UWI_ChargeBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ChargeBar_C>();
	}
};
static_assert(alignof(UWI_ChargeBar_C) == 0x000008, "Wrong alignment on UWI_ChargeBar_C");
static_assert(sizeof(UWI_ChargeBar_C) == 0x000338, "Wrong size on UWI_ChargeBar_C");
static_assert(offsetof(UWI_ChargeBar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ChargeBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, BG) == 0x0002E8, "Member 'UWI_ChargeBar_C::BG' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, Frame) == 0x0002F0, "Member 'UWI_ChargeBar_C::Frame' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, ProgressBar_23) == 0x0002F8, "Member 'UWI_ChargeBar_C::ProgressBar_23' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, OwnerASC) == 0x000300, "Member 'UWI_ChargeBar_C::OwnerASC' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, Equipped_Equipment) == 0x000308, "Member 'UWI_ChargeBar_C::Equipped_Equipment' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, Equipped_Item) == 0x000310, "Member 'UWI_ChargeBar_C::Equipped_Item' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, DisplayCharge) == 0x000318, "Member 'UWI_ChargeBar_C::DisplayCharge' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, ChargeStartedTime) == 0x000320, "Member 'UWI_ChargeBar_C::ChargeStartedTime' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, ChargeFullTime) == 0x000328, "Member 'UWI_ChargeBar_C::ChargeFullTime' has a wrong offset!");
static_assert(offsetof(UWI_ChargeBar_C, Visible) == 0x000330, "Member 'UWI_ChargeBar_C::Visible' has a wrong offset!");

}

