#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Cooldown_Bar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Cooldown_Bar.WI_Cooldown_Bar_C
// 0x0070 (0x0350 - 0x02E0)
class UWI_Cooldown_Bar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Remove;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Add;                                               // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_40;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TopNumber;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        StartTimestamp;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndTimestamp;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRemoveFinished;                                  // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsShowing;                                         // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag;                                               // 0x0344(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_Cooldown_Bar(int32 EntryPoint);
	void Init(double InDuration, double InStartTimestamp, TSoftObjectPtr<class UTexture2D> InIcon, const struct FGameplayTag& Tag_0);
	void OnRemoveFinished__DelegateSignature(class UWI_Cooldown_Bar_C* InSelf);
	void RemoveBar();
	void StartRemoveAnim();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Cooldown_Bar_C">();
	}
	static class UWI_Cooldown_Bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Cooldown_Bar_C>();
	}
};
static_assert(alignof(UWI_Cooldown_Bar_C) == 0x000008, "Wrong alignment on UWI_Cooldown_Bar_C");
static_assert(sizeof(UWI_Cooldown_Bar_C) == 0x000350, "Wrong size on UWI_Cooldown_Bar_C");
static_assert(offsetof(UWI_Cooldown_Bar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Cooldown_Bar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Remove) == 0x0002E8, "Member 'UWI_Cooldown_Bar_C::Remove' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Add) == 0x0002F0, "Member 'UWI_Cooldown_Bar_C::Add' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Icon) == 0x0002F8, "Member 'UWI_Cooldown_Bar_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Icon_1) == 0x000300, "Member 'UWI_Cooldown_Bar_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Image_40) == 0x000308, "Member 'UWI_Cooldown_Bar_C::Image_40' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, ProgressBar) == 0x000310, "Member 'UWI_Cooldown_Bar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, TopNumber) == 0x000318, "Member 'UWI_Cooldown_Bar_C::TopNumber' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, StartTimestamp) == 0x000320, "Member 'UWI_Cooldown_Bar_C::StartTimestamp' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, EndTimestamp) == 0x000328, "Member 'UWI_Cooldown_Bar_C::EndTimestamp' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, OnRemoveFinished) == 0x000330, "Member 'UWI_Cooldown_Bar_C::OnRemoveFinished' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, IsShowing) == 0x000340, "Member 'UWI_Cooldown_Bar_C::IsShowing' has a wrong offset!");
static_assert(offsetof(UWI_Cooldown_Bar_C, Tag) == 0x000344, "Member 'UWI_Cooldown_Bar_C::Tag' has a wrong offset!");

}

