#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CommonSettingsArrowButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_CommonSettingsArrowButton.WI_CommonSettingsArrowButton_C
// 0x0070 (0x1610 - 0x15A0)
class UWI_CommonSettingsArrowButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ArrowLeft;                                         // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowRight;                                        // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ArrowButtonHoverEffectMinus258x690_C* ButtonHoverEffect;                                 // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DesignerPreviewShowHoverEffect;                    // 0x15C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C1[0x3];                                     // 0x15C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            ArrowColor;                                        // 0x15C4(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            ArrowColorHovered;                                 // 0x15D8(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            ArrowColorPressed;                                 // 0x15EC(0x0014)(Edit, BlueprintVisible)
	bool                                          FlipArrowIcon;                                     // 0x1600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_CommonSettingsArrowButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update();
	void UpdateColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_CommonSettingsArrowButton_C">();
	}
	static class UWI_CommonSettingsArrowButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_CommonSettingsArrowButton_C>();
	}
};
static_assert(alignof(UWI_CommonSettingsArrowButton_C) == 0x000010, "Wrong alignment on UWI_CommonSettingsArrowButton_C");
static_assert(sizeof(UWI_CommonSettingsArrowButton_C) == 0x001610, "Wrong size on UWI_CommonSettingsArrowButton_C");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, UberGraphFrame) == 0x0015A0, "Member 'UWI_CommonSettingsArrowButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ArrowLeft) == 0x0015A8, "Member 'UWI_CommonSettingsArrowButton_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ArrowRight) == 0x0015B0, "Member 'UWI_CommonSettingsArrowButton_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ButtonHoverEffect) == 0x0015B8, "Member 'UWI_CommonSettingsArrowButton_C::ButtonHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, DesignerPreviewShowHoverEffect) == 0x0015C0, "Member 'UWI_CommonSettingsArrowButton_C::DesignerPreviewShowHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ArrowColor) == 0x0015C4, "Member 'UWI_CommonSettingsArrowButton_C::ArrowColor' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ArrowColorHovered) == 0x0015D8, "Member 'UWI_CommonSettingsArrowButton_C::ArrowColorHovered' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, ArrowColorPressed) == 0x0015EC, "Member 'UWI_CommonSettingsArrowButton_C::ArrowColorPressed' has a wrong offset!");
static_assert(offsetof(UWI_CommonSettingsArrowButton_C, FlipArrowIcon) == 0x001600, "Member 'UWI_CommonSettingsArrowButton_C::FlipArrowIcon' has a wrong offset!");

}

