#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Character.WI_Character_C
// 0x00A8 (0x0388 - 0x02E0)
class UWI_Character_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CharacterSilhouette;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCrosshairWI_C*                         CrosshairWI;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedItemBG;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_EquippedItem_C*                     EquippedItemWI;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHitmarkerWI_C*                         HitmarkerWI;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Statusbar_C*                        WI_Buffbar;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CenteredAbilityContainer_C*         WI_CenteredAbilityContainer;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Character_Attributes_C*             WI_Character_Attributes;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ChargeBar_C*                        WI_ChargeBar;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_EquippedItemIcon_C*                 WI_EquippedItemIcon;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_HUD_Cooldowns_C*                    WI_HUD_Cooldowns;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ItemInfo_C*                         WI_ItemInfo;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_LocationState_C*                    WI_LocationState;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ProjectVersion_C*                   WI_ProjectVersion;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_StaminaBar_C*                       WI_StaminaBar;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Vignette_C*                         WI_Vignette;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skeletal_Mesh;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Third_Person_Camera;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstPerson;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddAbilityWidget(class UInputAction* InputAction, const class FText& Description);
	void ExecuteUbergraph_WI_Character(int32 EntryPoint);
	void HideCenteredAbilityInfo();
	void Play_Hitmarker();
	void UpdateGameDebugText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Character_C">();
	}
	static class UWI_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Character_C>();
	}
};
static_assert(alignof(UWI_Character_C) == 0x000008, "Wrong alignment on UWI_Character_C");
static_assert(sizeof(UWI_Character_C) == 0x000388, "Wrong size on UWI_Character_C");
static_assert(offsetof(UWI_Character_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Character_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, CharacterSilhouette) == 0x0002E8, "Member 'UWI_Character_C::CharacterSilhouette' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, CrosshairWI) == 0x0002F0, "Member 'UWI_Character_C::CrosshairWI' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, EquippedItemBG) == 0x0002F8, "Member 'UWI_Character_C::EquippedItemBG' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, EquippedItemWI) == 0x000300, "Member 'UWI_Character_C::EquippedItemWI' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, HitmarkerWI) == 0x000308, "Member 'UWI_Character_C::HitmarkerWI' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, MainOverlay) == 0x000310, "Member 'UWI_Character_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_Buffbar) == 0x000318, "Member 'UWI_Character_C::WI_Buffbar' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_CenteredAbilityContainer) == 0x000320, "Member 'UWI_Character_C::WI_CenteredAbilityContainer' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_Character_Attributes) == 0x000328, "Member 'UWI_Character_C::WI_Character_Attributes' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_ChargeBar) == 0x000330, "Member 'UWI_Character_C::WI_ChargeBar' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_EquippedItemIcon) == 0x000338, "Member 'UWI_Character_C::WI_EquippedItemIcon' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_HUD_Cooldowns) == 0x000340, "Member 'UWI_Character_C::WI_HUD_Cooldowns' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_ItemInfo) == 0x000348, "Member 'UWI_Character_C::WI_ItemInfo' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_LocationState) == 0x000350, "Member 'UWI_Character_C::WI_LocationState' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_ProjectVersion) == 0x000358, "Member 'UWI_Character_C::WI_ProjectVersion' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_StaminaBar) == 0x000360, "Member 'UWI_Character_C::WI_StaminaBar' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, WI_Vignette) == 0x000368, "Member 'UWI_Character_C::WI_Vignette' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, Skeletal_Mesh) == 0x000370, "Member 'UWI_Character_C::Skeletal_Mesh' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, Third_Person_Camera) == 0x000378, "Member 'UWI_Character_C::Third_Person_Camera' has a wrong offset!");
static_assert(offsetof(UWI_Character_C, FirstPerson) == 0x000380, "Member 'UWI_Character_C::FirstPerson' has a wrong offset!");

}

