#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CommonSettingsArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_CommonSettingsArrowButton.WI_CommonSettingsArrowButton_C.ExecuteUbergraph_WI_CommonSettingsArrowButton
// 0x0060 (0x0060 - 0x0000)
struct WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton) == 0x000008, "Wrong alignment on WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton");
static_assert(sizeof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton) == 0x000060, "Wrong size on WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, EntryPoint) == 0x000000, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_bool_Variable) == 0x000004, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_real_Variable) == 0x000008, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_real_Variable_1) == 0x00000C, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_bool_Variable_1) == 0x000010, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_struct_Variable) == 0x000018, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_struct_Variable_1) == 0x000028, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_bool_Variable_2) == 0x000038, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_byte_Variable) == 0x000039, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_byte_Variable_1) == 0x00003A, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_bool_Variable_3) == 0x00003B, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_byte_Variable_2) == 0x00003C, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, Temp_byte_Variable_3) == 0x00003D, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, K2Node_Event_IsDesignTime) == 0x00003E, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, K2Node_Select_Default) == 0x00003F, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, CallFunc_IsHovered_ReturnValue) == 0x000040, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, CallFunc_IsPressed_ReturnValue) == 0x000041, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, K2Node_Select_Default_1) == 0x000044, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, K2Node_Select_Default_2) == 0x000048, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton, K2Node_Select_Default_3) == 0x000058, "Member 'WI_CommonSettingsArrowButton_C_ExecuteUbergraph_WI_CommonSettingsArrowButton::K2Node_Select_Default_3' has a wrong offset!");

// Function WI_CommonSettingsArrowButton.WI_CommonSettingsArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_CommonSettingsArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_CommonSettingsArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_CommonSettingsArrowButton_C_PreConstruct");
static_assert(sizeof(WI_CommonSettingsArrowButton_C_PreConstruct) == 0x000001, "Wrong size on WI_CommonSettingsArrowButton_C_PreConstruct");
static_assert(offsetof(WI_CommonSettingsArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_CommonSettingsArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

