#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Chat_Message

#include "Basic.hpp"

#include "IWChat_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_Chat_Message.WI_Chat_Message_C.ApplyViewModel
// 0x0028 (0x0028 - 0x0000)
struct WI_Chat_Message_C_ApplyViewModel final
{
public:
	struct FChatMessageWidgetViewModel            InViewModel;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_Chat_Message_C_ApplyViewModel) == 0x000008, "Wrong alignment on WI_Chat_Message_C_ApplyViewModel");
static_assert(sizeof(WI_Chat_Message_C_ApplyViewModel) == 0x000028, "Wrong size on WI_Chat_Message_C_ApplyViewModel");
static_assert(offsetof(WI_Chat_Message_C_ApplyViewModel, InViewModel) == 0x000000, "Member 'WI_Chat_Message_C_ApplyViewModel::InViewModel' has a wrong offset!");

// Function WI_Chat_Message.WI_Chat_Message_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WI_Chat_Message_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Chat_Message_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WI_Chat_Message_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WI_Chat_Message_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WI_Chat_Message_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WI_Chat_Message_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WI_Chat_Message_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WI_Chat_Message.WI_Chat_Message_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WI_Chat_Message_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Chat_Message_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WI_Chat_Message_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WI_Chat_Message_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WI_Chat_Message_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WI_Chat_Message_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WI_Chat_Message_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WI_Chat_Message.WI_Chat_Message_C.ExecuteUbergraph_WI_Chat_Message
// 0x00F8 (0x00F8 - 0x0000)
struct WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatMessageType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMessageWidgetViewModel            K2Node_Event_InViewModel;                          // 0x0060(0x0028)(ConstParm)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ListView_ChatMessage_C*             K2Node_DynamicCast_AsBP_List_View_Chat_Message;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0014)()
};
static_assert(alignof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message) == 0x000008, "Wrong alignment on WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message");
static_assert(sizeof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message) == 0x0000F8, "Wrong size on WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, EntryPoint) == 0x000000, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_byte_Variable) == 0x000004, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_struct_Variable) == 0x000008, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_struct_Variable_1) == 0x000018, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_struct_Variable_2) == 0x000028, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_struct_Variable_3) == 0x000038, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, Temp_struct_Variable_4) == 0x000048, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_Event_bIsExpanded) == 0x000058, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_Event_bIsSelected) == 0x000059, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_Event_InViewModel) == 0x000060, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_Event_InViewModel' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_Event_ListItemObject) == 0x000088, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_DynamicCast_AsBP_List_View_Chat_Message) == 0x000090, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_DynamicCast_AsBP_List_View_Chat_Message' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_DynamicCast_AsPlayer_State_JP) == 0x0000A0, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000B0, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_Select_Default) == 0x0000C0, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message, K2Node_MakeStruct_SlateColor) == 0x0000E0, "Member 'WI_Chat_Message_C_ExecuteUbergraph_WI_Chat_Message::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WI_Chat_Message.WI_Chat_Message_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WI_Chat_Message_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Chat_Message_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WI_Chat_Message_C_OnListItemObjectSet");
static_assert(sizeof(WI_Chat_Message_C_OnListItemObjectSet) == 0x000008, "Wrong size on WI_Chat_Message_C_OnListItemObjectSet");
static_assert(offsetof(WI_Chat_Message_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WI_Chat_Message_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

