#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_CurrencyPurchaseModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_CurrencyPurchaseModal.WI_CurrencyPurchaseModal_C
// 0x0028 (0x0458 - 0x0430)
class UWI_CurrencyPurchaseModal_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_BottomBoundActionBar_C*             WI_BottomBoundActionBar;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Finances_C*                         WI_Finances;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         UnlockCost;                                        // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Balance;                                           // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCurrencyNeeded;                                // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_WI_CurrencyPurchaseModal(int32 EntryPoint);
	void OnInitialized();
	void OnPurchaseConfirmed();
	void PreConstruct(bool IsDesignTime);
	void SetRequiredCurrency(int32 RequiredAmount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_CurrencyPurchaseModal_C">();
	}
	static class UWI_CurrencyPurchaseModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_CurrencyPurchaseModal_C>();
	}
};
static_assert(alignof(UWI_CurrencyPurchaseModal_C) == 0x000008, "Wrong alignment on UWI_CurrencyPurchaseModal_C");
static_assert(sizeof(UWI_CurrencyPurchaseModal_C) == 0x000458, "Wrong size on UWI_CurrencyPurchaseModal_C");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, UberGraphFrame) == 0x000430, "Member 'UWI_CurrencyPurchaseModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, WI_BottomBoundActionBar) == 0x000438, "Member 'UWI_CurrencyPurchaseModal_C::WI_BottomBoundActionBar' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, WI_Finances) == 0x000440, "Member 'UWI_CurrencyPurchaseModal_C::WI_Finances' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, UnlockCost) == 0x000448, "Member 'UWI_CurrencyPurchaseModal_C::UnlockCost' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, Balance) == 0x00044C, "Member 'UWI_CurrencyPurchaseModal_C::Balance' has a wrong offset!");
static_assert(offsetof(UWI_CurrencyPurchaseModal_C, ShowCurrencyNeeded) == 0x000450, "Member 'UWI_CurrencyPurchaseModal_C::ShowCurrencyNeeded' has a wrong offset!");

}

