#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Character

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_Character.WI_Character_C.AddAbilityWidget
// 0x0018 (0x0018 - 0x0000)
struct WI_Character_C_AddAbilityWidget final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_Character_C_AddAbilityWidget) == 0x000008, "Wrong alignment on WI_Character_C_AddAbilityWidget");
static_assert(sizeof(WI_Character_C_AddAbilityWidget) == 0x000018, "Wrong size on WI_Character_C_AddAbilityWidget");
static_assert(offsetof(WI_Character_C_AddAbilityWidget, InputAction) == 0x000000, "Member 'WI_Character_C_AddAbilityWidget::InputAction' has a wrong offset!");
static_assert(offsetof(WI_Character_C_AddAbilityWidget, Description) == 0x000008, "Member 'WI_Character_C_AddAbilityWidget::Description' has a wrong offset!");

// Function WI_Character.WI_Character_C.ExecuteUbergraph_WI_Character
// 0x0020 (0x0020 - 0x0000)
struct WI_Character_C_ExecuteUbergraph_WI_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0010(0x0010)()
};
static_assert(alignof(WI_Character_C_ExecuteUbergraph_WI_Character) == 0x000008, "Wrong alignment on WI_Character_C_ExecuteUbergraph_WI_Character");
static_assert(sizeof(WI_Character_C_ExecuteUbergraph_WI_Character) == 0x000020, "Wrong size on WI_Character_C_ExecuteUbergraph_WI_Character");
static_assert(offsetof(WI_Character_C_ExecuteUbergraph_WI_Character, EntryPoint) == 0x000000, "Member 'WI_Character_C_ExecuteUbergraph_WI_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Character_C_ExecuteUbergraph_WI_Character, K2Node_CustomEvent_InputAction) == 0x000008, "Member 'WI_Character_C_ExecuteUbergraph_WI_Character::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(WI_Character_C_ExecuteUbergraph_WI_Character, K2Node_CustomEvent_Description) == 0x000010, "Member 'WI_Character_C_ExecuteUbergraph_WI_Character::K2Node_CustomEvent_Description' has a wrong offset!");

}

