#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Character_Attributes

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_Character_Attributes.WI_Character_Attributes_C.ExecuteUbergraph_WI_Character_Attributes
// 0x00C0 (0x00C0 - 0x0000)
struct WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetNeighborIdentifier_ReturnValue;        // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_GetNeighborDefinition_ReturnValue;        // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes) == 0x000008, "Wrong alignment on WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes");
static_assert(sizeof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes) == 0x0000C0, "Wrong size on WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, EntryPoint) == 0x000000, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, Temp_object_Variable) == 0x000010, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_CustomEvent_Loaded_1) == 0x000028, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, Temp_object_Variable_1) == 0x000050, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000058, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000068, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_AsPlayer_State_JP) == 0x000078, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_GetNeighborIdentifier_ReturnValue) == 0x000084, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_GetNeighborIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_GetNeighborDefinition_ReturnValue) == 0x000090, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_GetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B8, "Member 'WI_Character_Attributes_C_ExecuteUbergraph_WI_Character_Attributes::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function WI_Character_Attributes.WI_Character_Attributes_C.OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358
// 0x0008 (0x0008 - 0x0000)
struct WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358) == 0x000008, "Wrong alignment on WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358");
static_assert(sizeof(WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358) == 0x000008, "Wrong size on WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358");
static_assert(offsetof(WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358, Loaded) == 0x000000, "Member 'WI_Character_Attributes_C_OnLoaded_63E1D11F453DA5304FE7CB88DC9D5358::Loaded' has a wrong offset!");

// Function WI_Character_Attributes.WI_Character_Attributes_C.OnLoaded_D2D190BD4F642E3E1560548AFBE4381A
// 0x0008 (0x0008 - 0x0000)
struct WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A) == 0x000008, "Wrong alignment on WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A");
static_assert(sizeof(WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A) == 0x000008, "Wrong size on WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A");
static_assert(offsetof(WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A, Loaded) == 0x000000, "Member 'WI_Character_Attributes_C_OnLoaded_D2D190BD4F642E3E1560548AFBE4381A::Loaded' has a wrong offset!");

}

