#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DeliveryServiceTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_DeliveryServiceTimer.WI_DeliveryServiceTimer_C
// 0x0030 (0x0310 - 0x02E0)
class UWI_DeliveryServiceTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_69;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTime;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherState;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DeliveryTimer;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DeliveryTimerElapsed();
	void ExecuteUbergraph_WI_DeliveryServiceTimer(int32 EntryPoint);
	void OnInitialized();
	void Set_Is_Out_For_Delivery(bool Enable);
	void Set_Show_Delivery_Service_Timer(bool Enable);
	void Start_Local_Timer(float Time);
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_DeliveryServiceTimer_C">();
	}
	static class UWI_DeliveryServiceTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_DeliveryServiceTimer_C>();
	}
};
static_assert(alignof(UWI_DeliveryServiceTimer_C) == 0x000008, "Wrong alignment on UWI_DeliveryServiceTimer_C");
static_assert(sizeof(UWI_DeliveryServiceTimer_C) == 0x000310, "Wrong size on UWI_DeliveryServiceTimer_C");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_DeliveryServiceTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, Image_69) == 0x0002E8, "Member 'UWI_DeliveryServiceTimer_C::Image_69' has a wrong offset!");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, Image_112) == 0x0002F0, "Member 'UWI_DeliveryServiceTimer_C::Image_112' has a wrong offset!");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, TextTime) == 0x0002F8, "Member 'UWI_DeliveryServiceTimer_C::TextTime' has a wrong offset!");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, WidgetSwitcherState) == 0x000300, "Member 'UWI_DeliveryServiceTimer_C::WidgetSwitcherState' has a wrong offset!");
static_assert(offsetof(UWI_DeliveryServiceTimer_C, DeliveryTimer) == 0x000308, "Member 'UWI_DeliveryServiceTimer_C::DeliveryTimer' has a wrong offset!");

}

