#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DiscordButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_DiscordButton.WI_DiscordButton_C.ExecuteUbergraph_WI_DiscordButton
// 0x0040 (0x0040 - 0x0000)
struct WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLaunchURL_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton) == 0x000008, "Wrong alignment on WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton");
static_assert(sizeof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton) == 0x000040, "Wrong size on WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, EntryPoint) == 0x000000, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton, CallFunc_CanLaunchURL_ReturnValue) == 0x000038, "Member 'WI_DiscordButton_C_ExecuteUbergraph_WI_DiscordButton::CallFunc_CanLaunchURL_ReturnValue' has a wrong offset!");

}

