#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DiscordButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_DiscordButton.WI_DiscordButton_C
// 0x0040 (0x1600 - 0x15C0)
class UWI_DiscordButton_C final : public ULyraButtonBase
{
public:
	uint8                                         Pad_15B8[0x8];                                     // 0x15B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_ButtonHoverEffectMinus480x150_C*    ButtonHoverEffect;                                 // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Discord;                                           // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_241;                                         // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x15E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E9[0x7];                                     // 0x15E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DiscordServerInviteCode;                           // 0x15F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AcceptDiscordServerInvite();
	void BP_OnClicked();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_DiscordButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_DiscordButton_C">();
	}
	static class UWI_DiscordButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_DiscordButton_C>();
	}
};
static_assert(alignof(UWI_DiscordButton_C) == 0x000010, "Wrong alignment on UWI_DiscordButton_C");
static_assert(sizeof(UWI_DiscordButton_C) == 0x001600, "Wrong size on UWI_DiscordButton_C");
static_assert(offsetof(UWI_DiscordButton_C, UberGraphFrame) == 0x0015C0, "Member 'UWI_DiscordButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, OnHovered) == 0x0015C8, "Member 'UWI_DiscordButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, ButtonHoverEffect) == 0x0015D0, "Member 'UWI_DiscordButton_C::ButtonHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, Discord) == 0x0015D8, "Member 'UWI_DiscordButton_C::Discord' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, Image_241) == 0x0015E0, "Member 'UWI_DiscordButton_C::Image_241' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, IsDisabled) == 0x0015E8, "Member 'UWI_DiscordButton_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UWI_DiscordButton_C, DiscordServerInviteCode) == 0x0015F0, "Member 'UWI_DiscordButton_C::DiscordServerInviteCode' has a wrong offset!");

}

