#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DeployableStatus

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_DeploymentInformationGameplayMessage_structs.hpp"


namespace SDK::Params
{

// Function WI_DeployableStatus.WI_DeployableStatus_C.ExecuteUbergraph_WI_DeployableStatus
// 0x0070 (0x0070 - 0x0000)
struct WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DeploymentInformationGameplayMessage Temp_struct_Variable;                              // 0x0008(0x0010)(HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DeploymentInformationGameplayMessage Temp_struct_Variable_1;                            // 0x0038(0x0010)(HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus) == 0x000008, "Wrong alignment on WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus");
static_assert(sizeof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus) == 0x000070, "Wrong size on WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, EntryPoint) == 0x000000, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, Temp_struct_Variable) == 0x000008, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, Temp_struct_Variable_1) == 0x000038, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, Temp_struct_Variable_2) == 0x000048, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, Temp_object_Variable) == 0x000050, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, CallFunc_GetPayload_ReturnValue) == 0x000058, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000060, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WI_DeployableStatus_C_ExecuteUbergraph_WI_DeployableStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_DeployableStatus.WI_DeployableStatus_C.OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7
// 0x0010 (0x0010 - 0x0000)
struct WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7) == 0x000008, "Wrong alignment on WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7");
static_assert(sizeof(WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7) == 0x000010, "Wrong size on WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7");
static_assert(offsetof(WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7, ProxyObject) == 0x000000, "Member 'WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7, ActualChannel) == 0x000008, "Member 'WI_DeployableStatus_C_OnMessageReceived_1AEFA35E48CF67C69E41EFBE7A3815C7::ActualChannel' has a wrong offset!");

}

