#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_DamageValue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_DamageValue.WI_DamageValue_C
// 0x0060 (0x0340 - 0x02E0)
class UWI_DamageValue_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CritNumberAnim;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FloatUp;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextIncomeChange;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextIncomeChangeCrit;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Textnoteffective;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        IncomingHealthDelta;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CriticalHit;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_DamageValue(int32 EntryPoint);
	void GetTextAndColor(class FText* Text, struct FLinearColor* Color);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_DamageValue_C">();
	}
	static class UWI_DamageValue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_DamageValue_C>();
	}
};
static_assert(alignof(UWI_DamageValue_C) == 0x000008, "Wrong alignment on UWI_DamageValue_C");
static_assert(sizeof(UWI_DamageValue_C) == 0x000340, "Wrong size on UWI_DamageValue_C");
static_assert(offsetof(UWI_DamageValue_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_DamageValue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, CritNumberAnim) == 0x0002E8, "Member 'UWI_DamageValue_C::CritNumberAnim' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, FloatUp) == 0x0002F0, "Member 'UWI_DamageValue_C::FloatUp' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, Overlay_2) == 0x0002F8, "Member 'UWI_DamageValue_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, TextIncomeChange) == 0x000300, "Member 'UWI_DamageValue_C::TextIncomeChange' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, TextIncomeChangeCrit) == 0x000308, "Member 'UWI_DamageValue_C::TextIncomeChangeCrit' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, Textnoteffective) == 0x000310, "Member 'UWI_DamageValue_C::Textnoteffective' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, IncomingHealthDelta) == 0x000318, "Member 'UWI_DamageValue_C::IncomingHealthDelta' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, WorldLocation) == 0x000320, "Member 'UWI_DamageValue_C::WorldLocation' has a wrong offset!");
static_assert(offsetof(UWI_DamageValue_C, CriticalHit) == 0x000338, "Member 'UWI_DamageValue_C::CriticalHit' has a wrong offset!");

}

