#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_EventLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_EventLog.WI_EventLog_C
// 0x0040 (0x0320 - 0x02E0)
class UWI_EventLog_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              ListView;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPrintMessageEntryWI_C*>         ActiveMessages;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EMessageCategory                              DeleteAllRef;                                      // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxMessagesShown;                                  // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToFade;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeTimer;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MessageLifetime;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_EventLog(int32 EntryPoint);
	void SendMessage(const struct FS_EventMessageParams& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_EventLog_C">();
	}
	static class UWI_EventLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_EventLog_C>();
	}
};
static_assert(alignof(UWI_EventLog_C) == 0x000008, "Wrong alignment on UWI_EventLog_C");
static_assert(sizeof(UWI_EventLog_C) == 0x000320, "Wrong size on UWI_EventLog_C");
static_assert(offsetof(UWI_EventLog_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_EventLog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, ListView) == 0x0002E8, "Member 'UWI_EventLog_C::ListView' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, ActiveMessages) == 0x0002F0, "Member 'UWI_EventLog_C::ActiveMessages' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, DeleteAllRef) == 0x000300, "Member 'UWI_EventLog_C::DeleteAllRef' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, MaxMessagesShown) == 0x000304, "Member 'UWI_EventLog_C::MaxMessagesShown' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, TimeToFade) == 0x000308, "Member 'UWI_EventLog_C::TimeToFade' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, FadeTimer) == 0x000310, "Member 'UWI_EventLog_C::FadeTimer' has a wrong offset!");
static_assert(offsetof(UWI_EventLog_C, MessageLifetime) == 0x000318, "Member 'UWI_EventLog_C::MessageLifetime' has a wrong offset!");

}

