#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_EquippedItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_EquippedItem.WI_EquippedItem_C.EnableBrokenItemOverlay
// 0x0001 (0x0001 - 0x0000)
struct WI_EquippedItem_C_EnableBrokenItemOverlay final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_EnableBrokenItemOverlay) == 0x000001, "Wrong alignment on WI_EquippedItem_C_EnableBrokenItemOverlay");
static_assert(sizeof(WI_EquippedItem_C_EnableBrokenItemOverlay) == 0x000001, "Wrong size on WI_EquippedItem_C_EnableBrokenItemOverlay");
static_assert(offsetof(WI_EquippedItem_C_EnableBrokenItemOverlay, Enable) == 0x000000, "Member 'WI_EquippedItem_C_EnableBrokenItemOverlay::Enable' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Equipped
// 0x0008 (0x0008 - 0x0000)
struct WI_EquippedItem_C_Equipped final
{
public:
	class UEquipmentInstance*                     Equipment_Instance;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Equipped) == 0x000008, "Wrong alignment on WI_EquippedItem_C_Equipped");
static_assert(sizeof(WI_EquippedItem_C_Equipped) == 0x000008, "Wrong size on WI_EquippedItem_C_Equipped");
static_assert(offsetof(WI_EquippedItem_C_Equipped, Equipment_Instance) == 0x000000, "Member 'WI_EquippedItem_C_Equipped::Equipment_Instance' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.ExecuteUbergraph_WI_EquippedItem
// 0x0160 (0x0160 - 0x0000)
struct WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEquipmentInstance* Instance)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     K2Node_CustomEvent_Instance_1;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     K2Node_CustomEvent_Instance;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentInstance*                     K2Node_CustomEvent_Equipment_Instance;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue_1;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentManagerComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceFromSlot_IsInstanceValid;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentInstance*                     CallFunc_GetInstanceFromSlot_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Percent_For_Equipped_Item_ReturnValue; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentInstance* Instance)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00CC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetInstigator_ReturnValue_1;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_DynamicCast_AsItem_Instance_1;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UItemAction_ItemWheel*            CallFunc_FindActionByType_ReturnValue;             // 0x0120(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FItemWheelInfo                         CallFunc_ConstructItemWheelInfo_ReturnValue;       // 0x0128(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LerpDisplayDurability_Alpha_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LerpDisplayAmmoPercentage_Alpha_ImplicitCast; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem) == 0x000008, "Wrong alignment on WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem");
static_assert(sizeof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem) == 0x000160, "Wrong size on WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, EntryPoint) == 0x000000, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_DynamicCast_AsItem_Instance) == 0x000010, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_DynamicCast_AsItem_Instance' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CustomEvent_Instance_1) == 0x000030, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CustomEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CustomEvent_Instance) == 0x000038, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CustomEvent_Instance' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CustomEvent_Equipment_Instance) == 0x000040, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CustomEvent_Equipment_Instance' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000060, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CustomEvent_OldPawn) == 0x000068, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CustomEvent_NewPawn) == 0x000070, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetPlayerControllerFromID_ReturnValue_1) == 0x000078, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetPlayerControllerFromID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_K2_GetPawn_ReturnValue) == 0x000088, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A0, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetInstanceFromSlot_IsInstanceValid) == 0x0000A9, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetInstanceFromSlot_IsInstanceValid' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetInstanceFromSlot_ReturnValue) == 0x0000B0, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetInstanceFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_Get_Percent_For_Equipped_Item_ReturnValue) == 0x0000B8, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_Get_Percent_For_Equipped_Item_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_Event_MyGeometry) == 0x0000CC, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_Event_InDeltaTime) == 0x000104, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_GetInstigator_ReturnValue_1) == 0x000108, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_DynamicCast_AsItem_Instance_1) == 0x000110, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_DynamicCast_AsItem_Instance_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_FindActionByType_ReturnValue) == 0x000120, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_ConstructItemWheelInfo_ReturnValue) == 0x000128, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_ConstructItemWheelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_IsValid_ReturnValue_3) == 0x000148, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_LerpDisplayDurability_Alpha_ImplicitCast) == 0x000150, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_LerpDisplayDurability_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem, CallFunc_LerpDisplayAmmoPercentage_Alpha_ImplicitCast) == 0x000158, "Member 'WI_EquippedItem_C_ExecuteUbergraph_WI_EquippedItem::CallFunc_LerpDisplayAmmoPercentage_Alpha_ImplicitCast' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Get Actual Ammo Percentage
// 0x00C8 (0x00C8 - 0x0000)
struct WI_EquippedItem_C_Get_Actual_Ammo_Percentage final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     CallFunc_Get_Ammo_Type_Attributes_Attribute;       // 0x0008(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     CallFunc_Get_Ammo_Type_Attributes_MaxAttribute;    // 0x0040(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue_1;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage) == 0x000008, "Wrong alignment on WI_EquippedItem_C_Get_Actual_Ammo_Percentage");
static_assert(sizeof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage) == 0x0000C8, "Wrong size on WI_EquippedItem_C_Get_Actual_Ammo_Percentage");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_Get_Ammo_Type_Attributes_Attribute) == 0x000008, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_Get_Ammo_Type_Attributes_Attribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_Get_Ammo_Type_Attributes_MaxAttribute) == 0x000040, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_Get_Ammo_Type_Attributes_MaxAttribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_HasDefinitionTag_ReturnValue) == 0x000078, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_HasDefinitionTag_ReturnValue_1) == 0x000079, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_HasDefinitionTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_BooleanOR_ReturnValue) == 0x00007A, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x00007B, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00007C, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000080, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000084, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_SafeDivide_ReturnValue) == 0x000088, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetTagStackCount_ReturnValue) == 0x000094, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000098, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A0, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A8, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_SafeDivide_ReturnValue_1) == 0x0000B0, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_SafeDivide_B_ImplicitCast) == 0x0000B8, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Actual_Ammo_Percentage, CallFunc_SafeDivide_A_ImplicitCast) == 0x0000C0, "Member 'WI_EquippedItem_C_Get_Actual_Ammo_Percentage::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Get Ammo Type Attributes
// 0x0078 (0x0078 - 0x0000)
struct WI_EquippedItem_C_Get_Ammo_Type_Attributes final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	struct FGameplayAttribute                     MaxAttribute;                                      // 0x0038(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue_1;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Get_Ammo_Type_Attributes) == 0x000008, "Wrong alignment on WI_EquippedItem_C_Get_Ammo_Type_Attributes");
static_assert(sizeof(WI_EquippedItem_C_Get_Ammo_Type_Attributes) == 0x000078, "Wrong size on WI_EquippedItem_C_Get_Ammo_Type_Attributes");
static_assert(offsetof(WI_EquippedItem_C_Get_Ammo_Type_Attributes, Attribute) == 0x000000, "Member 'WI_EquippedItem_C_Get_Ammo_Type_Attributes::Attribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Ammo_Type_Attributes, MaxAttribute) == 0x000038, "Member 'WI_EquippedItem_C_Get_Ammo_Type_Attributes::MaxAttribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Ammo_Type_Attributes, CallFunc_HasDefinitionTag_ReturnValue) == 0x000070, "Member 'WI_EquippedItem_C_Get_Ammo_Type_Attributes::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Ammo_Type_Attributes, CallFunc_HasDefinitionTag_ReturnValue_1) == 0x000071, "Member 'WI_EquippedItem_C_Get_Ammo_Type_Attributes::CallFunc_HasDefinitionTag_ReturnValue_1' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Get Displayed Durability
// 0x0010 (0x0010 - 0x0000)
struct WI_EquippedItem_C_Get_Displayed_Durability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LerpedDurability;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Get_Displayed_Durability) == 0x000008, "Wrong alignment on WI_EquippedItem_C_Get_Displayed_Durability");
static_assert(sizeof(WI_EquippedItem_C_Get_Displayed_Durability) == 0x000010, "Wrong size on WI_EquippedItem_C_Get_Displayed_Durability");
static_assert(offsetof(WI_EquippedItem_C_Get_Displayed_Durability, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_Get_Displayed_Durability::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Displayed_Durability, LerpedDurability) == 0x000008, "Member 'WI_EquippedItem_C_Get_Displayed_Durability::LerpedDurability' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Get Percent For Equipped Item
// 0x0040 (0x0040 - 0x0000)
struct WI_EquippedItem_C_Get_Percent_For_Equipped_Item final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item) == 0x000008, "Wrong alignment on WI_EquippedItem_C_Get_Percent_For_Equipped_Item");
static_assert(sizeof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item) == 0x000040, "Wrong size on WI_EquippedItem_C_Get_Percent_For_Equipped_Item");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, Temp_bool_Variable) == 0x000004, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, Temp_int_Variable) == 0x000008, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_GetTagStackCount_ReturnValue) == 0x000010, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_ContainsTag_ReturnValue) == 0x000014, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000018, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, K2Node_Select_Default) == 0x00001C, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, CallFunc_NormalizeToRange_ReturnValue) == 0x000030, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_Percent_For_Equipped_Item, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000038, "Member 'WI_EquippedItem_C_Get_Percent_For_Equipped_Item::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.Get_ProgressBar_Durability_FillColorAndOpacity
// 0x0014 (0x0014 - 0x0000)
struct WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverheating_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity) == 0x000004, "Wrong alignment on WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity");
static_assert(sizeof(WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity) == 0x000014, "Wrong size on WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity");
static_assert(offsetof(WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity, CallFunc_IsOverheating_ReturnValue) == 0x000010, "Member 'WI_EquippedItem_C_Get_ProgressBar_Durability_FillColorAndOpacity::CallFunc_IsOverheating_ReturnValue' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.GetAmmoCountText
// 0x0178 (0x0178 - 0x0000)
struct WI_EquippedItem_C_GetAmmoCountText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FGameplayAttribute                     CallFunc_Get_Ammo_Type_Attributes_Attribute;       // 0x0010(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     CallFunc_Get_Ammo_Type_Attributes_MaxAttribute;    // 0x0048(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue_1;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue_2;           // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F8(0x0010)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagStackCount_ReturnValue_1;           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0158(0x0010)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_GetAmmoCountText) == 0x000008, "Wrong alignment on WI_EquippedItem_C_GetAmmoCountText");
static_assert(sizeof(WI_EquippedItem_C_GetAmmoCountText) == 0x000178, "Wrong size on WI_EquippedItem_C_GetAmmoCountText");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_GetAmmoCountText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Get_Ammo_Type_Attributes_Attribute) == 0x000010, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Get_Ammo_Type_Attributes_Attribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Get_Ammo_Type_Attributes_MaxAttribute) == 0x000048, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Get_Ammo_Type_Attributes_MaxAttribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_HasDefinitionTag_ReturnValue) == 0x000080, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_HasDefinitionTag_ReturnValue_1) == 0x000081, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_HasDefinitionTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_HasDefinitionTag_ReturnValue_2) == 0x000082, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_HasDefinitionTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_BooleanOR_ReturnValue) == 0x000083, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000084, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_BooleanOR_ReturnValue_1) == 0x00008C, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_FTrunc_ReturnValue) == 0x000090, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_IntToString_ReturnValue) == 0x000098, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x0000A8, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x0000AC, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_FTrunc_ReturnValue_1) == 0x0000B0, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000B8, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_ContainsTag_ReturnValue) == 0x0000C8, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D0, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000E0, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetTagStackCount_ReturnValue) == 0x0000F0, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetTagStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F8, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000108, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_GetTagStackCount_ReturnValue_1) == 0x000118, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_GetTagStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000120, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000138, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000148, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000158, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_FTrunc_A_ImplicitCast) == 0x000168, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetAmmoCountText, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000170, "Member 'WI_EquippedItem_C_GetAmmoCountText::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.GetDisplayAmmoPercentage
// 0x0008 (0x0008 - 0x0000)
struct WI_EquippedItem_C_GetDisplayAmmoPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_GetDisplayAmmoPercentage) == 0x000004, "Wrong alignment on WI_EquippedItem_C_GetDisplayAmmoPercentage");
static_assert(sizeof(WI_EquippedItem_C_GetDisplayAmmoPercentage) == 0x000008, "Wrong size on WI_EquippedItem_C_GetDisplayAmmoPercentage");
static_assert(offsetof(WI_EquippedItem_C_GetDisplayAmmoPercentage, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_GetDisplayAmmoPercentage::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_GetDisplayAmmoPercentage, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000004, "Member 'WI_EquippedItem_C_GetDisplayAmmoPercentage::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.IsOverheating
// 0x0038 (0x0038 - 0x0000)
struct WI_EquippedItem_C_IsOverheating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDefinitionTag_ReturnValue_1;           // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_IsOverheating) == 0x000008, "Wrong alignment on WI_EquippedItem_C_IsOverheating");
static_assert(sizeof(WI_EquippedItem_C_IsOverheating) == 0x000038, "Wrong size on WI_EquippedItem_C_IsOverheating");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, ReturnValue) == 0x000000, "Member 'WI_EquippedItem_C_IsOverheating::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasDefinitionTag_ReturnValue) == 0x000001, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasDefinitionTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000020, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000030, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_HasDefinitionTag_ReturnValue_1) == 0x000032, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_HasDefinitionTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_BooleanAND_ReturnValue_1) == 0x000033, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_IsOverheating, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'WI_EquippedItem_C_IsOverheating::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.LerpDisplayAmmoPercentage
// 0x0018 (0x0018 - 0x0000)
struct WI_EquippedItem_C_LerpDisplayAmmoPercentage final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Actual_Ammo_Percentage_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpEaseInOut_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_EquippedItem_C_LerpDisplayAmmoPercentage) == 0x000008, "Wrong alignment on WI_EquippedItem_C_LerpDisplayAmmoPercentage");
static_assert(sizeof(WI_EquippedItem_C_LerpDisplayAmmoPercentage) == 0x000018, "Wrong size on WI_EquippedItem_C_LerpDisplayAmmoPercentage");
static_assert(offsetof(WI_EquippedItem_C_LerpDisplayAmmoPercentage, Alpha) == 0x000000, "Member 'WI_EquippedItem_C_LerpDisplayAmmoPercentage::Alpha' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_LerpDisplayAmmoPercentage, CallFunc_Get_Actual_Ammo_Percentage_ReturnValue) == 0x000008, "Member 'WI_EquippedItem_C_LerpDisplayAmmoPercentage::CallFunc_Get_Actual_Ammo_Percentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_EquippedItem_C_LerpDisplayAmmoPercentage, CallFunc_FInterpEaseInOut_ReturnValue) == 0x000010, "Member 'WI_EquippedItem_C_LerpDisplayAmmoPercentage::CallFunc_FInterpEaseInOut_ReturnValue' has a wrong offset!");

// Function WI_EquippedItem.WI_EquippedItem_C.LerpDisplayDurability
// 0x0030 (0x0030 - 0x0000)
struct WI_EquippedItem_C_LerpDisplayDurability final
{
public:
