#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesPurchaseError

#include "Basic.hpp"

#include "IWOnlineServices_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_FinancesPurchaseError.WI_FinancesPurchaseError_C
// 0x0070 (0x04A0 - 0x0430)
class UWI_FinancesPurchaseError_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BodyText;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         WI_JPButton;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EPlatformStoreState, class FText>        StoreStateErrorMessageMap;                         // 0x0450(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_FinancesPurchaseError(int32 EntryPoint);
	void SetErrorInformation(EPlatformStoreState PlatformStoreState, const class FString& TransactionId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_FinancesPurchaseError_C">();
	}
	static class UWI_FinancesPurchaseError_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_FinancesPurchaseError_C>();
	}
};
static_assert(alignof(UWI_FinancesPurchaseError_C) == 0x000008, "Wrong alignment on UWI_FinancesPurchaseError_C");
static_assert(sizeof(UWI_FinancesPurchaseError_C) == 0x0004A0, "Wrong size on UWI_FinancesPurchaseError_C");
static_assert(offsetof(UWI_FinancesPurchaseError_C, UberGraphFrame) == 0x000430, "Member 'UWI_FinancesPurchaseError_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseError_C, BodyText) == 0x000438, "Member 'UWI_FinancesPurchaseError_C::BodyText' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseError_C, HeaderText) == 0x000440, "Member 'UWI_FinancesPurchaseError_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseError_C, WI_JPButton) == 0x000448, "Member 'UWI_FinancesPurchaseError_C::WI_JPButton' has a wrong offset!");
static_assert(offsetof(UWI_FinancesPurchaseError_C, StoreStateErrorMessageMap) == 0x000450, "Member 'UWI_FinancesPurchaseError_C::StoreStateErrorMessageMap' has a wrong offset!");

}

