#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesBundlePurchaseList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_FinancesBundlePurchaseList.WI_FinancesBundlePurchaseList_C
// 0x0058 (0x03A8 - 0x0350)
class UWI_FinancesBundlePurchaseList_C final : public UFinancesBundlePurchaseListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ContainerWidget;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CheapestBundlePrice;                               // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheapestBundleAmount;                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset>> DesignerPreviewCurrencyBundles;                    // 0x0368(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FString                                 DesignerPreviewCurrencyCode;                       // 0x0378(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 DesignerPreviewPrices;                             // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<int32>                                 DesignerPreviewAmounts;                            // 0x0398(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WI_FinancesBundlePurchaseList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetStoreOffers(const TArray<struct FPlatformStoreOffer>& PlatformStoreOffers);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_FinancesBundlePurchaseList_C">();
	}
	static class UWI_FinancesBundlePurchaseList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_FinancesBundlePurchaseList_C>();
	}
};
static_assert(alignof(UWI_FinancesBundlePurchaseList_C) == 0x000008, "Wrong alignment on UWI_FinancesBundlePurchaseList_C");
static_assert(sizeof(UWI_FinancesBundlePurchaseList_C) == 0x0003A8, "Wrong size on UWI_FinancesBundlePurchaseList_C");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, UberGraphFrame) == 0x000350, "Member 'UWI_FinancesBundlePurchaseList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, ContainerWidget) == 0x000358, "Member 'UWI_FinancesBundlePurchaseList_C::ContainerWidget' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, CheapestBundlePrice) == 0x000360, "Member 'UWI_FinancesBundlePurchaseList_C::CheapestBundlePrice' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, CheapestBundleAmount) == 0x000364, "Member 'UWI_FinancesBundlePurchaseList_C::CheapestBundleAmount' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, DesignerPreviewCurrencyBundles) == 0x000368, "Member 'UWI_FinancesBundlePurchaseList_C::DesignerPreviewCurrencyBundles' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, DesignerPreviewCurrencyCode) == 0x000378, "Member 'UWI_FinancesBundlePurchaseList_C::DesignerPreviewCurrencyCode' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, DesignerPreviewPrices) == 0x000388, "Member 'UWI_FinancesBundlePurchaseList_C::DesignerPreviewPrices' has a wrong offset!");
static_assert(offsetof(UWI_FinancesBundlePurchaseList_C, DesignerPreviewAmounts) == 0x000398, "Member 'UWI_FinancesBundlePurchaseList_C::DesignerPreviewAmounts' has a wrong offset!");

}

