#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesThrobber

#include "Basic.hpp"

#include "IWOnlineServices_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_FinancesThrobber.WI_FinancesThrobber_C
// 0x0060 (0x0490 - 0x0430)
class UWI_FinancesThrobber_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       StatusText;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EPlatformStoreState, class FText>        StoreStateMessages;                                // 0x0440(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WI_FinancesThrobber(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetStatusText(EPlatformStoreState PlatformStoreState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_FinancesThrobber_C">();
	}
	static class UWI_FinancesThrobber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_FinancesThrobber_C>();
	}
};
static_assert(alignof(UWI_FinancesThrobber_C) == 0x000008, "Wrong alignment on UWI_FinancesThrobber_C");
static_assert(sizeof(UWI_FinancesThrobber_C) == 0x000490, "Wrong size on UWI_FinancesThrobber_C");
static_assert(offsetof(UWI_FinancesThrobber_C, UberGraphFrame) == 0x000430, "Member 'UWI_FinancesThrobber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_FinancesThrobber_C, StatusText) == 0x000438, "Member 'UWI_FinancesThrobber_C::StatusText' has a wrong offset!");
static_assert(offsetof(UWI_FinancesThrobber_C, StoreStateMessages) == 0x000440, "Member 'UWI_FinancesThrobber_C::StoreStateMessages' has a wrong offset!");

}

