#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_FinancesPurchaseConfirmation

#include "Basic.hpp"

#include "IWOnlineServices_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_FinancesPurchaseConfirmation.WI_FinancesPurchaseConfirmation_C.BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_FinancesPurchaseConfirmation_C_BndEvt__WI_FinancesPurchaseConfirmation_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_FinancesPurchaseConfirmation.WI_FinancesPurchaseConfirmation_C.ExecuteUbergraph_WI_FinancesPurchaseConfirmation
// 0x0010 (0x0010 - 0x0000)
struct WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation) == 0x000008, "Wrong alignment on WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation");
static_assert(sizeof(WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation) == 0x000010, "Wrong size on WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation, EntryPoint) == 0x000000, "Member 'WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WI_FinancesPurchaseConfirmation_C_ExecuteUbergraph_WI_FinancesPurchaseConfirmation::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WI_FinancesPurchaseConfirmation.WI_FinancesPurchaseConfirmation_C.SetPurchaseInformation
// 0x0100 (0x0100 - 0x0000)
struct WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation final
{
public:
	bool                                          WalletUpdateSucceeded;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformStoreOffer                    StoreOffer;                                        // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 TransactionId;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	TSoftObjectPtr<class UOnlineCurrencyBundleDataAsset> CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset; // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
};
static_assert(alignof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation) == 0x000008, "Wrong alignment on WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation");
static_assert(sizeof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation) == 0x000100, "Wrong size on WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, WalletUpdateSucceeded) == 0x000000, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::WalletUpdateSucceeded' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, StoreOffer) == 0x000008, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::StoreOffer' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, TransactionId) == 0x000048, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::TransactionId' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset) == 0x000068, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::CallFunc_TryGetCurrencyBundleDataAsset_CurrencyBundleDataAsset' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue) == 0x000090, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::CallFunc_TryGetCurrencyBundleDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WI_FinancesPurchaseConfirmation_C_SetPurchaseInformation::CallFunc_Format_ReturnValue' has a wrong offset!");

}

