#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Finances

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "IWOnlineServices_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_Finances.WI_Finances_C.ChangeThrobberMessage
// 0x0001 (0x0001 - 0x0000)
struct WI_Finances_C_ChangeThrobberMessage final
{
public:
	EPlatformStoreState                           StoreState;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_ChangeThrobberMessage) == 0x000001, "Wrong alignment on WI_Finances_C_ChangeThrobberMessage");
static_assert(sizeof(WI_Finances_C_ChangeThrobberMessage) == 0x000001, "Wrong size on WI_Finances_C_ChangeThrobberMessage");
static_assert(offsetof(WI_Finances_C_ChangeThrobberMessage, StoreState) == 0x000000, "Member 'WI_Finances_C_ChangeThrobberMessage::StoreState' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.ExecuteUbergraph_WI_Finances
// 0x01E8 (0x01E8 - 0x0000)
struct WI_Finances_C_ExecuteUbergraph_WI_Finances final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWalletUpdateSucceeded;               // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformStoreOffer                    K2Node_Event_StoreOffer;                           // 0x0008(0x0040)(ConstParm)
	class FString                                 K2Node_Event_TransactionID_1;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EPlatformStoreState                           K2Node_Event_StoreState_1;                         // 0x0058(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_TransactionID;                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_1;     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_FinancesPurchaseConfirmation_C*     K2Node_DynamicCast_AsWI_Finances_Purchase_Confirmation; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_FinancesPurchaseError_C*            K2Node_DynamicCast_AsWI_Finances_Purchase_Error;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineCurrency*                        K2Node_DynamicCast_AsOnline_Currency;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0048)(HasGetValueTypeHash)
	EPlatformStoreState                           K2Node_Event_StoreState;                           // 0x0108(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_2;     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_FinancesThrobber_C*                 K2Node_DynamicCast_AsWI_Finances_Throbber;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RequiredCurrencyAmount;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0150(0x0048)(HasGetValueTypeHash)
	TSoftObjectPtr<class UOnlineCurrency>         CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency; // 0x0198(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0010)()
};
static_assert(alignof(WI_Finances_C_ExecuteUbergraph_WI_Finances) == 0x000008, "Wrong alignment on WI_Finances_C_ExecuteUbergraph_WI_Finances");
static_assert(sizeof(WI_Finances_C_ExecuteUbergraph_WI_Finances) == 0x0001E8, "Wrong size on WI_Finances_C_ExecuteUbergraph_WI_Finances");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, EntryPoint) == 0x000000, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_bWalletUpdateSucceeded) == 0x000005, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_bWalletUpdateSucceeded' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_StoreOffer) == 0x000008, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_StoreOffer' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_TransactionID_1) == 0x000048, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_TransactionID_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_StoreState_1) == 0x000058, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_StoreState_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_TransactionID) == 0x000060, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_TransactionID' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000070, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_PushWidgetToLayerStack_ReturnValue_1) == 0x000078, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_PushWidgetToLayerStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_AsWI_Finances_Purchase_Confirmation) == 0x000080, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_AsWI_Finances_Purchase_Confirmation' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_AsWI_Finances_Purchase_Error) == 0x000090, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_AsWI_Finances_Purchase_Error' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, Temp_object_Variable) == 0x0000A0, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_CustomEvent_Loaded) == 0x0000A8, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_AsOnline_Currency) == 0x0000B0, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_AsOnline_Currency' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_Event_StoreState) == 0x000108, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_Event_StoreState' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_PushWidgetToLayerStack_ReturnValue_2) == 0x000110, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_PushWidgetToLayerStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_AsWI_Finances_Throbber) == 0x000118, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_AsWI_Finances_Throbber' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_IsValid_ReturnValue) == 0x000121, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_IsValid_ReturnValue_1) == 0x000122, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_CreateDelegate_OutputDelegate) == 0x000124, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_CustomEvent_RequiredCurrencyAmount) == 0x000134, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_CustomEvent_RequiredCurrencyAmount' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000138, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_CreateDelegate_OutputDelegate_1) == 0x000140, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_MakeStruct_FormatArgumentData_1) == 0x000150, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency) == 0x000198, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue) == 0x0001C0, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, K2Node_MakeArray_Array) == 0x0001C8, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ExecuteUbergraph_WI_Finances, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'WI_Finances_C_ExecuteUbergraph_WI_Finances::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.OnLoaded_8101B2004735CA6DF704D58E812F1A70
// 0x0008 (0x0008 - 0x0000)
struct WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70) == 0x000008, "Wrong alignment on WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70");
static_assert(sizeof(WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70) == 0x000008, "Wrong size on WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70");
static_assert(offsetof(WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70, Loaded) == 0x000000, "Member 'WI_Finances_C_OnLoaded_8101B2004735CA6DF704D58E812F1A70::Loaded' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_Finances_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_PreConstruct) == 0x000001, "Wrong alignment on WI_Finances_C_PreConstruct");
static_assert(sizeof(WI_Finances_C_PreConstruct) == 0x000001, "Wrong size on WI_Finances_C_PreConstruct");
static_assert(offsetof(WI_Finances_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_Finances_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.SetIsModal
// 0x0005 (0x0005 - 0x0000)
struct WI_Finances_C_SetIsModal final
{
public:
	bool                                          IsModal_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_SetIsModal) == 0x000001, "Wrong alignment on WI_Finances_C_SetIsModal");
static_assert(sizeof(WI_Finances_C_SetIsModal) == 0x000005, "Wrong size on WI_Finances_C_SetIsModal");
static_assert(offsetof(WI_Finances_C_SetIsModal, IsModal_0) == 0x000000, "Member 'WI_Finances_C_SetIsModal::IsModal_0' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetIsModal, Temp_bool_Variable) == 0x000001, "Member 'WI_Finances_C_SetIsModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetIsModal, Temp_byte_Variable) == 0x000002, "Member 'WI_Finances_C_SetIsModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetIsModal, Temp_byte_Variable_1) == 0x000003, "Member 'WI_Finances_C_SetIsModal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetIsModal, K2Node_Select_Default) == 0x000004, "Member 'WI_Finances_C_SetIsModal::K2Node_Select_Default' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.SetRequiredCurrency
// 0x0004 (0x0004 - 0x0000)
struct WI_Finances_C_SetRequiredCurrency final
{
public:
	int32                                         RequiredCurrencyAmount_0;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_SetRequiredCurrency) == 0x000004, "Wrong alignment on WI_Finances_C_SetRequiredCurrency");
static_assert(sizeof(WI_Finances_C_SetRequiredCurrency) == 0x000004, "Wrong size on WI_Finances_C_SetRequiredCurrency");
static_assert(offsetof(WI_Finances_C_SetRequiredCurrency, RequiredCurrencyAmount_0) == 0x000000, "Member 'WI_Finances_C_SetRequiredCurrency::RequiredCurrencyAmount_0' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.SetShowRequiredCurrency
// 0x0005 (0x0005 - 0x0000)
struct WI_Finances_C_SetShowRequiredCurrency final
{
public:
	bool                                          ShowRequiredCurrency_0;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_SetShowRequiredCurrency) == 0x000001, "Wrong alignment on WI_Finances_C_SetShowRequiredCurrency");
static_assert(sizeof(WI_Finances_C_SetShowRequiredCurrency) == 0x000005, "Wrong size on WI_Finances_C_SetShowRequiredCurrency");
static_assert(offsetof(WI_Finances_C_SetShowRequiredCurrency, ShowRequiredCurrency_0) == 0x000000, "Member 'WI_Finances_C_SetShowRequiredCurrency::ShowRequiredCurrency_0' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowRequiredCurrency, Temp_bool_Variable) == 0x000001, "Member 'WI_Finances_C_SetShowRequiredCurrency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowRequiredCurrency, Temp_byte_Variable) == 0x000002, "Member 'WI_Finances_C_SetShowRequiredCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowRequiredCurrency, Temp_byte_Variable_1) == 0x000003, "Member 'WI_Finances_C_SetShowRequiredCurrency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowRequiredCurrency, K2Node_Select_Default) == 0x000004, "Member 'WI_Finances_C_SetShowRequiredCurrency::K2Node_Select_Default' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.SetShowWalletCurrency
// 0x0005 (0x0005 - 0x0000)
struct WI_Finances_C_SetShowWalletCurrency final
{
public:
	bool                                          ShowWalletCurrency_0;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_SetShowWalletCurrency) == 0x000001, "Wrong alignment on WI_Finances_C_SetShowWalletCurrency");
static_assert(sizeof(WI_Finances_C_SetShowWalletCurrency) == 0x000005, "Wrong size on WI_Finances_C_SetShowWalletCurrency");
static_assert(offsetof(WI_Finances_C_SetShowWalletCurrency, ShowWalletCurrency_0) == 0x000000, "Member 'WI_Finances_C_SetShowWalletCurrency::ShowWalletCurrency_0' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowWalletCurrency, Temp_bool_Variable) == 0x000001, "Member 'WI_Finances_C_SetShowWalletCurrency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowWalletCurrency, Temp_byte_Variable) == 0x000002, "Member 'WI_Finances_C_SetShowWalletCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowWalletCurrency, Temp_byte_Variable_1) == 0x000003, "Member 'WI_Finances_C_SetShowWalletCurrency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetShowWalletCurrency, K2Node_Select_Default) == 0x000004, "Member 'WI_Finances_C_SetShowWalletCurrency::K2Node_Select_Default' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.SetWalletCurrency
// 0x0005 (0x0005 - 0x0000)
struct WI_Finances_C_SetWalletCurrency final
{
public:
	bool                                          ShowWalletCurrency_0;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_SetWalletCurrency) == 0x000001, "Wrong alignment on WI_Finances_C_SetWalletCurrency");
static_assert(sizeof(WI_Finances_C_SetWalletCurrency) == 0x000005, "Wrong size on WI_Finances_C_SetWalletCurrency");
static_assert(offsetof(WI_Finances_C_SetWalletCurrency, ShowWalletCurrency_0) == 0x000000, "Member 'WI_Finances_C_SetWalletCurrency::ShowWalletCurrency_0' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetWalletCurrency, Temp_bool_Variable) == 0x000001, "Member 'WI_Finances_C_SetWalletCurrency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetWalletCurrency, Temp_byte_Variable) == 0x000002, "Member 'WI_Finances_C_SetWalletCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetWalletCurrency, Temp_byte_Variable_1) == 0x000003, "Member 'WI_Finances_C_SetWalletCurrency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_SetWalletCurrency, K2Node_Select_Default) == 0x000004, "Member 'WI_Finances_C_SetWalletCurrency::K2Node_Select_Default' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.ShowPurchaseErrorModal
// 0x0018 (0x0018 - 0x0000)
struct WI_Finances_C_ShowPurchaseErrorModal final
{
public:
	EPlatformStoreState                           StoreState;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TransactionId;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_ShowPurchaseErrorModal) == 0x000008, "Wrong alignment on WI_Finances_C_ShowPurchaseErrorModal");
static_assert(sizeof(WI_Finances_C_ShowPurchaseErrorModal) == 0x000018, "Wrong size on WI_Finances_C_ShowPurchaseErrorModal");
static_assert(offsetof(WI_Finances_C_ShowPurchaseErrorModal, StoreState) == 0x000000, "Member 'WI_Finances_C_ShowPurchaseErrorModal::StoreState' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ShowPurchaseErrorModal, TransactionId) == 0x000008, "Member 'WI_Finances_C_ShowPurchaseErrorModal::TransactionId' has a wrong offset!");

// Function WI_Finances.WI_Finances_C.ShowPurchaseSuccessModal
// 0x0058 (0x0058 - 0x0000)
struct WI_Finances_C_ShowPurchaseSuccessModal final
{
public:
	bool                                          bWalletUpdateSucceeded;                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformStoreOffer                    StoreOffer;                                        // 0x0008(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 TransactionId;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Finances_C_ShowPurchaseSuccessModal) == 0x000008, "Wrong alignment on WI_Finances_C_ShowPurchaseSuccessModal");
static_assert(sizeof(WI_Finances_C_ShowPurchaseSuccessModal) == 0x000058, "Wrong size on WI_Finances_C_ShowPurchaseSuccessModal");
static_assert(offsetof(WI_Finances_C_ShowPurchaseSuccessModal, bWalletUpdateSucceeded) == 0x000000, "Member 'WI_Finances_C_ShowPurchaseSuccessModal::bWalletUpdateSucceeded' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ShowPurchaseSuccessModal, StoreOffer) == 0x000008, "Member 'WI_Finances_C_ShowPurchaseSuccessModal::StoreOffer' has a wrong offset!");
static_assert(offsetof(WI_Finances_C_ShowPurchaseSuccessModal, TransactionId) == 0x000048, "Member 'WI_Finances_C_ShowPurchaseSuccessModal::TransactionId' has a wrong offset!");

}

