#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseScreen_HousePreviewPopup

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "S_PreviewHouseChangedMessage_structs.hpp"
#include "S_HouseBoughtMessage_structs.hpp"


namespace SDK::Params
{

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_NextHouseSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_BndEvt__WI_HouseScreen_HousePreviewPopup_PrevHouseSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup
// 0x0350 (0x0350 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_GetSelectedHouseOrDefault_SelectedHouse;  // 0x0028(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_BackButton_C*                       CallFunc_GetBackButton_BackButton;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   Temp_struct_Variable;                              // 0x00B0(0x0048)(ConstParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHouseOwned_ReturnValue;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreviewHouseChangedMessage          K2Node_MakeStruct_S_PreviewHouseChangedMessage;    // 0x0100(0x0030)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   CallFunc_GetUnlockInfo_StoreItemData;              // 0x0150(0x0048)()
	struct FOnlineStoreItemData                   CallFunc_Map_Find_Value;                           // 0x0198(0x0048)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_UnlockConfirmation_C*               K2Node_DynamicCast_AsWI_Unlock_Confirmation;       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_1;     // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurSpinner_C*               K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner;      // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrencyAmount_ReturnValue;            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_2;     // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_CurrencyPurchaseModal_C*            K2Node_DynamicCast_AsWI_Currency_Purchase_Modal;   // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetHouseID_ReturnValue;                   // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HouseBoughtMessage                  K2Node_MakeStruct_S_HouseBoughtMessage;            // 0x02C8(0x0028)(HasGetValueTypeHash)
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue; // 0x02F0(0x0048)()
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue_3;     // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_OverlayBlurErrorNotification_C*     K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification; // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup) == 0x000350, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, EntryPoint) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetSelectedHouseOrDefault_SelectedHouse) == 0x000028, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetSelectedHouseOrDefault_SelectedHouse' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x000058, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x000080, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetBackButton_BackButton) == 0x000098, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetBackButton_BackButton' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CustomEvent_Button) == 0x0000A0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_MathExpression_ReturnValue) == 0x0000A8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_MathExpression_ReturnValue_1) == 0x0000AC, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, Temp_struct_Variable) == 0x0000B0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_Array_Find_ReturnValue) == 0x0000F8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_IsHouseOwned_ReturnValue) == 0x0000FC, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_IsHouseOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_MakeStruct_S_PreviewHouseChangedMessage) == 0x000100, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_MakeStruct_S_PreviewHouseChangedMessage' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_2) == 0x000140, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetUnlockInfo_StoreItemData) == 0x000150, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetUnlockInfo_StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_Map_Find_Value) == 0x000198, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_Map_Find_ReturnValue) == 0x0001E0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001E8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001F0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x0001F8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_AsWI_Unlock_Confirmation) == 0x000200, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_AsWI_Unlock_Confirmation' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_3) == 0x00020C, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_4) == 0x00021C, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_PushWidgetToLayerStack_ReturnValue_1) == 0x000230, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_PushWidgetToLayerStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner) == 0x000238, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_AsWI_Overlay_Blur_Spinner' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_bSuccess_1) == 0x000240, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000248, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_SwitchEnum_CmpSuccess) == 0x000250, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000251, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetCurrencyAmount_ReturnValue) == 0x000254, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetCurrencyAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000258, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_5) == 0x00025C, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CreateDelegate_OutputDelegate_6) == 0x00026C, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_CustomEvent_ErrorMessage) == 0x000280, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000290, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_PushWidgetToLayerStack_ReturnValue_2) == 0x000298, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_PushWidgetToLayerStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_AsWI_Currency_Purchase_Modal) == 0x0002A0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_AsWI_Currency_Purchase_Modal' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0002B0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_GetHouseID_ReturnValue) == 0x0002B8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_GetHouseID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0002C0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_MakeStruct_S_HouseBoughtMessage) == 0x0002C8, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_MakeStruct_S_HouseBoughtMessage' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue) == 0x0002F0, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_MakeOnlineStoreItemDataNoUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, CallFunc_PushWidgetToLayerStack_ReturnValue_3) == 0x000338, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::CallFunc_PushWidgetToLayerStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification) == 0x000340, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_AsWI_Overlay_Blur_Error_Notification' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup, K2Node_DynamicCast_bSuccess_3) == 0x000348, "Member 'WI_HouseScreen_HousePreviewPopup_C_ExecuteUbergraph_WI_HouseScreen_HousePreviewPopup::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.GetSelectedHouseOrDefault
// 0x0090 (0x0090 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        SelectedHouse_0;                                   // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition; // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHouseDefinition>        CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition_1; // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetHouseDefinition_ReturnValue_1;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault) == 0x000090, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, SelectedHouse_0) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::SelectedHouse_0' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition) == 0x000028, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_TryGetHouseDefinition_ReturnValue) == 0x000050, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_TryGetHouseDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000051, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition_1) == 0x000058, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_TryGetHouseDefinition_OutSoftHouseDefinition_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_TryGetHouseDefinition_ReturnValue_1) == 0x000080, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_TryGetHouseDefinition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault, CallFunc_Array_Get_Item) == 0x000084, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetSelectedHouseOrDefault::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.GetUnlockInfo
// 0x00A0 (0x00A0 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo final
{
public:
	struct FGameplayTag                           AssetID;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   StoreItemData;                                     // 0x0008(0x0048)(Parm, OutParm)
	struct FOnlineStoreItemData                   CallFunc_Map_Find_Value;                           // 0x0050(0x0048)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo) == 0x0000A0, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo, AssetID) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo::AssetID' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo, StoreItemData) == 0x000008, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo::StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo, CallFunc_Map_Find_Value) == 0x000050, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'WI_HouseScreen_HousePreviewPopup_C_GetUnlockInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.HandleTopMenuBackButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked) == 0x000008, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked, Button) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_HandleTopMenuBackButtonClicked::Button' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.IsHouseOwned
// 0x0060 (0x0060 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned final
{
public:
	struct FGameplayTag                           HouseDefinition;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineStoreItemData                   CallFunc_GetUnlockInfo_StoreItemData;              // 0x0010(0x0048)()
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned) == 0x000060, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned, HouseDefinition) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned::HouseDefinition' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned, ReturnValue) == 0x000008, "Member 'WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned, CallFunc_GetUnlockInfo_StoreItemData) == 0x000010, "Member 'WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned::CallFunc_GetUnlockInfo_StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000058, "Member 'WI_HouseScreen_HousePreviewPopup_C_IsHouseOwned::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.OnEquipHouse__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature final
{
public:
	struct FGameplayTag                           HouseID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature) == 0x000004, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature) == 0x000008, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature, HouseID) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_OnEquipHouse__DelegateSignature::HouseID' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.OnUnlockError
// 0x0010 (0x0010 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_OnUnlockError final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockError) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_OnUnlockError");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockError) == 0x000010, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_OnUnlockError");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockError, ErrorMessage) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_OnUnlockError::ErrorMessage' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.OnUnlockHouse__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature final
{
public:
	struct FOnlineStoreItemData                   UnlockedItemData;                                  // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature) == 0x000048, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature, UnlockedItemData) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_OnUnlockHouse__DelegateSignature::UnlockedItemData' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_PreConstruct) == 0x000001, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_PreConstruct");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_PreConstruct) == 0x000001, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_PreConstruct");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.SetHouseData
// 0x0070 (0x0070 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_SetHouseData final
{
public:
	TArray<struct FGameplayTag>                   Houses_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<struct FGameplayTag, struct FOnlineStoreItemData> StoreData_0;                                       // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           SelectedHouse_0;                                   // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_SetHouseData");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData) == 0x000070, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_SetHouseData");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData, Houses_0) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_SetHouseData::Houses_0' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData, StoreData_0) == 0x000010, "Member 'WI_HouseScreen_HousePreviewPopup_C_SetHouseData::StoreData_0' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData, SelectedHouse_0) == 0x000060, "Member 'WI_HouseScreen_HousePreviewPopup_C_SetHouseData::SelectedHouse_0' has a wrong offset!");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_SetHouseData, CallFunc_Array_Find_ReturnValue) == 0x000068, "Member 'WI_HouseScreen_HousePreviewPopup_C_SetHouseData::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WI_HouseScreen_HousePreviewPopup.WI_HouseScreen_HousePreviewPopup_C.SetHouseNameFromHouseDefinition
// 0x0048 (0x0048 - 0x0000)
struct WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition final
{
public:
	TSoftObjectPtr<class UHouseDefinition>        SelectedHouseDefinition;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHouseDefinition*                       K2Node_DynamicCast_AsHouse_Definition;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition) == 0x000008, "Wrong alignment on WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition");
static_assert(sizeof(WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition) == 0x000048, "Wrong size on WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition");
static_assert(offsetof(WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition, SelectedHouseDefinition) == 0x000000, "Member 'WI_HouseScreen_HousePreviewPopup_C_SetHouseNameFromHouseDefinition::SelectedHouseDefinition' has a wrong offset!");
