#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HouseLevel.WI_HouseLevel_C
// 0x0028 (0x0308 - 0x02E0)
class UWI_HouseLevel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pulse;                                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_Level;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETeamType                                     TeamType;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Blue_Horizontal_Alignment;                         // 0x02F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Blue_Justification;                                // 0x02FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Red_Horizontal_Alignment;                          // 0x02FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Red_Justification;                                 // 0x02FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HouseLevel;                                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_HouseLevel(int32 EntryPoint);
	void On_UpdateHouseLevel(int32 Level);
	void PreConstruct(bool IsDesignTime);
	void SetHouseLevel(int32 HouseLevel_0);
	void SetTeamType(ETeamType TeamType_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HouseLevel_C">();
	}
	static class UWI_HouseLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HouseLevel_C>();
	}
};
static_assert(alignof(UWI_HouseLevel_C) == 0x000008, "Wrong alignment on UWI_HouseLevel_C");
static_assert(sizeof(UWI_HouseLevel_C) == 0x000308, "Wrong size on UWI_HouseLevel_C");
static_assert(offsetof(UWI_HouseLevel_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_HouseLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Pulse) == 0x0002E8, "Member 'UWI_HouseLevel_C::Pulse' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Text_Level) == 0x0002F0, "Member 'UWI_HouseLevel_C::Text_Level' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, TeamType) == 0x0002F8, "Member 'UWI_HouseLevel_C::TeamType' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Blue_Horizontal_Alignment) == 0x0002F9, "Member 'UWI_HouseLevel_C::Blue_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Blue_Justification) == 0x0002FA, "Member 'UWI_HouseLevel_C::Blue_Justification' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Red_Horizontal_Alignment) == 0x0002FB, "Member 'UWI_HouseLevel_C::Red_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, Red_Justification) == 0x0002FC, "Member 'UWI_HouseLevel_C::Red_Justification' has a wrong offset!");
static_assert(offsetof(UWI_HouseLevel_C, HouseLevel) == 0x000300, "Member 'UWI_HouseLevel_C::HouseLevel' has a wrong offset!");

}

