#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HUD_Match

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HUD_Match.WI_HUD_Match_C
// 0x00A8 (0x04E8 - 0x0440)
class UWI_HUD_Match_C final : public UJPHUDWidget_Match
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInteractButtonWI_C*                    InteractButtonWI;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrintMessageWI_C*                      PrintMessageWI;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_AbilityBar_C*                       WI_AbilityBar;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_AdditionalHealthBar_C*              WI_AdditionalHealthBar;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_BuffList_C*                         WI_BuffList;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Character_C*                        WI_Character;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Chat_Match_C*                       WI_Chat_Match;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_DeathGrayoutWrapper_C*              WI_DeathGrayoutWrapper;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_DeliveryServiceTimer_C*             WI_DeliveryServiceTimer;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_DeployableStatus_C*                 WI_DeployableStatus;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_EventLog_C*                         WI_EventLog;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ImportantNotifications_C*           WI_ImportantNotifications;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_KillFeed_C*                         WI_KillFeed;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ObjectiveList_C*                    WI_ObjectiveList;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PerkAbilityContainer_C*             WI_PerkAbilityContainer;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ScreenSplat_Container_C*            WI_ScreenSplat;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SurrenderVoteHUD_C*                 WI_SurrenderVoteHUD;                               // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TeamStatusBar_C*                    WI_TeamStatusBar;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TimeOfDay_C*                        WI_TimeOfDay;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_VoiceChat_C*                        WI_VoiceChat;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeactivated();
	void ExecuteUbergraph_WI_HUD_Match(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HUD_Match_C">();
	}
	static class UWI_HUD_Match_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HUD_Match_C>();
	}
};
static_assert(alignof(UWI_HUD_Match_C) == 0x000008, "Wrong alignment on UWI_HUD_Match_C");
static_assert(sizeof(UWI_HUD_Match_C) == 0x0004E8, "Wrong size on UWI_HUD_Match_C");
static_assert(offsetof(UWI_HUD_Match_C, UberGraphFrame) == 0x000440, "Member 'UWI_HUD_Match_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, InteractButtonWI) == 0x000448, "Member 'UWI_HUD_Match_C::InteractButtonWI' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, PrintMessageWI) == 0x000450, "Member 'UWI_HUD_Match_C::PrintMessageWI' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_AbilityBar) == 0x000458, "Member 'UWI_HUD_Match_C::WI_AbilityBar' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_AdditionalHealthBar) == 0x000460, "Member 'UWI_HUD_Match_C::WI_AdditionalHealthBar' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_BuffList) == 0x000468, "Member 'UWI_HUD_Match_C::WI_BuffList' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_Character) == 0x000470, "Member 'UWI_HUD_Match_C::WI_Character' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_Chat_Match) == 0x000478, "Member 'UWI_HUD_Match_C::WI_Chat_Match' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_DeathGrayoutWrapper) == 0x000480, "Member 'UWI_HUD_Match_C::WI_DeathGrayoutWrapper' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_DeliveryServiceTimer) == 0x000488, "Member 'UWI_HUD_Match_C::WI_DeliveryServiceTimer' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_DeployableStatus) == 0x000490, "Member 'UWI_HUD_Match_C::WI_DeployableStatus' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_EventLog) == 0x000498, "Member 'UWI_HUD_Match_C::WI_EventLog' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_ImportantNotifications) == 0x0004A0, "Member 'UWI_HUD_Match_C::WI_ImportantNotifications' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_KillFeed) == 0x0004A8, "Member 'UWI_HUD_Match_C::WI_KillFeed' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_ObjectiveList) == 0x0004B0, "Member 'UWI_HUD_Match_C::WI_ObjectiveList' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_PerkAbilityContainer) == 0x0004B8, "Member 'UWI_HUD_Match_C::WI_PerkAbilityContainer' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_ScreenSplat) == 0x0004C0, "Member 'UWI_HUD_Match_C::WI_ScreenSplat' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_SurrenderVoteHUD) == 0x0004C8, "Member 'UWI_HUD_Match_C::WI_SurrenderVoteHUD' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_TeamStatusBar) == 0x0004D0, "Member 'UWI_HUD_Match_C::WI_TeamStatusBar' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_TimeOfDay) == 0x0004D8, "Member 'UWI_HUD_Match_C::WI_TimeOfDay' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Match_C, WI_VoiceChat) == 0x0004E0, "Member 'UWI_HUD_Match_C::WI_VoiceChat' has a wrong offset!");

}

