#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HomingWrenchTracking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HomingWrenchTracking.WI_HomingWrenchTracking_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_HomingWrenchTracking_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_47;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_HomingWrenchTracking(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HomingWrenchTracking_C">();
	}
	static class UWI_HomingWrenchTracking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HomingWrenchTracking_C>();
	}
};
static_assert(alignof(UWI_HomingWrenchTracking_C) == 0x000008, "Wrong alignment on UWI_HomingWrenchTracking_C");
static_assert(sizeof(UWI_HomingWrenchTracking_C) == 0x0002F8, "Wrong size on UWI_HomingWrenchTracking_C");
static_assert(offsetof(UWI_HomingWrenchTracking_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_HomingWrenchTracking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_HomingWrenchTracking_C, Anim) == 0x0002E8, "Member 'UWI_HomingWrenchTracking_C::Anim' has a wrong offset!");
static_assert(offsetof(UWI_HomingWrenchTracking_C, Image_47) == 0x0002F0, "Member 'UWI_HomingWrenchTracking_C::Image_47' has a wrong offset!");

}

