#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HitDirection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HitDirection.WI_HitDirection_C
// 0x0060 (0x0340 - 0x02E0)
class UWI_HitDirection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           HitAnchor;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Lifetime;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldHitPosition;                                  // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DamageMagnitude;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             SmallDamageTexture;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MediumDamageTexture;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BigDamageTexture;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DrawLocationOnAvatarPlane();
	void DrawLocationOnSwitchedPlane();
	void ExecuteUbergraph_WI_HitDirection(int32 EntryPoint);
	struct FVector GetLocationOnProjectedAvatarPlane();
	void GetNormalizedScreenSpacePosition(struct FVector2D* Return_Value, double* Angle);
	struct FVector GetOwnerLocation();
	const struct FTransform GetOwnerTransform();
	void GetPlaneData(struct FPlane* OutPlane);
	void PlayDamageSound();
	void RemoveWidget();
	void Set_Texture_According_to_Damage();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HitDirection_C">();
	}
	static class UWI_HitDirection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HitDirection_C>();
	}
};
static_assert(alignof(UWI_HitDirection_C) == 0x000008, "Wrong alignment on UWI_HitDirection_C");
static_assert(sizeof(UWI_HitDirection_C) == 0x000340, "Wrong size on UWI_HitDirection_C");
static_assert(offsetof(UWI_HitDirection_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_HitDirection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, Fade) == 0x0002E8, "Member 'UWI_HitDirection_C::Fade' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, HitAnchor) == 0x0002F0, "Member 'UWI_HitDirection_C::HitAnchor' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, Image) == 0x0002F8, "Member 'UWI_HitDirection_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, Lifetime) == 0x000300, "Member 'UWI_HitDirection_C::Lifetime' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, WorldHitPosition) == 0x000308, "Member 'UWI_HitDirection_C::WorldHitPosition' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, DamageMagnitude) == 0x000320, "Member 'UWI_HitDirection_C::DamageMagnitude' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, SmallDamageTexture) == 0x000328, "Member 'UWI_HitDirection_C::SmallDamageTexture' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, MediumDamageTexture) == 0x000330, "Member 'UWI_HitDirection_C::MediumDamageTexture' has a wrong offset!");
static_assert(offsetof(UWI_HitDirection_C, BigDamageTexture) == 0x000338, "Member 'UWI_HitDirection_C::BigDamageTexture' has a wrong offset!");

}

