#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HUD_Cooldowns

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HUD_Cooldowns.WI_HUD_Cooldowns_C
// 0x0068 (0x0348 - 0x02E0)
class UWI_HUD_Cooldowns_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BarList;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_34;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class UWI_Cooldown_Bar_C*> Cooldowns;                                         // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddCooldown(const struct FGameplayTag& InTag, double InDuration, TSoftObjectPtr<class UTexture2D> InIcon);
	void ExecuteUbergraph_WI_HUD_Cooldowns(int32 EntryPoint);
	void OnRemove(class UWI_Cooldown_Bar_C* InSelf);
	void RemoveCooldown(const struct FGameplayTag& InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HUD_Cooldowns_C">();
	}
	static class UWI_HUD_Cooldowns_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HUD_Cooldowns_C>();
	}
};
static_assert(alignof(UWI_HUD_Cooldowns_C) == 0x000008, "Wrong alignment on UWI_HUD_Cooldowns_C");
static_assert(sizeof(UWI_HUD_Cooldowns_C) == 0x000348, "Wrong size on UWI_HUD_Cooldowns_C");
static_assert(offsetof(UWI_HUD_Cooldowns_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_HUD_Cooldowns_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Cooldowns_C, BarList) == 0x0002E8, "Member 'UWI_HUD_Cooldowns_C::BarList' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Cooldowns_C, RetainerBox_34) == 0x0002F0, "Member 'UWI_HUD_Cooldowns_C::RetainerBox_34' has a wrong offset!");
static_assert(offsetof(UWI_HUD_Cooldowns_C, Cooldowns) == 0x0002F8, "Member 'UWI_HUD_Cooldowns_C::Cooldowns' has a wrong offset!");

}

