#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_HouseUpgradeInfobox

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_HouseUpgradeInfobox.WI_HouseUpgradeInfobox_C
// 0x0038 (0x0318 - 0x02E0)
class UWI_HouseUpgradeInfobox_C final : public UUserWidget
{
public:
	class UBorder*                                Border_Ready;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_348;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HouseLevel;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCostTitle;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Prompt;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_HouseUpgradeInfobox_C">();
	}
	static class UWI_HouseUpgradeInfobox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_HouseUpgradeInfobox_C>();
	}
};
static_assert(alignof(UWI_HouseUpgradeInfobox_C) == 0x000008, "Wrong alignment on UWI_HouseUpgradeInfobox_C");
static_assert(sizeof(UWI_HouseUpgradeInfobox_C) == 0x000318, "Wrong size on UWI_HouseUpgradeInfobox_C");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, Border_Ready) == 0x0002E0, "Member 'UWI_HouseUpgradeInfobox_C::Border_Ready' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, Image_2) == 0x0002E8, "Member 'UWI_HouseUpgradeInfobox_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, Image_62) == 0x0002F0, "Member 'UWI_HouseUpgradeInfobox_C::Image_62' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, Spacer_348) == 0x0002F8, "Member 'UWI_HouseUpgradeInfobox_C::Spacer_348' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, TextBlock_HouseLevel) == 0x000300, "Member 'UWI_HouseUpgradeInfobox_C::TextBlock_HouseLevel' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, TextCostTitle) == 0x000308, "Member 'UWI_HouseUpgradeInfobox_C::TextCostTitle' has a wrong offset!");
static_assert(offsetof(UWI_HouseUpgradeInfobox_C, WidgetSwitcher_Prompt) == 0x000310, "Member 'UWI_HouseUpgradeInfobox_C::WidgetSwitcher_Prompt' has a wrong offset!");

}

