#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_InterpolatingProgressbar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_InterpolatingProgressbar.WI_InterpolatingProgressbar_C
// 0x0080 (0x0360 - 0x02E0)
class UWI_InterpolatingProgressbar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NotifyStaminaCost;                                 // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Main;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Progressbar;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_121;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Amount;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        NewPercentage;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayPercentage;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextSpaceWidth;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextHeightOffset;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FontSize;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextAngle;                                         // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_InterpolatingProgressbar(int32 EntryPoint);
	void InterpolateBar(double DeltaTime);
	void Play_Warning_Animation();
	void PreConstruct(bool IsDesignTime);
	void SetFontSize();
	void SetProgress(double New_Stamina, double MaxStamina);
	void SetText(double New_Stamina);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateValues(double CurrentStamina, double MaxStamina);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_InterpolatingProgressbar_C">();
	}
	static class UWI_InterpolatingProgressbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_InterpolatingProgressbar_C>();
	}
};
static_assert(alignof(UWI_InterpolatingProgressbar_C) == 0x000008, "Wrong alignment on UWI_InterpolatingProgressbar_C");
static_assert(sizeof(UWI_InterpolatingProgressbar_C) == 0x000360, "Wrong size on UWI_InterpolatingProgressbar_C");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_InterpolatingProgressbar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, NotifyStaminaCost) == 0x0002E8, "Member 'UWI_InterpolatingProgressbar_C::NotifyStaminaCost' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, Image_73) == 0x0002F0, "Member 'UWI_InterpolatingProgressbar_C::Image_73' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, ProgressBar) == 0x0002F8, "Member 'UWI_InterpolatingProgressbar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, SizeBox_Main) == 0x000300, "Member 'UWI_InterpolatingProgressbar_C::SizeBox_Main' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, SizeBox_Progressbar) == 0x000308, "Member 'UWI_InterpolatingProgressbar_C::SizeBox_Progressbar' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, Spacer_121) == 0x000310, "Member 'UWI_InterpolatingProgressbar_C::Spacer_121' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, TextBlock_Amount) == 0x000318, "Member 'UWI_InterpolatingProgressbar_C::TextBlock_Amount' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, NewPercentage) == 0x000320, "Member 'UWI_InterpolatingProgressbar_C::NewPercentage' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, DisplayPercentage) == 0x000328, "Member 'UWI_InterpolatingProgressbar_C::DisplayPercentage' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, Color) == 0x000330, "Member 'UWI_InterpolatingProgressbar_C::Color' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, Width) == 0x000340, "Member 'UWI_InterpolatingProgressbar_C::Width' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, Height) == 0x000344, "Member 'UWI_InterpolatingProgressbar_C::Height' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, TextSpaceWidth) == 0x000348, "Member 'UWI_InterpolatingProgressbar_C::TextSpaceWidth' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, TextHeightOffset) == 0x000350, "Member 'UWI_InterpolatingProgressbar_C::TextHeightOffset' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, FontSize) == 0x000358, "Member 'UWI_InterpolatingProgressbar_C::FontSize' has a wrong offset!");
static_assert(offsetof(UWI_InterpolatingProgressbar_C, TextAngle) == 0x00035C, "Member 'UWI_InterpolatingProgressbar_C::TextAngle' has a wrong offset!");

}

