#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ItemInfo_Single_Center

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ItemInfo_Single_Center.WI_ItemInfo_Single_Center_C.ExecuteUbergraph_WI_ItemInfo_Single_Center
// 0x0020 (0x0020 - 0x0000)
struct WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0010(0x0010)()
};
static_assert(alignof(WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center) == 0x000008, "Wrong alignment on WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center");
static_assert(sizeof(WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center) == 0x000020, "Wrong size on WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center");
static_assert(offsetof(WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center, EntryPoint) == 0x000000, "Member 'WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center, K2Node_CustomEvent_InputAction) == 0x000008, "Member 'WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center, K2Node_CustomEvent_Description) == 0x000010, "Member 'WI_ItemInfo_Single_Center_C_ExecuteUbergraph_WI_ItemInfo_Single_Center::K2Node_CustomEvent_Description' has a wrong offset!");

// Function WI_ItemInfo_Single_Center.WI_ItemInfo_Single_Center_C.SetAbilityData
// 0x0018 (0x0018 - 0x0000)
struct WI_ItemInfo_Single_Center_C_SetAbilityData final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description_0;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_ItemInfo_Single_Center_C_SetAbilityData) == 0x000008, "Wrong alignment on WI_ItemInfo_Single_Center_C_SetAbilityData");
static_assert(sizeof(WI_ItemInfo_Single_Center_C_SetAbilityData) == 0x000018, "Wrong size on WI_ItemInfo_Single_Center_C_SetAbilityData");
static_assert(offsetof(WI_ItemInfo_Single_Center_C_SetAbilityData, InputAction_0) == 0x000000, "Member 'WI_ItemInfo_Single_Center_C_SetAbilityData::InputAction_0' has a wrong offset!");
static_assert(offsetof(WI_ItemInfo_Single_Center_C_SetAbilityData, Description_0) == 0x000008, "Member 'WI_ItemInfo_Single_Center_C_SetAbilityData::Description_0' has a wrong offset!");

}

