#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_InGameMenu

#include "Basic.hpp"

#include "S_InGameMenuClosed_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonGame_structs.hpp"


namespace SDK::Params
{

// Function WI_InGameMenu.WI_InGameMenu_C.ApplyKillEffect
// 0x01F8 (0x01F8 - 0x0000)
struct WI_InGameMenu_C_ApplyKillEffect final
{
public:
	class ABP_ResidentCharacter_C*                ResidentCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponentJP*              ASC;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0020(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue_1;          // 0x0038(0x0018)()
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0148(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0158(0x0010)()
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0168(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FCombatParticipant                     K2Node_MakeStruct_CombatParticipant;               // 0x0188(0x0060)()
	bool                                          CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue; // 0x01EC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_ApplyKillEffect) == 0x000008, "Wrong alignment on WI_InGameMenu_C_ApplyKillEffect");
static_assert(sizeof(WI_InGameMenu_C_ApplyKillEffect) == 0x0001F8, "Wrong size on WI_InGameMenu_C_ApplyKillEffect");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, ResidentCharacter) == 0x000000, "Member 'WI_InGameMenu_C_ApplyKillEffect::ResidentCharacter' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, ASC) == 0x000008, "Member 'WI_InGameMenu_C_ApplyKillEffect::ASC' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000018, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_MakeEffectContext_ReturnValue) == 0x000020, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_MakeEffectContext_ReturnValue_1) == 0x000038, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_MakeEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_MakeHitResult_ReturnValue) == 0x000050, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000148, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000158, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_GetEffectContext_ReturnValue) == 0x000168, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000180, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, K2Node_MakeStruct_CombatParticipant) == 0x000188, "Member 'WI_InGameMenu_C_ApplyKillEffect::K2Node_MakeStruct_CombatParticipant' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed) == 0x0001E8, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_Changed' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ApplyKillEffect, CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue) == 0x0001EC, "Member 'WI_InGameMenu_C_ApplyKillEffect::CallFunc_ApplyGameplayEffectSpecToTargetWithChange_ReturnValue' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_InGameMenu_C_BndEvt__WI_InGameMenu_IAmStuckButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_InGameMenu_C_BndEvt__WI_InGameMenu_QuitToMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_InGameMenu_C_BndEvt__WI_InGameMenu_ResumeButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_InGameMenu_C_BndEvt__WI_InGameMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.ExecuteUbergraph_WI_InGameMenu
// 0x0210 (0x0210 - 0x0000)
struct WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InGameMenuClosed                    K2Node_MakeStruct_S_InGameMenuClosed;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable;                                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GI_C*                               K2Node_DynamicCast_AsBP_GI;                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchEnded_ReturnValue;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerJP_Match*              K2Node_DynamicCast_AsPlayer_Controller_JP_Match;   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0168(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0190(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x01C0(0x0010)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationYesNo_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu) == 0x000008, "Wrong alignment on WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu");
static_assert(sizeof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu) == 0x000210, "Wrong size on WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, EntryPoint) == 0x000000, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_MakeStruct_S_InGameMenuClosed) == 0x000004, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_MakeStruct_S_InGameMenuClosed' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable) == 0x000008, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_bool_Variable) == 0x000010, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000018, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000038, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00003C, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000040, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_object_Variable) == 0x000048, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000050, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_1) == 0x000058, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_2) == 0x000060, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_1_0) == 0x000068, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_2_0) == 0x000070, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_bool_Variable_1) == 0x000078, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_CustomEvent_Result) == 0x00008C, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_byte_Variable) == 0x00008D, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000090, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000A0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_ComponentBoundEvent_Button_3) == 0x0000B0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetGameInstance_ReturnValue) == 0x0000B8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_ComponentBoundEvent_Button_2) == 0x0000C0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_AsBP_GI) == 0x0000C8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_AsBP_GI' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000E8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000F0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_ComponentBoundEvent_Button_1) == 0x0000F8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_4) == 0x000100, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_5) == 0x000108, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000110, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_6) == 0x000128, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetGameState_ReturnValue) == 0x000130, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_HasMatchEnded_ReturnValue) == 0x000138, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_HasMatchEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_7) == 0x000140, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_3) == 0x000148, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_AsPlayer_Controller_JP_Match) == 0x000150, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_AsPlayer_Controller_JP_Match' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_object_Variable_1) == 0x000160, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000168, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000188, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00018C, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000190, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000198, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_3_0) == 0x0001A8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, Temp_real_Variable_0) == 0x0001B0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0001B8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_IsServer_ReturnValue) == 0x0001B9, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_SelectText_ReturnValue) == 0x0001C0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_ComponentBoundEvent_Button) == 0x0001D0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_ShowConfirmationYesNo_ReturnValue) == 0x0001D8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_ShowConfirmationYesNo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_GetPlayerController_ReturnValue_8) == 0x0001E0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_GetPlayerController_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_K2_GetPawn_ReturnValue) == 0x0001F0, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000200, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, K2Node_DynamicCast_bSuccess_2) == 0x000208, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu, CallFunc_IsValid_ReturnValue_2) == 0x000209, "Member 'WI_InGameMenu_C_ExecuteUbergraph_WI_InGameMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WI_InGameMenu_C_InpActEvt_IA_Back_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WI_InGameMenu_C_InpActEvt_IA_CloseGameMenu_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC
// 0x0001 (0x0001 - 0x0000)
struct WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC) == 0x000001, "Wrong alignment on WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC");
static_assert(sizeof(WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC) == 0x000001, "Wrong size on WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC");
static_assert(offsetof(WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC, Result) == 0x000000, "Member 'WI_InGameMenu_C_OnResult_36812D0F4AB8C3AAA9F733A9667E4DCC::Result' has a wrong offset!");

// Function WI_InGameMenu.WI_InGameMenu_C.TogglePlayerInGame HUD
// 0x00E8 (0x00E8 - 0x0000)
struct WI_InGameMenu_C_TogglePlayerInGame_HUD final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visibility_0;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_TimeOfDay_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWI_TimeOfDay_C*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_WarmupCountdown_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrintMessageWI_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrintMessageWI_C*                      CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractButtonWI_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets_3;      // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractButtonWI_C*                    CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InGameMenu_C_TogglePlayerInGame_HUD) == 0x000008, "Wrong alignment on WI_InGameMenu_C_TogglePlayerInGame_HUD");
static_assert(sizeof(WI_InGameMenu_C_TogglePlayerInGame_HUD) == 0x0000E8, "Wrong size on WI_InGameMenu_C_TogglePlayerInGame_HUD");
static_assert(offsetof(WI_InGameMenu_C_TogglePlayerInGame_HUD, Show) == 0x000000, "Member 'WI_InGameMenu_C_TogglePlayerInGame_HUD::Show' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_TogglePlayerInGame_HUD, Visibility_0) == 0x000001, "Member 'WI_InGameMenu_C_TogglePlayerInGame_HUD::Visibility_0' has a wrong offset!");
static_assert(offsetof(WI_InGameMenu_C_TogglePlayerInGame_HUD, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WI_InGameMenu_C_TogglePlayerInGame_HUD::Temp_int_Array_Index_Variable' has a wrong offset!");
