#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_InspectRewardPopup

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_InspectRewardPopup.WI_InspectRewardPopup_C.ExecuteUbergraph_WI_InspectRewardPopup
// 0x0020 (0x0020 - 0x0000)
struct WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_RewardTag;                      // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup) == 0x000008, "Wrong alignment on WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup");
static_assert(sizeof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup) == 0x000020, "Wrong size on WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup");
static_assert(offsetof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup, EntryPoint) == 0x000000, "Member 'WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup, K2Node_CustomEvent_RewardTag) == 0x000004, "Member 'WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup::K2Node_CustomEvent_RewardTag' has a wrong offset!");
static_assert(offsetof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WI_InspectRewardPopup_C_ExecuteUbergraph_WI_InspectRewardPopup::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WI_InspectRewardPopup.WI_InspectRewardPopup_C.ReadFromRewardTagAsync
// 0x0008 (0x0008 - 0x0000)
struct WI_InspectRewardPopup_C_ReadFromRewardTagAsync final
{
public:
	struct FGameplayTag                           RewardTag;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InspectRewardPopup_C_ReadFromRewardTagAsync) == 0x000004, "Wrong alignment on WI_InspectRewardPopup_C_ReadFromRewardTagAsync");
static_assert(sizeof(WI_InspectRewardPopup_C_ReadFromRewardTagAsync) == 0x000008, "Wrong size on WI_InspectRewardPopup_C_ReadFromRewardTagAsync");
static_assert(offsetof(WI_InspectRewardPopup_C_ReadFromRewardTagAsync, RewardTag) == 0x000000, "Member 'WI_InspectRewardPopup_C_ReadFromRewardTagAsync::RewardTag' has a wrong offset!");

}

