#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_InvisibleWallsLogo

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WI_InvisibleWallsLogo.WI_InvisibleWallsLogo_C.ExecuteUbergraph_WI_InvisibleWallsLogo
// 0x0078 (0x0078 - 0x0000)
struct WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo) == 0x000008, "Wrong alignment on WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo");
static_assert(sizeof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo) == 0x000078, "Wrong size on WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, EntryPoint) == 0x000000, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000010, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000030, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000034, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000038, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_object_Variable) == 0x000040, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_real_Variable) == 0x000050, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_real_Variable_1) == 0x000058, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_real_Variable_0) == 0x000060, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_real_Variable_1_0) == 0x000068, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_bool_Variable) == 0x000070, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_bool_Has_Been_Initd_Variable) == 0x000071, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo, Temp_bool_IsClosed_Variable) == 0x000072, "Member 'WI_InvisibleWallsLogo_C_ExecuteUbergraph_WI_InvisibleWallsLogo::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function WI_InvisibleWallsLogo.WI_InvisibleWallsLogo_C.InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WI_InvisibleWallsLogo_C_InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

}

