#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_IntroOverlayBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_IntroType_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_IntroOverlayBase.WI_IntroOverlayBase_C
// 0x00A8 (0x04D8 - 0x0430)
class UWI_IntroOverlayBase_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimateScale;                                      // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UJPCommonActivatableWidgetSwitcher*     JPCommonActivatableWidgetSwitcher_0;               // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Intro_DeedSafe_C*                   WI_Intro_DeedSafe;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Intro_Essentials_C*                 WI_Intro_Essentials;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Intro_MatchMap_C*                   WI_Intro_MatchMap;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Intro_Team_C*                       WI_Intro_Team;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<E_IntroType, class UWidget*>             IntroWidgetMap;                                    // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         FinalCountdown;                                    // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             InputPressed;                                      // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_IntroType                                   CurrentIntroState;                                 // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Animate_In();
	void Construct();
	void ExecuteUbergraph_WI_IntroOverlayBase(int32 EntryPoint);
	void InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InputPressed__DelegateSignature();
	void PopulateMap();
	void ShowRelatedWidget(E_IntroType Intro);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_IntroOverlayBase_C">();
	}
	static class UWI_IntroOverlayBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_IntroOverlayBase_C>();
	}
};
static_assert(alignof(UWI_IntroOverlayBase_C) == 0x000008, "Wrong alignment on UWI_IntroOverlayBase_C");
static_assert(sizeof(UWI_IntroOverlayBase_C) == 0x0004D8, "Wrong size on UWI_IntroOverlayBase_C");
static_assert(offsetof(UWI_IntroOverlayBase_C, UberGraphFrame) == 0x000430, "Member 'UWI_IntroOverlayBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, AnimateScale) == 0x000438, "Member 'UWI_IntroOverlayBase_C::AnimateScale' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, JPCommonActivatableWidgetSwitcher_0) == 0x000440, "Member 'UWI_IntroOverlayBase_C::JPCommonActivatableWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, WI_Intro_DeedSafe) == 0x000448, "Member 'UWI_IntroOverlayBase_C::WI_Intro_DeedSafe' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, WI_Intro_Essentials) == 0x000450, "Member 'UWI_IntroOverlayBase_C::WI_Intro_Essentials' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, WI_Intro_MatchMap) == 0x000458, "Member 'UWI_IntroOverlayBase_C::WI_Intro_MatchMap' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, WI_Intro_Team) == 0x000460, "Member 'UWI_IntroOverlayBase_C::WI_Intro_Team' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, IntroWidgetMap) == 0x000468, "Member 'UWI_IntroOverlayBase_C::IntroWidgetMap' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, FinalCountdown) == 0x0004B8, "Member 'UWI_IntroOverlayBase_C::FinalCountdown' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, InputPressed) == 0x0004C0, "Member 'UWI_IntroOverlayBase_C::InputPressed' has a wrong offset!");
static_assert(offsetof(UWI_IntroOverlayBase_C, CurrentIntroState) == 0x0004D0, "Member 'UWI_IntroOverlayBase_C::CurrentIntroState' has a wrong offset!");

}

