#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ImportantNotificationEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ImportantNotificationEntry.WI_ImportantNotificationEntry_C.ExecuteUbergraph_WI_ImportantNotificationEntry
// 0x0020 (0x0020 - 0x0000)
struct WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry) == 0x000008, "Wrong alignment on WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry");
static_assert(sizeof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry) == 0x000020, "Wrong size on WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry");
static_assert(offsetof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry, EntryPoint) == 0x000000, "Member 'WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000011, "Member 'WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WI_ImportantNotificationEntry_C_ExecuteUbergraph_WI_ImportantNotificationEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WI_ImportantNotificationEntry.WI_ImportantNotificationEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ImportantNotificationEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ImportantNotificationEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ImportantNotificationEntry_C_PreConstruct");
static_assert(sizeof(WI_ImportantNotificationEntry_C_PreConstruct) == 0x000001, "Wrong size on WI_ImportantNotificationEntry_C_PreConstruct");
static_assert(offsetof(WI_ImportantNotificationEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ImportantNotificationEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

