#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPActionWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WI_JPActionWidget.WI_JPActionWidget_C.ExecuteUbergraph_WI_JPActionWidget
// 0x0048 (0x0048 - 0x0000)
struct WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget) == 0x000008, "Wrong alignment on WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget");
static_assert(sizeof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget) == 0x000048, "Wrong size on WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, EntryPoint) == 0x000000, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, K2Node_CustomEvent_bNewInputType) == 0x000018, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000038, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WI_JPActionWidget_C_ExecuteUbergraph_WI_JPActionWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WI_JPActionWidget_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on WI_JPActionWidget_C_HandleInputMethodChanged");
static_assert(sizeof(WI_JPActionWidget_C_HandleInputMethodChanged) == 0x000001, "Wrong size on WI_JPActionWidget_C_HandleInputMethodChanged");
static_assert(offsetof(WI_JPActionWidget_C_HandleInputMethodChanged, bNewInputType) == 0x000000, "Member 'WI_JPActionWidget_C_HandleInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_JPActionWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WI_JPActionWidget_C_PreConstruct");
static_assert(sizeof(WI_JPActionWidget_C_PreConstruct) == 0x000001, "Wrong size on WI_JPActionWidget_C_PreConstruct");
static_assert(offsetof(WI_JPActionWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_JPActionWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetActionIconFromSlateBrush
// 0x01A0 (0x01A0 - 0x0000)
struct WI_JPActionWidget_C_SetActionIconFromSlateBrush final
{
public:
	struct FSlateBrush                            SlateBrush;                                        // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D0(0x00D0)()
};
static_assert(alignof(WI_JPActionWidget_C_SetActionIconFromSlateBrush) == 0x000010, "Wrong alignment on WI_JPActionWidget_C_SetActionIconFromSlateBrush");
static_assert(sizeof(WI_JPActionWidget_C_SetActionIconFromSlateBrush) == 0x0001A0, "Wrong size on WI_JPActionWidget_C_SetActionIconFromSlateBrush");
static_assert(offsetof(WI_JPActionWidget_C_SetActionIconFromSlateBrush, SlateBrush) == 0x000000, "Member 'WI_JPActionWidget_C_SetActionIconFromSlateBrush::SlateBrush' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetActionIconFromSlateBrush, K2Node_MakeStruct_SlateBrush) == 0x0000D0, "Member 'WI_JPActionWidget_C_SetActionIconFromSlateBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetActionIconFromTexture2D
// 0x00E0 (0x00E0 - 0x0000)
struct WI_JPActionWidget_C_SetActionIconFromTexture2D final
{
public:
	class UTexture2D*                             Texture2D;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
};
static_assert(alignof(WI_JPActionWidget_C_SetActionIconFromTexture2D) == 0x000010, "Wrong alignment on WI_JPActionWidget_C_SetActionIconFromTexture2D");
static_assert(sizeof(WI_JPActionWidget_C_SetActionIconFromTexture2D) == 0x0000E0, "Wrong size on WI_JPActionWidget_C_SetActionIconFromTexture2D");
static_assert(offsetof(WI_JPActionWidget_C_SetActionIconFromTexture2D, Texture2D) == 0x000000, "Member 'WI_JPActionWidget_C_SetActionIconFromTexture2D::Texture2D' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetActionIconFromTexture2D, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WI_JPActionWidget_C_SetActionIconFromTexture2D::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetInputAction
// 0x0008 (0x0008 - 0x0000)
struct WI_JPActionWidget_C_SetInputAction final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_SetInputAction) == 0x000008, "Wrong alignment on WI_JPActionWidget_C_SetInputAction");
static_assert(sizeof(WI_JPActionWidget_C_SetInputAction) == 0x000008, "Wrong size on WI_JPActionWidget_C_SetInputAction");
static_assert(offsetof(WI_JPActionWidget_C_SetInputAction, InputAction_0) == 0x000000, "Member 'WI_JPActionWidget_C_SetInputAction::InputAction_0' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetShowActionIconState
// 0x00D0 (0x00D0 - 0x0000)
struct WI_JPActionWidget_C_SetShowActionIconState final
{
public:
	struct FSlateBrush                            SlateBrush;                                        // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPActionWidget_C_SetShowActionIconState) == 0x000010, "Wrong alignment on WI_JPActionWidget_C_SetShowActionIconState");
static_assert(sizeof(WI_JPActionWidget_C_SetShowActionIconState) == 0x0000D0, "Wrong size on WI_JPActionWidget_C_SetShowActionIconState");
static_assert(offsetof(WI_JPActionWidget_C_SetShowActionIconState, SlateBrush) == 0x000000, "Member 'WI_JPActionWidget_C_SetShowActionIconState::SlateBrush' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetShowActionTextState
// 0x0010 (0x0010 - 0x0000)
struct WI_JPActionWidget_C_SetShowActionTextState final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_JPActionWidget_C_SetShowActionTextState) == 0x000008, "Wrong alignment on WI_JPActionWidget_C_SetShowActionTextState");
static_assert(sizeof(WI_JPActionWidget_C_SetShowActionTextState) == 0x000010, "Wrong size on WI_JPActionWidget_C_SetShowActionTextState");
static_assert(offsetof(WI_JPActionWidget_C_SetShowActionTextState, InText) == 0x000000, "Member 'WI_JPActionWidget_C_SetShowActionTextState::InText' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.SetWidgetVisibility
// 0x0010 (0x0010 - 0x0000)
struct WI_JPActionWidget_C_SetWidgetVisibility final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_SetWidgetVisibility) == 0x000008, "Wrong alignment on WI_JPActionWidget_C_SetWidgetVisibility");
static_assert(sizeof(WI_JPActionWidget_C_SetWidgetVisibility) == 0x000010, "Wrong size on WI_JPActionWidget_C_SetWidgetVisibility");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, Widget) == 0x000000, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::Widget' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, Visible) == 0x000008, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::Visible' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, Temp_bool_Variable) == 0x000009, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, Temp_byte_Variable) == 0x00000A, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, Temp_byte_Variable_1) == 0x00000B, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_SetWidgetVisibility, K2Node_Select_Default) == 0x00000C, "Member 'WI_JPActionWidget_C_SetWidgetVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WI_JPActionWidget.WI_JPActionWidget_C.UpdateActionIconAndText
// 0x0110 (0x0110 - 0x0000)
struct WI_JPActionWidget_C_UpdateActionIconAndText final
{
public:
	class FString                                 CallFunc_GetBuildConfiguration_ReturnValue;        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_TryGetActionIcon_IconSlateBrush;          // 0x0020(0x00D0)()
	bool                                          CallFunc_TryGetActionIcon_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetActionTextForFirstBoundKey_ActionKeyText; // 0x00F8(0x0010)()
	bool                                          CallFunc_TryGetActionTextForFirstBoundKey_ReturnValue; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPActionWidget_C_UpdateActionIconAndText) == 0x000010, "Wrong alignment on WI_JPActionWidget_C_UpdateActionIconAndText");
static_assert(sizeof(WI_JPActionWidget_C_UpdateActionIconAndText) == 0x000110, "Wrong size on WI_JPActionWidget_C_UpdateActionIconAndText");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_GetBuildConfiguration_ReturnValue) == 0x000000, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_GetBuildConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000010, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_TryGetActionIcon_IconSlateBrush) == 0x000020, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_TryGetActionIcon_IconSlateBrush' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_TryGetActionIcon_ReturnValue) == 0x0000F0, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_TryGetActionIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_TryGetActionTextForFirstBoundKey_ActionKeyText) == 0x0000F8, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_TryGetActionTextForFirstBoundKey_ActionKeyText' has a wrong offset!");
static_assert(offsetof(WI_JPActionWidget_C_UpdateActionIconAndText, CallFunc_TryGetActionTextForFirstBoundKey_ReturnValue) == 0x000108, "Member 'WI_JPActionWidget_C_UpdateActionIconAndText::CallFunc_TryGetActionTextForFirstBoundKey_ReturnValue' has a wrong offset!");

}

