#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSettingItemCheckbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPCommonSettingItemCheckbox.WI_JPCommonSettingItemCheckbox_C
// 0x0070 (0x03B8 - 0x0348)
class UWI_JPCommonSettingItemCheckbox_C final : public UJPSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BlockIcon;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_IconButton_C*                       WI_IconButton;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfigurationItemViewModel       ViewModel;                                         // 0x0370(0x0048)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_WI_JPCommonSettingItemCheckbox(int32 EntryPoint);
	void SetVisuals(const struct FMatchConfigurationItemViewModel& ViewModel_0);
	void Toggled(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPCommonSettingItemCheckbox_C">();
	}
	static class UWI_JPCommonSettingItemCheckbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPCommonSettingItemCheckbox_C>();
	}
};
static_assert(alignof(UWI_JPCommonSettingItemCheckbox_C) == 0x000008, "Wrong alignment on UWI_JPCommonSettingItemCheckbox_C");
static_assert(sizeof(UWI_JPCommonSettingItemCheckbox_C) == 0x0003B8, "Wrong size on UWI_JPCommonSettingItemCheckbox_C");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, UberGraphFrame) == 0x000348, "Member 'UWI_JPCommonSettingItemCheckbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, BlockIcon) == 0x000350, "Member 'UWI_JPCommonSettingItemCheckbox_C::BlockIcon' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, ItemName) == 0x000358, "Member 'UWI_JPCommonSettingItemCheckbox_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, WI_IconButton) == 0x000360, "Member 'UWI_JPCommonSettingItemCheckbox_C::WI_IconButton' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, Enabled) == 0x000368, "Member 'UWI_JPCommonSettingItemCheckbox_C::Enabled' has a wrong offset!");
static_assert(offsetof(UWI_JPCommonSettingItemCheckbox_C, ViewModel) == 0x000370, "Member 'UWI_JPCommonSettingItemCheckbox_C::ViewModel' has a wrong offset!");

}

