#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingEntryBackground

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.ExecuteUbergraph_WI_JPSettingEntryBackground
// 0x0148 (0x0148 - 0x0000)
struct WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0078)(ConstParm)
	bool                                          CallFunc_IsOwningPlayerUsingTouch_ReturnValue;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground) == 0x000008, "Wrong alignment on WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground");
static_assert(sizeof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground) == 0x000148, "Wrong size on WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, EntryPoint) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, K2Node_Event_MyGeometry) == 0x000004, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B8, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C0, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, CallFunc_IsOwningPlayerUsingTouch_ReturnValue) == 0x000140, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::CallFunc_IsOwningPlayerUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground, K2Node_Event_IsDesignTime) == 0x000141, "Member 'WI_JPSettingEntryBackground_C_ExecuteUbergraph_WI_JPSettingEntryBackground::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WI_JPSettingEntryBackground_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_OnMouseEnter) == 0x000008, "Wrong alignment on WI_JPSettingEntryBackground_C_OnMouseEnter");
static_assert(sizeof(WI_JPSettingEntryBackground_C_OnMouseEnter) == 0x0000B0, "Wrong size on WI_JPSettingEntryBackground_C_OnMouseEnter");
static_assert(offsetof(WI_JPSettingEntryBackground_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WI_JPSettingEntryBackground_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.OnMouseEnterChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature final
{
public:
	bool                                          IsEnterEvent;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature) == 0x000001, "Wrong alignment on WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature");
static_assert(sizeof(WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature) == 0x000001, "Wrong size on WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature");
static_assert(offsetof(WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature, IsEnterEvent) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_OnMouseEnterChanged__DelegateSignature::IsEnterEvent' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WI_JPSettingEntryBackground_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_OnMouseLeave) == 0x000008, "Wrong alignment on WI_JPSettingEntryBackground_C_OnMouseLeave");
static_assert(sizeof(WI_JPSettingEntryBackground_C_OnMouseLeave) == 0x000078, "Wrong size on WI_JPSettingEntryBackground_C_OnMouseLeave");
static_assert(offsetof(WI_JPSettingEntryBackground_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_JPSettingEntryBackground_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_PreConstruct) == 0x000001, "Wrong alignment on WI_JPSettingEntryBackground_C_PreConstruct");
static_assert(sizeof(WI_JPSettingEntryBackground_C_PreConstruct) == 0x000001, "Wrong size on WI_JPSettingEntryBackground_C_PreConstruct");
static_assert(offsetof(WI_JPSettingEntryBackground_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.SetIsEven
// 0x0005 (0x0005 - 0x0000)
struct WI_JPSettingEntryBackground_C_SetIsEven final
{
public:
	bool                                          IsEven_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_SetIsEven) == 0x000001, "Wrong alignment on WI_JPSettingEntryBackground_C_SetIsEven");
static_assert(sizeof(WI_JPSettingEntryBackground_C_SetIsEven) == 0x000005, "Wrong size on WI_JPSettingEntryBackground_C_SetIsEven");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetIsEven, IsEven_0) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_SetIsEven::IsEven_0' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetIsEven, Temp_bool_Variable) == 0x000001, "Member 'WI_JPSettingEntryBackground_C_SetIsEven::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetIsEven, Temp_byte_Variable) == 0x000002, "Member 'WI_JPSettingEntryBackground_C_SetIsEven::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetIsEven, Temp_byte_Variable_1) == 0x000003, "Member 'WI_JPSettingEntryBackground_C_SetIsEven::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetIsEven, K2Node_Select_Default) == 0x000004, "Member 'WI_JPSettingEntryBackground_C_SetIsEven::K2Node_Select_Default' has a wrong offset!");

// Function WI_JPSettingEntryBackground.WI_JPSettingEntryBackground_C.SetShowHoverImage
// 0x0005 (0x0005 - 0x0000)
struct WI_JPSettingEntryBackground_C_SetShowHoverImage final
{
public:
	bool                                          ShowHoverImage_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPSettingEntryBackground_C_SetShowHoverImage) == 0x000001, "Wrong alignment on WI_JPSettingEntryBackground_C_SetShowHoverImage");
static_assert(sizeof(WI_JPSettingEntryBackground_C_SetShowHoverImage) == 0x000005, "Wrong size on WI_JPSettingEntryBackground_C_SetShowHoverImage");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetShowHoverImage, ShowHoverImage_0) == 0x000000, "Member 'WI_JPSettingEntryBackground_C_SetShowHoverImage::ShowHoverImage_0' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetShowHoverImage, Temp_bool_Variable) == 0x000001, "Member 'WI_JPSettingEntryBackground_C_SetShowHoverImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetShowHoverImage, Temp_byte_Variable) == 0x000002, "Member 'WI_JPSettingEntryBackground_C_SetShowHoverImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetShowHoverImage, Temp_byte_Variable_1) == 0x000003, "Member 'WI_JPSettingEntryBackground_C_SetShowHoverImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPSettingEntryBackground_C_SetShowHoverImage, K2Node_Select_Default) == 0x000004, "Member 'WI_JPSettingEntryBackground_C_SetShowHoverImage::K2Node_Select_Default' has a wrong offset!");

}

