#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsListEntry_KBMBinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPSettingsListEntry_KBMBinding.WI_JPSettingsListEntry_KBMBinding_C
// 0x0018 (0x03A8 - 0x0390)
class UWI_JPSettingsListEntry_KBMBinding_C final : public ULyraSettingsListEntrySetting_KeyboardInput
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_JPSettingsEntryOneLiner_C*          WI_JPSettingsEntryOneLiner;                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_JPSettingsListEntry_KBMBinding(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPSettingsListEntry_KBMBinding_C">();
	}
	static class UWI_JPSettingsListEntry_KBMBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPSettingsListEntry_KBMBinding_C>();
	}
};
static_assert(alignof(UWI_JPSettingsListEntry_KBMBinding_C) == 0x000008, "Wrong alignment on UWI_JPSettingsListEntry_KBMBinding_C");
static_assert(sizeof(UWI_JPSettingsListEntry_KBMBinding_C) == 0x0003A8, "Wrong size on UWI_JPSettingsListEntry_KBMBinding_C");
static_assert(offsetof(UWI_JPSettingsListEntry_KBMBinding_C, UberGraphFrame) == 0x000390, "Member 'UWI_JPSettingsListEntry_KBMBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsListEntry_KBMBinding_C, OnHover) == 0x000398, "Member 'UWI_JPSettingsListEntry_KBMBinding_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsListEntry_KBMBinding_C, WI_JPSettingsEntryOneLiner) == 0x0003A0, "Member 'UWI_JPSettingsListEntry_KBMBinding_C::WI_JPSettingsEntryOneLiner' has a wrong offset!");

}

