#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPSettingsEntryOneLiner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPSettingsEntryOneLiner.WI_JPSettingsEntryOneLiner_C
// 0x0038 (0x0318 - 0x02E0)
class UWI_JPSettingsEntryOneLiner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPSettingEntryBackground_C*         Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HoverHitbox;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             InputNamedSlot;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             LabelNamedSlot;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         InputSlotFillFactor;                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LabelSlotFillFactor;                               // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Hover_Image;                                  // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEven;                                            // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_JPSettingsEntryOneLiner(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetInputSlotFillFactor(float InputSlotFillFactor_0);
	void SetIsEven(bool IsEven_0);
	void SetLabelSlotFillFactor(float LabelSlotFillFactor_0);
	void SetShowHoverImage(bool ShowHoverImage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPSettingsEntryOneLiner_C">();
	}
	static class UWI_JPSettingsEntryOneLiner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPSettingsEntryOneLiner_C>();
	}
};
static_assert(alignof(UWI_JPSettingsEntryOneLiner_C) == 0x000008, "Wrong alignment on UWI_JPSettingsEntryOneLiner_C");
static_assert(sizeof(UWI_JPSettingsEntryOneLiner_C) == 0x000318, "Wrong size on UWI_JPSettingsEntryOneLiner_C");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_JPSettingsEntryOneLiner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, Background) == 0x0002E8, "Member 'UWI_JPSettingsEntryOneLiner_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, HoverHitbox) == 0x0002F0, "Member 'UWI_JPSettingsEntryOneLiner_C::HoverHitbox' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, InputNamedSlot) == 0x0002F8, "Member 'UWI_JPSettingsEntryOneLiner_C::InputNamedSlot' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, LabelNamedSlot) == 0x000300, "Member 'UWI_JPSettingsEntryOneLiner_C::LabelNamedSlot' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, InputSlotFillFactor) == 0x000308, "Member 'UWI_JPSettingsEntryOneLiner_C::InputSlotFillFactor' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, LabelSlotFillFactor) == 0x00030C, "Member 'UWI_JPSettingsEntryOneLiner_C::LabelSlotFillFactor' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, Show_Hover_Image) == 0x000310, "Member 'UWI_JPSettingsEntryOneLiner_C::Show_Hover_Image' has a wrong offset!");
static_assert(offsetof(UWI_JPSettingsEntryOneLiner_C, IsEven) == 0x000311, "Member 'UWI_JPSettingsEntryOneLiner_C::IsEven' has a wrong offset!");

}

