#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPPrimaryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "JP_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_JPPrimaryButton.WI_JPPrimaryButton_C
// 0x0040 (0x1600 - 0x15C0)
class UWI_JPPrimaryButton_C final : public ULyraButtonBase
{
public:
	uint8                                         Pad_15B8[0x8];                                     // 0x15B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text;                                              // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle;                                      // 0x15D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerInputStyle;                              // 0x15E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x15E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  TextJustification;                                 // 0x15E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x15EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15EB[0x5];                                     // 0x15EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PressProgress;                                     // 0x15F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_JPPrimaryButton(int32 EntryPoint);
	void GetPressProgress(double* Progress);
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void UpdateButtonStyle();
	void UpdateButtonText(const class FText& InText);
	void UpdateContentAlignment();
	void UpdateStyle(bool UsingGamepad);
	void UpdateTextAndStyle(ECommonInputType InputType);
	void UpdateTextStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_JPPrimaryButton_C">();
	}
	static class UWI_JPPrimaryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_JPPrimaryButton_C>();
	}
};
static_assert(alignof(UWI_JPPrimaryButton_C) == 0x000010, "Wrong alignment on UWI_JPPrimaryButton_C");
static_assert(sizeof(UWI_JPPrimaryButton_C) == 0x001600, "Wrong size on UWI_JPPrimaryButton_C");
static_assert(offsetof(UWI_JPPrimaryButton_C, UberGraphFrame) == 0x0015C0, "Member 'UWI_JPPrimaryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, ContentBorder) == 0x0015C8, "Member 'UWI_JPPrimaryButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, Text) == 0x0015D0, "Member 'UWI_JPPrimaryButton_C::Text' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, DefaultStyle) == 0x0015D8, "Member 'UWI_JPPrimaryButton_C::DefaultStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, ControllerInputStyle) == 0x0015E0, "Member 'UWI_JPPrimaryButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, ContentAlignment) == 0x0015E8, "Member 'UWI_JPPrimaryButton_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, TextJustification) == 0x0015E9, "Member 'UWI_JPPrimaryButton_C::TextJustification' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, TextTransformPolicy) == 0x0015EA, "Member 'UWI_JPPrimaryButton_C::TextTransformPolicy' has a wrong offset!");
static_assert(offsetof(UWI_JPPrimaryButton_C, PressProgress) == 0x0015F0, "Member 'UWI_JPPrimaryButton_C::PressProgress' has a wrong offset!");

}

