#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_JPArrowButton.WI_JPArrowButton_C.ExecuteUbergraph_WI_JPArrowButton
// 0x0088 (0x0088 - 0x0000)
struct WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton) == 0x000008, "Wrong alignment on WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton");
static_assert(sizeof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton) == 0x000088, "Wrong size on WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, EntryPoint) == 0x000000, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_bool_Variable) == 0x000004, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_struct_Variable) == 0x000008, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_struct_Variable_1) == 0x000018, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_bool_Variable_1) == 0x000028, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_real_Variable) == 0x00002C, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_real_Variable_1) == 0x000030, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_bool_Variable_2) == 0x000034, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_struct_Variable_2) == 0x000038, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, Temp_struct_Variable_3) == 0x000048, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, K2Node_Select_Default) == 0x000060, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, CallFunc_IsHovered_ReturnValue) == 0x000070, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, CallFunc_IsPressed_ReturnValue) == 0x000071, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, K2Node_Select_Default_1) == 0x000074, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton, K2Node_Select_Default_2) == 0x000078, "Member 'WI_JPArrowButton_C_ExecuteUbergraph_WI_JPArrowButton::K2Node_Select_Default_2' has a wrong offset!");

// Function WI_JPArrowButton.WI_JPArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_JPArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_JPArrowButton_C_PreConstruct");
static_assert(sizeof(WI_JPArrowButton_C_PreConstruct) == 0x000001, "Wrong size on WI_JPArrowButton_C_PreConstruct");
static_assert(offsetof(WI_JPArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_JPArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

