#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_JPCommonSettingCheckboxArray

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_JPCommonSettingCheckboxArray.WI_JPCommonSettingCheckboxArray_C.ButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_JPCommonSettingCheckboxArray_C_ButtonClicked final
{
public:
	class UJPSettingWidget*                       Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingCheckboxArray_C_ButtonClicked) == 0x000008, "Wrong alignment on WI_JPCommonSettingCheckboxArray_C_ButtonClicked");
static_assert(sizeof(WI_JPCommonSettingCheckboxArray_C_ButtonClicked) == 0x000008, "Wrong size on WI_JPCommonSettingCheckboxArray_C_ButtonClicked");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ButtonClicked, Widget) == 0x000000, "Member 'WI_JPCommonSettingCheckboxArray_C_ButtonClicked::Widget' has a wrong offset!");

// Function WI_JPCommonSettingCheckboxArray.WI_JPCommonSettingCheckboxArray_C.ExecuteUbergraph_WI_JPCommonSettingCheckboxArray
// 0x0130 (0x0130 - 0x0000)
struct WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchConfigurationItemViewModel> K2Node_CustomEvent_NewItemArray;                   // 0x0018(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_JPCommonSettingItemCheckbox_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJPSettingWidget* InWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJPSettingWidget*                       K2Node_CustomEvent_Widget;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPCommonSettingItemCheckbox_C*      K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfigurationItemViewModel       CallFunc_Array_Get_Item;                           // 0x0078(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_JPCommonSettingItemCheckbox_C*      K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox_1; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchConfigurationItemViewModel       CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray) == 0x000008, "Wrong alignment on WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray");
static_assert(sizeof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray) == 0x000130, "Wrong size on WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, EntryPoint) == 0x000000, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_CustomEvent_NewItemArray) == 0x000018, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_CustomEvent_NewItemArray' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000048, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_CustomEvent_Widget) == 0x000050, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox) == 0x000060, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_HasAnyChildren_ReturnValue) == 0x000070, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Array_Get_Item) == 0x000078, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_GetChildAt_ReturnValue) == 0x0000C8, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox_1) == 0x0000D0, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_DynamicCast_AsWI_JPCommon_Setting_Item_Checkbox_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Array_Length_ReturnValue_1) == 0x000128, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray, CallFunc_Less_IntInt_ReturnValue_1) == 0x00012C, "Member 'WI_JPCommonSettingCheckboxArray_C_ExecuteUbergraph_WI_JPCommonSettingCheckboxArray::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WI_JPCommonSettingCheckboxArray.WI_JPCommonSettingCheckboxArray_C.GetValue
// 0x0010 (0x0010 - 0x0000)
struct WI_JPCommonSettingCheckboxArray_C_GetValue final
{
public:
	TArray<struct FMatchConfigurationItemViewModel> NewParam;                                          // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(WI_JPCommonSettingCheckboxArray_C_GetValue) == 0x000008, "Wrong alignment on WI_JPCommonSettingCheckboxArray_C_GetValue");
static_assert(sizeof(WI_JPCommonSettingCheckboxArray_C_GetValue) == 0x000010, "Wrong size on WI_JPCommonSettingCheckboxArray_C_GetValue");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_GetValue, NewParam) == 0x000000, "Member 'WI_JPCommonSettingCheckboxArray_C_GetValue::NewParam' has a wrong offset!");

// Function WI_JPCommonSettingCheckboxArray.WI_JPCommonSettingCheckboxArray_C.SetItemEnabled__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature final
{
public:
	struct FGameplayTag                           ItemTag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature) == 0x000004, "Wrong alignment on WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature");
static_assert(sizeof(WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature) == 0x00000C, "Wrong size on WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature, ItemTag) == 0x000000, "Member 'WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature::ItemTag' has a wrong offset!");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature, IsEnabled) == 0x000008, "Member 'WI_JPCommonSettingCheckboxArray_C_SetItemEnabled__DelegateSignature::IsEnabled' has a wrong offset!");

// Function WI_JPCommonSettingCheckboxArray.WI_JPCommonSettingCheckboxArray_C.SetValue
// 0x0010 (0x0010 - 0x0000)
struct WI_JPCommonSettingCheckboxArray_C_SetValue final
{
public:
	TArray<struct FMatchConfigurationItemViewModel> NewItemArray;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_JPCommonSettingCheckboxArray_C_SetValue) == 0x000008, "Wrong alignment on WI_JPCommonSettingCheckboxArray_C_SetValue");
static_assert(sizeof(WI_JPCommonSettingCheckboxArray_C_SetValue) == 0x000010, "Wrong size on WI_JPCommonSettingCheckboxArray_C_SetValue");
static_assert(offsetof(WI_JPCommonSettingCheckboxArray_C_SetValue, NewItemArray) == 0x000000, "Member 'WI_JPCommonSettingCheckboxArray_C_SetValue::NewItemArray' has a wrong offset!");

}

