#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LobbyV3_PlayerWidget

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_LobbyV3_PlayerWidget.WI_LobbyV3_PlayerWidget_C.ApplyViewModel
// 0x0040 (0x0040 - 0x0000)
struct WI_LobbyV3_PlayerWidget_C_ApplyViewModel final
{
public:
	struct FLobbyPlayerAvatarViewModel            ViewModel;                                         // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_LobbyV3_PlayerWidget_C_ApplyViewModel) == 0x000008, "Wrong alignment on WI_LobbyV3_PlayerWidget_C_ApplyViewModel");
static_assert(sizeof(WI_LobbyV3_PlayerWidget_C_ApplyViewModel) == 0x000040, "Wrong size on WI_LobbyV3_PlayerWidget_C_ApplyViewModel");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ApplyViewModel, ViewModel) == 0x000000, "Member 'WI_LobbyV3_PlayerWidget_C_ApplyViewModel::ViewModel' has a wrong offset!");

// Function WI_LobbyV3_PlayerWidget.WI_LobbyV3_PlayerWidget_C.ExecuteUbergraph_WI_LobbyV3_PlayerWidget
// 0x00E0 (0x00E0 - 0x0000)
struct WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyPlayerAvatarViewModel            K2Node_Event_ViewModel;                            // 0x0038(0x0040)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget) == 0x000008, "Wrong alignment on WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget");
static_assert(sizeof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget) == 0x0000E0, "Wrong size on WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, EntryPoint) == 0x000000, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_bool_Variable) == 0x000004, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_softobject_Variable) == 0x000008, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_bool_Variable_1) == 0x000030, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable) == 0x000031, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable_1) == 0x000032, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_bool_Variable_2) == 0x000033, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable_2) == 0x000034, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable_3) == 0x000035, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, K2Node_Event_ViewModel) == 0x000038, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, K2Node_Select_Default) == 0x000078, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, K2Node_Select_Default_1) == 0x000079, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00007A, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, CallFunc_IsEmpty_ReturnValue) == 0x000090, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, K2Node_Select_Default_2) == 0x000098, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable_4) == 0x0000C0, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_byte_Variable_5) == 0x0000C1, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, Temp_bool_Variable_3) == 0x0000C2, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C8, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, K2Node_Select_Default_3) == 0x0000D0, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D8, "Member 'WI_LobbyV3_PlayerWidget_C_ExecuteUbergraph_WI_LobbyV3_PlayerWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_LobbyV3_PlayerWidget.WI_LobbyV3_PlayerWidget_C.GetPlayerKickedBanReasonText
// 0x0010 (0x0010 - 0x0000)
struct WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText) == 0x000008, "Wrong alignment on WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText");
static_assert(sizeof(WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText) == 0x000010, "Wrong size on WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText, ReturnValue) == 0x000000, "Member 'WI_LobbyV3_PlayerWidget_C_GetPlayerKickedBanReasonText::ReturnValue' has a wrong offset!");

// Function WI_LobbyV3_PlayerWidget.WI_LobbyV3_PlayerWidget_C.ToggleContextMenu
// 0x0018 (0x0018 - 0x0000)
struct WI_LobbyV3_PlayerWidget_C_ToggleContextMenu final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_LobbyV3_PlayerWidget_C_ToggleContextMenu) == 0x000008, "Wrong alignment on WI_LobbyV3_PlayerWidget_C_ToggleContextMenu");
static_assert(sizeof(WI_LobbyV3_PlayerWidget_C_ToggleContextMenu) == 0x000018, "Wrong size on WI_LobbyV3_PlayerWidget_C_ToggleContextMenu");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ToggleContextMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WI_LobbyV3_PlayerWidget_C_ToggleContextMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ToggleContextMenu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_LobbyV3_PlayerWidget_C_ToggleContextMenu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_LobbyV3_PlayerWidget_C_ToggleContextMenu, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_LobbyV3_PlayerWidget_C_ToggleContextMenu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

