#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LookAtMeEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_LookAtMeEffect.WI_LookAtMeEffect_C
// 0x0050 (0x0330 - 0x02E0)
class UWI_LookAtMeEffect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseLoop;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               TextureMask;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DesignerPreviewVisible;                            // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TextureMaskParameter;                              // 0x0314(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RevealFractionParameter;                           // 0x031C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorParameter;                                    // 0x0324(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_LookAtMeEffect(int32 EntryPoint);
	void PlayPulseAnimationLoop();
	void PlayPulseAnimationOnce();
	void PreConstruct(bool IsDesignTime);
	void SetColor(const struct FLinearColor& Color_0);
	void SetMaskTexture(class UTexture* TextureMask_0);
	void SetRevealFraction(float RevealFraction);
	void StopPulseAnimationLoop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_LookAtMeEffect_C">();
	}
	static class UWI_LookAtMeEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_LookAtMeEffect_C>();
	}
};
static_assert(alignof(UWI_LookAtMeEffect_C) == 0x000008, "Wrong alignment on UWI_LookAtMeEffect_C");
static_assert(sizeof(UWI_LookAtMeEffect_C) == 0x000330, "Wrong size on UWI_LookAtMeEffect_C");
static_assert(offsetof(UWI_LookAtMeEffect_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_LookAtMeEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, PulseLoop) == 0x0002E8, "Member 'UWI_LookAtMeEffect_C::PulseLoop' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, Image) == 0x0002F0, "Member 'UWI_LookAtMeEffect_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, TextureMask) == 0x0002F8, "Member 'UWI_LookAtMeEffect_C::TextureMask' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, Color) == 0x000300, "Member 'UWI_LookAtMeEffect_C::Color' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, DesignerPreviewVisible) == 0x000310, "Member 'UWI_LookAtMeEffect_C::DesignerPreviewVisible' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, TextureMaskParameter) == 0x000314, "Member 'UWI_LookAtMeEffect_C::TextureMaskParameter' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, RevealFractionParameter) == 0x00031C, "Member 'UWI_LookAtMeEffect_C::RevealFractionParameter' has a wrong offset!");
static_assert(offsetof(UWI_LookAtMeEffect_C, ColorParameter) == 0x000324, "Member 'UWI_LookAtMeEffect_C::ColorParameter' has a wrong offset!");

}

