#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_LobbyV3_MatchConfiguration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_LobbyV3_MatchConfiguration.WI_LobbyV3_MatchConfiguration_C
// 0x0118 (0x0550 - 0x0438)
class UWI_LobbyV3_MatchConfiguration_C final : public UMatchConfigurationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Open;                                              // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_JPButton_C*                         CloseButton;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           DayLength;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingCheckboxArray_C*     DefenceItems;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingCheckboxArray_C*     DeliveryItems;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_SingleChoice_C*     DuplicateNeighborRestriction;                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         GuardDog;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Integer_C*          HouseEssentialDestroyCount;                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingsPanel_C*            JPCommonSettingsPanel;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           NightLength;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingCheckboxArray_C*     OffenceItems;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_SingleChoice_C*     PassiveIncome;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         RandomNeighbors;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Integer_C*          RequiredKillCount;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPButton_C*                         ResetButton;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           RespawnTimeMultiplier;                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Right_InfoBoxSizeBox;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SettingImage;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           SpecialAbilityInitialCooldown;                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_SingleChoice_C*     StartingEconomy;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Integer_C*          StartingResources;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         SuddenDeathEnabled;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           SuddenDeathTime;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSettingCheckboxArray_C*     SupportItems;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPHorizontalTabList_C*              TopSettingsTabs;                                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_OptionalSettingImage;                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Scalar_C*           WarmupDuration;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         WarmupEnabled;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetTransformRandomizer*             WidgetTransformRandomizer;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         WinConditionDeed;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         WinConditionDestruction;                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPCommonSetting_Checkbox_C*         WinConditionTeamDeathmatch;                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FMatchConfigurationViewModel& InViewModel);
	void BndEvt__WI_LobbyV3_MatchConfiguration_ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_LobbyV3_MatchConfiguration_WI_JPButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FGameplayTag& ItemTag, bool IsEnabled);
	void ExecuteUbergraph_WI_LobbyV3_MatchConfiguration(int32 EntryPoint);
	void Finished_A341AB854AD1E7D2A963CEB5F7C965A9();
	void GetInputsAsArray(TArray<class UObject*>* Array);
	void HandleCheckboxValueChanged(class UJPSettingWidget* InWidget);
	void HandleIntegerValueChanged(class UJPSettingWidget* InWidget);
	void HandleScalarValueChanged(class UJPSettingWidget* InWidget);
	void HandleSettingHovered(class UJPSettingWidget* InWidget);
	void HandleSettingUnhovered(class UJPSettingWidget* InWidget);
	void OnInitialized();
	void SetIsOpen(bool InVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_LobbyV3_MatchConfiguration_C">();
	}
	static class UWI_LobbyV3_MatchConfiguration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_LobbyV3_MatchConfiguration_C>();
	}
};
static_assert(alignof(UWI_LobbyV3_MatchConfiguration_C) == 0x000008, "Wrong alignment on UWI_LobbyV3_MatchConfiguration_C");
static_assert(sizeof(UWI_LobbyV3_MatchConfiguration_C) == 0x000550, "Wrong size on UWI_LobbyV3_MatchConfiguration_C");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, UberGraphFrame) == 0x000438, "Member 'UWI_LobbyV3_MatchConfiguration_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, Open) == 0x000440, "Member 'UWI_LobbyV3_MatchConfiguration_C::Open' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, CloseButton) == 0x000448, "Member 'UWI_LobbyV3_MatchConfiguration_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, DayLength) == 0x000450, "Member 'UWI_LobbyV3_MatchConfiguration_C::DayLength' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, DefenceItems) == 0x000458, "Member 'UWI_LobbyV3_MatchConfiguration_C::DefenceItems' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, DeliveryItems) == 0x000460, "Member 'UWI_LobbyV3_MatchConfiguration_C::DeliveryItems' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, DuplicateNeighborRestriction) == 0x000468, "Member 'UWI_LobbyV3_MatchConfiguration_C::DuplicateNeighborRestriction' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, GuardDog) == 0x000470, "Member 'UWI_LobbyV3_MatchConfiguration_C::GuardDog' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, HouseEssentialDestroyCount) == 0x000478, "Member 'UWI_LobbyV3_MatchConfiguration_C::HouseEssentialDestroyCount' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, JPCommonSettingsPanel) == 0x000480, "Member 'UWI_LobbyV3_MatchConfiguration_C::JPCommonSettingsPanel' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, NightLength) == 0x000488, "Member 'UWI_LobbyV3_MatchConfiguration_C::NightLength' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, OffenceItems) == 0x000490, "Member 'UWI_LobbyV3_MatchConfiguration_C::OffenceItems' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, PassiveIncome) == 0x000498, "Member 'UWI_LobbyV3_MatchConfiguration_C::PassiveIncome' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, RandomNeighbors) == 0x0004A0, "Member 'UWI_LobbyV3_MatchConfiguration_C::RandomNeighbors' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, RequiredKillCount) == 0x0004A8, "Member 'UWI_LobbyV3_MatchConfiguration_C::RequiredKillCount' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, ResetButton) == 0x0004B0, "Member 'UWI_LobbyV3_MatchConfiguration_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, RespawnTimeMultiplier) == 0x0004B8, "Member 'UWI_LobbyV3_MatchConfiguration_C::RespawnTimeMultiplier' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, RichText_Description) == 0x0004C0, "Member 'UWI_LobbyV3_MatchConfiguration_C::RichText_Description' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, Right_InfoBoxSizeBox) == 0x0004C8, "Member 'UWI_LobbyV3_MatchConfiguration_C::Right_InfoBoxSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, SettingImage) == 0x0004D0, "Member 'UWI_LobbyV3_MatchConfiguration_C::SettingImage' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, SpecialAbilityInitialCooldown) == 0x0004D8, "Member 'UWI_LobbyV3_MatchConfiguration_C::SpecialAbilityInitialCooldown' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, StartingEconomy) == 0x0004E0, "Member 'UWI_LobbyV3_MatchConfiguration_C::StartingEconomy' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, StartingResources) == 0x0004E8, "Member 'UWI_LobbyV3_MatchConfiguration_C::StartingResources' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, SuddenDeathEnabled) == 0x0004F0, "Member 'UWI_LobbyV3_MatchConfiguration_C::SuddenDeathEnabled' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, SuddenDeathTime) == 0x0004F8, "Member 'UWI_LobbyV3_MatchConfiguration_C::SuddenDeathTime' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, SupportItems) == 0x000500, "Member 'UWI_LobbyV3_MatchConfiguration_C::SupportItems' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, Text_SettingName) == 0x000508, "Member 'UWI_LobbyV3_MatchConfiguration_C::Text_SettingName' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, TopSettingsTabs) == 0x000510, "Member 'UWI_LobbyV3_MatchConfiguration_C::TopSettingsTabs' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, VerticalBox_OptionalSettingImage) == 0x000518, "Member 'UWI_LobbyV3_MatchConfiguration_C::VerticalBox_OptionalSettingImage' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WarmupDuration) == 0x000520, "Member 'UWI_LobbyV3_MatchConfiguration_C::WarmupDuration' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WarmupEnabled) == 0x000528, "Member 'UWI_LobbyV3_MatchConfiguration_C::WarmupEnabled' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WidgetTransformRandomizer) == 0x000530, "Member 'UWI_LobbyV3_MatchConfiguration_C::WidgetTransformRandomizer' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WinConditionDeed) == 0x000538, "Member 'UWI_LobbyV3_MatchConfiguration_C::WinConditionDeed' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WinConditionDestruction) == 0x000540, "Member 'UWI_LobbyV3_MatchConfiguration_C::WinConditionDestruction' has a wrong offset!");
static_assert(offsetof(UWI_LobbyV3_MatchConfiguration_C, WinConditionTeamDeathmatch) == 0x000548, "Member 'UWI_LobbyV3_MatchConfiguration_C::WinConditionTeamDeathmatch' has a wrong offset!");

}

