#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MainShopV2

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_MainShopV2.WI_MainShopV2_C.AddItemToTier
// 0x00A8 (0x00A8 - 0x0000)
struct WI_MainShopV2_C_AddItemToTier final
{
public:
	struct FShopItemViewModel                     ShopItemViewModel;                                 // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_AddItemToTier) == 0x000008, "Wrong alignment on WI_MainShopV2_C_AddItemToTier");
static_assert(sizeof(WI_MainShopV2_C_AddItemToTier) == 0x0000A8, "Wrong size on WI_MainShopV2_C_AddItemToTier");
static_assert(offsetof(WI_MainShopV2_C_AddItemToTier, ShopItemViewModel) == 0x000000, "Member 'WI_MainShopV2_C_AddItemToTier::ShopItemViewModel' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_AddItemToTier, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'WI_MainShopV2_C_AddItemToTier::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_AddItemToTier, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000090, "Member 'WI_MainShopV2_C_AddItemToTier::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_AddItemToTier, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'WI_MainShopV2_C_AddItemToTier::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.AddShopItemToTierAndAddToItemList
// 0x0018 (0x0018 - 0x0000)
struct WI_MainShopV2_C_AddShopItemToTierAndAddToItemList final
{
public:
	class UWI_ShopTierV2_C*                       TierWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  CallFunc_AddShopItemToWrapBox_ShopItem;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_AddShopItemToTierAndAddToItemList) == 0x000008, "Wrong alignment on WI_MainShopV2_C_AddShopItemToTierAndAddToItemList");
static_assert(sizeof(WI_MainShopV2_C_AddShopItemToTierAndAddToItemList) == 0x000018, "Wrong size on WI_MainShopV2_C_AddShopItemToTierAndAddToItemList");
static_assert(offsetof(WI_MainShopV2_C_AddShopItemToTierAndAddToItemList, TierWidget) == 0x000000, "Member 'WI_MainShopV2_C_AddShopItemToTierAndAddToItemList::TierWidget' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_AddShopItemToTierAndAddToItemList, CallFunc_AddShopItemToWrapBox_ShopItem) == 0x000008, "Member 'WI_MainShopV2_C_AddShopItemToTierAndAddToItemList::CallFunc_AddShopItemToWrapBox_ShopItem' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_AddShopItemToTierAndAddToItemList, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'WI_MainShopV2_C_AddShopItemToTierAndAddToItemList::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BindToHoveredAndPressedEventForItemsInTiers
// 0x00E8 (0x00E8 - 0x0000)
struct WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_ShopUpgradeButtonV2_C* ShopUpgradeButton, class UWI_ShopTierV2_C* ShopTier)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_ShopItemEntryV2_C* ShopItemWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWI_ShopItemEntryV2_C* ShopItem)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           K2Node_DynamicCast_AsVertical_Box;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       K2Node_DynamicCast_AsWI_Shop_Tier_V2;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopItemEntryV2_C*                  K2Node_DynamicCast_AsWI_Shop_Item_Entry_V2;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers");
static_assert(sizeof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers) == 0x0000E8, "Wrong size on WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Array_Index_Variable_1) == 0x000004, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Array_Index_Variable_2) == 0x000010, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, Temp_int_Loop_Counter_Variable_2) == 0x00004C, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_GetAllChildren_ReturnValue) == 0x000050, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Add_IntInt_ReturnValue_2) == 0x000060, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Get_Item) == 0x000068, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_AsVertical_Box) == 0x000070, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_AsVertical_Box' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_GetAllChildren_ReturnValue_1) == 0x000080, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_AsWI_Shop_Tier_V2) == 0x0000A0, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_AsWI_Shop_Tier_V2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_GetAllChildren_ReturnValue_2) == 0x0000B8, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Get_Item_2) == 0x0000C8, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Array_Length_ReturnValue_2) == 0x0000D0, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_AsWI_Shop_Item_Entry_V2) == 0x0000D8, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_AsWI_Shop_Item_Entry_V2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E1, "Member 'WI_MainShopV2_C_BindToHoveredAndPressedEventForItemsInTiers::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_JPButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopCategoryButtonV2_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature, Button) == 0x000000, "Member 'WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_1_K2Node_ComponentBoundEvent_2_On_Pressed__DelegateSignature::Button' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopCategoryButtonV2_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature, Button) == 0x000000, "Member 'WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_2_K2Node_ComponentBoundEvent_0_On_Pressed__DelegateSignature::Button' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopCategoryButtonV2_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature, Button) == 0x000000, "Member 'WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_3_K2Node_ComponentBoundEvent_1_On_Pressed__DelegateSignature::Button' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopCategoryButtonV2_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature, Button) == 0x000000, "Member 'WI_MainShopV2_C_BndEvt__WI_MainShopV2_WI_ShopCategoryButtonV2_K2Node_ComponentBoundEvent_3_On_Pressed__DelegateSignature::Button' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.DeliveryConfirmed
// 0x0008 (0x0008 - 0x0000)
struct WI_MainShopV2_C_DeliveryConfirmed final
{
public:
	struct FGameplayTag                           ItemGameplayTag;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_DeliveryConfirmed) == 0x000004, "Wrong alignment on WI_MainShopV2_C_DeliveryConfirmed");
static_assert(sizeof(WI_MainShopV2_C_DeliveryConfirmed) == 0x000008, "Wrong size on WI_MainShopV2_C_DeliveryConfirmed");
static_assert(offsetof(WI_MainShopV2_C_DeliveryConfirmed, ItemGameplayTag) == 0x000000, "Member 'WI_MainShopV2_C_DeliveryConfirmed::ItemGameplayTag' has a wrong offset!");

// Function WI_MainShopV2.WI_MainShopV2_C.ExecuteUbergraph_WI_MainShopV2
// 0x0300 (0x0300 - 0x0000)
struct WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& ItemGameplayTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpectatorPawnStinna_C*                 K2Node_DynamicCast_AsSpectator_Pawn_Stinna;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopUpgradeButtonV2_C*              K2Node_CustomEvent_ShopUpgradeButton;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       K2Node_CustomEvent_ShopTier;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  K2Node_CustomEvent_ShopItemWidget;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_1;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character_2;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_ItemBeingBought;                // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         K2Node_CustomEvent_ItemDefinition;                 // 0x00F0(0x0028)(HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  CallFunc_FindShopItemWidgetFromItemDefinition_ShopEntry; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UItemInstance*                          K2Node_CustomEvent_ItemInstance;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ItemGameplayTag_1;              // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_1;      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_2;      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_3;      // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_4;      // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_5;      // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_6;      // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_7;      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_8;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_9;      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopItemEntryV2_C*                  K2Node_CustomEvent_ShopItem;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_4;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character)>  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     K2Node_DynamicCast_AsGame_State_JP_Match;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopCategoryButtonV2_C*             K2Node_ComponentBoundEvent_Button_3;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FShopItemViewModel>             CallFunc_GetTeamShopItems_ReturnValue;             // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_10;     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_11;     // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_12;     // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             K2Node_ComponentBoundEvent_Button_2;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopCategoryButtonV2_C*             K2Node_ComponentBoundEvent_Button_1;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_13;     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_ShopCategoryButtonV2_C*             K2Node_ComponentBoundEvent_Button;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_14;     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_15;     // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShopItemViewModel                     CallFunc_Array_Get_Item;                           // 0x0210(0x0080)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_OrderedDeliveryTag;             // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPlayerControllerJP_MatchBPComponent_C* CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ItemGameplayTag;                // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_16;     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveCategory_CategoryChanged_17;     // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_5;              // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UShopInteractionAC_C*                   CallFunc_GetComponentByClass_ReturnValue_3;        // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP*                           K2Node_DynamicCast_AsGame_State_JP;                // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UItemInstance* ItemInstance, const struct FGameplayTag& ItemGameplayTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2) == 0x000008, "Wrong alignment on WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2");
static_assert(sizeof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2) == 0x000300, "Wrong size on WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, EntryPoint) == 0x000000, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, Temp_byte_Variable) == 0x000004, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsSpectator_Pawn_Stinna) == 0x000040, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsSpectator_Pawn_Stinna' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000050, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ShopUpgradeButton) == 0x000060, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ShopUpgradeButton' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ShopTier) == 0x000068, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ShopTier' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerPawn_ReturnValue) == 0x000070, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ShopItemWidget) == 0x000078, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ShopItemWidget' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetComponentByClass_ReturnValue) == 0x000080, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000088, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsBP_Resident_Character_1) == 0x000090, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsBP_Resident_Character_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000A0, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_Character) == 0x0000A8, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsItem_Definition) == 0x0000B0, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetAssetIdentifier_ReturnValue) == 0x0000BC, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetAssetIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0000C8, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_ComponentBoundEvent_Button_4) == 0x0000D0, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsBP_Resident_Character_2) == 0x0000D8, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsBP_Resident_Character_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess_4) == 0x0000E0, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ItemBeingBought) == 0x0000E4, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ItemBeingBought' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ItemDefinition) == 0x0000F0, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ItemDefinition' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_FindShopItemWidgetFromItemDefinition_ShopEntry) == 0x000118, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_FindShopItemWidgetFromItemDefinition_ShopEntry' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ItemInstance) == 0x000120, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ItemInstance' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ItemGameplayTag_1) == 0x000128, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ItemGameplayTag_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerPawn_ReturnValue_3) == 0x000130, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000138, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged) == 0x000140, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_1) == 0x000141, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_2) == 0x000142, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_3) == 0x000143, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_3' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_SwitchEnum_CmpSuccess) == 0x000144, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_4) == 0x000145, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_4' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_5) == 0x000146, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_5' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_6) == 0x000147, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_6' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_SwitchEnum_CmpSuccess_1) == 0x000148, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_7) == 0x000149, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_7' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_SwitchEnum_CmpSuccess_2) == 0x00014A, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerController_ReturnValue_2) == 0x000150, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_8) == 0x000158, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_8' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_SetActiveCategory_CategoryChanged_9) == 0x000159, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_SetActiveCategory_CategoryChanged_9' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CustomEvent_ShopItem) == 0x000160, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CustomEvent_ShopItem' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, CallFunc_GetPlayerPawn_ReturnValue_4) == 0x000170, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::CallFunc_GetPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000178, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_AsTeamable_Interface) == 0x000188, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'WI_MainShopV2_C_ExecuteUbergraph_WI_MainShopV2::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
