#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MiscAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "WI_AbilityBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_MiscAbility.WI_MiscAbility_C
// 0x0088 (0x03A0 - 0x0318)
class UWI_MiscAbility_C final : public UWI_AbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_MiscAbility_C;                   // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPActionWidget_C*                   ActionWidget;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BoundActionSizeBox;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Background;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ProgressBarFillFraction;                           // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CooldownText;                                      // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ShowOverlay;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              IconSoftTexture;                                   // 0x0360(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ShowBoundAction;                                   // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ActionOverrideIcon;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_MiscAbility(int32 EntryPoint);
	class FString GetCooldownText(double TimeRemaining);
	void OnAbilityActivatable();
	void OnAbilityCooldownEnded();
	void OnAbilityCooldownStarted(double TimeRemaining, double CooldownDuration, double PercentageDone);
	void OnAbilityInactivatable();
	void OnAbilityInitialized();
	void OnCooldownTick(double TimeRemaining, double CooldownDuration, double PercentageDone);
	void PreConstruct(bool IsDesignTime);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D> SoftTexture);
	void SetInputAction(class UInputAction* InputAction_0);
	void SetShowBoundAction(bool Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_MiscAbility_C">();
	}
	static class UWI_MiscAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_MiscAbility_C>();
	}
};
static_assert(alignof(UWI_MiscAbility_C) == 0x000008, "Wrong alignment on UWI_MiscAbility_C");
static_assert(sizeof(UWI_MiscAbility_C) == 0x0003A0, "Wrong size on UWI_MiscAbility_C");
static_assert(offsetof(UWI_MiscAbility_C, UberGraphFrame_WI_MiscAbility_C) == 0x000318, "Member 'UWI_MiscAbility_C::UberGraphFrame_WI_MiscAbility_C' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, ActionWidget) == 0x000320, "Member 'UWI_MiscAbility_C::ActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, BoundActionSizeBox) == 0x000328, "Member 'UWI_MiscAbility_C::BoundActionSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, Icon) == 0x000330, "Member 'UWI_MiscAbility_C::Icon' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, Image_Icon_Background) == 0x000338, "Member 'UWI_MiscAbility_C::Image_Icon_Background' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, ProgressBarFillFraction) == 0x000340, "Member 'UWI_MiscAbility_C::ProgressBarFillFraction' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, CooldownText) == 0x000348, "Member 'UWI_MiscAbility_C::CooldownText' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, ShowOverlay) == 0x000358, "Member 'UWI_MiscAbility_C::ShowOverlay' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, IconSoftTexture) == 0x000360, "Member 'UWI_MiscAbility_C::IconSoftTexture' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, ShowBoundAction) == 0x000388, "Member 'UWI_MiscAbility_C::ShowBoundAction' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, InputAction) == 0x000390, "Member 'UWI_MiscAbility_C::InputAction' has a wrong offset!");
static_assert(offsetof(UWI_MiscAbility_C, ActionOverrideIcon) == 0x000398, "Member 'UWI_MiscAbility_C::ActionOverrideIcon' has a wrong offset!");

}

