#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MenuCarousel_Item_Dot

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_MenuCarousel_Item_Dot.WI_MenuCarousel_Item_Dot_C.ButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature final
{
public:
	int32                                         DotIndex_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature");
static_assert(sizeof(WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature");
static_assert(offsetof(WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature, DotIndex_0) == 0x000000, "Member 'WI_MenuCarousel_Item_Dot_C_ButtonClicked__DelegateSignature::DotIndex_0' has a wrong offset!");

// Function WI_MenuCarousel_Item_Dot.WI_MenuCarousel_Item_Dot_C.ExecuteUbergraph_WI_MenuCarousel_Item_Dot
// 0x0004 (0x0004 - 0x0000)
struct WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot) == 0x000004, "Wrong alignment on WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot");
static_assert(sizeof(WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot) == 0x000004, "Wrong size on WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot");
static_assert(offsetof(WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot, EntryPoint) == 0x000000, "Member 'WI_MenuCarousel_Item_Dot_C_ExecuteUbergraph_WI_MenuCarousel_Item_Dot::EntryPoint' has a wrong offset!");

}

