#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_MoneyIncomeNotification

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_MoneyIncomeNotification.WI_MoneyIncomeNotification_C.ExecuteUbergraph_WI_MoneyIncomeNotification
// 0x0018 (0x0018 - 0x0000)
struct WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_DeltaAmount;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_NewAmount;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification) == 0x000008, "Wrong alignment on WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification");
static_assert(sizeof(WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification) == 0x000018, "Wrong size on WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification");
static_assert(offsetof(WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification, EntryPoint) == 0x000000, "Member 'WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification, K2Node_Event_DeltaAmount) == 0x000008, "Member 'WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification::K2Node_Event_DeltaAmount' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification, K2Node_Event_NewAmount) == 0x000010, "Member 'WI_MoneyIncomeNotification_C_ExecuteUbergraph_WI_MoneyIncomeNotification::K2Node_Event_NewAmount' has a wrong offset!");

// Function WI_MoneyIncomeNotification.WI_MoneyIncomeNotification_C.OnHandlePayload
// 0x00A8 (0x00A8 - 0x0000)
struct WI_MoneyIncomeNotification_C_OnHandlePayload final
{
public:
	struct FResourcePayload                       NewPayload;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        DeltaAmount;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResourceValueChange                          Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentAmount_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MoneyIncomeNotification_C_OnHandlePayload) == 0x000008, "Wrong alignment on WI_MoneyIncomeNotification_C_OnHandlePayload");
static_assert(sizeof(WI_MoneyIncomeNotification_C_OnHandlePayload) == 0x0000A8, "Wrong size on WI_MoneyIncomeNotification_C_OnHandlePayload");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, NewPayload) == 0x000000, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::NewPayload' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, DeltaAmount) == 0x000028, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::DeltaAmount' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_byte_Variable) == 0x000030, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable) == 0x000038, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_1) == 0x000040, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_2) == 0x000048, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_3) == 0x000050, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_4) == 0x000058, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_5) == 0x000060, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, Temp_object_Variable_6) == 0x000068, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, K2Node_Select_Default) == 0x000078, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, CallFunc_Abs_ReturnValue) == 0x000088, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000090, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, K2Node_VariableSet_CurrentAmount_ImplicitCast) == 0x000098, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::K2Node_VariableSet_CurrentAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnHandlePayload, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'WI_MoneyIncomeNotification_C_OnHandlePayload::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WI_MoneyIncomeNotification.WI_MoneyIncomeNotification_C.OnIncomeNotify
// 0x0010 (0x0010 - 0x0000)
struct WI_MoneyIncomeNotification_C_OnIncomeNotify final
{
public:
	double                                        DeltaAmount;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewAmount;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MoneyIncomeNotification_C_OnIncomeNotify) == 0x000008, "Wrong alignment on WI_MoneyIncomeNotification_C_OnIncomeNotify");
static_assert(sizeof(WI_MoneyIncomeNotification_C_OnIncomeNotify) == 0x000010, "Wrong size on WI_MoneyIncomeNotification_C_OnIncomeNotify");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnIncomeNotify, DeltaAmount) == 0x000000, "Member 'WI_MoneyIncomeNotification_C_OnIncomeNotify::DeltaAmount' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnIncomeNotify, NewAmount) == 0x000008, "Member 'WI_MoneyIncomeNotification_C_OnIncomeNotify::NewAmount' has a wrong offset!");

// Function WI_MoneyIncomeNotification.WI_MoneyIncomeNotification_C.OnNotificationUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature final
{
public:
	double                                        DeltaAmount;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewAmount;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature");
static_assert(sizeof(WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature) == 0x000010, "Wrong size on WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature, DeltaAmount) == 0x000000, "Member 'WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature::DeltaAmount' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature, NewAmount) == 0x000008, "Member 'WI_MoneyIncomeNotification_C_OnNotificationUpdated__DelegateSignature::NewAmount' has a wrong offset!");

// Function WI_MoneyIncomeNotification.WI_MoneyIncomeNotification_C.SetDisplayValue
// 0x0010 (0x0010 - 0x0000)
struct WI_MoneyIncomeNotification_C_SetDisplayValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_MoneyIncomeNotification_C_SetDisplayValue) == 0x000008, "Wrong alignment on WI_MoneyIncomeNotification_C_SetDisplayValue");
static_assert(sizeof(WI_MoneyIncomeNotification_C_SetDisplayValue) == 0x000010, "Wrong size on WI_MoneyIncomeNotification_C_SetDisplayValue");
static_assert(offsetof(WI_MoneyIncomeNotification_C_SetDisplayValue, Value) == 0x000000, "Member 'WI_MoneyIncomeNotification_C_SetDisplayValue::Value' has a wrong offset!");
static_assert(offsetof(WI_MoneyIncomeNotification_C_SetDisplayValue, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'WI_MoneyIncomeNotification_C_SetDisplayValue::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

}

