#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NewMainMenu

#include "Basic.hpp"

#include "S_TabDescriptorRow_structs.hpp"
#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonGame_structs.hpp"
#include "Engine_structs.hpp"
#include "S_Message_TabOpened_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_NewMainMenu.WI_NewMainMenu_C.ExecuteUbergraph_WI_NewMainMenu
// 0x0168 (0x0168 - 0x0000)
struct WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          K2Node_MakeStruct_EmptyPayload;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCachedNetworkFailureAsString_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonGameDialogDescriptor*            CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_Descriptor; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result_1;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationCustom_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          Temp_struct_Variable;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_TryGetCachedNetworkFailureAsTag_NetworkFailureTag; // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCachedNetworkFailureAsTag_ReturnValue; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCachedNetworkFailure_ReturnValue;      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonGameDialogDescriptor*            CallFunc_TryGetNetworkFailureTagDescriptor_Descriptor; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNetworkFailureTagDescriptor_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationCustom_ReturnValue_1;     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_TabNameId;                      // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPHorizontalTabList_C*              CallFunc_GetJPTabs_JPTabs;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Message_TabOpened                   K2Node_MakeStruct_S_Message_TabOpened;             // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPHorizontalTabList_C*              CallFunc_GetJPTabs_JPTabs_1;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_JPHorizontalTabList_C*              CallFunc_GetJPTabs_JPTabs_2;                       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabId)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FEmptyPayload                          Temp_struct_Variable_2;                            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu) == 0x000008, "Wrong alignment on WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu");
static_assert(sizeof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu) == 0x000168, "Wrong size on WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, EntryPoint) == 0x000000, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_MakeStruct_EmptyPayload) == 0x000004, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_MakeStruct_EmptyPayload' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetCachedNetworkFailureAsString_ReturnValue) == 0x000010, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetCachedNetworkFailureAsString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_Descriptor) == 0x000030, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_Descriptor' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_ReturnValue) == 0x000038, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetFollowLeaderNetworkFailureDescriptor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CustomEvent_Result_1) == 0x000039, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_ShowConfirmationCustom_ReturnValue) == 0x000040, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_ShowConfirmationCustom_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_byte_Variable) == 0x000048, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000050, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CustomEvent_Result) == 0x000058, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_byte_Variable_1) == 0x00006C, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000070, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_bool_Variable) == 0x000079, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_byte_Variable_2) == 0x00007A, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_byte_Variable_3) == 0x00007B, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000080, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_struct_Variable) == 0x000088, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000089, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_bool_Has_Been_Initd_Variable) == 0x00008A, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_bool_IsClosed_Variable) == 0x00008B, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000090, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetCachedNetworkFailureAsTag_NetworkFailureTag) == 0x000098, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetCachedNetworkFailureAsTag_NetworkFailureTag' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetCachedNetworkFailureAsTag_ReturnValue) == 0x0000A0, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetCachedNetworkFailureAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_HasCachedNetworkFailure_ReturnValue) == 0x0000A1, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_HasCachedNetworkFailure_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000A2, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetNetworkFailureTagDescriptor_Descriptor) == 0x0000A8, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetNetworkFailureTagDescriptor_Descriptor' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_TryGetNetworkFailureTagDescriptor_ReturnValue) == 0x0000B0, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_TryGetNetworkFailureTagDescriptor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_ShowConfirmationCustom_ReturnValue_1) == 0x0000B8, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_ShowConfirmationCustom_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CustomEvent_TabNameId) == 0x0000C4, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CustomEvent_TabNameId' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetJPTabs_JPTabs) == 0x0000D0, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetJPTabs_JPTabs' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D8, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_MakeStruct_S_Message_TabOpened) == 0x0000DC, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_MakeStruct_S_Message_TabOpened' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_Select_Default) == 0x0000E4, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetJPTabs_JPTabs_1) == 0x0000E8, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetJPTabs_JPTabs_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x0000F0, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_object_Variable) == 0x0000F8, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetPayload_ReturnValue) == 0x000100, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_IsValid_ReturnValue_2) == 0x000101, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetJPTabs_JPTabs_2) == 0x000108, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetJPTabs_JPTabs_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_struct_Variable_1) == 0x000120, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, Temp_struct_Variable_2) == 0x000128, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CustomEvent_ProxyObject) == 0x000130, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CustomEvent_ActualChannel) == 0x000138, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000140, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000158, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000160, "Member 'WI_NewMainMenu_C_ExecuteUbergraph_WI_NewMainMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.GetJPTabs
// 0x0010 (0x0010 - 0x0000)
struct WI_NewMainMenu_C_GetJPTabs final
{
public:
	class UWI_JPHorizontalTabList_C*              JPTabs;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_JPHorizontalTabList_C*              CallFunc_GetJPTabs_JPTabs;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_GetJPTabs) == 0x000008, "Wrong alignment on WI_NewMainMenu_C_GetJPTabs");
static_assert(sizeof(WI_NewMainMenu_C_GetJPTabs) == 0x000010, "Wrong size on WI_NewMainMenu_C_GetJPTabs");
static_assert(offsetof(WI_NewMainMenu_C_GetJPTabs, JPTabs) == 0x000000, "Member 'WI_NewMainMenu_C_GetJPTabs::JPTabs' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetJPTabs, CallFunc_GetJPTabs_JPTabs) == 0x000008, "Member 'WI_NewMainMenu_C_GetJPTabs::CallFunc_GetJPTabs_JPTabs' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.GetLocalPlayerPartySlotWidget
// 0x0010 (0x0010 - 0x0000)
struct WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget final
{
public:
	class UWI_PartySlot_C*                        LocalPlayerPartySlotWidget;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_PartySlot_C*                        CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget) == 0x000008, "Wrong alignment on WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget");
static_assert(sizeof(WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget) == 0x000010, "Wrong size on WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget");
static_assert(offsetof(WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget, LocalPlayerPartySlotWidget) == 0x000000, "Member 'WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget::LocalPlayerPartySlotWidget' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget, CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget) == 0x000008, "Member 'WI_NewMainMenu_C_GetLocalPlayerPartySlotWidget::CallFunc_GetLocalPlayerPartySlotWidget_LocalPlayerPartySlotWidget' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.GetSettingsButton
// 0x0010 (0x0010 - 0x0000)
struct WI_NewMainMenu_C_GetSettingsButton final
{
public:
	class UWI_SettingsButton_C*                   SettingsButton;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SettingsButton_C*                   CallFunc_GetSettingsButton_SettingsButton;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_GetSettingsButton) == 0x000008, "Wrong alignment on WI_NewMainMenu_C_GetSettingsButton");
static_assert(sizeof(WI_NewMainMenu_C_GetSettingsButton) == 0x000010, "Wrong size on WI_NewMainMenu_C_GetSettingsButton");
static_assert(offsetof(WI_NewMainMenu_C_GetSettingsButton, SettingsButton) == 0x000000, "Member 'WI_NewMainMenu_C_GetSettingsButton::SettingsButton' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetSettingsButton, CallFunc_GetSettingsButton_SettingsButton) == 0x000008, "Member 'WI_NewMainMenu_C_GetSettingsButton::CallFunc_GetSettingsButton_SettingsButton' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.HandleTabSelected
// 0x0008 (0x0008 - 0x0000)
struct WI_NewMainMenu_C_HandleTabSelected final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_HandleTabSelected) == 0x000004, "Wrong alignment on WI_NewMainMenu_C_HandleTabSelected");
static_assert(sizeof(WI_NewMainMenu_C_HandleTabSelected) == 0x000008, "Wrong size on WI_NewMainMenu_C_HandleTabSelected");
static_assert(offsetof(WI_NewMainMenu_C_HandleTabSelected, TabNameID) == 0x000000, "Member 'WI_NewMainMenu_C_HandleTabSelected::TabNameID' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A
// 0x0010 (0x0010 - 0x0000)
struct WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A) == 0x000008, "Wrong alignment on WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A");
static_assert(sizeof(WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A) == 0x000010, "Wrong size on WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A");
static_assert(offsetof(WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A, ProxyObject) == 0x000000, "Member 'WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A, ActualChannel) == 0x000008, "Member 'WI_NewMainMenu_C_OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A::ActualChannel' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF
// 0x0001 (0x0001 - 0x0000)
struct WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF) == 0x000001, "Wrong alignment on WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF");
static_assert(sizeof(WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF) == 0x000001, "Wrong size on WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF");
static_assert(offsetof(WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF, Result) == 0x000000, "Member 'WI_NewMainMenu_C_OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF::Result' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9
// 0x0001 (0x0001 - 0x0000)
struct WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9 final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9) == 0x000001, "Wrong alignment on WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9");
static_assert(sizeof(WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9) == 0x000001, "Wrong size on WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9");
static_assert(offsetof(WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9, Result) == 0x000000, "Member 'WI_NewMainMenu_C_OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9::Result' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.GetTabDescriptors
// 0x01A0 (0x01A0 - 0x0000)
struct WI_NewMainMenu_C_GetTabDescriptors final
{
public:
	TArray<struct FLyraTabDescriptor>             ExistingTabDescriptors;                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FLyraTabDescriptor>             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<struct FLyraTabDescriptor>             TempArray;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0040(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TabDescriptorRow                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0120)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLyraTabDescriptor>             K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_GetTabDescriptors) == 0x000010, "Wrong alignment on WI_NewMainMenu_C_GetTabDescriptors");
static_assert(sizeof(WI_NewMainMenu_C_GetTabDescriptors) == 0x0001A0, "Wrong size on WI_NewMainMenu_C_GetTabDescriptors");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, ExistingTabDescriptors) == 0x000000, "Member 'WI_NewMainMenu_C_GetTabDescriptors::ExistingTabDescriptors' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, ReturnValue) == 0x000010, "Member 'WI_NewMainMenu_C_GetTabDescriptors::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, TempArray) == 0x000020, "Member 'WI_NewMainMenu_C_GetTabDescriptors::TempArray' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WI_NewMainMenu_C_GetTabDescriptors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WI_NewMainMenu_C_GetTabDescriptors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000040, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_Array_Get_Item) == 0x000050, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000180, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_Less_IntInt_ReturnValue) == 0x000181, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, K2Node_MakeArray_Array) == 0x000188, "Member 'WI_NewMainMenu_C_GetTabDescriptors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_GetTabDescriptors, CallFunc_Array_Add_ReturnValue) == 0x000198, "Member 'WI_NewMainMenu_C_GetTabDescriptors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WI_NewMainMenu.WI_NewMainMenu_C.IsTabDisabled
// 0x0140 (0x0140 - 0x0000)
struct WI_NewMainMenu_C_IsTabDisabled final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TabDescriptorRow                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0120)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewMainMenu_C_IsTabDisabled) == 0x000010, "Wrong alignment on WI_NewMainMenu_C_IsTabDisabled");
static_assert(sizeof(WI_NewMainMenu_C_IsTabDisabled) == 0x000140, "Wrong size on WI_NewMainMenu_C_IsTabDisabled");
static_assert(offsetof(WI_NewMainMenu_C_IsTabDisabled, TabName) == 0x000000, "Member 'WI_NewMainMenu_C_IsTabDisabled::TabName' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_IsTabDisabled, ReturnValue) == 0x000008, "Member 'WI_NewMainMenu_C_IsTabDisabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NewMainMenu_C_IsTabDisabled, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WI_NewMainMenu_C_IsTabDisabled::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
