#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_News

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_News.WI_News_C.DecodeNews
// 0x0088 (0x0088 - 0x0000)
struct WI_News_C_DecodeNews final
{
public:
	class UPlayFabJsonObject*                     SingleNewsJson;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewsId;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Timestamp;                                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Title;                                             // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Body;                                              // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_DecodeNews) == 0x000008, "Wrong alignment on WI_News_C_DecodeNews");
static_assert(sizeof(WI_News_C_DecodeNews) == 0x000088, "Wrong size on WI_News_C_DecodeNews");
static_assert(offsetof(WI_News_C_DecodeNews, SingleNewsJson) == 0x000000, "Member 'WI_News_C_DecodeNews::SingleNewsJson' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, NewsId) == 0x000008, "Member 'WI_News_C_DecodeNews::NewsId' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, Timestamp) == 0x000018, "Member 'WI_News_C_DecodeNews::Timestamp' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, Title) == 0x000028, "Member 'WI_News_C_DecodeNews::Title' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, Body) == 0x000038, "Member 'WI_News_C_DecodeNews::Body' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, CallFunc_GetStringField_ReturnValue) == 0x000048, "Member 'WI_News_C_DecodeNews::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, CallFunc_GetStringField_ReturnValue_1) == 0x000058, "Member 'WI_News_C_DecodeNews::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, CallFunc_GetStringField_ReturnValue_2) == 0x000068, "Member 'WI_News_C_DecodeNews::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_News_C_DecodeNews, CallFunc_GetStringField_ReturnValue_3) == 0x000078, "Member 'WI_News_C_DecodeNews::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");

// Function WI_News.WI_News_C.ExecuteUbergraph_WI_News
// 0x0240 (0x0240 - 0x0000)
struct WI_News_C_ExecuteUbergraph_WI_News final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0020(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_WaitForLoggedIn*           CallFunc_WaitForLoggedIn_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_WaitForClientAuthenticationInitialized* CallFunc_WaitForClientAuthenticationInitialized_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalUserOnlineServicesGameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaytestInProgress_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_PlaytestCountdown_C*                CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FOnlineLanguageChangedPayload          Temp_struct_Variable_1;                            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineLanguageChangedPayload          Temp_struct_Variable_2;                            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x00EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientGetTitleNewsRequest             K2Node_MakeStruct_ClientGetTitleNewsRequest;       // 0x0110(0x0010)(NoDestructor)
	const class UPlayFabJsonObject*               K2Node_CustomEvent_ResponseData;                   // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_GetTitleNews_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientGetTitleNewsResult              CallFunc_decodeGetTitleNewsResultResponse_ReturnValue; // 0x0130(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DecodeNews_NewsId;                        // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DecodeNews_Timestamp;                     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DecodeNews_Title;                         // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DecodeNews_Body;                          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0010)()
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsDateTime_DateTime_ReturnValue;          // 0x01C8(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsLoading;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x01E8(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_ExecuteUbergraph_WI_News) == 0x000008, "Wrong alignment on WI_News_C_ExecuteUbergraph_WI_News");
static_assert(sizeof(WI_News_C_ExecuteUbergraph_WI_News) == 0x000240, "Wrong size on WI_News_C_ExecuteUbergraph_WI_News");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, EntryPoint) == 0x000000, "Member 'WI_News_C_ExecuteUbergraph_WI_News::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_object_Variable) == 0x000008, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_struct_Variable) == 0x000020, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_WaitForLoggedIn_ReturnValue) == 0x000070, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_WaitForLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_WaitForClientAuthenticationInitialized_ReturnValue) == 0x000090, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_WaitForClientAuthenticationInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_bool_Variable) == 0x000098, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_int_Variable) == 0x00009C, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_int_Variable_1) == 0x0000A0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_IsPlaytestInProgress_ReturnValue) == 0x0000B0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_IsPlaytestInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_struct_Variable_1) == 0x0000C0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_ProxyObject) == 0x0000C8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_ActualChannel) == 0x0000D0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_struct_Variable_2) == 0x0000E8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_struct_Variable_3) == 0x0000EC, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_object_Variable_1) == 0x0000F8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000100, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_GetPayload_ReturnValue) == 0x000108, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_IsValid_ReturnValue_2) == 0x000109, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_MakeStruct_ClientGetTitleNewsRequest) == 0x000110, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_MakeStruct_ClientGetTitleNewsRequest' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_ResponseData) == 0x000120, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_ResponseData' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_GetTitleNews_ReturnValue) == 0x000128, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_GetTitleNews_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_decodeGetTitleNewsResultResponse_ReturnValue) == 0x000130, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_decodeGetTitleNewsResultResponse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_Array_Get_Item) == 0x000148, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000150, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DecodeNews_NewsId) == 0x000158, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DecodeNews_NewsId' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DecodeNews_Timestamp) == 0x000168, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DecodeNews_Timestamp' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DecodeNews_Title) == 0x000178, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DecodeNews_Title' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DecodeNews_Body) == 0x000188, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DecodeNews_Body' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DateTimeFromIsoString_Result) == 0x0001B8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DateTimeFromIsoString_Result' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_DateTimeFromIsoString_ReturnValue) == 0x0001C0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_DateTimeFromIsoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_IsValid_ReturnValue_3) == 0x0001C1, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_AsDateTime_DateTime_ReturnValue) == 0x0001C8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_AsDateTime_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, Temp_bool_Variable_1) == 0x0001D8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_IsLoading) == 0x0001D9, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_IsLoading' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_Select_Default) == 0x0001DC, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_Event_IsDesignTime) == 0x0001E0, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_response) == 0x0001E8, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_customData) == 0x000228, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, K2Node_CustomEvent_successful) == 0x000230, "Member 'WI_News_C_ExecuteUbergraph_WI_News::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(WI_News_C_ExecuteUbergraph_WI_News, CallFunc_AddChild_ReturnValue) == 0x000238, "Member 'WI_News_C_ExecuteUbergraph_WI_News::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WI_News.WI_News_C.HandleSuccess
// 0x0008 (0x0008 - 0x0000)
struct WI_News_C_HandleSuccess final
{
public:
	const class UPlayFabJsonObject*               ResponseData;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_HandleSuccess) == 0x000008, "Wrong alignment on WI_News_C_HandleSuccess");
static_assert(sizeof(WI_News_C_HandleSuccess) == 0x000008, "Wrong size on WI_News_C_HandleSuccess");
static_assert(offsetof(WI_News_C_HandleSuccess, ResponseData) == 0x000000, "Member 'WI_News_C_HandleSuccess::ResponseData' has a wrong offset!");

// Function WI_News.WI_News_C.OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B
// 0x0010 (0x0010 - 0x0000)
struct WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B) == 0x000008, "Wrong alignment on WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B");
static_assert(sizeof(WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B) == 0x000010, "Wrong size on WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B");
static_assert(offsetof(WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B, ProxyObject) == 0x000000, "Member 'WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B, ActualChannel) == 0x000008, "Member 'WI_News_C_OnMessageReceived_4477B7A44AE7858E4A462EA5F64E2F5B::ActualChannel' has a wrong offset!");

// Function WI_News.WI_News_C.OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E
// 0x0050 (0x0050 - 0x0000)
struct WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E) == 0x000008, "Wrong alignment on WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E");
static_assert(sizeof(WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E) == 0x000050, "Wrong size on WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E");
static_assert(offsetof(WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E, Response) == 0x000000, "Member 'WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E::Response' has a wrong offset!");
static_assert(offsetof(WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E, CustomData) == 0x000040, "Member 'WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E::CustomData' has a wrong offset!");
static_assert(offsetof(WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E, Successful) == 0x000048, "Member 'WI_News_C_OnPlayFabResponse_57369CC741AA47057A142FA4E78CDD6E::Successful' has a wrong offset!");

// Function WI_News.WI_News_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_News_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_PreConstruct) == 0x000001, "Wrong alignment on WI_News_C_PreConstruct");
static_assert(sizeof(WI_News_C_PreConstruct) == 0x000001, "Wrong size on WI_News_C_PreConstruct");
static_assert(offsetof(WI_News_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_News_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_News.WI_News_C.SetIsLoading
// 0x0001 (0x0001 - 0x0000)
struct WI_News_C_SetIsLoading final
{
public:
	bool                                          IsLoading;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_News_C_SetIsLoading) == 0x000001, "Wrong alignment on WI_News_C_SetIsLoading");
static_assert(sizeof(WI_News_C_SetIsLoading) == 0x000001, "Wrong size on WI_News_C_SetIsLoading");
static_assert(offsetof(WI_News_C_SetIsLoading, IsLoading) == 0x000000, "Member 'WI_News_C_SetIsLoading::IsLoading' has a wrong offset!");

}

