#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NeighborDetails

#include "Basic.hpp"

#include "S_PlayerRewardPreviewChangedMessage_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "S_NeighborSelectionChangedMessage_structs.hpp"
#include "E_DetailsType_structs.hpp"


namespace SDK::Params
{

// Function WI_NeighborDetails.WI_NeighborDetails_C.BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_ItemSkinButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_NextNeighborSelector_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_OutfitButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_NeighborDetails_C_BndEvt__WI_NeighborDetails_PrevNeighborSelector_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.BroadcastPlayerRewardChange
// 0x0018 (0x0018 - 0x0000)
struct WI_NeighborDetails_C_BroadcastPlayerRewardChange final
{
public:
	struct FGameplayTag                           PlayerRewardID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerRewardPreviewChangedMessage   K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_BroadcastPlayerRewardChange) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_BroadcastPlayerRewardChange");
static_assert(sizeof(WI_NeighborDetails_C_BroadcastPlayerRewardChange) == 0x000018, "Wrong size on WI_NeighborDetails_C_BroadcastPlayerRewardChange");
static_assert(offsetof(WI_NeighborDetails_C_BroadcastPlayerRewardChange, PlayerRewardID) == 0x000000, "Member 'WI_NeighborDetails_C_BroadcastPlayerRewardChange::PlayerRewardID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_BroadcastPlayerRewardChange, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_NeighborDetails_C_BroadcastPlayerRewardChange::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_BroadcastPlayerRewardChange, K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage) == 0x000010, "Member 'WI_NeighborDetails_C_BroadcastPlayerRewardChange::K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.ClearPreviewActor
// 0x0001 (0x0001 - 0x0000)
struct WI_NeighborDetails_C_ClearPreviewActor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_ClearPreviewActor) == 0x000001, "Wrong alignment on WI_NeighborDetails_C_ClearPreviewActor");
static_assert(sizeof(WI_NeighborDetails_C_ClearPreviewActor) == 0x000001, "Wrong size on WI_NeighborDetails_C_ClearPreviewActor");
static_assert(offsetof(WI_NeighborDetails_C_ClearPreviewActor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WI_NeighborDetails_C_ClearPreviewActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.ExecuteUbergraph_WI_NeighborDetails
// 0x01D0 (0x01D0 - 0x0000)
struct WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineStoreItemData>           CallFunc_GetNeighborsFilteredByActive_ReturnValue; // 0x0010(0x0010)(ReferenceParm)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborMetaData_Succeeded;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborMetaData>       CallFunc_TryGetNeighborMetaData_ReturnValue;       // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeighborOnlineServicesContainer       CallFunc_GetActiveNeighbors_ReturnValue;           // 0x0098(0x0010)(ConstParm)
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_BackButton_C*                       CallFunc_GetBackButton_BackButton;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              CallFunc_GetPreviewSlot_PreviewSlot;               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              CallFunc_GetPreviewSlot_PreviewSlot_1;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              CallFunc_GetPreviewSlot_PreviewSlot_2;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_InTag;                          // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNeighborIndexFromTag_Array_Index;      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 K2Node_CustomEvent_DetailsType;                    // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SelectEquippedGeneralPerk;      // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15F[0x1];                                      // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_PushWidgetToLayerStack_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_NeighborDetailsSelect_C*            K2Node_DynamicCast_AsWI_Neighbor_Details_Select;   // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborMetaData*                      K2Node_DynamicCast_AsNeighbor_Meta_Data;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_DetailsType OldDetailsType)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_DetailsType                                 K2Node_CustomEvent_OldDetailsType;                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_TryGetStartingItemSkinID_ReturnValue;     // 0x01BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_TryGetLoadoutStartingItemSkinID_OutTag;   // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetLoadoutStartingItemSkinID_ReturnValue; // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails");
static_assert(sizeof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails) == 0x0001D0, "Wrong size on WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, EntryPoint) == 0x000000, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetNeighborsFilteredByActive_ReturnValue) == 0x000010, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetNeighborsFilteredByActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000030, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000038, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetNeighborMetaData_Succeeded) == 0x000060, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetNeighborMetaData_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetNeighborMetaData_ReturnValue) == 0x000068, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetNeighborMetaData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_Index) == 0x000090, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetActiveNeighbors_ReturnValue) == 0x000098, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetActiveNeighbors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000A8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_ComponentBoundEvent_Button_3) == 0x0000C0, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_ComponentBoundEvent_Button_2) == 0x0000C8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, Temp_object_Variable) == 0x0000D8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_AsNeighbor_Definition) == 0x0000E0, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000E9, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000EC, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_ComponentBoundEvent_Button_1) == 0x000100, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_ComponentBoundEvent_Button) == 0x000108, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetBackButton_BackButton) == 0x000120, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetBackButton_BackButton' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_Button) == 0x000128, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetPreviewSlot_PreviewSlot) == 0x000130, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetPreviewSlot_PreviewSlot' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetPreviewSlot_PreviewSlot_1) == 0x000138, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetPreviewSlot_PreviewSlot_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetPreviewSlot_PreviewSlot_2) == 0x000140, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetPreviewSlot_PreviewSlot_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_InTag) == 0x000148, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_InTag' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_Loaded) == 0x000150, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GetNeighborIndexFromTag_Array_Index) == 0x000158, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GetNeighborIndexFromTag_Array_Index' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00015C, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_DetailsType) == 0x00015D, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_DetailsType' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_SelectEquippedGeneralPerk) == 0x00015E, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_SelectEquippedGeneralPerk' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_PushWidgetToLayerStack_ReturnValue) == 0x000160, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_PushWidgetToLayerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_AsWI_Neighbor_Details_Select) == 0x000168, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_AsWI_Neighbor_Details_Select' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, Temp_object_Variable_1) == 0x000178, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_AsNeighbor_Meta_Data) == 0x000180, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_AsNeighbor_Meta_Data' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_Loaded_1) == 0x000190, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CreateDelegate_OutputDelegate_3) == 0x000198, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_CustomEvent_OldDetailsType) == 0x0001B8, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_CustomEvent_OldDetailsType' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, K2Node_SwitchEnum_CmpSuccess) == 0x0001B9, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetStartingItemSkinID_ReturnValue) == 0x0001BC, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetStartingItemSkinID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetLoadoutStartingItemSkinID_OutTag) == 0x0001C4, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetLoadoutStartingItemSkinID_OutTag' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails, CallFunc_TryGetLoadoutStartingItemSkinID_ReturnValue) == 0x0001CC, "Member 'WI_NeighborDetails_C_ExecuteUbergraph_WI_NeighborDetails::CallFunc_TryGetLoadoutStartingItemSkinID_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.Get Item Skin
// 0x00F0 (0x00F0 - 0x0000)
struct WI_NeighborDetails_C_Get_Item_Skin final
{
public:
	struct FNeighborLoadout                       LoadoutLookup;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UItemSkinDefinition>     OutSoftItemSkinDefinition;                         // 0x0030(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           AssetID;                                           // 0x0058(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefault;                                         // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemLoadout                           CallFunc_Array_Get_Item;                           // 0x006C(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemSkinDefinition>     CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition; // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetItemSkinDefinition_ReturnValue;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UItemSkinDefinition>     CallFunc_GetDefaultItemSkin_OutSoftItemSkinDefinition; // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetDefaultItemSkin_ReturnValue;           // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetNeighborItemID_NeighborItemID;         // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_Get_Item_Skin) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_Get_Item_Skin");
static_assert(sizeof(WI_NeighborDetails_C_Get_Item_Skin) == 0x0000F0, "Wrong size on WI_NeighborDetails_C_Get_Item_Skin");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, LoadoutLookup) == 0x000000, "Member 'WI_NeighborDetails_C_Get_Item_Skin::LoadoutLookup' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, OutSoftItemSkinDefinition) == 0x000030, "Member 'WI_NeighborDetails_C_Get_Item_Skin::OutSoftItemSkinDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, AssetID) == 0x000058, "Member 'WI_NeighborDetails_C_Get_Item_Skin::AssetID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, IsDefault) == 0x000060, "Member 'WI_NeighborDetails_C_Get_Item_Skin::IsDefault' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, Temp_int_Array_Index_Variable) == 0x000064, "Member 'WI_NeighborDetails_C_Get_Item_Skin::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_Array_Get_Item) == 0x00006C, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WI_NeighborDetails_C_Get_Item_Skin::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition) == 0x000080, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_TryGetItemSkinDefinition_ReturnValue) == 0x0000A8, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_TryGetItemSkinDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_Less_IntInt_ReturnValue) == 0x0000A9, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_GetDefaultItemSkin_OutSoftItemSkinDefinition) == 0x0000B0, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_GetDefaultItemSkin_OutSoftItemSkinDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_GetDefaultItemSkin_ReturnValue) == 0x0000D8, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_GetDefaultItemSkin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_GetNeighborItemID_NeighborItemID) == 0x0000E0, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_GetNeighborItemID_NeighborItemID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_Get_Item_Skin, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000E8, "Member 'WI_NeighborDetails_C_Get_Item_Skin::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.GetDefaultItemSkin
// 0x00B0 (0x00B0 - 0x0000)
struct WI_NeighborDetails_C_GetDefaultItemSkin final
{
public:
	TSoftObjectPtr<class UItemSkinDefinition>     OutSoftItemSkinDefinition;                         // 0x0000(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_TryGetStartingItemSkinID_ReturnValue;     // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemSkinDefinition>     CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition; // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetItemSkinDefinition_ReturnValue;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_GetDefaultItemSkin) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_GetDefaultItemSkin");
static_assert(sizeof(WI_NeighborDetails_C_GetDefaultItemSkin) == 0x0000B0, "Wrong size on WI_NeighborDetails_C_GetDefaultItemSkin");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, OutSoftItemSkinDefinition) == 0x000000, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::OutSoftItemSkinDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, ReturnValue) == 0x000028, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000030, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000038, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000068, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_TryGetStartingItemSkinID_ReturnValue) == 0x000074, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_TryGetStartingItemSkinID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition) == 0x000080, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_TryGetItemSkinDefinition_OutSoftItemSkinDefinition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetDefaultItemSkin, CallFunc_TryGetItemSkinDefinition_ReturnValue) == 0x0000A8, "Member 'WI_NeighborDetails_C_GetDefaultItemSkin::CallFunc_TryGetItemSkinDefinition_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.GetNeighborIndexFromTag
// 0x0038 (0x0038 - 0x0000)
struct WI_NeighborDetails_C_GetNeighborIndexFromTag final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeighborOnlineServicesContainer       CallFunc_GetActiveNeighbors_ReturnValue;           // 0x0018(0x0010)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeighborOnlineServicesData            CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_GetNeighborIndexFromTag) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_GetNeighborIndexFromTag");
static_assert(sizeof(WI_NeighborDetails_C_GetNeighborIndexFromTag) == 0x000038, "Wrong size on WI_NeighborDetails_C_GetNeighborIndexFromTag");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, InTag) == 0x000000, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::InTag' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, Array_Index) == 0x000008, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::Array_Index' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_GetActiveNeighbors_ReturnValue) == 0x000018, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_GetActiveNeighbors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborIndexFromTag, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000035, "Member 'WI_NeighborDetails_C_GetNeighborIndexFromTag::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.GetNeighborItemID
// 0x0058 (0x0058 - 0x0000)
struct WI_NeighborDetails_C_GetNeighborItemID final
{
public:
	struct FGameplayTag                           NeighborItemID;                                    // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetNeighborDefinition_Succeeded;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborDefinition>     CallFunc_TryGetNeighborDefinition_ReturnValue;     // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborDefinition*                    K2Node_DynamicCast_AsNeighbor_Definition;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetStartingItemID_ReturnValue;            // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_GetNeighborItemID) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_GetNeighborItemID");
static_assert(sizeof(WI_NeighborDetails_C_GetNeighborItemID) == 0x000058, "Wrong size on WI_NeighborDetails_C_GetNeighborItemID");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, NeighborItemID) == 0x000000, "Member 'WI_NeighborDetails_C_GetNeighborItemID::NeighborItemID' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, CallFunc_TryGetNeighborDefinition_Succeeded) == 0x000008, "Member 'WI_NeighborDetails_C_GetNeighborItemID::CallFunc_TryGetNeighborDefinition_Succeeded' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, CallFunc_TryGetNeighborDefinition_ReturnValue) == 0x000010, "Member 'WI_NeighborDetails_C_GetNeighborItemID::CallFunc_TryGetNeighborDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WI_NeighborDetails_C_GetNeighborItemID::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, K2Node_DynamicCast_AsNeighbor_Definition) == 0x000040, "Member 'WI_NeighborDetails_C_GetNeighborItemID::K2Node_DynamicCast_AsNeighbor_Definition' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_NeighborDetails_C_GetNeighborItemID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetNeighborItemID, CallFunc_GetStartingItemID_ReturnValue) == 0x00004C, "Member 'WI_NeighborDetails_C_GetNeighborItemID::CallFunc_GetStartingItemID_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.GetPreviewSlot
// 0x0018 (0x0018 - 0x0000)
struct WI_NeighborDetails_C_GetPreviewSlot final
{
public:
	class ABP_NeighborPreviewSlot_C*              PreviewSlot_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_GetPreviewSlot) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_GetPreviewSlot");
static_assert(sizeof(WI_NeighborDetails_C_GetPreviewSlot) == 0x000018, "Wrong size on WI_NeighborDetails_C_GetPreviewSlot");
static_assert(offsetof(WI_NeighborDetails_C_GetPreviewSlot, PreviewSlot_0) == 0x000000, "Member 'WI_NeighborDetails_C_GetPreviewSlot::PreviewSlot_0' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetPreviewSlot, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'WI_NeighborDetails_C_GetPreviewSlot::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_GetPreviewSlot, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WI_NeighborDetails_C_GetPreviewSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.HandleTopBarBackButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_NeighborDetails_C_HandleTopBarBackButtonClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_HandleTopBarBackButtonClicked) == 0x000008, "Wrong alignment on WI_NeighborDetails_C_HandleTopBarBackButtonClicked");
static_assert(sizeof(WI_NeighborDetails_C_HandleTopBarBackButtonClicked) == 0x000008, "Wrong size on WI_NeighborDetails_C_HandleTopBarBackButtonClicked");
static_assert(offsetof(WI_NeighborDetails_C_HandleTopBarBackButtonClicked, Button) == 0x000000, "Member 'WI_NeighborDetails_C_HandleTopBarBackButtonClicked::Button' has a wrong offset!");

// Function WI_NeighborDetails.WI_NeighborDetails_C.HavePreviewSkinsChanged
// 0x0009 (0x0009 - 0x0000)
struct WI_NeighborDetails_C_HavePreviewSkinsChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_NeighborDetails_C_HavePreviewSkinsChanged) == 0x000001, "Wrong alignment on WI_NeighborDetails_C_HavePreviewSkinsChanged");
static_assert(sizeof(WI_NeighborDetails_C_HavePreviewSkinsChanged) == 0x000009, "Wrong size on WI_NeighborDetails_C_HavePreviewSkinsChanged");
static_assert(offsetof(WI_NeighborDetails_C_HavePreviewSkinsChanged, ReturnValue) == 0x000000, "Member 'WI_NeighborDetails_C_HavePreviewSkinsChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_HavePreviewSkinsChanged, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000001, "Member 'WI_NeighborDetails_C_HavePreviewSkinsChanged::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_HavePreviewSkinsChanged, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000002, "Member 'WI_NeighborDetails_C_HavePreviewSkinsChanged::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_HavePreviewSkinsChanged, CallFunc_MatchesTag_ReturnValue) == 0x000003, "Member 'WI_NeighborDetails_C_HavePreviewSkinsChanged::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_NeighborDetails_C_HavePreviewSkinsChanged, CallFunc_BooleanNOR_ReturnValue) == 0x000004, "Member 'WI_NeighborDetails_C_HavePreviewSkinsChanged::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
