#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NewPerkUnlockedPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_NewPerkUnlockedPanel.WI_NewPerkUnlockedPanel_C.SetRewardData
// 0x0068 (0x0068 - 0x0000)
struct WI_NewPerkUnlockedPanel_C_SetRewardData final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Cost;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DescriptionHeader;                                 // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0040(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_NewPerkUnlockedPanel_C_SetRewardData) == 0x000008, "Wrong alignment on WI_NewPerkUnlockedPanel_C_SetRewardData");
static_assert(sizeof(WI_NewPerkUnlockedPanel_C_SetRewardData) == 0x000068, "Wrong size on WI_NewPerkUnlockedPanel_C_SetRewardData");
static_assert(offsetof(WI_NewPerkUnlockedPanel_C_SetRewardData, Name_0) == 0x000000, "Member 'WI_NewPerkUnlockedPanel_C_SetRewardData::Name_0' has a wrong offset!");
static_assert(offsetof(WI_NewPerkUnlockedPanel_C_SetRewardData, Cost) == 0x000010, "Member 'WI_NewPerkUnlockedPanel_C_SetRewardData::Cost' has a wrong offset!");
static_assert(offsetof(WI_NewPerkUnlockedPanel_C_SetRewardData, DescriptionHeader) == 0x000020, "Member 'WI_NewPerkUnlockedPanel_C_SetRewardData::DescriptionHeader' has a wrong offset!");
static_assert(offsetof(WI_NewPerkUnlockedPanel_C_SetRewardData, Description) == 0x000030, "Member 'WI_NewPerkUnlockedPanel_C_SetRewardData::Description' has a wrong offset!");
static_assert(offsetof(WI_NewPerkUnlockedPanel_C_SetRewardData, Image) == 0x000040, "Member 'WI_NewPerkUnlockedPanel_C_SetRewardData::Image' has a wrong offset!");

}

