#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NewNeighborsScreen

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WI_BaseScreen_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_NewNeighborsScreen.WI_NewNeighborsScreen_C
// 0x00A8 (0x04D8 - 0x0430)
class UWI_NewNeighborsScreen_C final : public UWI_BaseScreen_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               RotatorBox;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PlayerRotator_C*                    WI_PlayerRotator;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumberOfNeighbors;                                 // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstRowCutoff;                                    // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondRowCutoff;                                   // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                NeighborButtonPadding;                             // 0x045C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NeighborButtonScale;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              PreviewSlot;                                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnedNum;                                          // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FOnlineStoreItemData> NeighborButtonsMap;                                // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddButtonToContainer(class UWidget* Button);
	void AddPreviewNeighborButton(const struct FOnlineStoreItemData& StoreItem, int32 Index_0);
	void CreateNeighborButton(const struct FOnlineStoreItemData& StoreItem, int32 Index_0, bool ShouldGetXP, class UWI_NeighborButton_C** NeighborButtonWidget);
	void ExecuteUbergraph_WI_NewNeighborsScreen(int32 EntryPoint);
	void OnInitialized();
	void OnMessageReceived_6649F7E44AE56F8D255B02944310E1FF(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnNeighborButtonClicked(int32 NeighborIndex);
	void OnNeighborsUpdated(const TArray<struct FOnlineStoreItemData>& OwnedItems, const TArray<struct FOnlineStoreItemData>& UnownedItems);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_NewNeighborsScreen_C">();
	}
	static class UWI_NewNeighborsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_NewNeighborsScreen_C>();
	}
};
static_assert(alignof(UWI_NewNeighborsScreen_C) == 0x000008, "Wrong alignment on UWI_NewNeighborsScreen_C");
static_assert(sizeof(UWI_NewNeighborsScreen_C) == 0x0004D8, "Wrong size on UWI_NewNeighborsScreen_C");
static_assert(offsetof(UWI_NewNeighborsScreen_C, UberGraphFrame) == 0x000430, "Member 'UWI_NewNeighborsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, RotatorBox) == 0x000438, "Member 'UWI_NewNeighborsScreen_C::RotatorBox' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, WI_PlayerRotator) == 0x000440, "Member 'UWI_NewNeighborsScreen_C::WI_PlayerRotator' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, WrapBox) == 0x000448, "Member 'UWI_NewNeighborsScreen_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, NumberOfNeighbors) == 0x000450, "Member 'UWI_NewNeighborsScreen_C::NumberOfNeighbors' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, FirstRowCutoff) == 0x000454, "Member 'UWI_NewNeighborsScreen_C::FirstRowCutoff' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, SecondRowCutoff) == 0x000458, "Member 'UWI_NewNeighborsScreen_C::SecondRowCutoff' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, NeighborButtonPadding) == 0x00045C, "Member 'UWI_NewNeighborsScreen_C::NeighborButtonPadding' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, NeighborButtonScale) == 0x000470, "Member 'UWI_NewNeighborsScreen_C::NeighborButtonScale' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, PreviewSlot) == 0x000478, "Member 'UWI_NewNeighborsScreen_C::PreviewSlot' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, OwnedNum) == 0x000480, "Member 'UWI_NewNeighborsScreen_C::OwnedNum' has a wrong offset!");
static_assert(offsetof(UWI_NewNeighborsScreen_C, NeighborButtonsMap) == 0x000488, "Member 'UWI_NewNeighborsScreen_C::NeighborButtonsMap' has a wrong offset!");

}

