#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_NewMainMenu

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_NewMainMenu.WI_NewMainMenu_C
// 0x0068 (0x0498 - 0x0430)
class UWI_NewMainMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_BottomBoundActionBar_C*             BottomBoundActionBar;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CaptureClicks;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                Content;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_Social_C*                           Social;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_TopBar_RootMenu_C*                  TopBar;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ProjectVersion_C*                   WI_ProjectVersion;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FLyraTabDescriptor>             OverrideTabDescriptors;                            // 0x0468(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UDataTable*                             OverrideTabDescriptorsTable;                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   SettingsWidgetClass;                               // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   NeighborIDs;                                       // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_WI_NewMainMenu(int32 EntryPoint);
	void GetJPTabs(class UWI_JPHorizontalTabList_C** JPTabs);
	void GetLocalPlayerPartySlotWidget(class UWI_PartySlot_C** LocalPlayerPartySlotWidget);
	void GetSettingsButton(class UWI_SettingsButton_C** SettingsButton);
	void HandleTabSelected(class FName TabNameID);
	void OnInitialized();
	void OnMessageReceived_413B7E074EEBEF2F1CE802971AEA143A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnResult_5EDDE5DA4A4CEFB35DFE46AD66B28BCF(ECommonMessagingResult Result);
	void OnResult_B15C5E114F2BBA3417B87FA3CDE03AA9(ECommonMessagingResult Result);

	TArray<struct FLyraTabDescriptor> GetTabDescriptors(const TArray<struct FLyraTabDescriptor>& ExistingTabDescriptors) const;
	bool IsTabDisabled(const class FName TabName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_NewMainMenu_C">();
	}
	static class UWI_NewMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_NewMainMenu_C>();
	}
};
static_assert(alignof(UWI_NewMainMenu_C) == 0x000008, "Wrong alignment on UWI_NewMainMenu_C");
static_assert(sizeof(UWI_NewMainMenu_C) == 0x000498, "Wrong size on UWI_NewMainMenu_C");
static_assert(offsetof(UWI_NewMainMenu_C, UberGraphFrame) == 0x000430, "Member 'UWI_NewMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, BottomBoundActionBar) == 0x000438, "Member 'UWI_NewMainMenu_C::BottomBoundActionBar' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, CaptureClicks) == 0x000440, "Member 'UWI_NewMainMenu_C::CaptureClicks' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, Content) == 0x000448, "Member 'UWI_NewMainMenu_C::Content' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, Social) == 0x000450, "Member 'UWI_NewMainMenu_C::Social' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, TopBar) == 0x000458, "Member 'UWI_NewMainMenu_C::TopBar' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, WI_ProjectVersion) == 0x000460, "Member 'UWI_NewMainMenu_C::WI_ProjectVersion' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, OverrideTabDescriptors) == 0x000468, "Member 'UWI_NewMainMenu_C::OverrideTabDescriptors' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, OverrideTabDescriptorsTable) == 0x000478, "Member 'UWI_NewMainMenu_C::OverrideTabDescriptorsTable' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, SettingsWidgetClass) == 0x000480, "Member 'UWI_NewMainMenu_C::SettingsWidgetClass' has a wrong offset!");
static_assert(offsetof(UWI_NewMainMenu_C, NeighborIDs) == 0x000488, "Member 'UWI_NewMainMenu_C::NeighborIDs' has a wrong offset!");

}

