#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Objective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "E_TimeOfDay_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Objective.WI_Objective_C
// 0x01C0 (0x04A0 - 0x02E0)
class UWI_Objective_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideIn;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideOut;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Check;                                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CheckMark;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxPlayers;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_117;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_166;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ObjectiveTitleWidget;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Reward;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              SubObjectiveList;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_42;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ToolTipImage_C*                     WI_ToolTipImage;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_UIFlashEffect_C*                    WI_UIFlashEffect;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ObjectiveTitle;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWI_ObjectiveTracker_C*>         TrackingPlayerMap;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ASubObjective*>                  SubObjectives;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FText                                   ObjectiveReward;                                   // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeTillObjectiveEnd;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CompletedStrikeBrush;                              // 0x03C0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWI_ObjectiveList_C*                    OwningList;                                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddObjectiveTracker(class APlayerState* TrackingPlayer);
	void CalculateTimeUntilObjectiveEnd();
	void Client_UpdateTimer();
	void ExecuteUbergraph_WI_Objective(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RemoveFromList();
	void Set_Visuals(class UObjectiveDefinition* ObjectiveDefinition);
	void SetCompletedStatus(bool IsCompleted);
	void SetObjectiveReward(const class FText& ObjectiveReward_0);
	void SetObjectiveTitle(const class FText& ObjectiveTitle_0);
	void SetupVisualsForTutorialObjective();
	void StartAddAnimation();
	void StartRemoveAnim();
	void StartShowObjective();
	double TimeSinceObjectiveCreated(class ASubObjective* SubObjective);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Objective_C">();
	}
	static class UWI_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Objective_C>();
	}
};
static_assert(alignof(UWI_Objective_C) == 0x000010, "Wrong alignment on UWI_Objective_C");
static_assert(sizeof(UWI_Objective_C) == 0x0004A0, "Wrong size on UWI_Objective_C");
static_assert(offsetof(UWI_Objective_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_Objective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Show) == 0x0002E8, "Member 'UWI_Objective_C::Show' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, SlideIn) == 0x0002F0, "Member 'UWI_Objective_C::SlideIn' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, SlideOut) == 0x0002F8, "Member 'UWI_Objective_C::SlideOut' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Check) == 0x000300, "Member 'UWI_Objective_C::Check' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Background) == 0x000308, "Member 'UWI_Objective_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, CheckMark) == 0x000310, "Member 'UWI_Objective_C::CheckMark' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, HorizontalBoxPlayers) == 0x000318, "Member 'UWI_Objective_C::HorizontalBoxPlayers' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Image_117) == 0x000320, "Member 'UWI_Objective_C::Image_117' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Image_166) == 0x000328, "Member 'UWI_Objective_C::Image_166' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, ObjectiveTitleWidget) == 0x000330, "Member 'UWI_Objective_C::ObjectiveTitleWidget' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Reward) == 0x000338, "Member 'UWI_Objective_C::Reward' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Separator) == 0x000340, "Member 'UWI_Objective_C::Separator' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, SubObjectiveList) == 0x000348, "Member 'UWI_Objective_C::SubObjectiveList' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, TextBlock_42) == 0x000350, "Member 'UWI_Objective_C::TextBlock_42' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, Timer) == 0x000358, "Member 'UWI_Objective_C::Timer' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, WI_ToolTipImage) == 0x000360, "Member 'UWI_Objective_C::WI_ToolTipImage' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, WI_UIFlashEffect) == 0x000368, "Member 'UWI_Objective_C::WI_UIFlashEffect' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, ObjectiveTitle) == 0x000370, "Member 'UWI_Objective_C::ObjectiveTitle' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, TrackingPlayerMap) == 0x000380, "Member 'UWI_Objective_C::TrackingPlayerMap' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, SubObjectives) == 0x000390, "Member 'UWI_Objective_C::SubObjectives' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, ObjectiveReward) == 0x0003A0, "Member 'UWI_Objective_C::ObjectiveReward' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, TimeTillObjectiveEnd) == 0x0003B0, "Member 'UWI_Objective_C::TimeTillObjectiveEnd' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, CompletedStrikeBrush) == 0x0003C0, "Member 'UWI_Objective_C::CompletedStrikeBrush' has a wrong offset!");
static_assert(offsetof(UWI_Objective_C, OwningList) == 0x000490, "Member 'UWI_Objective_C::OwningList' has a wrong offset!");

}

