#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_OverlayBlurErrorNotification

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_OverlayBlurErrorNotification.WI_OverlayBlurErrorNotification_C.BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_OverlayBlurErrorNotification_C_BndEvt__WI_OverlayBlurErrorNotification_WI_JPButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_OverlayBlurErrorNotification.WI_OverlayBlurErrorNotification_C.ExecuteUbergraph_WI_OverlayBlurErrorNotification
// 0x0010 (0x0010 - 0x0000)
struct WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification) == 0x000008, "Wrong alignment on WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification");
static_assert(sizeof(WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification) == 0x000010, "Wrong size on WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification, EntryPoint) == 0x000000, "Member 'WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WI_OverlayBlurErrorNotification_C_ExecuteUbergraph_WI_OverlayBlurErrorNotification::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WI_OverlayBlurErrorNotification.WI_OverlayBlurErrorNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_OverlayBlurErrorNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_OverlayBlurErrorNotification_C_PreConstruct) == 0x000001, "Wrong alignment on WI_OverlayBlurErrorNotification_C_PreConstruct");
static_assert(sizeof(WI_OverlayBlurErrorNotification_C_PreConstruct) == 0x000001, "Wrong size on WI_OverlayBlurErrorNotification_C_PreConstruct");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_OverlayBlurErrorNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_OverlayBlurErrorNotification.WI_OverlayBlurErrorNotification_C.SetBodyText
// 0x0010 (0x0010 - 0x0000)
struct WI_OverlayBlurErrorNotification_C_SetBodyText final
{
public:
	class FText                                   Body_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_OverlayBlurErrorNotification_C_SetBodyText) == 0x000008, "Wrong alignment on WI_OverlayBlurErrorNotification_C_SetBodyText");
static_assert(sizeof(WI_OverlayBlurErrorNotification_C_SetBodyText) == 0x000010, "Wrong size on WI_OverlayBlurErrorNotification_C_SetBodyText");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_SetBodyText, Body_0) == 0x000000, "Member 'WI_OverlayBlurErrorNotification_C_SetBodyText::Body_0' has a wrong offset!");

// Function WI_OverlayBlurErrorNotification.WI_OverlayBlurErrorNotification_C.SetHeaderText
// 0x0010 (0x0010 - 0x0000)
struct WI_OverlayBlurErrorNotification_C_SetHeaderText final
{
public:
	class FText                                   Header_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_OverlayBlurErrorNotification_C_SetHeaderText) == 0x000008, "Wrong alignment on WI_OverlayBlurErrorNotification_C_SetHeaderText");
static_assert(sizeof(WI_OverlayBlurErrorNotification_C_SetHeaderText) == 0x000010, "Wrong size on WI_OverlayBlurErrorNotification_C_SetHeaderText");
static_assert(offsetof(WI_OverlayBlurErrorNotification_C_SetHeaderText, Header_0) == 0x000000, "Member 'WI_OverlayBlurErrorNotification_C_SetHeaderText::Header_0' has a wrong offset!");

}

