#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ObjectiveList

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_ObjectiveList.WI_ObjectiveList_C.AddObjectiveToList
// 0x0008 (0x0008 - 0x0000)
struct WI_ObjectiveList_C_AddObjectiveToList final
{
public:
	class UWI_Objective_C*                        InObjective;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_AddObjectiveToList) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_AddObjectiveToList");
static_assert(sizeof(WI_ObjectiveList_C_AddObjectiveToList) == 0x000008, "Wrong size on WI_ObjectiveList_C_AddObjectiveToList");
static_assert(offsetof(WI_ObjectiveList_C_AddObjectiveToList, InObjective) == 0x000000, "Member 'WI_ObjectiveList_C_AddObjectiveToList::InObjective' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.AddObjectiveWidget
// 0x0020 (0x0020 - 0x0000)
struct WI_ObjectiveList_C_AddObjectiveWidget final
{
public:
	const class UObjectiveDefinition*             ObjectiveDefinition;                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        NewObjectiveWidget;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_AddObjectiveWidget) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_AddObjectiveWidget");
static_assert(sizeof(WI_ObjectiveList_C_AddObjectiveWidget) == 0x000020, "Wrong size on WI_ObjectiveList_C_AddObjectiveWidget");
static_assert(offsetof(WI_ObjectiveList_C_AddObjectiveWidget, ObjectiveDefinition) == 0x000000, "Member 'WI_ObjectiveList_C_AddObjectiveWidget::ObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_AddObjectiveWidget, NewObjectiveWidget) == 0x000008, "Member 'WI_ObjectiveList_C_AddObjectiveWidget::NewObjectiveWidget' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_AddObjectiveWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WI_ObjectiveList_C_AddObjectiveWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_AddObjectiveWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WI_ObjectiveList_C_AddObjectiveWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.ClearObjectiveWidgets
// 0x0010 (0x0010 - 0x0000)
struct WI_ObjectiveList_C_ClearObjectiveWidgets final
{
public:
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_ClearObjectiveWidgets) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_ClearObjectiveWidgets");
static_assert(sizeof(WI_ObjectiveList_C_ClearObjectiveWidgets) == 0x000010, "Wrong size on WI_ObjectiveList_C_ClearObjectiveWidgets");
static_assert(offsetof(WI_ObjectiveList_C_ClearObjectiveWidgets, CallFunc_Get_ClassLog_Name_name) == 0x000000, "Member 'WI_ObjectiveList_C_ClearObjectiveWidgets::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.CreateObjectiveWidget
// 0x0010 (0x0010 - 0x0000)
struct WI_ObjectiveList_C_CreateObjectiveWidget final
{
public:
	struct FObjectiveAndOwningPlayer              Objective;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WI_ObjectiveList_C_CreateObjectiveWidget) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_CreateObjectiveWidget");
static_assert(sizeof(WI_ObjectiveList_C_CreateObjectiveWidget) == 0x000010, "Wrong size on WI_ObjectiveList_C_CreateObjectiveWidget");
static_assert(offsetof(WI_ObjectiveList_C_CreateObjectiveWidget, Objective) == 0x000000, "Member 'WI_ObjectiveList_C_CreateObjectiveWidget::Objective' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.CreateSubObjectiveWidget
// 0x0008 (0x0008 - 0x0000)
struct WI_ObjectiveList_C_CreateSubObjectiveWidget final
{
public:
	class ASubObjective*                          SubObjective;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_CreateSubObjectiveWidget) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_CreateSubObjectiveWidget");
static_assert(sizeof(WI_ObjectiveList_C_CreateSubObjectiveWidget) == 0x000008, "Wrong size on WI_ObjectiveList_C_CreateSubObjectiveWidget");
static_assert(offsetof(WI_ObjectiveList_C_CreateSubObjectiveWidget, SubObjective) == 0x000000, "Member 'WI_ObjectiveList_C_CreateSubObjectiveWidget::SubObjective' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.DoesObjectiveBelongToThisPlayer
// 0x0030 (0x0030 - 0x0000)
struct WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer final
{
public:
	struct FObjectiveAndOwningPlayer              ObjectiveAndOwningPlayer;                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	class UObjectiveDefinition*                   ObjectiveDefinition;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer");
static_assert(sizeof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer) == 0x000030, "Wrong size on WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer");
static_assert(offsetof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer, ObjectiveAndOwningPlayer) == 0x000000, "Member 'WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer::ObjectiveAndOwningPlayer' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer, ObjectiveDefinition) == 0x000010, "Member 'WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer::ObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer, ReturnValue) == 0x000018, "Member 'WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'WI_ObjectiveList_C_DoesObjectiveBelongToThisPlayer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.DoesSubObjectiveBelongToThisPlayer
// 0x0020 (0x0020 - 0x0000)
struct WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer final
{
public:
	class ASubObjective*                          SubObjective;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer");
static_assert(sizeof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer) == 0x000020, "Wrong size on WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer");
static_assert(offsetof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer, SubObjective) == 0x000000, "Member 'WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer::SubObjective' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer, ReturnValue) == 0x000008, "Member 'WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'WI_ObjectiveList_C_DoesSubObjectiveBelongToThisPlayer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.ExecuteUbergraph_WI_ObjectiveList
// 0x0308 (0x0308 - 0x0000)
struct WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveAndOwningPlayer              K2Node_Event_Objective_2;                          // 0x0070(0x0010)(NoDestructor, ContainsInstancedReference)
	class ASubObjective*                          K2Node_Event_SubObjective_2;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObjectiveDefinition*                   CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_AddObjectiveWidget_NewObjectiveWidget;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASubObjective*                          K2Node_Event_SubObjective_1;                       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASubObjective*                          K2Node_Event_SubObjective;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_1; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_2; // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_SubObjective_C*                     CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_SubObjective_C*                     CallFunc_Map_Find_Value;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_1;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FObjectiveTracker>              K2Node_Event_ObjectiveTrackers;                    // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UWI_SubObjective_C*                     CallFunc_Map_Find_Value_2;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectiveTracker                      CallFunc_Array_Get_Item;                           // 0x0120(0x0010)(NoDestructor, ContainsInstancedReference)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_3;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SubObjective_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_4;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectiveAndOwningPlayer              K2Node_Event_Objective_1;                          // 0x0198(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveDefinition*                   CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_1; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_1; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_5;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveAction*                       CallFunc_FindActionByType_ReturnValue;             // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveAndOwningPlayer              K2Node_Event_Objective;                            // 0x01E8(0x0010)(NoDestructor, ContainsInstancedReference)
	class APlayerStateJP*                         K2Node_DynamicCast_AsPlayer_State_JP;              // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObjectiveDefinition*                   CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_2; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_2; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_6;                         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        K2Node_CustomEvent_InObjective_1;                  // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FObjectiveAndOwningPlayer              K2Node_CustomEvent_Objective;                      // 0x0238(0x0010)(NoDestructor, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0248(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObjectiveDefinition*                   CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_3; // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_3; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_Objective_C*                        K2Node_CustomEvent_InObjective;                    // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Objective_C*                        CallFunc_Map_Find_Value_7;                         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x02B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList) == 0x000008, "Wrong alignment on WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList");
static_assert(sizeof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList) == 0x000308, "Wrong size on WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, EntryPoint) == 0x000000, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Get_ClassLog_Name_name) == 0x000008, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Variable) == 0x000044, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Array_Index_Variable_1) == 0x000060, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Loop_Counter_Variable_2) == 0x000064, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Add_IntInt_ReturnValue_3) == 0x000068, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_int_Array_Index_Variable_2) == 0x00006C, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_Objective_2) == 0x000070, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_Objective_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_SubObjective_2) == 0x000080, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_SubObjective_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition) == 0x000088, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue) == 0x000090, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_AddObjectiveWidget_NewObjectiveWidget) == 0x000098, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_AddObjectiveWidget_NewObjectiveWidget' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue) == 0x0000A0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_SubObjective_1) == 0x0000A8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_SubObjective_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_SubObjective) == 0x0000B0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_SubObjective' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_1) == 0x0000B8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_2) == 0x0000B9, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesSubObjectiveBelongToThisPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Remove_ReturnValue) == 0x0000D0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value) == 0x0000D8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue) == 0x0000E0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_1) == 0x0000E8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_1) == 0x0000F0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_AddChild_ReturnValue) == 0x0000F8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_ObjectiveTrackers) == 0x000100, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_ObjectiveTrackers' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_2) == 0x000110, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_2) == 0x000118, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Get_Item) == 0x000120, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetTeamID_ReturnValue) == 0x000130, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_3) == 0x000140, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_3) == 0x000148, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_object_Variable) == 0x000150, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_IsDesignTime) == 0x000158, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000160, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Create_ReturnValue_1) == 0x000168, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Create_ReturnValue_2) == 0x000170, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_AddChild_ReturnValue_1) == 0x000178, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_AddChild_ReturnValue_2) == 0x000180, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_4) == 0x000188, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_4) == 0x000190, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_Objective_1) == 0x000198, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_Objective_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Add_ReturnValue) == 0x0001A8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_1) == 0x0001B0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_1) == 0x0001B8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_5) == 0x0001C0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_5) == 0x0001C8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_FindActionByType_ReturnValue) == 0x0001D0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_FindActionByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0001E0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Event_Objective) == 0x0001E8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Event_Objective' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_DynamicCast_AsPlayer_State_JP) == 0x0001F8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_DynamicCast_AsPlayer_State_JP' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_2) == 0x000208, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_2) == 0x000210, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetTeamID_ReturnValue_1) == 0x000211, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000212, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_6) == 0x000218, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_6) == 0x000220, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_object_Variable_1) == 0x000228, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CustomEvent_InObjective_1) == 0x000230, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CustomEvent_InObjective_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CustomEvent_Objective) == 0x000238, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CustomEvent_Objective' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetAllChildren_ReturnValue) == 0x000248, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_3) == 0x000258, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ObjectiveDefinition_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_3) == 0x000260, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_DoesObjectiveBelongToThisPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Length_ReturnValue_1) == 0x000270, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Length_ReturnValue_2) == 0x000274, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Less_IntInt_ReturnValue_1) == 0x000278, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Subtract_IntInt_ReturnValue) == 0x00027C, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Greater_IntInt_ReturnValue) == 0x000280, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_AddChild_ReturnValue_3) == 0x000288, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CustomEvent_InObjective) == 0x000290, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CustomEvent_InObjective' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Remove_ReturnValue_1) == 0x000298, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_Value_7) == 0x0002A0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Map_Find_ReturnValue_7) == 0x0002A8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetAllChildren_ReturnValue_1) == 0x0002B0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_RemoveChild_ReturnValue) == 0x0002C0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Get_Item_2) == 0x0002C8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Length_ReturnValue_3) == 0x0002D0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002D4, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Array_Length_ReturnValue_4) == 0x0002D8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0002DC, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, Temp_bool_Variable) == 0x0002E0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0002E1, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_Select_Default) == 0x0002E8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, CallFunc_GetGameState_ReturnValue) == 0x0002F0, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CustomEvent_Actor) == 0x0002F8, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList, K2Node_CustomEvent_EndPlayReason) == 0x000300, "Member 'WI_ObjectiveList_C_ExecuteUbergraph_WI_ObjectiveList::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");

// Function WI_ObjectiveList.WI_ObjectiveList_C.FindMatchingSubObjectiveWidgetIndex
// 0x0040 (0x0040 - 0x0000)
struct WI_ObjectiveList_C_FindMatchingSubObjectiveWidgetIndex final
{
public:
