#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_OffscreenIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_OffscreenIndicator.WI_OffscreenIndicator_C
// 0x0028 (0x0308 - 0x02E0)
class UWI_OffscreenIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Damaged;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Indicator;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_LookAtMeEffect_C*                   LookAtMeEffect;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_OffscreenIndicator(int32 EntryPoint);
	void SetArrowImage(class UTexture2D* Image, const struct FLinearColor& Color);
	void SetImage(class UTexture2D* Image, const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_OffscreenIndicator_C">();
	}
	static class UWI_OffscreenIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_OffscreenIndicator_C>();
	}
};
static_assert(alignof(UWI_OffscreenIndicator_C) == 0x000008, "Wrong alignment on UWI_OffscreenIndicator_C");
static_assert(sizeof(UWI_OffscreenIndicator_C) == 0x000308, "Wrong size on UWI_OffscreenIndicator_C");
static_assert(offsetof(UWI_OffscreenIndicator_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_OffscreenIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_OffscreenIndicator_C, Damaged) == 0x0002E8, "Member 'UWI_OffscreenIndicator_C::Damaged' has a wrong offset!");
static_assert(offsetof(UWI_OffscreenIndicator_C, Arrow) == 0x0002F0, "Member 'UWI_OffscreenIndicator_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWI_OffscreenIndicator_C, Indicator) == 0x0002F8, "Member 'UWI_OffscreenIndicator_C::Indicator' has a wrong offset!");
static_assert(offsetof(UWI_OffscreenIndicator_C, LookAtMeEffect) == 0x000300, "Member 'UWI_OffscreenIndicator_C::LookAtMeEffect' has a wrong offset!");

}

