#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PartyLeaderLeftPostMatchCountdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PartyLeaderLeftPostMatchCountdown.WI_PartyLeaderLeftPostMatchCountdown_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_PartyLeaderLeftPostMatchCountdown_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CountdownEndTime;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_PartyLeaderLeftPostMatchCountdown(int32 EntryPoint);
	void Start(double LeaveTime);
	void StartDisplayTick();
	void UpdateTimerText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PartyLeaderLeftPostMatchCountdown_C">();
	}
	static class UWI_PartyLeaderLeftPostMatchCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PartyLeaderLeftPostMatchCountdown_C>();
	}
};
static_assert(alignof(UWI_PartyLeaderLeftPostMatchCountdown_C) == 0x000008, "Wrong alignment on UWI_PartyLeaderLeftPostMatchCountdown_C");
static_assert(sizeof(UWI_PartyLeaderLeftPostMatchCountdown_C) == 0x000300, "Wrong size on UWI_PartyLeaderLeftPostMatchCountdown_C");
static_assert(offsetof(UWI_PartyLeaderLeftPostMatchCountdown_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PartyLeaderLeftPostMatchCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PartyLeaderLeftPostMatchCountdown_C, Background) == 0x0002E8, "Member 'UWI_PartyLeaderLeftPostMatchCountdown_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_PartyLeaderLeftPostMatchCountdown_C, TextBlock) == 0x0002F0, "Member 'UWI_PartyLeaderLeftPostMatchCountdown_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWI_PartyLeaderLeftPostMatchCountdown_C, CountdownEndTime) == 0x0002F8, "Member 'UWI_PartyLeaderLeftPostMatchCountdown_C::CountdownEndTime' has a wrong offset!");

}

