#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_ServerList_Password

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C.BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordCancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C.BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_PreLobby_ServerList_Password_C_BndEvt__WI_PreLobby_ServerList_Password_EnterPasswordConfirm_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C.ExecuteUbergraph_WI_PreLobby_ServerList_Password
// 0x0040 (0x0040 - 0x0000)
struct WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password");
static_assert(sizeof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password) == 0x000040, "Wrong size on WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, EntryPoint) == 0x000000, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WI_PreLobby_ServerList_Password_C_ExecuteUbergraph_WI_PreLobby_ServerList_Password::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C.OnEnteredPassword__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature final
{
public:
	class FString                                 Password;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature");
static_assert(sizeof(WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature) == 0x000010, "Wrong size on WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature, Password) == 0x000000, "Member 'WI_PreLobby_ServerList_Password_C_OnEnteredPassword__DelegateSignature::Password' has a wrong offset!");

// Function WI_PreLobby_ServerList_Password.WI_PreLobby_ServerList_Password_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PreLobby_ServerList_Password_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Password_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PreLobby_ServerList_Password_C_PreConstruct");
static_assert(sizeof(WI_PreLobby_ServerList_Password_C_PreConstruct) == 0x000001, "Wrong size on WI_PreLobby_ServerList_Password_C_PreConstruct");
static_assert(offsetof(WI_PreLobby_ServerList_Password_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PreLobby_ServerList_Password_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

