#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PerkUnlock

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_PerkUnlock.WI_PerkUnlock_C.BarFilled__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WI_PerkUnlock_C_BarFilled__DelegateSignature final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_BarFilled__DelegateSignature) == 0x000004, "Wrong alignment on WI_PerkUnlock_C_BarFilled__DelegateSignature");
static_assert(sizeof(WI_PerkUnlock_C_BarFilled__DelegateSignature) == 0x000004, "Wrong size on WI_PerkUnlock_C_BarFilled__DelegateSignature");
static_assert(offsetof(WI_PerkUnlock_C_BarFilled__DelegateSignature, Level) == 0x000000, "Member 'WI_PerkUnlock_C_BarFilled__DelegateSignature::Level' has a wrong offset!");

// Function WI_PerkUnlock.WI_PerkUnlock_C.BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_PerkUnlock_C_BndEvt__WI_PerkUnlock_WI_PerkButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_PerkUnlock.WI_PerkUnlock_C.ExecuteUbergraph_WI_PerkUnlock
// 0x0020 (0x0020 - 0x0000)
struct WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Level;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PerkID;                         // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock) == 0x000008, "Wrong alignment on WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock");
static_assert(sizeof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock) == 0x000020, "Wrong size on WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock");
static_assert(offsetof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock, EntryPoint) == 0x000000, "Member 'WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock, K2Node_CustomEvent_Level) == 0x000008, "Member 'WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock, K2Node_CustomEvent_PerkID) == 0x000018, "Member 'WI_PerkUnlock_C_ExecuteUbergraph_WI_PerkUnlock::K2Node_CustomEvent_PerkID' has a wrong offset!");

// Function WI_PerkUnlock.WI_PerkUnlock_C.OnPerkButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature final
{
public:
	class UWI_PerkButton_C*                       PerkButton_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature");
static_assert(sizeof(WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature");
static_assert(offsetof(WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature, PerkButton_0) == 0x000000, "Member 'WI_PerkUnlock_C_OnPerkButtonClicked__DelegateSignature::PerkButton_0' has a wrong offset!");

// Function WI_PerkUnlock.WI_PerkUnlock_C.SetLevel
// 0x0008 (0x0008 - 0x0000)
struct WI_PerkUnlock_C_SetLevel final
{
public:
	double                                        Level;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_SetLevel) == 0x000008, "Wrong alignment on WI_PerkUnlock_C_SetLevel");
static_assert(sizeof(WI_PerkUnlock_C_SetLevel) == 0x000008, "Wrong size on WI_PerkUnlock_C_SetLevel");
static_assert(offsetof(WI_PerkUnlock_C_SetLevel, Level) == 0x000000, "Member 'WI_PerkUnlock_C_SetLevel::Level' has a wrong offset!");

// Function WI_PerkUnlock.WI_PerkUnlock_C.SetPerk
// 0x0008 (0x0008 - 0x0000)
struct WI_PerkUnlock_C_SetPerk final
{
public:
	struct FGameplayTag                           PerkID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PerkUnlock_C_SetPerk) == 0x000004, "Wrong alignment on WI_PerkUnlock_C_SetPerk");
static_assert(sizeof(WI_PerkUnlock_C_SetPerk) == 0x000008, "Wrong size on WI_PerkUnlock_C_SetPerk");
static_assert(offsetof(WI_PerkUnlock_C_SetPerk, PerkID) == 0x000000, "Member 'WI_PerkUnlock_C_SetPerk::PerkID' has a wrong offset!");

}

