#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayScreenCardButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PlayScreenCardButton.WI_PlayScreenCardButton_C
// 0x0080 (0x1620 - 0x15A0)
class UWI_PlayScreenCardButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Body;                                              // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisabledOverlay;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Header;                                            // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x15D0(0x0010)(Edit, BlueprintVisible)
	class FText                                   BodyText;                                          // 0x15E0(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x15F0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnLockedChanged(bool bIsLocked);
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_PlayScreenCardButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PlayScreenCardButton_C">();
	}
	static class UWI_PlayScreenCardButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PlayScreenCardButton_C>();
	}
};
static_assert(alignof(UWI_PlayScreenCardButton_C) == 0x000010, "Wrong alignment on UWI_PlayScreenCardButton_C");
static_assert(sizeof(UWI_PlayScreenCardButton_C) == 0x001620, "Wrong size on UWI_PlayScreenCardButton_C");
static_assert(offsetof(UWI_PlayScreenCardButton_C, UberGraphFrame) == 0x0015A0, "Member 'UWI_PlayScreenCardButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, Hover) == 0x0015A8, "Member 'UWI_PlayScreenCardButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, base) == 0x0015B0, "Member 'UWI_PlayScreenCardButton_C::base' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, Body) == 0x0015B8, "Member 'UWI_PlayScreenCardButton_C::Body' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, DisabledOverlay) == 0x0015C0, "Member 'UWI_PlayScreenCardButton_C::DisabledOverlay' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, Header) == 0x0015C8, "Member 'UWI_PlayScreenCardButton_C::Header' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, HeaderText) == 0x0015D0, "Member 'UWI_PlayScreenCardButton_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, BodyText) == 0x0015E0, "Member 'UWI_PlayScreenCardButton_C::BodyText' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreenCardButton_C, SoftTexture) == 0x0015F0, "Member 'UWI_PlayScreenCardButton_C::SoftTexture' has a wrong offset!");

}

