#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayerRewardButton

#include "Basic.hpp"

#include "S_PlayerRewardPreviewChangedMessage_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.ExecuteUbergraph_WI_PlayerRewardButton
// 0x00E8 (0x00E8 - 0x0000)
struct WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerRewardDataAsset*                 K2Node_DynamicCast_AsPlayer_Reward_Data_Asset;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlayerRewardDataAsset>  CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPlayerRewardDataAsset_ReturnValue;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PlayerRewardDataAssetID;        // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URarity*                                K2Node_CustomEvent_Rarity;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   K2Node_CustomEvent_OnlineStoreItemData;            // 0x0088(0x0048)()
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton");
static_assert(sizeof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton) == 0x0000E8, "Wrong size on WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, EntryPoint) == 0x000000, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, Temp_object_Variable) == 0x000020, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_DynamicCast_AsPlayer_Reward_Data_Asset) == 0x000028, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_DynamicCast_AsPlayer_Reward_Data_Asset' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset) == 0x000038, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, CallFunc_TryGetPlayerRewardDataAsset_ReturnValue) == 0x000060, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::CallFunc_TryGetPlayerRewardDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_Event_IsDesignTime) == 0x000061, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CustomEvent_PlayerRewardDataAssetID) == 0x000064, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CustomEvent_PlayerRewardDataAssetID' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000070, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CustomEvent_Rarity) == 0x000080, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CustomEvent_Rarity' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CustomEvent_OnlineStoreItemData) == 0x000088, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CustomEvent_OnlineStoreItemData' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CustomEvent_Button) == 0x0000D0, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'WI_PlayerRewardButton_C_ExecuteUbergraph_WI_PlayerRewardButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.HandleRarityButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_HandleRarityButtonClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_HandleRarityButtonClicked) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_HandleRarityButtonClicked");
static_assert(sizeof(WI_PlayerRewardButton_C_HandleRarityButtonClicked) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_HandleRarityButtonClicked");
static_assert(offsetof(WI_PlayerRewardButton_C_HandleRarityButtonClicked, Button) == 0x000000, "Member 'WI_PlayerRewardButton_C_HandleRarityButtonClicked::Button' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.OnLoaded_FE9FBE634062D5C1F92C538EE8251E56
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56");
static_assert(sizeof(WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56");
static_assert(offsetof(WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56, Loaded) == 0x000000, "Member 'WI_PlayerRewardButton_C_OnLoaded_FE9FBE634062D5C1F92C538EE8251E56::Loaded' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.OnNewPlayerRewardActivated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature final
{
public:
	class UWI_PlayerRewardButton_C*               PlayerRewardButton;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature");
static_assert(sizeof(WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature");
static_assert(offsetof(WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature, PlayerRewardButton) == 0x000000, "Member 'WI_PlayerRewardButton_C_OnNewPlayerRewardActivated__DelegateSignature::PlayerRewardButton' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.OnNewPlayerRewardEquipped__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature final
{
public:
	class UWI_PlayerRewardButton_C*               PlayerRewardButton;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature");
static_assert(sizeof(WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature");
static_assert(offsetof(WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature, PlayerRewardButton) == 0x000000, "Member 'WI_PlayerRewardButton_C_OnNewPlayerRewardEquipped__DelegateSignature::PlayerRewardButton' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.OnPlayerRewardDataAssetSet__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature final
{
public:
	class UPlayerRewardDataAsset*                 PlayerRewardDataAsset_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_PlayerRewardButton_C*               PlayerRewardButton;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature");
static_assert(sizeof(WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature) == 0x000010, "Wrong size on WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature");
static_assert(offsetof(WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature, PlayerRewardDataAsset_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature::PlayerRewardDataAsset_0' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature, PlayerRewardButton) == 0x000008, "Member 'WI_PlayerRewardButton_C_OnPlayerRewardDataAssetSet__DelegateSignature::PlayerRewardButton' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PlayerRewardButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PlayerRewardButton_C_PreConstruct");
static_assert(sizeof(WI_PlayerRewardButton_C_PreConstruct) == 0x000001, "Wrong size on WI_PlayerRewardButton_C_PreConstruct");
static_assert(offsetof(WI_PlayerRewardButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PlayerRewardButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetButtonDiameter
// 0x0010 (0x0010 - 0x0000)
struct WI_PlayerRewardButton_C_SetButtonDiameter final
{
public:
	double                                        Diameter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetButtonDiameter) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetButtonDiameter");
static_assert(sizeof(WI_PlayerRewardButton_C_SetButtonDiameter) == 0x000010, "Wrong size on WI_PlayerRewardButton_C_SetButtonDiameter");
static_assert(offsetof(WI_PlayerRewardButton_C_SetButtonDiameter, Diameter) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetButtonDiameter::Diameter' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetButtonDiameter, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000008, "Member 'WI_PlayerRewardButton_C_SetButtonDiameter::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetButtonDiameter, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00000C, "Member 'WI_PlayerRewardButton_C_SetButtonDiameter::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetIcon
// 0x0028 (0x0028 - 0x0000)
struct WI_PlayerRewardButton_C_SetIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetIcon) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetIcon");
static_assert(sizeof(WI_PlayerRewardButton_C_SetIcon) == 0x000028, "Wrong size on WI_PlayerRewardButton_C_SetIcon");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIcon, SoftTexture) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetIcon::SoftTexture' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetIsActive
// 0x0020 (0x0020 - 0x0000)
struct WI_PlayerRewardButton_C_SetIsActive final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PlayerRewardPreviewChangedMessage   K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetIsActive) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetIsActive");
static_assert(sizeof(WI_PlayerRewardButton_C_SetIsActive) == 0x000020, "Wrong size on WI_PlayerRewardButton_C_SetIsActive");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsActive, IsActive_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetIsActive::IsActive_0' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsActive, K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage) == 0x000004, "Member 'WI_PlayerRewardButton_C_SetIsActive::K2Node_MakeStruct_S_PlayerRewardPreviewChangedMessage' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsActive, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WI_PlayerRewardButton_C_SetIsActive::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsActive, CallFunc_BooleanXOR_ReturnValue) == 0x000018, "Member 'WI_PlayerRewardButton_C_SetIsActive::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetIsEquipped
// 0x0020 (0x0020 - 0x0000)
struct WI_PlayerRewardButton_C_SetIsEquipped final
{
public:
	bool                                          IsEquipped_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetIsEquipped) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetIsEquipped");
static_assert(sizeof(WI_PlayerRewardButton_C_SetIsEquipped) == 0x000020, "Wrong size on WI_PlayerRewardButton_C_SetIsEquipped");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsEquipped, IsEquipped_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetIsEquipped::IsEquipped_0' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsEquipped, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_PlayerRewardButton_C_SetIsEquipped::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsEquipped, CallFunc_BooleanXOR_ReturnValue) == 0x000010, "Member 'WI_PlayerRewardButton_C_SetIsEquipped::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsEquipped, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WI_PlayerRewardButton_C_SetIsEquipped::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetIsPurchasable
// 0x0002 (0x0002 - 0x0000)
struct WI_PlayerRewardButton_C_SetIsPurchasable final
{
public:
	bool                                          IsPurchasable_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetIsPurchasable) == 0x000001, "Wrong alignment on WI_PlayerRewardButton_C_SetIsPurchasable");
static_assert(sizeof(WI_PlayerRewardButton_C_SetIsPurchasable) == 0x000002, "Wrong size on WI_PlayerRewardButton_C_SetIsPurchasable");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsPurchasable, IsPurchasable_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetIsPurchasable::IsPurchasable_0' has a wrong offset!");
static_assert(offsetof(WI_PlayerRewardButton_C_SetIsPurchasable, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WI_PlayerRewardButton_C_SetIsPurchasable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetName
// 0x0010 (0x0010 - 0x0000)
struct WI_PlayerRewardButton_C_SetName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetName) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetName");
static_assert(sizeof(WI_PlayerRewardButton_C_SetName) == 0x000010, "Wrong size on WI_PlayerRewardButton_C_SetName");
static_assert(offsetof(WI_PlayerRewardButton_C_SetName, Name_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetName::Name_0' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetPlayerRewardDataAsset
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_SetPlayerRewardDataAsset final
{
public:
	class UPlayerRewardDataAsset*                 PlayerRewardDataAsset_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetPlayerRewardDataAsset) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetPlayerRewardDataAsset");
static_assert(sizeof(WI_PlayerRewardButton_C_SetPlayerRewardDataAsset) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_SetPlayerRewardDataAsset");
static_assert(offsetof(WI_PlayerRewardButton_C_SetPlayerRewardDataAsset, PlayerRewardDataAsset_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetPlayerRewardDataAsset::PlayerRewardDataAsset_0' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetPlayerRewardDataAssetID
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID final
{
public:
	struct FGameplayTag                           PlayerRewardDataAssetID_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID) == 0x000004, "Wrong alignment on WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID");
static_assert(sizeof(WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID");
static_assert(offsetof(WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID, PlayerRewardDataAssetID_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetPlayerRewardDataAssetID::PlayerRewardDataAssetID_0' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetRarity
// 0x0008 (0x0008 - 0x0000)
struct WI_PlayerRewardButton_C_SetRarity final
{
public:
	class URarity*                                Rarity;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetRarity) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetRarity");
static_assert(sizeof(WI_PlayerRewardButton_C_SetRarity) == 0x000008, "Wrong size on WI_PlayerRewardButton_C_SetRarity");
static_assert(offsetof(WI_PlayerRewardButton_C_SetRarity, Rarity) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetRarity::Rarity' has a wrong offset!");

// Function WI_PlayerRewardButton.WI_PlayerRewardButton_C.SetStoreData
// 0x0048 (0x0048 - 0x0000)
struct WI_PlayerRewardButton_C_SetStoreData final
{
public:
	struct FOnlineStoreItemData                   OnlineStoreItemData_0;                             // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_PlayerRewardButton_C_SetStoreData) == 0x000008, "Wrong alignment on WI_PlayerRewardButton_C_SetStoreData");
static_assert(sizeof(WI_PlayerRewardButton_C_SetStoreData) == 0x000048, "Wrong size on WI_PlayerRewardButton_C_SetStoreData");
static_assert(offsetof(WI_PlayerRewardButton_C_SetStoreData, OnlineStoreItemData_0) == 0x000000, "Member 'WI_PlayerRewardButton_C_SetStoreData::OnlineStoreItemData_0' has a wrong offset!");

}

