#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayerRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PlayerRotator.WI_PlayerRotator_C
// 0x0018 (0x0448 - 0x0430)
class UWI_PlayerRotator_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_34;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NeighborPreviewSlot_C*              PreviewSlot;                                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_PlayerRotator(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PlayerRotator_C">();
	}
	static class UWI_PlayerRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PlayerRotator_C>();
	}
};
static_assert(alignof(UWI_PlayerRotator_C) == 0x000008, "Wrong alignment on UWI_PlayerRotator_C");
static_assert(sizeof(UWI_PlayerRotator_C) == 0x000448, "Wrong size on UWI_PlayerRotator_C");
static_assert(offsetof(UWI_PlayerRotator_C, UberGraphFrame) == 0x000430, "Member 'UWI_PlayerRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PlayerRotator_C, Image_34) == 0x000438, "Member 'UWI_PlayerRotator_C::Image_34' has a wrong offset!");
static_assert(offsetof(UWI_PlayerRotator_C, PreviewSlot) == 0x000440, "Member 'UWI_PlayerRotator_C::PreviewSlot' has a wrong offset!");

}

