#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_ServerList_Entry

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_PreLobby_ServerList_Entry.WI_PreLobby_ServerList_Entry_C.ApplyViewModel
// 0x0030 (0x0030 - 0x0000)
struct WI_PreLobby_ServerList_Entry_C_ApplyViewModel final
{
public:
	struct FPreLobbyServerBrowserEntryViewModel   InViewModel;                                       // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_PreLobby_ServerList_Entry_C_ApplyViewModel) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Entry_C_ApplyViewModel");
static_assert(sizeof(WI_PreLobby_ServerList_Entry_C_ApplyViewModel) == 0x000030, "Wrong size on WI_PreLobby_ServerList_Entry_C_ApplyViewModel");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ApplyViewModel, InViewModel) == 0x000000, "Member 'WI_PreLobby_ServerList_Entry_C_ApplyViewModel::InViewModel' has a wrong offset!");

// Function WI_PreLobby_ServerList_Entry.WI_PreLobby_ServerList_Entry_C.ExecuteUbergraph_WI_PreLobby_ServerList_Entry
// 0x0128 (0x0128 - 0x0000)
struct WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPreLobbyServerBrowserEntryViewModel   K2Node_Event_InViewModel;                          // 0x00F0(0x0030)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry");
static_assert(sizeof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry) == 0x000128, "Wrong size on WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, EntryPoint) == 0x000000, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, Temp_bool_Variable) == 0x000004, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, Temp_byte_Variable) == 0x000005, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000010, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C8, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, Temp_byte_Variable_1) == 0x0000E8, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, K2Node_Event_InViewModel) == 0x0000F0, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::K2Node_Event_InViewModel' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry, K2Node_Select_Default) == 0x000120, "Member 'WI_PreLobby_ServerList_Entry_C_ExecuteUbergraph_WI_PreLobby_ServerList_Entry::K2Node_Select_Default' has a wrong offset!");

// Function WI_PreLobby_ServerList_Entry.WI_PreLobby_ServerList_Entry_C.GetViewModel
// 0x0030 (0x0030 - 0x0000)
struct WI_PreLobby_ServerList_Entry_C_GetViewModel final
{
public:
	struct FPreLobbyServerBrowserEntryViewModel   ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WI_PreLobby_ServerList_Entry_C_GetViewModel) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList_Entry_C_GetViewModel");
static_assert(sizeof(WI_PreLobby_ServerList_Entry_C_GetViewModel) == 0x000030, "Wrong size on WI_PreLobby_ServerList_Entry_C_GetViewModel");
static_assert(offsetof(WI_PreLobby_ServerList_Entry_C_GetViewModel, ReturnValue) == 0x000000, "Member 'WI_PreLobby_ServerList_Entry_C_GetViewModel::ReturnValue' has a wrong offset!");

}

