#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PlayScreen_V2_MatchmakingVisualizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PlayScreen_V2_MatchmakingVisualizer.WI_PlayScreen_V2_MatchmakingVisualizer_C
// 0x0068 (0x0348 - 0x02E0)
class UWI_PlayScreen_V2_MatchmakingVisualizer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LeLoiRunning;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_RectangularButton_C*                CancelButton;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeLoi;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeLoiOverlay;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SearchingText;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 TranslatedString;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         DotCount;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DotsTimer;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SearchingOneShot;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateWidget();
	void BndEvt__WI_PlayScreen_V2_MatchmakingVisualizer_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void DeactivateWidget();
	void ExecuteUbergraph_WI_PlayScreen_V2_MatchmakingVisualizer(int32 EntryPoint);
	void On_Dots_Timer_Elapsed();
	void PreConstruct(bool IsDesignTime);
	void UpdateSearchingDots();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PlayScreen_V2_MatchmakingVisualizer_C">();
	}
	static class UWI_PlayScreen_V2_MatchmakingVisualizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PlayScreen_V2_MatchmakingVisualizer_C>();
	}
};
static_assert(alignof(UWI_PlayScreen_V2_MatchmakingVisualizer_C) == 0x000008, "Wrong alignment on UWI_PlayScreen_V2_MatchmakingVisualizer_C");
static_assert(sizeof(UWI_PlayScreen_V2_MatchmakingVisualizer_C) == 0x000348, "Wrong size on UWI_PlayScreen_V2_MatchmakingVisualizer_C");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, LeLoiRunning) == 0x0002E8, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::LeLoiRunning' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, Background) == 0x0002F0, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::Background' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, CancelButton) == 0x0002F8, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, LeLoi) == 0x000300, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::LeLoi' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, LeLoiOverlay) == 0x000308, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::LeLoiOverlay' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, SearchingText) == 0x000310, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::SearchingText' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, Shadow) == 0x000318, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, TranslatedString) == 0x000320, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::TranslatedString' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, DotCount) == 0x000330, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::DotCount' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, DotsTimer) == 0x000338, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::DotsTimer' has a wrong offset!");
static_assert(offsetof(UWI_PlayScreen_V2_MatchmakingVisualizer_C, SearchingOneShot) == 0x000340, "Member 'UWI_PlayScreen_V2_MatchmakingVisualizer_C::SearchingOneShot' has a wrong offset!");

}

