#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PreMainMenu.WI_PreMainMenu_C
// 0x0020 (0x0450 - 0x0430)
class UWI_PreMainMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        LoadingAudio;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void InpActEvt_IA_ASkipSplashScreen_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ExecuteUbergraph_WI_PreMainMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PreMainMenu_C">();
	}
	static class UWI_PreMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PreMainMenu_C>();
	}
};
static_assert(alignof(UWI_PreMainMenu_C) == 0x000008, "Wrong alignment on UWI_PreMainMenu_C");
static_assert(sizeof(UWI_PreMainMenu_C) == 0x000450, "Wrong size on UWI_PreMainMenu_C");
static_assert(offsetof(UWI_PreMainMenu_C, UberGraphFrame) == 0x000430, "Member 'UWI_PreMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PreMainMenu_C, Image_Background) == 0x000438, "Member 'UWI_PreMainMenu_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWI_PreMainMenu_C, WI_JPActionWidget) == 0x000440, "Member 'UWI_PreMainMenu_C::WI_JPActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_PreMainMenu_C, LoadingAudio) == 0x000448, "Member 'UWI_PreMainMenu_C::LoadingAudio' has a wrong offset!");

}

