#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PortraitFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_PortraitFrame.WI_PortraitFrame_C
// 0x0040 (0x0320 - 0x02E0)
class UWI_PortraitFrame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                FrameBackground;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              FrameBackgroundScaleBox;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             InsideBorderSlot;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             OutsideBorderSlot;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                FrameBackgroundPadding;                            // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        FrameBackgroundPaddingScale;                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_PortraitFrame(int32 EntryPoint);
	void GetScaledPadding(const struct FMargin& Padding_0, double Scale, struct FMargin* ScaledPadding);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_PortraitFrame_C">();
	}
	static class UWI_PortraitFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_PortraitFrame_C>();
	}
};
static_assert(alignof(UWI_PortraitFrame_C) == 0x000008, "Wrong alignment on UWI_PortraitFrame_C");
static_assert(sizeof(UWI_PortraitFrame_C) == 0x000320, "Wrong size on UWI_PortraitFrame_C");
static_assert(offsetof(UWI_PortraitFrame_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_PortraitFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, FrameBackground) == 0x0002E8, "Member 'UWI_PortraitFrame_C::FrameBackground' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, FrameBackgroundScaleBox) == 0x0002F0, "Member 'UWI_PortraitFrame_C::FrameBackgroundScaleBox' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, InsideBorderSlot) == 0x0002F8, "Member 'UWI_PortraitFrame_C::InsideBorderSlot' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, OutsideBorderSlot) == 0x000300, "Member 'UWI_PortraitFrame_C::OutsideBorderSlot' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, FrameBackgroundPadding) == 0x000308, "Member 'UWI_PortraitFrame_C::FrameBackgroundPadding' has a wrong offset!");
static_assert(offsetof(UWI_PortraitFrame_C, FrameBackgroundPaddingScale) == 0x000318, "Member 'UWI_PortraitFrame_C::FrameBackgroundPaddingScale' has a wrong offset!");

}

