#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PreLobby_ServerList2

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CommonGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.ApplyViewModel
// 0x0010 (0x0010 - 0x0000)
struct WI_PreLobby_ServerList2_C_ApplyViewModel final
{
public:
	struct FPreLobbyServerBrowserListViewModel    ViewModel;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_ApplyViewModel) == 0x000004, "Wrong alignment on WI_PreLobby_ServerList2_C_ApplyViewModel");
static_assert(sizeof(WI_PreLobby_ServerList2_C_ApplyViewModel) == 0x000010, "Wrong size on WI_PreLobby_ServerList2_C_ApplyViewModel");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ApplyViewModel, ViewModel) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_ApplyViewModel::ViewModel' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature final
{
public:
	class FString                                 Password;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature");
static_assert(sizeof(WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature) == 0x000010, "Wrong size on WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature");
static_assert(offsetof(WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature, Password) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_BndEvt__WI_PreLobby_ServerList2_WI_PreLobby_ServerList_Password_K2Node_ComponentBoundEvent_9_OnEnteredPassword__DelegateSignature::Password' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.CanJoinSession
// 0x0068 (0x0068 - 0x0000)
struct WI_PreLobby_ServerList2_C_CanJoinSession final
{
public:
	bool                                          Return_Value;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPreLobbyServerBrowserEntry*            CallFunc_GetSelectedEntry_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UOnlineServicesPartyMember*>     CallFunc_GetPartyMembers_ReturnValue;              // 0x0018(0x0010)(ReferenceParm)
	struct FPreLobbyServerBrowserEntryViewModel   CallFunc_GetViewModel_ReturnValue;                 // 0x0028(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_CanJoinSession) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList2_C_CanJoinSession");
static_assert(sizeof(WI_PreLobby_ServerList2_C_CanJoinSession) == 0x000068, "Wrong size on WI_PreLobby_ServerList2_C_CanJoinSession");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, Return_Value) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::Return_Value' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_GetSelectedEntry_ReturnValue) == 0x000010, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_GetSelectedEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_GetPartyMembers_ReturnValue) == 0x000018, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_GetViewModel_ReturnValue) == 0x000028, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_CanJoinSession, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'WI_PreLobby_ServerList2_C_CanJoinSession::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.ExecuteUbergraph_WI_PreLobby_ServerList2
// 0x0188 (0x0188 - 0x0000)
struct WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialGameInstanceSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalUserPartyLeader_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationYesNo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPreLobbyServerBrowserListViewModel    K2Node_Event_ViewModel;                            // 0x0038(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            K2Node_CustomEvent_SortMode;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_InArrow;                        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            K2Node_CustomEvent_InSortModeUp;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            K2Node_CustomEvent_InSortModeDown;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanJoinSession_Return_Value;              // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            K2Node_Select_Default_1;                           // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Password;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2");
static_assert(sizeof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2) == 0x000188, "Wrong size on WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, EntryPoint) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_bool_Variable) == 0x000004, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable) == 0x000005, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_1) == 0x000006, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_IsLocalUserPartyLeader_ReturnValue) == 0x000010, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_IsLocalUserPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_Result) == 0x000024, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_2) == 0x000025, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_ShowConfirmationYesNo_ReturnValue) == 0x000028, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_ShowConfirmationYesNo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_bool_Variable_1) == 0x000032, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_3) == 0x000033, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_4) == 0x000034, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_Event_ViewModel) == 0x000038, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000058, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000B0, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000100, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_MakeArray_Array) == 0x000108, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000128, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_5) == 0x00012C, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_byte_Variable_6) == 0x00012D, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, Temp_bool_Variable_2) == 0x00012E, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Add_IntInt_ReturnValue_2) == 0x000130, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Add_IntInt_ReturnValue_3) == 0x000134, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_SortMode) == 0x000138, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_SortMode' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_InArrow) == 0x000140, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_InArrow' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_InSortModeUp) == 0x000148, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_InSortModeUp' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_InSortModeDown) == 0x000149, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_InSortModeDown' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00014A, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00014B, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00014C, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_BooleanAND_ReturnValue) == 0x00014D, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Not_PreBool_ReturnValue) == 0x00014E, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_BooleanOR_ReturnValue) == 0x00014F, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000150, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000158, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_Select_Default) == 0x000160, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000161, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_CanJoinSession_Return_Value) == 0x000162, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_CanJoinSession_Return_Value' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_Select_Default_1) == 0x000163, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_IsChecked_ReturnValue) == 0x000164, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_Not_PreBool_ReturnValue_1) == 0x000165, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_Event_IsDesignTime) == 0x000166, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_CustomEvent_bIsVisible) == 0x000167, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_CustomEvent_bIsVisible' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_Select_Default_2) == 0x000168, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, K2Node_ComponentBoundEvent_Password) == 0x000170, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::K2Node_ComponentBoundEvent_Password' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000180, "Member 'WI_PreLobby_ServerList2_C_ExecuteUbergraph_WI_PreLobby_ServerList2::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.OnResult_767948A64987479EF628A0BE8EADF2FA
// 0x0001 (0x0001 - 0x0000)
struct WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA) == 0x000001, "Wrong alignment on WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA");
static_assert(sizeof(WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA) == 0x000001, "Wrong size on WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA");
static_assert(offsetof(WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA, Result) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_OnResult_767948A64987479EF628A0BE8EADF2FA::Result' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PreLobby_ServerList2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PreLobby_ServerList2_C_PreConstruct");
static_assert(sizeof(WI_PreLobby_ServerList2_C_PreConstruct) == 0x000001, "Wrong size on WI_PreLobby_ServerList2_C_PreConstruct");
static_assert(offsetof(WI_PreLobby_ServerList2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.TogglePasswordDialog
// 0x0001 (0x0001 - 0x0000)
struct WI_PreLobby_ServerList2_C_TogglePasswordDialog final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_TogglePasswordDialog) == 0x000001, "Wrong alignment on WI_PreLobby_ServerList2_C_TogglePasswordDialog");
static_assert(sizeof(WI_PreLobby_ServerList2_C_TogglePasswordDialog) == 0x000001, "Wrong size on WI_PreLobby_ServerList2_C_TogglePasswordDialog");
static_assert(offsetof(WI_PreLobby_ServerList2_C_TogglePasswordDialog, bIsVisible) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_TogglePasswordDialog::bIsVisible' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.UpdateSortArrow
// 0x0010 (0x0010 - 0x0000)
struct WI_PreLobby_ServerList2_C_UpdateSortArrow final
{
public:
	class UImage*                                 InArrow;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            InSortModeUp;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPreLobbyServerBrowserListSortMode            InSortModeDown;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_UpdateSortArrow) == 0x000008, "Wrong alignment on WI_PreLobby_ServerList2_C_UpdateSortArrow");
static_assert(sizeof(WI_PreLobby_ServerList2_C_UpdateSortArrow) == 0x000010, "Wrong size on WI_PreLobby_ServerList2_C_UpdateSortArrow");
static_assert(offsetof(WI_PreLobby_ServerList2_C_UpdateSortArrow, InArrow) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_UpdateSortArrow::InArrow' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_UpdateSortArrow, InSortModeUp) == 0x000008, "Member 'WI_PreLobby_ServerList2_C_UpdateSortArrow::InSortModeUp' has a wrong offset!");
static_assert(offsetof(WI_PreLobby_ServerList2_C_UpdateSortArrow, InSortModeDown) == 0x000009, "Member 'WI_PreLobby_ServerList2_C_UpdateSortArrow::InSortModeDown' has a wrong offset!");

// Function WI_PreLobby_ServerList2.WI_PreLobby_ServerList2_C.UpdateSortMode
// 0x0001 (0x0001 - 0x0000)
struct WI_PreLobby_ServerList2_C_UpdateSortMode final
{
public:
	EPreLobbyServerBrowserListSortMode            SortMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PreLobby_ServerList2_C_UpdateSortMode) == 0x000001, "Wrong alignment on WI_PreLobby_ServerList2_C_UpdateSortMode");
static_assert(sizeof(WI_PreLobby_ServerList2_C_UpdateSortMode) == 0x000001, "Wrong size on WI_PreLobby_ServerList2_C_UpdateSortMode");
static_assert(offsetof(WI_PreLobby_ServerList2_C_UpdateSortMode, SortMode) == 0x000000, "Member 'WI_PreLobby_ServerList2_C_UpdateSortMode::SortMode' has a wrong offset!");

}

