#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_PanelWithBlur

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_PanelWithBlur.WI_PanelWithBlur_C.ExecuteUbergraph_WI_PanelWithBlur
// 0x0008 (0x0008 - 0x0000)
struct WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur) == 0x000004, "Wrong alignment on WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur");
static_assert(sizeof(WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur) == 0x000008, "Wrong size on WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur");
static_assert(offsetof(WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur, EntryPoint) == 0x000000, "Member 'WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_PanelWithBlur_C_ExecuteUbergraph_WI_PanelWithBlur::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_PanelWithBlur.WI_PanelWithBlur_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_PanelWithBlur_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_PanelWithBlur_C_PreConstruct) == 0x000001, "Wrong alignment on WI_PanelWithBlur_C_PreConstruct");
static_assert(sizeof(WI_PanelWithBlur_C_PreConstruct) == 0x000001, "Wrong size on WI_PanelWithBlur_C_PreConstruct");
static_assert(offsetof(WI_PanelWithBlur_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_PanelWithBlur_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

