#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ResourceIncome

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_ResourceIncome.WI_ResourceIncome_C.ExecuteUbergraph_WI_ResourceIncome
// 0x0020 (0x0020 - 0x0000)
struct WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_NewAmount;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome) == 0x000008, "Wrong alignment on WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome");
static_assert(sizeof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome) == 0x000020, "Wrong size on WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome");
static_assert(offsetof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome, EntryPoint) == 0x000000, "Member 'WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome, K2Node_Event_NewAmount) == 0x000018, "Member 'WI_ResourceIncome_C_ExecuteUbergraph_WI_ResourceIncome::K2Node_Event_NewAmount' has a wrong offset!");

// Function WI_ResourceIncome.WI_ResourceIncome_C.OnHandlePayload
// 0x0028 (0x0028 - 0x0000)
struct WI_ResourceIncome_C_OnHandlePayload final
{
public:
	struct FResourcePayload                       NewPayload;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_ResourceIncome_C_OnHandlePayload) == 0x000008, "Wrong alignment on WI_ResourceIncome_C_OnHandlePayload");
static_assert(sizeof(WI_ResourceIncome_C_OnHandlePayload) == 0x000028, "Wrong size on WI_ResourceIncome_C_OnHandlePayload");
static_assert(offsetof(WI_ResourceIncome_C_OnHandlePayload, NewPayload) == 0x000000, "Member 'WI_ResourceIncome_C_OnHandlePayload::NewPayload' has a wrong offset!");

// Function WI_ResourceIncome.WI_ResourceIncome_C.PlayIncomeAnimation
// 0x0008 (0x0008 - 0x0000)
struct WI_ResourceIncome_C_PlayIncomeAnimation final
{
public:
	double                                        NewAmount;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ResourceIncome_C_PlayIncomeAnimation) == 0x000008, "Wrong alignment on WI_ResourceIncome_C_PlayIncomeAnimation");
static_assert(sizeof(WI_ResourceIncome_C_PlayIncomeAnimation) == 0x000008, "Wrong size on WI_ResourceIncome_C_PlayIncomeAnimation");
static_assert(offsetof(WI_ResourceIncome_C_PlayIncomeAnimation, NewAmount) == 0x000000, "Member 'WI_ResourceIncome_C_PlayIncomeAnimation::NewAmount' has a wrong offset!");

}

