#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_RewardPanel

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_RewardPanel.WI_RewardPanel_C.ExecuteUbergraph_WI_RewardPanel
// 0x0070 (0x0070 - 0x0000)
struct WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_RewardTag;                      // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlayerRewardDataAsset>  CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPlayerRewardDataAsset_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerRewardDataAsset*                 K2Node_DynamicCast_AsPlayer_Reward_Data_Asset;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel) == 0x000008, "Wrong alignment on WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel");
static_assert(sizeof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel) == 0x000070, "Wrong size on WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, EntryPoint) == 0x000000, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_CustomEvent_RewardTag) == 0x000014, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_CustomEvent_RewardTag' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset) == 0x000020, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, CallFunc_TryGetPlayerRewardDataAsset_ReturnValue) == 0x000048, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::CallFunc_TryGetPlayerRewardDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000049, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, Temp_object_Variable) == 0x000050, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_CustomEvent_Loaded) == 0x000058, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_DynamicCast_AsPlayer_Reward_Data_Asset) == 0x000060, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_DynamicCast_AsPlayer_Reward_Data_Asset' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WI_RewardPanel_C_ExecuteUbergraph_WI_RewardPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.OnLoaded_0924CF2148AD91913EDDF99B86D059F3
// 0x0008 (0x0008 - 0x0000)
struct WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3) == 0x000008, "Wrong alignment on WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3");
static_assert(sizeof(WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3) == 0x000008, "Wrong size on WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3");
static_assert(offsetof(WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3, Loaded) == 0x000000, "Member 'WI_RewardPanel_C_OnLoaded_0924CF2148AD91913EDDF99B86D059F3::Loaded' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_RewardPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WI_RewardPanel_C_PreConstruct");
static_assert(sizeof(WI_RewardPanel_C_PreConstruct) == 0x000001, "Wrong size on WI_RewardPanel_C_PreConstruct");
static_assert(offsetof(WI_RewardPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_RewardPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.ReadFromLoadedRewardAsset
// 0x0220 (0x0220 - 0x0000)
struct WI_RewardPanel_C_ReadFromLoadedRewardAsset final
{
public:
	struct FGameplayTag                           RewardTag_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	const class UPlayerRewardDataAsset*           RewardAsset;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   TempRewardType;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPerkDefinition>         CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPerkDefinition_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPerkDefinition*                        K2Node_DynamicCast_AsPerk_Definition;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIcon_ReturnValue;                      // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0090(0x0010)()
	class FText                                   CallFunc_GetPerkName_ReturnValue;                  // 0x00A0(0x0010)()
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_3;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_4;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1; // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_5;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0180(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_6;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0010)()
	bool                                          CallFunc_MatchesTag_ReturnValue_7;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_8;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_9;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_ReadFromLoadedRewardAsset) == 0x000008, "Wrong alignment on WI_RewardPanel_C_ReadFromLoadedRewardAsset");
static_assert(sizeof(WI_RewardPanel_C_ReadFromLoadedRewardAsset) == 0x000220, "Wrong size on WI_RewardPanel_C_ReadFromLoadedRewardAsset");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, RewardTag_0) == 0x000000, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::RewardTag_0' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, RewardAsset) == 0x000008, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::RewardAsset' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, TempRewardType) == 0x000010, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::TempRewardType' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition) == 0x000020, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_TryGetPerkDefinition_OutSoftPerkDefinition' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_TryGetPerkDefinition_ReturnValue) == 0x000048, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_TryGetPerkDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000050, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_DynamicCast_AsPerk_Definition) == 0x000058, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_DynamicCast_AsPerk_Definition' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_GetIcon_ReturnValue) == 0x000068, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_GetDescription_ReturnValue) == 0x000090, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_GetPerkName_ReturnValue) == 0x0000A0, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_GetPerkName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x0000B0, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue) == 0x0000C0, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_1) == 0x000120, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_MakeArray_Array) == 0x000128, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_2) == 0x000148, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_3) == 0x000160, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_4) == 0x000161, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1) == 0x000168, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_GetDebugStringFromGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_5) == 0x000178, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000180, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_6) == 0x0001D8, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Format_ReturnValue_1) == 0x0001F0, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_7) == 0x000200, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000208, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_8) == 0x000218, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_ReadFromLoadedRewardAsset, CallFunc_MatchesTag_ReturnValue_9) == 0x000219, "Member 'WI_RewardPanel_C_ReadFromLoadedRewardAsset::CallFunc_MatchesTag_ReturnValue_9' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.ReadFromRewardTagAsync
// 0x0008 (0x0008 - 0x0000)
struct WI_RewardPanel_C_ReadFromRewardTagAsync final
{
public:
	struct FGameplayTag                           RewardTag_0;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_ReadFromRewardTagAsync) == 0x000004, "Wrong alignment on WI_RewardPanel_C_ReadFromRewardTagAsync");
static_assert(sizeof(WI_RewardPanel_C_ReadFromRewardTagAsync) == 0x000008, "Wrong size on WI_RewardPanel_C_ReadFromRewardTagAsync");
static_assert(offsetof(WI_RewardPanel_C_ReadFromRewardTagAsync, RewardTag_0) == 0x000000, "Member 'WI_RewardPanel_C_ReadFromRewardTagAsync::RewardTag_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetDescriptionBody
// 0x0010 (0x0010 - 0x0000)
struct WI_RewardPanel_C_SetDescriptionBody final
{
public:
	class FText                                   DescriptionBody_0;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RewardPanel_C_SetDescriptionBody) == 0x000008, "Wrong alignment on WI_RewardPanel_C_SetDescriptionBody");
static_assert(sizeof(WI_RewardPanel_C_SetDescriptionBody) == 0x000010, "Wrong size on WI_RewardPanel_C_SetDescriptionBody");
static_assert(offsetof(WI_RewardPanel_C_SetDescriptionBody, DescriptionBody_0) == 0x000000, "Member 'WI_RewardPanel_C_SetDescriptionBody::DescriptionBody_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetDescriptionHeader
// 0x0010 (0x0010 - 0x0000)
struct WI_RewardPanel_C_SetDescriptionHeader final
{
public:
	class FText                                   DescriptionHeader_0;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RewardPanel_C_SetDescriptionHeader) == 0x000008, "Wrong alignment on WI_RewardPanel_C_SetDescriptionHeader");
static_assert(sizeof(WI_RewardPanel_C_SetDescriptionHeader) == 0x000010, "Wrong size on WI_RewardPanel_C_SetDescriptionHeader");
static_assert(offsetof(WI_RewardPanel_C_SetDescriptionHeader, DescriptionHeader_0) == 0x000000, "Member 'WI_RewardPanel_C_SetDescriptionHeader::DescriptionHeader_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetPanelTitle
// 0x0010 (0x0010 - 0x0000)
struct WI_RewardPanel_C_SetPanelTitle final
{
public:
	class FText                                   PanelTitle_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RewardPanel_C_SetPanelTitle) == 0x000008, "Wrong alignment on WI_RewardPanel_C_SetPanelTitle");
static_assert(sizeof(WI_RewardPanel_C_SetPanelTitle) == 0x000010, "Wrong size on WI_RewardPanel_C_SetPanelTitle");
static_assert(offsetof(WI_RewardPanel_C_SetPanelTitle, PanelTitle_0) == 0x000000, "Member 'WI_RewardPanel_C_SetPanelTitle::PanelTitle_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetRewardName
// 0x0010 (0x0010 - 0x0000)
struct WI_RewardPanel_C_SetRewardName final
{
public:
	class FText                                   RewardName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RewardPanel_C_SetRewardName) == 0x000008, "Wrong alignment on WI_RewardPanel_C_SetRewardName");
static_assert(sizeof(WI_RewardPanel_C_SetRewardName) == 0x000010, "Wrong size on WI_RewardPanel_C_SetRewardName");
static_assert(offsetof(WI_RewardPanel_C_SetRewardName, RewardName_0) == 0x000000, "Member 'WI_RewardPanel_C_SetRewardName::RewardName_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetRewardTag
// 0x0008 (0x0008 - 0x0000)
struct WI_RewardPanel_C_SetRewardTag final
{
public:
	struct FGameplayTag                           RewardTag_0;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_SetRewardTag) == 0x000004, "Wrong alignment on WI_RewardPanel_C_SetRewardTag");
static_assert(sizeof(WI_RewardPanel_C_SetRewardTag) == 0x000008, "Wrong size on WI_RewardPanel_C_SetRewardTag");
static_assert(offsetof(WI_RewardPanel_C_SetRewardTag, RewardTag_0) == 0x000000, "Member 'WI_RewardPanel_C_SetRewardTag::RewardTag_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetRewardType
// 0x0010 (0x0010 - 0x0000)
struct WI_RewardPanel_C_SetRewardType final
{
public:
	class FText                                   RewardType_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_RewardPanel_C_SetRewardType) == 0x000008, "Wrong alignment on WI_RewardPanel_C_SetRewardType");
static_assert(sizeof(WI_RewardPanel_C_SetRewardType) == 0x000010, "Wrong size on WI_RewardPanel_C_SetRewardType");
static_assert(offsetof(WI_RewardPanel_C_SetRewardType, RewardType_0) == 0x000000, "Member 'WI_RewardPanel_C_SetRewardType::RewardType_0' has a wrong offset!");

// Function WI_RewardPanel.WI_RewardPanel_C.SetShowDescription
// 0x0005 (0x0005 - 0x0000)
struct WI_RewardPanel_C_SetShowDescription final
{
public:
	bool                                          ShowDescription_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_RewardPanel_C_SetShowDescription) == 0x000001, "Wrong alignment on WI_RewardPanel_C_SetShowDescription");
static_assert(sizeof(WI_RewardPanel_C_SetShowDescription) == 0x000005, "Wrong size on WI_RewardPanel_C_SetShowDescription");
static_assert(offsetof(WI_RewardPanel_C_SetShowDescription, ShowDescription_0) == 0x000000, "Member 'WI_RewardPanel_C_SetShowDescription::ShowDescription_0' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_SetShowDescription, Temp_bool_Variable) == 0x000001, "Member 'WI_RewardPanel_C_SetShowDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_SetShowDescription, Temp_byte_Variable) == 0x000002, "Member 'WI_RewardPanel_C_SetShowDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_SetShowDescription, Temp_byte_Variable_1) == 0x000003, "Member 'WI_RewardPanel_C_SetShowDescription::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_RewardPanel_C_SetShowDescription, K2Node_Select_Default) == 0x000004, "Member 'WI_RewardPanel_C_SetShowDescription::K2Node_Select_Default' has a wrong offset!");

}

