#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopUpgradeButtonV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopUpgradeButtonV2.WI_ShopUpgradeButtonV2_C
// 0x0040 (0x0320 - 0x02E0)
class UWI_ShopUpgradeButtonV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ButtonUpgrade;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageCrateIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPrice;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextUpgrade;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPActionWidget_C*                   WI_JPActionWidget;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             On_Clicked;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WI_ShopUpgradeButtonV2_ButtonUpgrade_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WI_ShopUpgradeButtonV2(int32 EntryPoint);
	void On_Clicked__DelegateSignature(class UWI_ShopUpgradeButtonV2_C* ShopUpgradeButton);
	void Set_Can_Purchase(bool Enable);
	void Set_Price_text(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopUpgradeButtonV2_C">();
	}
	static class UWI_ShopUpgradeButtonV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopUpgradeButtonV2_C>();
	}
};
static_assert(alignof(UWI_ShopUpgradeButtonV2_C) == 0x000008, "Wrong alignment on UWI_ShopUpgradeButtonV2_C");
static_assert(sizeof(UWI_ShopUpgradeButtonV2_C) == 0x000320, "Wrong size on UWI_ShopUpgradeButtonV2_C");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopUpgradeButtonV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, ButtonUpgrade) == 0x0002E8, "Member 'UWI_ShopUpgradeButtonV2_C::ButtonUpgrade' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, ImageCrateIcon) == 0x0002F0, "Member 'UWI_ShopUpgradeButtonV2_C::ImageCrateIcon' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, TextPrice) == 0x0002F8, "Member 'UWI_ShopUpgradeButtonV2_C::TextPrice' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, TextUpgrade) == 0x000300, "Member 'UWI_ShopUpgradeButtonV2_C::TextUpgrade' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, WI_JPActionWidget) == 0x000308, "Member 'UWI_ShopUpgradeButtonV2_C::WI_JPActionWidget' has a wrong offset!");
static_assert(offsetof(UWI_ShopUpgradeButtonV2_C, On_Clicked) == 0x000310, "Member 'UWI_ShopUpgradeButtonV2_C::On_Clicked' has a wrong offset!");

}

