#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonScreen_V2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_Message_TabOpened_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_SeasonScreen_V2.WI_SeasonScreen_V2_C.ButtonHovered_Event
// 0x0008 (0x0008 - 0x0000)
struct WI_SeasonScreen_V2_C_ButtonHovered_Event final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonScreen_V2_C_ButtonHovered_Event) == 0x000008, "Wrong alignment on WI_SeasonScreen_V2_C_ButtonHovered_Event");
static_assert(sizeof(WI_SeasonScreen_V2_C_ButtonHovered_Event) == 0x000008, "Wrong size on WI_SeasonScreen_V2_C_ButtonHovered_Event");
static_assert(offsetof(WI_SeasonScreen_V2_C_ButtonHovered_Event, Widget) == 0x000000, "Member 'WI_SeasonScreen_V2_C_ButtonHovered_Event::Widget' has a wrong offset!");

// Function WI_SeasonScreen_V2.WI_SeasonScreen_V2_C.ExecuteUbergraph_WI_SeasonScreen_V2
// 0x00D8 (0x00D8 - 0x0000)
struct WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Message_TabOpened                   Temp_struct_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SeasonPassTierWidget_Full_V2_WithButton_C* K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full_V2_with_Button; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2) == 0x000008, "Wrong alignment on WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2");
static_assert(sizeof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2) == 0x0000D8, "Wrong size on WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, EntryPoint) == 0x000000, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_struct_Variable) == 0x000004, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CustomEvent_ProxyObject) == 0x000010, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CustomEvent_ActualChannel) == 0x000018, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_struct_Variable_1) == 0x000030, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_struct_Variable_2) == 0x000038, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_object_Variable) == 0x000040, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_GetPayload_ReturnValue) == 0x000049, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000050, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000084, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_int_Array_Index_Variable) == 0x000094, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_CustomEvent_Widget) == 0x0000A0, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_GetAllChildren_ReturnValue) == 0x0000A8, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full_V2_with_Button) == 0x0000C0, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full_V2_with_Button' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'WI_SeasonScreen_V2_C_ExecuteUbergraph_WI_SeasonScreen_V2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_SeasonScreen_V2.WI_SeasonScreen_V2_C.OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5
// 0x0010 (0x0010 - 0x0000)
struct WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5) == 0x000008, "Wrong alignment on WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5");
static_assert(sizeof(WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5) == 0x000010, "Wrong size on WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5");
static_assert(offsetof(WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5, ProxyObject) == 0x000000, "Member 'WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5::ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5, ActualChannel) == 0x000008, "Member 'WI_SeasonScreen_V2_C_OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5::ActualChannel' has a wrong offset!");

// Function WI_SeasonScreen_V2.WI_SeasonScreen_V2_C.PlayAnim
// 0x0030 (0x0030 - 0x0000)
struct WI_SeasonScreen_V2_C_PlayAnim final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SeasonPassTierWidget_Full_C*        K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonScreen_V2_C_PlayAnim) == 0x000008, "Wrong alignment on WI_SeasonScreen_V2_C_PlayAnim");
static_assert(sizeof(WI_SeasonScreen_V2_C_PlayAnim) == 0x000030, "Wrong size on WI_SeasonScreen_V2_C_PlayAnim");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, Temp_int_Variable) == 0x000000, "Member 'WI_SeasonScreen_V2_C_PlayAnim::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WI_SeasonScreen_V2_C_PlayAnim::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WI_SeasonScreen_V2_C_PlayAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WI_SeasonScreen_V2_C_PlayAnim::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full) == 0x000018, "Member 'WI_SeasonScreen_V2_C_PlayAnim::K2Node_DynamicCast_AsWI_Season_Pass_Tier_Widget_Full' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WI_SeasonScreen_V2_C_PlayAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, CallFunc_GetChildrenCount_ReturnValue) == 0x000024, "Member 'WI_SeasonScreen_V2_C_PlayAnim::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PlayAnim, CallFunc_Less_IntInt_ReturnValue_1) == 0x000028, "Member 'WI_SeasonScreen_V2_C_PlayAnim::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WI_SeasonScreen_V2.WI_SeasonScreen_V2_C.PopulateRewardInfoWidget
// 0x0058 (0x0058 - 0x0000)
struct WI_SeasonScreen_V2_C_PopulateRewardInfoWidget final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_SeasonPassRewardWidget_Single_C*    K2Node_DynamicCast_AsWI_Season_Pass_Reward_Widget_Single; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SeasonPassReward_CatalogItem_Default_C* K2Node_DynamicCast_AsWI_Season_Pass_Reward_Catalog_Item_Default; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_SeasonPassRewardContent_NeighborSkin_C* K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor_Skin; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_SeasonPassRewardContent_Neighbor_C* K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget) == 0x000008, "Wrong alignment on WI_SeasonScreen_V2_C_PopulateRewardInfoWidget");
static_assert(sizeof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget) == 0x000058, "Wrong size on WI_SeasonScreen_V2_C_PopulateRewardInfoWidget");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, Object) == 0x000000, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::Object' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_AsWI_Season_Pass_Reward_Widget_Single) == 0x000008, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_AsWI_Season_Pass_Reward_Widget_Single' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_AsWI_Season_Pass_Reward_Catalog_Item_Default) == 0x000020, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_AsWI_Season_Pass_Reward_Catalog_Item_Default' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, CallFunc_GetChildAt_ReturnValue_1) == 0x000030, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor_Skin) == 0x000038, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor_Skin' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor) == 0x000048, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_AsWI_Season_Pass_Reward_Content_Neighbor' has a wrong offset!");
static_assert(offsetof(WI_SeasonScreen_V2_C_PopulateRewardInfoWidget, K2Node_DynamicCast_bSuccess_3) == 0x000050, "Member 'WI_SeasonScreen_V2_C_PopulateRewardInfoWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

