#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemPropertyDetailsV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopItemPropertyDetailsV2.WI_ShopItemPropertyDetailsV2_C
// 0x0038 (0x0318 - 0x02E0)
class UWI_ShopItemPropertyDetailsV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBoxStars;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackgroundBox;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlockDescription;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ActiveStarsAmount;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WI_ShopItemPropertyDetailsV2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_Widget(const class FText& Text_0, int32 ActiveStarsAmount_0);
	void UpdateActiveStarsAmount();
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopItemPropertyDetailsV2_C">();
	}
	static class UWI_ShopItemPropertyDetailsV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopItemPropertyDetailsV2_C>();
	}
};
static_assert(alignof(UWI_ShopItemPropertyDetailsV2_C) == 0x000008, "Wrong alignment on UWI_ShopItemPropertyDetailsV2_C");
static_assert(sizeof(UWI_ShopItemPropertyDetailsV2_C) == 0x000318, "Wrong size on UWI_ShopItemPropertyDetailsV2_C");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopItemPropertyDetailsV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, HorizontalBoxStars) == 0x0002E8, "Member 'UWI_ShopItemPropertyDetailsV2_C::HorizontalBoxStars' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, ImageBackgroundBox) == 0x0002F0, "Member 'UWI_ShopItemPropertyDetailsV2_C::ImageBackgroundBox' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, RichTextBlockDescription) == 0x0002F8, "Member 'UWI_ShopItemPropertyDetailsV2_C::RichTextBlockDescription' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, ActiveStarsAmount) == 0x000300, "Member 'UWI_ShopItemPropertyDetailsV2_C::ActiveStarsAmount' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemPropertyDetailsV2_C, Text) == 0x000308, "Member 'UWI_ShopItemPropertyDetailsV2_C::Text' has a wrong offset!");

}

