#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SocialList.WI_SocialList_C
// 0x0038 (0x0360 - 0x0328)
class UWI_SocialList_C final : public USocialListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               ContentPanel;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SocialListHeader_C*                 ListHeader;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FillHeight;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SmallHeight;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHeaderClick;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BlueprintApplyListStateNoAnimation(const ESocialListState InListState);
	void BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_SocialList(int32 EntryPoint);
	void OnHeaderClick__DelegateSignature();
	void SetHeader(const class FString& StringToAppend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SocialList_C">();
	}
	static class UWI_SocialList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SocialList_C>();
	}
};
static_assert(alignof(UWI_SocialList_C) == 0x000008, "Wrong alignment on UWI_SocialList_C");
static_assert(sizeof(UWI_SocialList_C) == 0x000360, "Wrong size on UWI_SocialList_C");
static_assert(offsetof(UWI_SocialList_C, UberGraphFrame) == 0x000328, "Member 'UWI_SocialList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SocialList_C, ContentPanel) == 0x000330, "Member 'UWI_SocialList_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UWI_SocialList_C, ListHeader) == 0x000338, "Member 'UWI_SocialList_C::ListHeader' has a wrong offset!");
static_assert(offsetof(UWI_SocialList_C, FillHeight) == 0x000340, "Member 'UWI_SocialList_C::FillHeight' has a wrong offset!");
static_assert(offsetof(UWI_SocialList_C, SmallHeight) == 0x000348, "Member 'UWI_SocialList_C::SmallHeight' has a wrong offset!");
static_assert(offsetof(UWI_SocialList_C, OnHeaderClick) == 0x000350, "Member 'UWI_SocialList_C::OnHeaderClick' has a wrong offset!");

}

