#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SpawnItemsDropdownField

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_SpawnItemsDropdownField.WI_SpawnItemsDropdownField_C.GetOptions
// 0x0068 (0x0068 - 0x0000)
struct WI_SpawnItemsDropdownField_C_GetOptions final
{
public:
	TArray<class FString>                         Options;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         ReturnOptions;                                     // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SpawnItemsDropdownField_C_GetOptions) == 0x000008, "Wrong alignment on WI_SpawnItemsDropdownField_C_GetOptions");
static_assert(sizeof(WI_SpawnItemsDropdownField_C_GetOptions) == 0x000068, "Wrong size on WI_SpawnItemsDropdownField_C_GetOptions");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, Options) == 0x000000, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::Options' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, ReturnOptions) == 0x000010, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::ReturnOptions' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Array_Get_Item) == 0x000040, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Conv_NameToString_ReturnValue) == 0x000048, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SpawnItemsDropdownField_C_GetOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WI_SpawnItemsDropdownField_C_GetOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

