#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialFriendEntry

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_SocialFriendEntry.WI_SocialFriendEntry_C.ExecuteUbergraph_WI_SocialFriendEntry
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry) == 0x000004, "Wrong alignment on WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry");
static_assert(sizeof(WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry) == 0x000008, "Wrong size on WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry");
static_assert(offsetof(WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry, EntryPoint) == 0x000000, "Member 'WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_SocialFriendEntry_C_ExecuteUbergraph_WI_SocialFriendEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WI_SocialFriendEntry.WI_SocialFriendEntry_C.GetLocalizedStatusInfo
// 0x0048 (0x0048 - 0x0000)
struct WI_SocialFriendEntry_C_GetLocalizedStatusInfo final
{
public:
	EOnlineServicesFriendStatus                   Status;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StatusText;                                        // 0x0008(0x0010)(Parm, OutParm)
	struct FLinearColor                           Color;                                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetStatusText_StatusText;                 // 0x0028(0x0010)()
	struct FLinearColor                           CallFunc_GetStatusTextColor_TextColor;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo) == 0x000008, "Wrong alignment on WI_SocialFriendEntry_C_GetLocalizedStatusInfo");
static_assert(sizeof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo) == 0x000048, "Wrong size on WI_SocialFriendEntry_C_GetLocalizedStatusInfo");
static_assert(offsetof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo, Status) == 0x000000, "Member 'WI_SocialFriendEntry_C_GetLocalizedStatusInfo::Status' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo, StatusText) == 0x000008, "Member 'WI_SocialFriendEntry_C_GetLocalizedStatusInfo::StatusText' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo, Color) == 0x000018, "Member 'WI_SocialFriendEntry_C_GetLocalizedStatusInfo::Color' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo, CallFunc_GetStatusText_StatusText) == 0x000028, "Member 'WI_SocialFriendEntry_C_GetLocalizedStatusInfo::CallFunc_GetStatusText_StatusText' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetLocalizedStatusInfo, CallFunc_GetStatusTextColor_TextColor) == 0x000038, "Member 'WI_SocialFriendEntry_C_GetLocalizedStatusInfo::CallFunc_GetStatusTextColor_TextColor' has a wrong offset!");

// Function WI_SocialFriendEntry.WI_SocialFriendEntry_C.GetStatusText
// 0x0020 (0x0020 - 0x0000)
struct WI_SocialFriendEntry_C_GetStatusText final
{
public:
	EOnlineServicesFriendStatus                   Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StatusText;                                        // 0x0008(0x0010)(Parm, OutParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendEntry_C_GetStatusText) == 0x000008, "Wrong alignment on WI_SocialFriendEntry_C_GetStatusText");
static_assert(sizeof(WI_SocialFriendEntry_C_GetStatusText) == 0x000020, "Wrong size on WI_SocialFriendEntry_C_GetStatusText");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusText, Status) == 0x000000, "Member 'WI_SocialFriendEntry_C_GetStatusText::Status' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusText, StatusText) == 0x000008, "Member 'WI_SocialFriendEntry_C_GetStatusText::StatusText' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusText, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WI_SocialFriendEntry_C_GetStatusText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WI_SocialFriendEntry.WI_SocialFriendEntry_C.GetStatusTextColor
// 0x0018 (0x0018 - 0x0000)
struct WI_SocialFriendEntry_C_GetStatusTextColor final
{
public:
	EOnlineServicesFriendStatus                   Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TextColor;                                         // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendEntry_C_GetStatusTextColor) == 0x000004, "Wrong alignment on WI_SocialFriendEntry_C_GetStatusTextColor");
static_assert(sizeof(WI_SocialFriendEntry_C_GetStatusTextColor) == 0x000018, "Wrong size on WI_SocialFriendEntry_C_GetStatusTextColor");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusTextColor, Status) == 0x000000, "Member 'WI_SocialFriendEntry_C_GetStatusTextColor::Status' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusTextColor, TextColor) == 0x000004, "Member 'WI_SocialFriendEntry_C_GetStatusTextColor::TextColor' has a wrong offset!");
static_assert(offsetof(WI_SocialFriendEntry_C_GetStatusTextColor, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WI_SocialFriendEntry_C_GetStatusTextColor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WI_SocialFriendEntry.WI_SocialFriendEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_SocialFriendEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WI_SocialFriendEntry_C_PreConstruct");
static_assert(sizeof(WI_SocialFriendEntry_C_PreConstruct) == 0x000001, "Wrong size on WI_SocialFriendEntry_C_PreConstruct");
static_assert(offsetof(WI_SocialFriendEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_SocialFriendEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

