#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopTierV2

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopTierV2.WI_ShopTierV2_C.AddShopItemToWrapBox
// 0x00A0 (0x00A0 - 0x0000)
struct WI_ShopTierV2_C_AddShopItemToWrapBox final
{
public:
	struct FShopItemViewModel                     ItemDataViewmodel;                                 // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWI_ShopTierV2_C*                       AssociatedTier;                                    // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  ShopItem;                                          // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_AddShopItemToWrapBox) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_AddShopItemToWrapBox");
static_assert(sizeof(WI_ShopTierV2_C_AddShopItemToWrapBox) == 0x0000A0, "Wrong size on WI_ShopTierV2_C_AddShopItemToWrapBox");
static_assert(offsetof(WI_ShopTierV2_C_AddShopItemToWrapBox, ItemDataViewmodel) == 0x000000, "Member 'WI_ShopTierV2_C_AddShopItemToWrapBox::ItemDataViewmodel' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_AddShopItemToWrapBox, AssociatedTier) == 0x000080, "Member 'WI_ShopTierV2_C_AddShopItemToWrapBox::AssociatedTier' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_AddShopItemToWrapBox, ShopItem) == 0x000088, "Member 'WI_ShopTierV2_C_AddShopItemToWrapBox::ShopItem' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_AddShopItemToWrapBox, CallFunc_Create_ReturnValue) == 0x000090, "Member 'WI_ShopTierV2_C_AddShopItemToWrapBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_AddShopItemToWrapBox, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000098, "Member 'WI_ShopTierV2_C_AddShopItemToWrapBox::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature final
{
public:
	class UWI_ShopUpgradeButtonV2_C*              ShopUpgradeButton;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature");
static_assert(sizeof(WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature) == 0x000008, "Wrong size on WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature");
static_assert(offsetof(WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature, ShopUpgradeButton) == 0x000000, "Member 'WI_ShopTierV2_C_BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature::ShopUpgradeButton' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.ExecuteUbergraph_WI_ShopTierV2
// 0x00E8 (0x00E8 - 0x0000)
struct WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FShopViewModel& ShopViewModel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryV2_C*                  CallFunc_AddShopItemToWrapBox_ShopItem;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShopViewModel                         K2Node_CustomEvent_ShopViewModel;                  // 0x0038(0x0028)()
	class UWI_ShopUpgradeButtonV2_C*              K2Node_ComponentBoundEvent_ShopUpgradeButton;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_NewLevel;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0010)()
};
static_assert(alignof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2");
static_assert(sizeof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2) == 0x0000E8, "Wrong size on WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, EntryPoint) == 0x000000, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, Temp_int_Variable) == 0x000018, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00001C, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_AddShopItemToWrapBox_ShopItem) == 0x000028, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_AddShopItemToWrapBox_ShopItem' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000030, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_CustomEvent_ShopViewModel) == 0x000038, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_CustomEvent_ShopViewModel' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_ComponentBoundEvent_ShopUpgradeButton) == 0x000060, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_ComponentBoundEvent_ShopUpgradeButton' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_CustomEvent_NewLevel) == 0x000068, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000078, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WI_ShopTierV2_C_ExecuteUbergraph_WI_ShopTierV2::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.GetRoomManagerOfClass
// 0x0048 (0x0048 - 0x0000)
struct WI_ShopTierV2_C_GetRoomManagerOfClass final
{
public:
	class UClass*                                 RoomManagerToFind;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_RoomManager_C*>              RoomManagers;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ABP_RoomManager_C*                      RoomManager;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RoomManager_C*                      CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_GetRoomManagerOfClass) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_GetRoomManagerOfClass");
static_assert(sizeof(WI_ShopTierV2_C_GetRoomManagerOfClass) == 0x000048, "Wrong size on WI_ShopTierV2_C_GetRoomManagerOfClass");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, RoomManagerToFind) == 0x000000, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::RoomManagerToFind' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, RoomManagers) == 0x000008, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::RoomManagers' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, RoomManager) == 0x000018, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::RoomManager' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000041, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_GetRoomManagerOfClass, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WI_ShopTierV2_C_GetRoomManagerOfClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.InitializeUpgradingCosmetics
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopTierV2_C_InitializeUpgradingCosmetics final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_InitializeUpgradingCosmetics) == 0x000004, "Wrong alignment on WI_ShopTierV2_C_InitializeUpgradingCosmetics");
static_assert(sizeof(WI_ShopTierV2_C_InitializeUpgradingCosmetics) == 0x000008, "Wrong size on WI_ShopTierV2_C_InitializeUpgradingCosmetics");
static_assert(offsetof(WI_ShopTierV2_C_InitializeUpgradingCosmetics, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WI_ShopTierV2_C_InitializeUpgradingCosmetics::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_InitializeUpgradingCosmetics, CallFunc_Conv_IntToByte_ReturnValue) == 0x000004, "Member 'WI_ShopTierV2_C_InitializeUpgradingCosmetics::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_InitializeUpgradingCosmetics, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WI_ShopTierV2_C_InitializeUpgradingCosmetics::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.On_Shop Changed
// 0x0028 (0x0028 - 0x0000)
struct WI_ShopTierV2_C_On_Shop_Changed final
{
public:
	struct FShopViewModel                         ShopViewModel;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_ShopTierV2_C_On_Shop_Changed) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_On_Shop_Changed");
static_assert(sizeof(WI_ShopTierV2_C_On_Shop_Changed) == 0x000028, "Wrong size on WI_ShopTierV2_C_On_Shop_Changed");
static_assert(offsetof(WI_ShopTierV2_C_On_Shop_Changed, ShopViewModel) == 0x000000, "Member 'WI_ShopTierV2_C_On_Shop_Changed::ShopViewModel' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.On_UpgradeButtonClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature final
{
public:
	class UWI_ShopUpgradeButtonV2_C*              ShopUpgradeButton;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopTierV2_C*                       ShopTier_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature");
static_assert(sizeof(WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature) == 0x000010, "Wrong size on WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature");
static_assert(offsetof(WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature, ShopUpgradeButton) == 0x000000, "Member 'WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature::ShopUpgradeButton' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature, ShopTier_0) == 0x000008, "Member 'WI_ShopTierV2_C_On_UpgradeButtonClicked__DelegateSignature::ShopTier_0' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopTierV2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ShopTierV2_C_PreConstruct");
static_assert(sizeof(WI_ShopTierV2_C_PreConstruct) == 0x000001, "Wrong size on WI_ShopTierV2_C_PreConstruct");
static_assert(offsetof(WI_ShopTierV2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ShopTierV2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetPrice
// 0x0050 (0x0050 - 0x0000)
struct WI_ShopTierV2_C_SetPrice final
{
public:
	uint8                                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomyDefinition*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomyDefinition*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomyDefinition*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResourceData                          CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0038(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetPrice) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_SetPrice");
static_assert(sizeof(WI_ShopTierV2_C_SetPrice) == 0x000050, "Wrong size on WI_ShopTierV2_C_SetPrice");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, Temp_byte_Variable) == 0x000000, "Member 'WI_ShopTierV2_C_SetPrice::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, Temp_object_Variable) == 0x000008, "Member 'WI_ShopTierV2_C_SetPrice::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, Temp_object_Variable_1) == 0x000010, "Member 'WI_ShopTierV2_C_SetPrice::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_Greater_ByteByte_ReturnValue) == 0x000019, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, K2Node_Select_Default) == 0x000020, "Member 'WI_ShopTierV2_C_SetPrice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000038, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetPrice, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000048, "Member 'WI_ShopTierV2_C_SetPrice::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetRoomManagerForTier
// 0x00D0 (0x00D0 - 0x0000)
struct WI_ShopTierV2_C_SetRoomManagerForTier final
{
public:
	TArray<class ABP_RoomManager_C*>              L_RoomManagersForTeam;                             // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	uint8                                         L_PlayerTeamID;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(uint8 NewLevel)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             Temp_byte_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RoomManager_C*                      CallFunc_GetRoomManagerOfClass_RoomManager;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARoomManager*                           CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RoomManager_C*                      K2Node_DynamicCast_AsBP_Room_Manager;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGroundsKeeper*                         CallFunc_GetGroundsKeeper_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITeamableInterface>    K2Node_DynamicCast_AsTeamable_Interface;           // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue_1;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetRoomManagerForTier) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_SetRoomManagerForTier");
static_assert(sizeof(WI_ShopTierV2_C_SetRoomManagerForTier) == 0x0000D0, "Wrong size on WI_ShopTierV2_C_SetRoomManagerForTier");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, L_RoomManagersForTeam) == 0x000000, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::L_RoomManagersForTeam' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, L_PlayerTeamID) == 0x000010, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::L_PlayerTeamID' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_class_Variable) == 0x000018, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_class_Variable_1) == 0x000020, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_class_Variable_2) == 0x000028, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_byte_Variable) == 0x000030, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_class_Variable_3) == 0x000060, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, Temp_byte_Variable_1) == 0x000068, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_Select_Default) == 0x000070, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000078, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetRoomManagerOfClass_RoomManager) == 0x000080, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetRoomManagerOfClass_RoomManager' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_Array_Get_Item) == 0x000088, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_DynamicCast_AsBP_Room_Manager) == 0x000098, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_DynamicCast_AsBP_Room_Manager' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A8, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetGroundsKeeper_ReturnValue) == 0x0000B0, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetGroundsKeeper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_DynamicCast_AsTeamable_Interface) == 0x0000B8, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_DynamicCast_AsTeamable_Interface' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetTeamID_ReturnValue) == 0x0000C9, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_GetTeamID_ReturnValue_1) == 0x0000CA, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetRoomManagerForTier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000CB, "Member 'WI_ShopTierV2_C_SetRoomManagerForTier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetTierAvilablility
// 0x0030 (0x0030 - 0x0000)
struct WI_ShopTierV2_C_SetTierAvilablility final
{
public:
	struct FShopViewModel                         Shop_View_Model;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetTierAvilablility) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_SetTierAvilablility");
static_assert(sizeof(WI_ShopTierV2_C_SetTierAvilablility) == 0x000030, "Wrong size on WI_ShopTierV2_C_SetTierAvilablility");
static_assert(offsetof(WI_ShopTierV2_C_SetTierAvilablility, Shop_View_Model) == 0x000000, "Member 'WI_ShopTierV2_C_SetTierAvilablility::Shop_View_Model' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetTierAvilablility, CallFunc_Less_ByteByte_ReturnValue) == 0x000028, "Member 'WI_ShopTierV2_C_SetTierAvilablility::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetTierLocked
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopTierV2_C_SetTierLocked final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetTierLocked) == 0x000001, "Wrong alignment on WI_ShopTierV2_C_SetTierLocked");
static_assert(sizeof(WI_ShopTierV2_C_SetTierLocked) == 0x000001, "Wrong size on WI_ShopTierV2_C_SetTierLocked");
static_assert(offsetof(WI_ShopTierV2_C_SetTierLocked, Locked) == 0x000000, "Member 'WI_ShopTierV2_C_SetTierLocked::Locked' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetUpgradeAvailability
// 0x0060 (0x0060 - 0x0000)
struct WI_ShopTierV2_C_SetUpgradeAvailability final
{
public:
	struct FShopViewModel                         ShopVievModel;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             Temp_byte_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomyDefinition*                     CallFunc_GetNextLevelEconomyCost_EconomyCost;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAfford_ReturnValue;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetUpgradeAvailability) == 0x000008, "Wrong alignment on WI_ShopTierV2_C_SetUpgradeAvailability");
static_assert(sizeof(WI_ShopTierV2_C_SetUpgradeAvailability) == 0x000060, "Wrong size on WI_ShopTierV2_C_SetUpgradeAvailability");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, ShopVievModel) == 0x000000, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::ShopVievModel' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_byte_Variable) == 0x000028, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_byte_Variable_1) == 0x000029, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_byte_Variable_2) == 0x00002A, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_bool_Variable) == 0x00002B, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_byte_Variable_3) == 0x00002C, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_byte_Variable_4) == 0x00002D, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_Array_Contains_ReturnValue) == 0x00002E, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002F, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, Temp_bool_Variable_1) == 0x000030, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_GetNextLevelEconomyCost_EconomyCost) == 0x000038, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_GetNextLevelEconomyCost_EconomyCost' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, K2Node_Select_Default) == 0x000049, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_Add_ByteByte_ReturnValue) == 0x000058, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_CanAfford_ReturnValue) == 0x000059, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_CanAfford_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005A, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, K2Node_Select_Default_1) == 0x00005B, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, CallFunc_Greater_ByteByte_ReturnValue) == 0x00005C, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradeAvailability, K2Node_Select_Default_2) == 0x00005D, "Member 'WI_ShopTierV2_C_SetUpgradeAvailability::K2Node_Select_Default_2' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.SetUpgradingCosmetics
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopTierV2_C_SetUpgradingCosmetics final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_SetUpgradingCosmetics) == 0x000001, "Wrong alignment on WI_ShopTierV2_C_SetUpgradingCosmetics");
static_assert(sizeof(WI_ShopTierV2_C_SetUpgradingCosmetics) == 0x000001, "Wrong size on WI_ShopTierV2_C_SetUpgradingCosmetics");
static_assert(offsetof(WI_ShopTierV2_C_SetUpgradingCosmetics, Enable) == 0x000000, "Member 'WI_ShopTierV2_C_SetUpgradingCosmetics::Enable' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.Shop Upgrade Started
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopTierV2_C_Shop_Upgrade_Started final
{
public:
	uint8                                         NewLevel;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_Shop_Upgrade_Started) == 0x000001, "Wrong alignment on WI_ShopTierV2_C_Shop_Upgrade_Started");
static_assert(sizeof(WI_ShopTierV2_C_Shop_Upgrade_Started) == 0x000001, "Wrong size on WI_ShopTierV2_C_Shop_Upgrade_Started");
static_assert(offsetof(WI_ShopTierV2_C_Shop_Upgrade_Started, NewLevel) == 0x000000, "Member 'WI_ShopTierV2_C_Shop_Upgrade_Started::NewLevel' has a wrong offset!");

// Function WI_ShopTierV2.WI_ShopTierV2_C.ShowUpgradeButton
// 0x0005 (0x0005 - 0x0000)
struct WI_ShopTierV2_C_ShowUpgradeButton final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopTierV2_C_ShowUpgradeButton) == 0x000001, "Wrong alignment on WI_ShopTierV2_C_ShowUpgradeButton");
static_assert(sizeof(WI_ShopTierV2_C_ShowUpgradeButton) == 0x000005, "Wrong size on WI_ShopTierV2_C_ShowUpgradeButton");
static_assert(offsetof(WI_ShopTierV2_C_ShowUpgradeButton, Show) == 0x000000, "Member 'WI_ShopTierV2_C_ShowUpgradeButton::Show' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ShowUpgradeButton, Temp_bool_Variable) == 0x000001, "Member 'WI_ShopTierV2_C_ShowUpgradeButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopTierV2_C_ShowUpgradeButton, Temp_byte_Variable) == 0x000002, "Member 'WI_ShopTierV2_C_ShowUpgradeButton::Temp_byte_Variable' has a wrong offset!");
