#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialListHeader

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_SocialListHeader.WI_SocialListHeader_C.ExecuteUbergraph_WI_SocialListHeader
// 0x0004 (0x0004 - 0x0000)
struct WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader) == 0x000004, "Wrong alignment on WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader");
static_assert(sizeof(WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader) == 0x000004, "Wrong size on WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader");
static_assert(offsetof(WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader, EntryPoint) == 0x000000, "Member 'WI_SocialListHeader_C_ExecuteUbergraph_WI_SocialListHeader::EntryPoint' has a wrong offset!");

// Function WI_SocialListHeader.WI_SocialListHeader_C.SetHeader
// 0x0010 (0x0010 - 0x0000)
struct WI_SocialListHeader_C_SetHeader final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_SocialListHeader_C_SetHeader) == 0x000008, "Wrong alignment on WI_SocialListHeader_C_SetHeader");
static_assert(sizeof(WI_SocialListHeader_C_SetHeader) == 0x000010, "Wrong size on WI_SocialListHeader_C_SetHeader");
static_assert(offsetof(WI_SocialListHeader_C_SetHeader, Header) == 0x000000, "Member 'WI_SocialListHeader_C_SetHeader::Header' has a wrong offset!");

}

