#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopDropItemEntry

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopDropItemEntry.WI_ShopDropItemEntry_C
// 0x0070 (0x0350 - 0x02E0)
class UWI_ShopDropItemEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CircleButtonHoverEffectMinus512x512_C* WI_CircleButtonHoverEffectMinus512x512;            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FItemWheelInfo                         ItemInfo;                                          // 0x0308(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UItemInstance*                          ItemInstance;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnItemHovered;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnItemClicked;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WI_ShopDropItemEntry(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnClicked();
	void OnHovered();
	void OnItemClicked__DelegateSignature(class UItemInstance* ItemInstance_0);
	void OnItemHovered__DelegateSignature(class UItemInstance* ItemInstance_0);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopDropItemEntry_C">();
	}
	static class UWI_ShopDropItemEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopDropItemEntry_C>();
	}
};
static_assert(alignof(UWI_ShopDropItemEntry_C) == 0x000008, "Wrong alignment on UWI_ShopDropItemEntry_C");
static_assert(sizeof(UWI_ShopDropItemEntry_C) == 0x000350, "Wrong size on UWI_ShopDropItemEntry_C");
static_assert(offsetof(UWI_ShopDropItemEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopDropItemEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, Button) == 0x0002E8, "Member 'UWI_ShopDropItemEntry_C::Button' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, Image_66) == 0x0002F0, "Member 'UWI_ShopDropItemEntry_C::Image_66' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, Overlay) == 0x0002F8, "Member 'UWI_ShopDropItemEntry_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, WI_CircleButtonHoverEffectMinus512x512) == 0x000300, "Member 'UWI_ShopDropItemEntry_C::WI_CircleButtonHoverEffectMinus512x512' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, ItemInfo) == 0x000308, "Member 'UWI_ShopDropItemEntry_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, ItemInstance) == 0x000328, "Member 'UWI_ShopDropItemEntry_C::ItemInstance' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, OnItemHovered) == 0x000330, "Member 'UWI_ShopDropItemEntry_C::OnItemHovered' has a wrong offset!");
static_assert(offsetof(UWI_ShopDropItemEntry_C, OnItemClicked) == 0x000340, "Member 'UWI_ShopDropItemEntry_C::OnItemClicked' has a wrong offset!");

}

