#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopTierV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopTierV2.WI_ShopTierV2_C
// 0x00B0 (0x0398 - 0x02E8)
class UWI_ShopTierV2_C final : public UShopWidgetTier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UpgradeComplete;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageBokke;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResourceCrate;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTitleBackground;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTitleBackground_1;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageUpgradingBackground_1;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageUpgradingBackgroundPanning;                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayUpgrading;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBoxLocked;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTitle;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ShopUpgradeButtonV2_C*              WI_ShopUpgradeButtonV2;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherUpgradeButton;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBoxItems;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0358(0x0010)(Edit, BlueprintVisible)
	bool                                          PreviewTierLocked;                                 // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             On_UpgradeButtonClicked;                           // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PreviewShowUpgradeButton;                          // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RoomManager_C*                      AssociatedRoomManager;                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TierLocked;                                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddShopItemToWrapBox(const struct FShopItemViewModel& ItemDataViewmodel, class UWI_ShopTierV2_C* AssociatedTier, class UWI_ShopItemEntryV2_C** ShopItem);
	void BndEvt__WI_ShopTierV2_WI_ShopUpgradeButtonV2_K2Node_ComponentBoundEvent_0_On_Clicked__DelegateSignature(class UWI_ShopUpgradeButtonV2_C* ShopUpgradeButton);
	void Construct();
	void ExecuteUbergraph_WI_ShopTierV2(int32 EntryPoint);
	void GetRoomManagerOfClass(class UClass* RoomManagerToFind, TArray<class ABP_RoomManager_C*>& RoomManagers, class ABP_RoomManager_C** RoomManager);
	void InitializeUpgradingCosmetics();
	void On_Shop_Changed(const struct FShopViewModel& ShopViewModel);
	void On_UpgradeButtonClicked__DelegateSignature(class UWI_ShopUpgradeButtonV2_C* ShopUpgradeButton, class UWI_ShopTierV2_C* ShopTier_0);
	void PreConstruct(bool IsDesignTime);
	void SetPrice();
	void SetRoomManagerForTier();
	void SetTierAvilablility(const struct FShopViewModel& Shop_View_Model);
	void SetTierLocked(bool Locked);
	void SetUpgradeAvailability(const struct FShopViewModel& ShopVievModel);
	void SetUpgradingCosmetics(bool Enable);
	void Shop_Upgrade_Complete();
	void Shop_Upgrade_Started(uint8 NewLevel);
	void ShowUpgradeButton(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopTierV2_C">();
	}
	static class UWI_ShopTierV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopTierV2_C>();
	}
};
static_assert(alignof(UWI_ShopTierV2_C) == 0x000008, "Wrong alignment on UWI_ShopTierV2_C");
static_assert(sizeof(UWI_ShopTierV2_C) == 0x000398, "Wrong size on UWI_ShopTierV2_C");
static_assert(offsetof(UWI_ShopTierV2_C, UberGraphFrame) == 0x0002E8, "Member 'UWI_ShopTierV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, UpgradeComplete) == 0x0002F0, "Member 'UWI_ShopTierV2_C::UpgradeComplete' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageBokke) == 0x0002F8, "Member 'UWI_ShopTierV2_C::ImageBokke' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageResourceCrate) == 0x000300, "Member 'UWI_ShopTierV2_C::ImageResourceCrate' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageTitleBackground) == 0x000308, "Member 'UWI_ShopTierV2_C::ImageTitleBackground' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageTitleBackground_1) == 0x000310, "Member 'UWI_ShopTierV2_C::ImageTitleBackground_1' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageUpgradingBackground_1) == 0x000318, "Member 'UWI_ShopTierV2_C::ImageUpgradingBackground_1' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, ImageUpgradingBackgroundPanning) == 0x000320, "Member 'UWI_ShopTierV2_C::ImageUpgradingBackgroundPanning' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, OverlayUpgrading) == 0x000328, "Member 'UWI_ShopTierV2_C::OverlayUpgrading' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, RetainerBoxLocked) == 0x000330, "Member 'UWI_ShopTierV2_C::RetainerBoxLocked' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, TextTitle) == 0x000338, "Member 'UWI_ShopTierV2_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, WI_ShopUpgradeButtonV2) == 0x000340, "Member 'UWI_ShopTierV2_C::WI_ShopUpgradeButtonV2' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, WidgetSwitcherUpgradeButton) == 0x000348, "Member 'UWI_ShopTierV2_C::WidgetSwitcherUpgradeButton' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, WrapBoxItems) == 0x000350, "Member 'UWI_ShopTierV2_C::WrapBoxItems' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, Title) == 0x000358, "Member 'UWI_ShopTierV2_C::Title' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, PreviewTierLocked) == 0x000368, "Member 'UWI_ShopTierV2_C::PreviewTierLocked' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, On_UpgradeButtonClicked) == 0x000370, "Member 'UWI_ShopTierV2_C::On_UpgradeButtonClicked' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, PreviewShowUpgradeButton) == 0x000380, "Member 'UWI_ShopTierV2_C::PreviewShowUpgradeButton' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, AssociatedRoomManager) == 0x000388, "Member 'UWI_ShopTierV2_C::AssociatedRoomManager' has a wrong offset!");
static_assert(offsetof(UWI_ShopTierV2_C, TierLocked) == 0x000390, "Member 'UWI_ShopTierV2_C::TierLocked' has a wrong offset!");

}

