#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemEntry_Radial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "S_ShopItem_structs.hpp"
#include "UMG_classes.hpp"
#include "E_ShopType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C
// 0x08E0 (0x0BC0 - 0x02E0)
class UWI_ShopItemEntry_Radial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Highlight;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Purchase;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_1;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Item;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Resource;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Price;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PriceAmount;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Quantity;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_QuantityAmount;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ResourceAmount;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_RoomReq;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_RoomReqLevel;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Build;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_ShopItem                            ShopItem;                                          // 0x0358(0x0020)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PurchaseButtonClicked;                             // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class Abp_groundskeeper_C*                    GroundsKeeper;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_ShopType                                    ShopType;                                          // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CheatUnlocked;                                     // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentlyEnabled;                                  // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393[0x5];                                      // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EnabledChanged;                                    // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           EnabledStyle;                                      // 0x03B0(0x03F0)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FButtonStyle                           DisabledStyle;                                     // 0x07A0(0x03F0)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRoomData                              RoomData;                                          // 0x0B90(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             UpgradeButtonClicked;                              // 0x0BA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AreAllRequirementsMet(bool* Return);
	void BndEvt__WI_ShopItemEntry_Radial_Button_527_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WI_ShopItemEntry_Radial_Button_527_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WI_ShopItemEntry_Radial_Button_527_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void CalculateUpgradeCost(class UItemTiersDefinition* ItemTiersDefinition, const struct FRoomData& RoomData_0, class UItemInstance** FoundItemInstance);
	void Cheat_Set_Unlocked(bool Unlocked);
	void Construct();
	void Destruct();
	void EnabledChanged__DelegateSignature();
	void ExecuteUbergraph_WI_ShopItemEntry_Radial(int32 EntryPoint);
	bool Get_Button_Purchase_B_Is_Enabled();
	struct FLinearColor Get_Image_BG_ColorAndOpacity_0();
	struct FSlateColor Get_Text_RoomReqLevel_ColorAndOpacity_0();
	struct FSlateColor Get_TextBlock_Build_ColorAndOpacity();
	void GetCurrentItemTierIndex(const struct FRoomData& RoomData_0, const TArray<struct FItemTier>& ItemTiers, int32* ItemTierIndex);
	void Has_Item_in_Inventory(class UItemTiersDefinition* ItemToFind, bool* Has_Item);
	void HasItem(TSoftObjectPtr<class UItemDefinition> Definition, bool* Return);
	void HasItemSameTier(class UItemTiersDefinition* ItemTiersDefinition, bool* Has_Same_Tier_Item);
	void InitShopItem();
	void Is_Upgrade_Requirements_Met(bool* CanUpgradeItem);
	void IsPurchaseRequirementMet(class AGroundsKeeper* GroundsKeeper_0, bool* Return);
	void On_Purchase_Pressed();
	void OnEnded_9CFB812C4401FD1CE51BAF89D38B9608();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnHighlight();
	void OnInitialized();
	void OnMessageReceived_659EB55349D8295CBA2CC59D3B2F461F(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_C972C65640C9D1AF76CDE98BF1299225(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnUnhighlight();
	void PurchaseButtonClicked__DelegateSignature(const struct FS_ShopItem& ShopItem_0, bool CheatUnlocked_0);
	void Set_Cheat_Unlocked();
	void Set_Purchasable(bool Enable);
	void Update_Text_Display_Color(class UTextBlock* Text_WIdget, EResourceType Type, const struct FLinearColor& Can_Afford, const struct FLinearColor& Can_Not_Afford);
	void UpgradeButtonClicked__DelegateSignature(const struct FS_ShopItem& Shop_Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopItemEntry_Radial_C">();
	}
	static class UWI_ShopItemEntry_Radial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopItemEntry_Radial_C>();
	}
};
static_assert(alignof(UWI_ShopItemEntry_Radial_C) == 0x000010, "Wrong alignment on UWI_ShopItemEntry_Radial_C");
static_assert(sizeof(UWI_ShopItemEntry_Radial_C) == 0x000BC0, "Wrong size on UWI_ShopItemEntry_Radial_C");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopItemEntry_Radial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Border_Highlight) == 0x0002E8, "Member 'UWI_ShopItemEntry_Radial_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Button_Purchase) == 0x0002F0, "Member 'UWI_ShopItemEntry_Radial_C::Button_Purchase' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Image_BG_1) == 0x0002F8, "Member 'UWI_ShopItemEntry_Radial_C::Image_BG_1' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Image_Item) == 0x000300, "Member 'UWI_ShopItemEntry_Radial_C::Image_Item' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Image_Resource) == 0x000308, "Member 'UWI_ShopItemEntry_Radial_C::Image_Resource' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_Name) == 0x000310, "Member 'UWI_ShopItemEntry_Radial_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_Price) == 0x000318, "Member 'UWI_ShopItemEntry_Radial_C::Text_Price' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_PriceAmount) == 0x000320, "Member 'UWI_ShopItemEntry_Radial_C::Text_PriceAmount' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_Quantity) == 0x000328, "Member 'UWI_ShopItemEntry_Radial_C::Text_Quantity' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_QuantityAmount) == 0x000330, "Member 'UWI_ShopItemEntry_Radial_C::Text_QuantityAmount' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_ResourceAmount) == 0x000338, "Member 'UWI_ShopItemEntry_Radial_C::Text_ResourceAmount' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_RoomReq) == 0x000340, "Member 'UWI_ShopItemEntry_Radial_C::Text_RoomReq' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, Text_RoomReqLevel) == 0x000348, "Member 'UWI_ShopItemEntry_Radial_C::Text_RoomReqLevel' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, TextBlock_Build) == 0x000350, "Member 'UWI_ShopItemEntry_Radial_C::TextBlock_Build' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, ShopItem) == 0x000358, "Member 'UWI_ShopItemEntry_Radial_C::ShopItem' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, PurchaseButtonClicked) == 0x000378, "Member 'UWI_ShopItemEntry_Radial_C::PurchaseButtonClicked' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, GroundsKeeper) == 0x000388, "Member 'UWI_ShopItemEntry_Radial_C::GroundsKeeper' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, ShopType) == 0x000390, "Member 'UWI_ShopItemEntry_Radial_C::ShopType' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, CheatUnlocked) == 0x000391, "Member 'UWI_ShopItemEntry_Radial_C::CheatUnlocked' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, CurrentlyEnabled) == 0x000392, "Member 'UWI_ShopItemEntry_Radial_C::CurrentlyEnabled' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, EnabledChanged) == 0x000398, "Member 'UWI_ShopItemEntry_Radial_C::EnabledChanged' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, EnabledStyle) == 0x0003B0, "Member 'UWI_ShopItemEntry_Radial_C::EnabledStyle' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, DisabledStyle) == 0x0007A0, "Member 'UWI_ShopItemEntry_Radial_C::DisabledStyle' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, RoomData) == 0x000B90, "Member 'UWI_ShopItemEntry_Radial_C::RoomData' has a wrong offset!");
static_assert(offsetof(UWI_ShopItemEntry_Radial_C, UpgradeButtonClicked) == 0x000BA8, "Member 'UWI_ShopItemEntry_Radial_C::UpgradeButtonClicked' has a wrong offset!");

}

