#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonScreen_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WI_BaseScreen_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SeasonScreen_V2.WI_SeasonScreen_V2_C
// 0x0028 (0x0458 - 0x0430)
class UWI_SeasonScreen_V2_C final : public UWI_BaseScreen_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_MoreRewardInfo_C*                   WI_MoreRewardInfo;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_WelcomePassFull_C*                  WI_WelcomePassFull;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           InitBounceTimerHandle;                             // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimCount;                                         // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimSelectedItem();
	void ButtonHovered_Event(class UWidget* Widget);
	void ButtonUnhovered_Event_0();
	void Construct();
	void ExecuteUbergraph_WI_SeasonScreen_V2(int32 EntryPoint);
	void OnMessageReceived_33D05DE7433DFF80C44950BB743C55C5(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void PlayAnim();
	void PopulateRewardInfoWidget(class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SeasonScreen_V2_C">();
	}
	static class UWI_SeasonScreen_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SeasonScreen_V2_C>();
	}
};
static_assert(alignof(UWI_SeasonScreen_V2_C) == 0x000008, "Wrong alignment on UWI_SeasonScreen_V2_C");
static_assert(sizeof(UWI_SeasonScreen_V2_C) == 0x000458, "Wrong size on UWI_SeasonScreen_V2_C");
static_assert(offsetof(UWI_SeasonScreen_V2_C, UberGraphFrame) == 0x000430, "Member 'UWI_SeasonScreen_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonScreen_V2_C, WI_MoreRewardInfo) == 0x000438, "Member 'UWI_SeasonScreen_V2_C::WI_MoreRewardInfo' has a wrong offset!");
static_assert(offsetof(UWI_SeasonScreen_V2_C, WI_WelcomePassFull) == 0x000440, "Member 'UWI_SeasonScreen_V2_C::WI_WelcomePassFull' has a wrong offset!");
static_assert(offsetof(UWI_SeasonScreen_V2_C, InitBounceTimerHandle) == 0x000448, "Member 'UWI_SeasonScreen_V2_C::InitBounceTimerHandle' has a wrong offset!");
static_assert(offsetof(UWI_SeasonScreen_V2_C, AnimCount) == 0x000450, "Member 'UWI_SeasonScreen_V2_C::AnimCount' has a wrong offset!");

}

