#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Seagull130_Overlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.ExecuteUbergraph_WI_Seagull130_Overlay
// 0x00A8 (0x00A8 - 0x0000)
struct WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Amount)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Amount)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Amount_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Primary;                        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Amount;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWI_Chat_C*>                     CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWI_Chat_C*                             CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay");
static_assert(sizeof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay) == 0x0000A8, "Wrong size on WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, EntryPoint) == 0x000000, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, Temp_bool_Variable) == 0x000004, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CustomEvent_Amount_1) == 0x000048, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CustomEvent_Amount_1' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CustomEvent_Primary) == 0x00004C, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CustomEvent_Primary' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_Select_Default) == 0x000058, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, K2Node_CustomEvent_Amount) == 0x000060, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::K2Node_CustomEvent_Amount' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_SpawnSound2D_ReturnValue) == 0x000070, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_IsInViewport_ReturnValue) == 0x000079, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000080, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_Array_Get_Item) == 0x000098, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WI_Seagull130_Overlay_C_ExecuteUbergraph_WI_Seagull130_Overlay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.InitAbilityInfo
// 0x0068 (0x0068 - 0x0000)
struct WI_Seagull130_Overlay_C_InitAbilityInfo final
{
public:
	bool                                          CallFunc_IsOwningPlayerUsingGamepad_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0060)(HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_InitAbilityInfo) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_InitAbilityInfo");
static_assert(sizeof(WI_Seagull130_Overlay_C_InitAbilityInfo) == 0x000068, "Wrong size on WI_Seagull130_Overlay_C_InitAbilityInfo");
static_assert(offsetof(WI_Seagull130_Overlay_C_InitAbilityInfo, CallFunc_IsOwningPlayerUsingGamepad_ReturnValue) == 0x000000, "Member 'WI_Seagull130_Overlay_C_InitAbilityInfo::CallFunc_IsOwningPlayerUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_InitAbilityInfo, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'WI_Seagull130_Overlay_C_InitAbilityInfo::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.On_NewPrimaryAmmoSet_Event
// 0x0004 (0x0004 - 0x0000)
struct WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event) == 0x000004, "Wrong alignment on WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event");
static_assert(sizeof(WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event) == 0x000004, "Wrong size on WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event");
static_assert(offsetof(WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event, Amount) == 0x000000, "Member 'WI_Seagull130_Overlay_C_On_NewPrimaryAmmoSet_Event::Amount' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.On_NewSecondaryAmmoSet_Event
// 0x0004 (0x0004 - 0x0000)
struct WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event) == 0x000004, "Wrong alignment on WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event");
static_assert(sizeof(WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event) == 0x000004, "Wrong size on WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event");
static_assert(offsetof(WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event, Amount) == 0x000000, "Member 'WI_Seagull130_Overlay_C_On_NewSecondaryAmmoSet_Event::Amount' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.Set Fire Mode Cosmetics
// 0x0001 (0x0001 - 0x0000)
struct WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics final
{
public:
	bool                                          Primary;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics) == 0x000001, "Wrong alignment on WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics");
static_assert(sizeof(WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics) == 0x000001, "Wrong size on WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics");
static_assert(offsetof(WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics, Primary) == 0x000000, "Member 'WI_Seagull130_Overlay_C_Set_Fire_Mode_Cosmetics::Primary' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.SetPrimaryAmmoText
// 0x0018 (0x0018 - 0x0000)
struct WI_Seagull130_Overlay_C_SetPrimaryAmmoText final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WI_Seagull130_Overlay_C_SetPrimaryAmmoText) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_SetPrimaryAmmoText");
static_assert(sizeof(WI_Seagull130_Overlay_C_SetPrimaryAmmoText) == 0x000018, "Wrong size on WI_Seagull130_Overlay_C_SetPrimaryAmmoText");
static_assert(offsetof(WI_Seagull130_Overlay_C_SetPrimaryAmmoText, Value) == 0x000000, "Member 'WI_Seagull130_Overlay_C_SetPrimaryAmmoText::Value' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_SetPrimaryAmmoText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_Seagull130_Overlay_C_SetPrimaryAmmoText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.SetSecondaryAmmoText
// 0x0018 (0x0018 - 0x0000)
struct WI_Seagull130_Overlay_C_SetSecondaryAmmoText final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WI_Seagull130_Overlay_C_SetSecondaryAmmoText) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_SetSecondaryAmmoText");
static_assert(sizeof(WI_Seagull130_Overlay_C_SetSecondaryAmmoText) == 0x000018, "Wrong size on WI_Seagull130_Overlay_C_SetSecondaryAmmoText");
static_assert(offsetof(WI_Seagull130_Overlay_C_SetSecondaryAmmoText, Value) == 0x000000, "Member 'WI_Seagull130_Overlay_C_SetSecondaryAmmoText::Value' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_SetSecondaryAmmoText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_Seagull130_Overlay_C_SetSecondaryAmmoText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.Try Play Low Ammo Animation
// 0x0028 (0x0028 - 0x0000)
struct WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation final
{
public:
	int32                                         CurrentAmmo;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Threshold;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 Animation;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                WidgetObject;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation");
static_assert(sizeof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation) == 0x000028, "Wrong size on WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, CurrentAmmo) == 0x000000, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::CurrentAmmo' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, Threshold) == 0x000004, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::Threshold' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, Animation) == 0x000008, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::Animation' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, WidgetObject) == 0x000010, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::WidgetObject' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000019, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WI_Seagull130_Overlay_C_Try_Play_Low_Ammo_Animation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_Seagull130_Overlay.WI_Seagull130_Overlay_C.Update Lifetime Progressbar
// 0x0028 (0x0028 - 0x0000)
struct WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar) == 0x000008, "Wrong alignment on WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar");
static_assert(sizeof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar) == 0x000028, "Wrong size on WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000004, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_SafeDivide_ReturnValue) == 0x000008, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_SafeDivide_B_ImplicitCast) == 0x000010, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_SafeDivide_A_ImplicitCast) == 0x000018, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000020, "Member 'WI_Seagull130_Overlay_C_Update_Lifetime_Progressbar::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

