#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonPassTierWidget_Full_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SeasonPassTierWidget_Full_V2.WI_SeasonPassTierWidget_Full_V2_C
// 0x0088 (0x0390 - 0x0308)
class UWI_SeasonPassTierWidget_Full_V2_C final : public USeasonPassTierWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CheckmarkImage;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_260;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBorder;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBorder;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           TierProgressBar;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_LockedIcon_C*                       WI_LockedIcon;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_SeasonProgressionBarBreakpoint_C*   WI_SeasonProgressionBarBreakpoint;                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   RewardWidget;                                      // 0x0368(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void DoApplyViewModel(const struct FSeasonPassTierViewModel& ViewModel);
	void ExecuteUbergraph_WI_SeasonPassTierWidget_Full_V2(int32 EntryPoint);
	void K2_ApplyViewModel(const struct FSeasonPassTierViewModel& ViewModel);
	void SetUnlockedState(bool Unlocked);
	void UpdateReward();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SeasonPassTierWidget_Full_V2_C">();
	}
	static class UWI_SeasonPassTierWidget_Full_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SeasonPassTierWidget_Full_V2_C>();
	}
};
static_assert(alignof(UWI_SeasonPassTierWidget_Full_V2_C) == 0x000008, "Wrong alignment on UWI_SeasonPassTierWidget_Full_V2_C");
static_assert(sizeof(UWI_SeasonPassTierWidget_Full_V2_C) == 0x000390, "Wrong size on UWI_SeasonPassTierWidget_Full_V2_C");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, UberGraphFrame) == 0x000308, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, Border) == 0x000310, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::Border' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, CheckmarkImage) == 0x000318, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::CheckmarkImage' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, Image) == 0x000320, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::Image' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, Image_1) == 0x000328, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, Image_260) == 0x000330, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::Image_260' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, LeftBorder) == 0x000338, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::LeftBorder' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, NamedSlot) == 0x000340, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::NamedSlot' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, RightBorder) == 0x000348, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::RightBorder' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, TierProgressBar) == 0x000350, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::TierProgressBar' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, WI_LockedIcon) == 0x000358, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::WI_LockedIcon' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, WI_SeasonProgressionBarBreakpoint) == 0x000360, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::WI_SeasonProgressionBarBreakpoint' has a wrong offset!");
static_assert(offsetof(UWI_SeasonPassTierWidget_Full_V2_C, RewardWidget) == 0x000368, "Member 'UWI_SeasonPassTierWidget_Full_V2_C::RewardWidget' has a wrong offset!");

}

