#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialFriendEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SocialFriendEntry.WI_SocialFriendEntry_C
// 0x0010 (0x0338 - 0x0328)
class UWI_SocialFriendEntry_C final : public USocialFriendEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EOnlineServicesFriendStatus                   PreviewStatus;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewIsInviteSent;                               // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_SocialFriendEntry(int32 EntryPoint);
	void GetLocalizedStatusInfo(const EOnlineServicesFriendStatus Status, class FText* StatusText, struct FLinearColor* Color);
	void GetStatusText(EOnlineServicesFriendStatus Status, class FText* StatusText);
	void GetStatusTextColor(EOnlineServicesFriendStatus Status, struct FLinearColor* TextColor);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SocialFriendEntry_C">();
	}
	static class UWI_SocialFriendEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SocialFriendEntry_C>();
	}
};
static_assert(alignof(UWI_SocialFriendEntry_C) == 0x000008, "Wrong alignment on UWI_SocialFriendEntry_C");
static_assert(sizeof(UWI_SocialFriendEntry_C) == 0x000338, "Wrong size on UWI_SocialFriendEntry_C");
static_assert(offsetof(UWI_SocialFriendEntry_C, UberGraphFrame) == 0x000328, "Member 'UWI_SocialFriendEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SocialFriendEntry_C, PreviewStatus) == 0x000330, "Member 'UWI_SocialFriendEntry_C::PreviewStatus' has a wrong offset!");
static_assert(offsetof(UWI_SocialFriendEntry_C, PreviewIsInviteSent) == 0x000331, "Member 'UWI_SocialFriendEntry_C::PreviewIsInviteSent' has a wrong offset!");

}

