#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SpecialAbilityDetailsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C
// 0x0070 (0x0350 - 0x02E0)
class UWI_SpecialAbilityDetailsPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       AbilityDescriptionText;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AbilityIcon;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AbilityNameText;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0328(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_SpecialAbilityDetailsPanel(int32 EntryPoint);
	void OnLoaded_C3A0BE3D430E7189847A86AA34D3789B(class UObject* Loaded);
	void SetDescription(const class FText& Name_0);
	void SetIcon(TSoftObjectPtr<class UTexture2D> Icon_0);
	void SetName(const class FText& Name_0);
	void SetSpecialAbilityDefinition(TSoftObjectPtr<class UNeighborSpecialAbilityDefinition> SpecialAbilityDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SpecialAbilityDetailsPanel_C">();
	}
	static class UWI_SpecialAbilityDetailsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SpecialAbilityDetailsPanel_C>();
	}
};
static_assert(alignof(UWI_SpecialAbilityDetailsPanel_C) == 0x000008, "Wrong alignment on UWI_SpecialAbilityDetailsPanel_C");
static_assert(sizeof(UWI_SpecialAbilityDetailsPanel_C) == 0x000350, "Wrong size on UWI_SpecialAbilityDetailsPanel_C");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_SpecialAbilityDetailsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, AbilityDescriptionText) == 0x0002E8, "Member 'UWI_SpecialAbilityDetailsPanel_C::AbilityDescriptionText' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, AbilityIcon) == 0x0002F0, "Member 'UWI_SpecialAbilityDetailsPanel_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, AbilityNameText) == 0x0002F8, "Member 'UWI_SpecialAbilityDetailsPanel_C::AbilityNameText' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, Image_84) == 0x000300, "Member 'UWI_SpecialAbilityDetailsPanel_C::Image_84' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, Name_0) == 0x000308, "Member 'UWI_SpecialAbilityDetailsPanel_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, Description) == 0x000318, "Member 'UWI_SpecialAbilityDetailsPanel_C::Description' has a wrong offset!");
static_assert(offsetof(UWI_SpecialAbilityDetailsPanel_C, Icon) == 0x000328, "Member 'UWI_SpecialAbilityDetailsPanel_C::Icon' has a wrong offset!");

}

