#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SettingsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SettingsButton.WI_SettingsButton_C
// 0x0030 (0x15F0 - 0x15C0)
class UWI_SettingsButton_C final : public ULyraButtonBase
{
public:
	uint8                                         Pad_15B8[0x8];                                     // 0x15B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWI_ButtonHoverEffectMinus480x150_C*    ButtonHoverEffect;                                 // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DesignerPreviewShowHoverEffect;                    // 0x15E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_SettingsButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SettingsButton_C">();
	}
	static class UWI_SettingsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SettingsButton_C>();
	}
};
static_assert(alignof(UWI_SettingsButton_C) == 0x000010, "Wrong alignment on UWI_SettingsButton_C");
static_assert(sizeof(UWI_SettingsButton_C) == 0x0015F0, "Wrong size on UWI_SettingsButton_C");
static_assert(offsetof(UWI_SettingsButton_C, UberGraphFrame) == 0x0015C0, "Member 'UWI_SettingsButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SettingsButton_C, Hover) == 0x0015C8, "Member 'UWI_SettingsButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWI_SettingsButton_C, ButtonHoverEffect) == 0x0015D0, "Member 'UWI_SettingsButton_C::ButtonHoverEffect' has a wrong offset!");
static_assert(offsetof(UWI_SettingsButton_C, ContentBorder) == 0x0015D8, "Member 'UWI_SettingsButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWI_SettingsButton_C, DesignerPreviewShowHoverEffect) == 0x0015E0, "Member 'UWI_SettingsButton_C::DesignerPreviewShowHoverEffect' has a wrong offset!");

}

