#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemEntryV2

#include "Basic.hpp"

#include "IWCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JP_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.AddIconForTag
// 0x0060 (0x0060 - 0x0000)
struct WI_ShopItemEntryV2_C_AddIconForTag final
{
public:
	TArray<struct FGameplayTagStack>              Container;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTexture2D*                             Texture;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagStack                      CallFunc_Array_Get_Item;                           // 0x0030(0x0018)(NoDestructor)
	int32                                         CallFunc_GetTagStackAmount_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetTagStackTag_ReturnValue;               // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_AddIconForTag) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_AddIconForTag");
static_assert(sizeof(WI_ShopItemEntryV2_C_AddIconForTag) == 0x000060, "Wrong size on WI_ShopItemEntryV2_C_AddIconForTag");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, Container) == 0x000000, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::Container' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, Texture) == 0x000010, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::Texture' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, Tag) == 0x000018, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::Tag' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, NewLocalVar) == 0x000020, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_GetTagStackAmount_ReturnValue) == 0x000048, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_GetTagStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_GetTagStackTag_ReturnValue) == 0x00004C, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_GetTagStackTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000054, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000055, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_Less_IntInt_ReturnValue) == 0x000056, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddIconForTag, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WI_ShopItemEntryV2_C_AddIconForTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.AddPropertyToPropertyBox
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopItemEntryV2_C_AddPropertyToPropertyBox final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWI_ShopItemEntryPropertySimpleV2_C*    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_AddPropertyToPropertyBox) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_AddPropertyToPropertyBox");
static_assert(sizeof(WI_ShopItemEntryV2_C_AddPropertyToPropertyBox) == 0x000018, "Wrong size on WI_ShopItemEntryV2_C_AddPropertyToPropertyBox");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddPropertyToPropertyBox, Texture) == 0x000000, "Member 'WI_ShopItemEntryV2_C_AddPropertyToPropertyBox::Texture' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddPropertyToPropertyBox, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntryV2_C_AddPropertyToPropertyBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_AddPropertyToPropertyBox, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000010, "Member 'WI_ShopItemEntryV2_C_AddPropertyToPropertyBox::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.ExecuteUbergraph_WI_ShopItemEntryV2
// 0x0088 (0x0088 - 0x0000)
struct WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_ImageBackground;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0078(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0080(0x0008)(NoDestructor)
};
static_assert(alignof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2");
static_assert(sizeof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2) == 0x000088, "Wrong size on WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, EntryPoint) == 0x000000, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, Temp_bool_Variable) == 0x000004, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, Temp_object_Variable) == 0x000008, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, Temp_object_Variable_1) == 0x000010, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, Temp_object_Variable_2) == 0x000020, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_DynamicCast_AsItem_Definition) == 0x000028, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_GetAssetIdentifier_ReturnValue) == 0x000034, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_GetAssetIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_CustomEvent_ImageBackground) == 0x000040, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_CustomEvent_ImageBackground' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_Greater_ByteByte_ReturnValue) == 0x000049, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004B, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_BooleanAND_ReturnValue_2) == 0x00004D, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, Temp_bool_Variable_1) == 0x00004E, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_Select_Default) == 0x000050, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_Select_Default_1) == 0x000058, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_Event_InFocusEvent_1) == 0x000078, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2, K2Node_Event_InFocusEvent) == 0x000080, "Member 'WI_ShopItemEntryV2_C_ExecuteUbergraph_WI_ShopItemEntryV2::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_GetButton final
{
public:
	class UButton*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_GetButton) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_GetButton");
static_assert(sizeof(WI_ShopItemEntryV2_C_GetButton) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_GetButton");
static_assert(offsetof(WI_ShopItemEntryV2_C_GetButton, ReturnValue) == 0x000000, "Member 'WI_ShopItemEntryV2_C_GetButton::ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.ImageBackground_FlickerRed
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_ImageBackground_FlickerRed final
{
public:
	class UImage*                                 ImageBackground_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_ImageBackground_FlickerRed) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_ImageBackground_FlickerRed");
static_assert(sizeof(WI_ShopItemEntryV2_C_ImageBackground_FlickerRed) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_ImageBackground_FlickerRed");
static_assert(offsetof(WI_ShopItemEntryV2_C_ImageBackground_FlickerRed, ImageBackground_0) == 0x000000, "Member 'WI_ShopItemEntryV2_C_ImageBackground_FlickerRed::ImageBackground_0' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.On_Hovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature final
{
public:
	class UWI_ShopItemEntryV2_C*                  ShopItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature");
static_assert(sizeof(WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature");
static_assert(offsetof(WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature, ShopItem) == 0x000000, "Member 'WI_ShopItemEntryV2_C_On_Hovered__DelegateSignature::ShopItem' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopItemEntryV2_C*                  ShopItemWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature, ShopItemWidget) == 0x000000, "Member 'WI_ShopItemEntryV2_C_On_Pressed__DelegateSignature::ShopItemWidget' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_ShopItemEntryV2_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WI_ShopItemEntryV2_C_OnAddedToFocusPath");
static_assert(sizeof(WI_ShopItemEntryV2_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_OnAddedToFocusPath");
static_assert(offsetof(WI_ShopItemEntryV2_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WI_ShopItemEntryV2_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.OnLoaded_057C9E214C13890F402A97AA23A49560
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560");
static_assert(sizeof(WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560");
static_assert(offsetof(WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560, Loaded) == 0x000000, "Member 'WI_ShopItemEntryV2_C_OnLoaded_057C9E214C13890F402A97AA23A49560::Loaded' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_ShopItemEntryV2_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WI_ShopItemEntryV2_C_OnRemovedFromFocusPath");
static_assert(sizeof(WI_ShopItemEntryV2_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_OnRemovedFromFocusPath");
static_assert(offsetof(WI_ShopItemEntryV2_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WI_ShopItemEntryV2_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2 final
{
public:
	class UImage*                                 ImageBackground_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2");
static_assert(sizeof(WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2) == 0x000008, "Wrong size on WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2");
static_assert(offsetof(WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2, ImageBackground_0) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SequenceEvent__ENTRYPOINTWI_ShopItemEntryV2::ImageBackground_0' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetCanAffordCosmetics
// 0x0048 (0x0048 - 0x0000)
struct WI_ShopItemEntryV2_C_SetCanAffordCosmetics final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0034(0x0014)()
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics) == 0x000004, "Wrong alignment on WI_ShopItemEntryV2_C_SetCanAffordCosmetics");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics) == 0x000048, "Wrong size on WI_ShopItemEntryV2_C_SetCanAffordCosmetics");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics, Temp_bool_Variable) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetCanAffordCosmetics::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics, Temp_struct_Variable) == 0x000004, "Member 'WI_ShopItemEntryV2_C_SetCanAffordCosmetics::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics, Temp_struct_Variable_1) == 0x000014, "Member 'WI_ShopItemEntryV2_C_SetCanAffordCosmetics::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics, K2Node_Select_Default) == 0x000024, "Member 'WI_ShopItemEntryV2_C_SetCanAffordCosmetics::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCanAffordCosmetics, K2Node_MakeStruct_SlateColor) == 0x000034, "Member 'WI_ShopItemEntryV2_C_SetCanAffordCosmetics::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetCantCarryMore
// 0x0010 (0x0010 - 0x0000)
struct WI_ShopItemEntryV2_C_SetCantCarryMore final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetCantCarryMore) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SetCantCarryMore");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetCantCarryMore) == 0x000010, "Wrong size on WI_ShopItemEntryV2_C_SetCantCarryMore");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_bool_Variable) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_byte_Variable) == 0x000001, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_byte_Variable_1) == 0x000002, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_bool_Variable_1) == 0x000003, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_byte_Variable_2) == 0x000004, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, Temp_byte_Variable_3) == 0x000005, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, K2Node_Select_Default) == 0x000006, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, K2Node_Select_Default_1) == 0x000007, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetCantCarryMore, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntryV2_C_SetCantCarryMore::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetHoveredCosmetics
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopItemEntryV2_C_SetHoveredCosmetics final
{
public:
	bool                                          Hovered_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetHoveredCosmetics) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SetHoveredCosmetics");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetHoveredCosmetics) == 0x000018, "Wrong size on WI_ShopItemEntryV2_C_SetHoveredCosmetics");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetHoveredCosmetics, Hovered_0) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetHoveredCosmetics::Hovered_0' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetHoveredCosmetics, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntryV2_C_SetHoveredCosmetics::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetHoveredCosmetics, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WI_ShopItemEntryV2_C_SetHoveredCosmetics::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetImageBackgroundColorBasedOnCategory
// 0x0068 (0x0068 - 0x0000)
struct WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory final
{
public:
	EShopItemCategory                             L_TempCategory;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue;             // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory) == 0x000068, "Wrong size on WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, L_TempCategory) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::L_TempCategory' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_Get_ClassLog_Name_name) == 0x000008, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_GetTagName_ReturnValue) == 0x000018, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000020, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_GetTweakableData_ReturnValue) == 0x000048, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_GetTweakableData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_Map_Find_Value) == 0x000050, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'WI_ShopItemEntryV2_C_SetImageBackgroundColorBasedOnCategory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetPriceText
// 0x0088 (0x0088 - 0x0000)
struct WI_ShopItemEntryV2_C_SetPriceText final
{
public:
	struct FResourceData                          CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(NoDestructor)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetPriceText) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SetPriceText");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetPriceText) == 0x000088, "Wrong size on WI_ShopItemEntryV2_C_SetPriceText");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, CallFunc_Array_Get_Item) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetPriceText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntryV2_C_SetPriceText::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WI_ShopItemEntryV2_C_SetPriceText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, K2Node_MakeArray_Array) == 0x000060, "Member 'WI_ShopItemEntryV2_C_SetPriceText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WI_ShopItemEntryV2_C_SetPriceText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetPriceText, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000080, "Member 'WI_ShopItemEntryV2_C_SetPriceText::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.SetQuantityCosmetics
// 0x0098 (0x0098 - 0x0000)
struct WI_ShopItemEntryV2_C_SetQuantityCosmetics final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_SetQuantityCosmetics) == 0x000008, "Wrong alignment on WI_ShopItemEntryV2_C_SetQuantityCosmetics");
static_assert(sizeof(WI_ShopItemEntryV2_C_SetQuantityCosmetics) == 0x000098, "Wrong size on WI_ShopItemEntryV2_C_SetQuantityCosmetics");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_bool_Variable) == 0x000000, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_byte_Variable) == 0x000001, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_byte_Variable_1) == 0x000002, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_byte_Variable_2) == 0x000003, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_byte_Variable_3) == 0x000004, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, Temp_bool_Variable_1) == 0x000005, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, K2Node_Select_Default) == 0x000060, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, K2Node_MakeArray_Array) == 0x000068, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_SetQuantityCosmetics, K2Node_Select_Default_1) == 0x000090, "Member 'WI_ShopItemEntryV2_C_SetQuantityCosmetics::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_ShopItemEntryV2.WI_ShopItemEntryV2_C.TrySetDeliverableExceptionBackground
// 0x0034 (0x0034 - 0x0000)
struct WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagStack                      CallFunc_Array_Get_Item;                           // 0x000C(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetTagStackTag_ReturnValue;               // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground) == 0x000004, "Wrong alignment on WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground");
static_assert(sizeof(WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground) == 0x000034, "Wrong size on WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground");
static_assert(offsetof(WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WI_ShopItemEntryV2_C_TrySetDeliverableExceptionBackground::Temp_int_Loop_Counter_Variable' has a wrong offset!");
