#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SuddenDeath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SuddenDeath.WI_SuddenDeath_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_SuddenDeath_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressbarWI_C*                       ProgressbarWI;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        SuddenDeathTime;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SuddenDeathStartTimeStamp;                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_SuddenDeath(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SuddenDeath_C">();
	}
	static class UWI_SuddenDeath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SuddenDeath_C>();
	}
};
static_assert(alignof(UWI_SuddenDeath_C) == 0x000008, "Wrong alignment on UWI_SuddenDeath_C");
static_assert(sizeof(UWI_SuddenDeath_C) == 0x000300, "Wrong size on UWI_SuddenDeath_C");
static_assert(offsetof(UWI_SuddenDeath_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_SuddenDeath_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SuddenDeath_C, ProgressbarWI) == 0x0002E8, "Member 'UWI_SuddenDeath_C::ProgressbarWI' has a wrong offset!");
static_assert(offsetof(UWI_SuddenDeath_C, SuddenDeathTime) == 0x0002F0, "Member 'UWI_SuddenDeath_C::SuddenDeathTime' has a wrong offset!");
static_assert(offsetof(UWI_SuddenDeath_C, SuddenDeathStartTimeStamp) == 0x0002F8, "Member 'UWI_SuddenDeath_C::SuddenDeathStartTimeStamp' has a wrong offset!");

}

