#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonPassRewardContent_Currency

#include "Basic.hpp"

#include "JP_structs.hpp"


namespace SDK::Params
{

// Function WI_SeasonPassRewardContent_Currency.WI_SeasonPassRewardContent_Currency_C.ApplyCurrencyViewModel
// 0x0010 (0x0010 - 0x0000)
struct WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel final
{
public:
	struct FSeasonPassRewardContent_CurrencyViewModel ViewModel;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel) == 0x000008, "Wrong alignment on WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel");
static_assert(sizeof(WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel) == 0x000010, "Wrong size on WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel");
static_assert(offsetof(WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel, ViewModel) == 0x000000, "Member 'WI_SeasonPassRewardContent_Currency_C_ApplyCurrencyViewModel::ViewModel' has a wrong offset!");

// Function WI_SeasonPassRewardContent_Currency.WI_SeasonPassRewardContent_Currency_C.ExecuteUbergraph_WI_SeasonPassRewardContent_Currency
// 0x0028 (0x0028 - 0x0000)
struct WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSeasonPassRewardContent_CurrencyViewModel K2Node_Event_ViewModel;                            // 0x0008(0x0010)(ConstParm, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
};
static_assert(alignof(WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency) == 0x000008, "Wrong alignment on WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency");
static_assert(sizeof(WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency) == 0x000028, "Wrong size on WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency");
static_assert(offsetof(WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency, EntryPoint) == 0x000000, "Member 'WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency, K2Node_Event_ViewModel) == 0x000008, "Member 'WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WI_SeasonPassRewardContent_Currency_C_ExecuteUbergraph_WI_SeasonPassRewardContent_Currency::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

