#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SinglePrice

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_SinglePrice.WI_SinglePrice_C.ExecuteUbergraph_WI_SinglePrice
// 0x0070 (0x0070 - 0x0000)
struct WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineCurrency*                        K2Node_DynamicCast_AsOnline_Currency;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_CurrencyTag;                    // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOnlineCurrency>         CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency; // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice) == 0x000008, "Wrong alignment on WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice");
static_assert(sizeof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice) == 0x000070, "Wrong size on WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, EntryPoint) == 0x000000, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, Temp_object_Variable) == 0x000020, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_DynamicCast_AsOnline_Currency) == 0x000028, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_DynamicCast_AsOnline_Currency' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_Event_IsDesignTime) == 0x000031, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, K2Node_CustomEvent_CurrencyTag) == 0x000034, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::K2Node_CustomEvent_CurrencyTag' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency) == 0x000040, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice, CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue) == 0x000068, "Member 'WI_SinglePrice_C_ExecuteUbergraph_WI_SinglePrice::CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.OnLoaded_68B0E1DB429EEC121A75FFA66A153858
// 0x0008 (0x0008 - 0x0000)
struct WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858) == 0x000008, "Wrong alignment on WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858");
static_assert(sizeof(WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858) == 0x000008, "Wrong size on WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858");
static_assert(offsetof(WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858, Loaded) == 0x000000, "Member 'WI_SinglePrice_C_OnLoaded_68B0E1DB429EEC121A75FFA66A153858::Loaded' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_SinglePrice_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_PreConstruct) == 0x000001, "Wrong alignment on WI_SinglePrice_C_PreConstruct");
static_assert(sizeof(WI_SinglePrice_C_PreConstruct) == 0x000001, "Wrong size on WI_SinglePrice_C_PreConstruct");
static_assert(offsetof(WI_SinglePrice_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_SinglePrice_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.SetAmount
// 0x0018 (0x0018 - 0x0000)
struct WI_SinglePrice_C_SetAmount final
{
public:
	int32                                         Amount_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WI_SinglePrice_C_SetAmount) == 0x000008, "Wrong alignment on WI_SinglePrice_C_SetAmount");
static_assert(sizeof(WI_SinglePrice_C_SetAmount) == 0x000018, "Wrong size on WI_SinglePrice_C_SetAmount");
static_assert(offsetof(WI_SinglePrice_C_SetAmount, Amount_0) == 0x000000, "Member 'WI_SinglePrice_C_SetAmount::Amount_0' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_SetAmount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WI_SinglePrice_C_SetAmount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.SetCurrencyTag
// 0x0008 (0x0008 - 0x0000)
struct WI_SinglePrice_C_SetCurrencyTag final
{
public:
	struct FGameplayTag                           CurrencyTag_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_SetCurrencyTag) == 0x000004, "Wrong alignment on WI_SinglePrice_C_SetCurrencyTag");
static_assert(sizeof(WI_SinglePrice_C_SetCurrencyTag) == 0x000008, "Wrong size on WI_SinglePrice_C_SetCurrencyTag");
static_assert(offsetof(WI_SinglePrice_C_SetCurrencyTag, CurrencyTag_0) == 0x000000, "Member 'WI_SinglePrice_C_SetCurrencyTag::CurrencyTag_0' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.SetPrice
// 0x000C (0x000C - 0x0000)
struct WI_SinglePrice_C_SetPrice final
{
public:
	struct FOnlineStoreItemCost                   Cost;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WI_SinglePrice_C_SetPrice) == 0x000004, "Wrong alignment on WI_SinglePrice_C_SetPrice");
static_assert(sizeof(WI_SinglePrice_C_SetPrice) == 0x00000C, "Wrong size on WI_SinglePrice_C_SetPrice");
static_assert(offsetof(WI_SinglePrice_C_SetPrice, Cost) == 0x000000, "Member 'WI_SinglePrice_C_SetPrice::Cost' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.SetSpacing
// 0x0018 (0x0018 - 0x0000)
struct WI_SinglePrice_C_SetSpacing final
{
public:
	double                                        Spacing_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_SetSpacing) == 0x000008, "Wrong alignment on WI_SinglePrice_C_SetSpacing");
static_assert(sizeof(WI_SinglePrice_C_SetSpacing) == 0x000018, "Wrong size on WI_SinglePrice_C_SetSpacing");
static_assert(offsetof(WI_SinglePrice_C_SetSpacing, Spacing_0) == 0x000000, "Member 'WI_SinglePrice_C_SetSpacing::Spacing_0' has a wrong offset!");
static_assert(offsetof(WI_SinglePrice_C_SetSpacing, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WI_SinglePrice_C_SetSpacing::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WI_SinglePrice.WI_SinglePrice_C.SetTextStyle
// 0x0008 (0x0008 - 0x0000)
struct WI_SinglePrice_C_SetTextStyle final
{
public:
	class UClass*                                 TextStyle_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SinglePrice_C_SetTextStyle) == 0x000008, "Wrong alignment on WI_SinglePrice_C_SetTextStyle");
static_assert(sizeof(WI_SinglePrice_C_SetTextStyle) == 0x000008, "Wrong size on WI_SinglePrice_C_SetTextStyle");
static_assert(offsetof(WI_SinglePrice_C_SetTextStyle, TextStyle_0) == 0x000000, "Member 'WI_SinglePrice_C_SetTextStyle::TextStyle_0' has a wrong offset!");

}

