#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopCategoryButtonV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.ExecuteUbergraph_WI_ShopCategoryButtonV2
// 0x0010 (0x0010 - 0x0000)
struct WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2) == 0x000008, "Wrong alignment on WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2) == 0x000010, "Wrong size on WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2, EntryPoint) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WI_ShopCategoryButtonV2_C_ExecuteUbergraph_WI_ShopCategoryButtonV2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.On_Pressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature final
{
public:
	class UWI_ShopCategoryButtonV2_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature) == 0x000008, "Wrong alignment on WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature) == 0x000008, "Wrong size on WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature, Button) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_On_Pressed__DelegateSignature::Button' has a wrong offset!");

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopCategoryButtonV2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_PreConstruct) == 0x000001, "Wrong alignment on WI_ShopCategoryButtonV2_C_PreConstruct");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_PreConstruct) == 0x000001, "Wrong size on WI_ShopCategoryButtonV2_C_PreConstruct");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.SetButtonColorFromCategory
// 0x0020 (0x0020 - 0x0000)
struct WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory final
{
public:
	const class UTweakableData*                   CallFunc_GetTweakableData_ReturnValue;             // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory) == 0x000008, "Wrong alignment on WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory) == 0x000020, "Wrong size on WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory, CallFunc_GetTweakableData_ReturnValue) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory::CallFunc_GetTweakableData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory, CallFunc_Map_Find_Value) == 0x000008, "Member 'WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WI_ShopCategoryButtonV2_C_SetButtonColorFromCategory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.SetHoveredCosmetics
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopCategoryButtonV2_C_SetHoveredCosmetics final
{
public:
	bool                                          Hovered_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_SetHoveredCosmetics) == 0x000008, "Wrong alignment on WI_ShopCategoryButtonV2_C_SetHoveredCosmetics");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_SetHoveredCosmetics) == 0x000018, "Wrong size on WI_ShopCategoryButtonV2_C_SetHoveredCosmetics");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetHoveredCosmetics, Hovered_0) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_SetHoveredCosmetics::Hovered_0' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetHoveredCosmetics, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WI_ShopCategoryButtonV2_C_SetHoveredCosmetics::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetHoveredCosmetics, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WI_ShopCategoryButtonV2_C_SetHoveredCosmetics::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WI_ShopCategoryButtonV2.WI_ShopCategoryButtonV2_C.SetSelectedCosmetics
// 0x0018 (0x0018 - 0x0000)
struct WI_ShopCategoryButtonV2_C_SetSelectedCosmetics final
{
public:
	bool                                          Selected_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopCategoryButtonV2_C_SetSelectedCosmetics) == 0x000008, "Wrong alignment on WI_ShopCategoryButtonV2_C_SetSelectedCosmetics");
static_assert(sizeof(WI_ShopCategoryButtonV2_C_SetSelectedCosmetics) == 0x000018, "Wrong size on WI_ShopCategoryButtonV2_C_SetSelectedCosmetics");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetSelectedCosmetics, Selected_0) == 0x000000, "Member 'WI_ShopCategoryButtonV2_C_SetSelectedCosmetics::Selected_0' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetSelectedCosmetics, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WI_ShopCategoryButtonV2_C_SetSelectedCosmetics::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopCategoryButtonV2_C_SetSelectedCosmetics, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WI_ShopCategoryButtonV2_C_SetSelectedCosmetics::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

