#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialUserEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SocialUserEntry.WI_SocialUserEntry_C
// 0x0028 (0x0320 - 0x02F8)
class UWI_SocialUserEntry_C final : public USocialUserEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_PlatformAvatar_C*                   UserAvatar;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                ListItemPadding;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowListItemPaddingPreview;                       // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_SocialUserEntry(int32 EntryPoint);
	struct FMargin GetListItemPadding();
	void PreConstruct(bool IsDesignTime);
	void SetAvatar(class UOnlineServicesUserBase* User);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SocialUserEntry_C">();
	}
	static class UWI_SocialUserEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SocialUserEntry_C>();
	}
};
static_assert(alignof(UWI_SocialUserEntry_C) == 0x000008, "Wrong alignment on UWI_SocialUserEntry_C");
static_assert(sizeof(UWI_SocialUserEntry_C) == 0x000320, "Wrong size on UWI_SocialUserEntry_C");
static_assert(offsetof(UWI_SocialUserEntry_C, UberGraphFrame) == 0x0002F8, "Member 'UWI_SocialUserEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SocialUserEntry_C, UserAvatar) == 0x000300, "Member 'UWI_SocialUserEntry_C::UserAvatar' has a wrong offset!");
static_assert(offsetof(UWI_SocialUserEntry_C, ListItemPadding) == 0x000308, "Member 'UWI_SocialUserEntry_C::ListItemPadding' has a wrong offset!");
static_assert(offsetof(UWI_SocialUserEntry_C, bShowListItemPaddingPreview) == 0x000318, "Member 'UWI_SocialUserEntry_C::bShowListItemPaddingPreview' has a wrong offset!");

}

