#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemBuffDetailsV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_ShopItemBuffDetailsV2.WI_ShopItemBuffDetailsV2_C.ExecuteUbergraph_WI_ShopItemBuffDetailsV2
// 0x0080 (0x0080 - 0x0000)
struct WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_Class;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsGameplay_Effect_IW;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UGameplayEffectComponent*>       CallFunc_FindComponents_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayEffectComponent*         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayEffectUIData_TextOnly*   K2Node_DynamicCast_AsUI_Data__Text_Only_;          // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayEffectUIData_Icon*       K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon;  // 0x0070(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2) == 0x000008, "Wrong alignment on WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2");
static_assert(sizeof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2) == 0x000080, "Wrong size on WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, EntryPoint) == 0x000000, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_CustomEvent_Class) == 0x000010, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_CustomEvent_Class' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_ClassDynamicCast_AsGameplay_Effect_IW) == 0x000018, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_ClassDynamicCast_AsGameplay_Effect_IW' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_FindComponents_ReturnValue) == 0x000030, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_FindComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_AsTexture_2D) == 0x000040, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_Array_Get_Item) == 0x000050, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_AsUI_Data__Text_Only_) == 0x000060, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_AsUI_Data__Text_Only_' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon) == 0x000070, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_AsGameplay_Effect_UIData_Icon' has a wrong offset!");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WI_ShopItemBuffDetailsV2_C_ExecuteUbergraph_WI_ShopItemBuffDetailsV2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WI_ShopItemBuffDetailsV2.WI_ShopItemBuffDetailsV2_C.Update Widget
// 0x0008 (0x0008 - 0x0000)
struct WI_ShopItemBuffDetailsV2_C_Update_Widget final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemBuffDetailsV2_C_Update_Widget) == 0x000008, "Wrong alignment on WI_ShopItemBuffDetailsV2_C_Update_Widget");
static_assert(sizeof(WI_ShopItemBuffDetailsV2_C_Update_Widget) == 0x000008, "Wrong size on WI_ShopItemBuffDetailsV2_C_Update_Widget");
static_assert(offsetof(WI_ShopItemBuffDetailsV2_C_Update_Widget, Class_0) == 0x000000, "Member 'WI_ShopItemBuffDetailsV2_C_Update_Widget::Class_0' has a wrong offset!");

}

