#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialList

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_SocialList.WI_SocialList_C.BlueprintApplyListStateNoAnimation
// 0x0020 (0x0020 - 0x0000)
struct WI_SocialList_C_BlueprintApplyListStateNoAnimation final
{
public:
	ESocialListState                              InListState;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialListState                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Fill_ImplicitCast;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Party_ImplicitCast;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Full_ImplicitCast;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialList_C_BlueprintApplyListStateNoAnimation) == 0x000008, "Wrong alignment on WI_SocialList_C_BlueprintApplyListStateNoAnimation");
static_assert(sizeof(WI_SocialList_C_BlueprintApplyListStateNoAnimation) == 0x000020, "Wrong size on WI_SocialList_C_BlueprintApplyListStateNoAnimation");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, InListState) == 0x000000, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::InListState' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, Temp_byte_Variable) == 0x000001, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, Temp_real_Variable) == 0x000004, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, K2Node_Select_Default) == 0x000010, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, K2Node_Select_Fill_ImplicitCast) == 0x000014, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::K2Node_Select_Fill_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, K2Node_Select_Party_ImplicitCast) == 0x000018, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::K2Node_Select_Party_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_BlueprintApplyListStateNoAnimation, K2Node_Select_Full_ImplicitCast) == 0x00001C, "Member 'WI_SocialList_C_BlueprintApplyListStateNoAnimation::K2Node_Select_Full_ImplicitCast' has a wrong offset!");

// Function WI_SocialList.WI_SocialList_C.BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_SocialList_C_BndEvt__WI_SocialList_ListHeader_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_SocialList.WI_SocialList_C.ExecuteUbergraph_WI_SocialList
// 0x0010 (0x0010 - 0x0000)
struct WI_SocialList_C_ExecuteUbergraph_WI_SocialList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialList_C_ExecuteUbergraph_WI_SocialList) == 0x000008, "Wrong alignment on WI_SocialList_C_ExecuteUbergraph_WI_SocialList");
static_assert(sizeof(WI_SocialList_C_ExecuteUbergraph_WI_SocialList) == 0x000010, "Wrong size on WI_SocialList_C_ExecuteUbergraph_WI_SocialList");
static_assert(offsetof(WI_SocialList_C_ExecuteUbergraph_WI_SocialList, EntryPoint) == 0x000000, "Member 'WI_SocialList_C_ExecuteUbergraph_WI_SocialList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_ExecuteUbergraph_WI_SocialList, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WI_SocialList_C_ExecuteUbergraph_WI_SocialList::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WI_SocialList.WI_SocialList_C.SetHeader
// 0x00D0 (0x00D0 - 0x0000)
struct WI_SocialList_C_SetHeader final
{
public:
	class FString                                 StringToAppend;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0010)()
};
static_assert(alignof(WI_SocialList_C_SetHeader) == 0x000008, "Wrong alignment on WI_SocialList_C_SetHeader");
static_assert(sizeof(WI_SocialList_C_SetHeader) == 0x0000D0, "Wrong size on WI_SocialList_C_SetHeader");
static_assert(offsetof(WI_SocialList_C_SetHeader, StringToAppend) == 0x000000, "Member 'WI_SocialList_C_SetHeader::StringToAppend' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_SetHeader, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WI_SocialList_C_SetHeader::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_SetHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WI_SocialList_C_SetHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_SetHeader, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'WI_SocialList_C_SetHeader::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_SetHeader, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WI_SocialList_C_SetHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_SocialList_C_SetHeader, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WI_SocialList_C_SetHeader::CallFunc_Format_ReturnValue' has a wrong offset!");

}

