#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SurrenderVote

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SurrenderVote.WI_SurrenderVote_C
// 0x0030 (0x0338 - 0x0308)
class UWI_SurrenderVote_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       SurrenderStateText;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SurrenderTitle;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_CommonSettingsCheckbox_C*           WI_CommonSettingsCheckbox;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_PanelBackground_C*                  WI_PanelBackground;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TeammatesSurrendering;                             // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurrenderUnlockTime;                               // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckboxClicked(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WI_SurrenderVote(int32 EntryPoint);
	void UpdateSurrenderPromptText();
	void UpdateVoteState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SurrenderVote_C">();
	}
	static class UWI_SurrenderVote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SurrenderVote_C>();
	}
};
static_assert(alignof(UWI_SurrenderVote_C) == 0x000008, "Wrong alignment on UWI_SurrenderVote_C");
static_assert(sizeof(UWI_SurrenderVote_C) == 0x000338, "Wrong size on UWI_SurrenderVote_C");
static_assert(offsetof(UWI_SurrenderVote_C, UberGraphFrame) == 0x000308, "Member 'UWI_SurrenderVote_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, SurrenderStateText) == 0x000310, "Member 'UWI_SurrenderVote_C::SurrenderStateText' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, SurrenderTitle) == 0x000318, "Member 'UWI_SurrenderVote_C::SurrenderTitle' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, WI_CommonSettingsCheckbox) == 0x000320, "Member 'UWI_SurrenderVote_C::WI_CommonSettingsCheckbox' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, WI_PanelBackground) == 0x000328, "Member 'UWI_SurrenderVote_C::WI_PanelBackground' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, TeammatesSurrendering) == 0x000330, "Member 'UWI_SurrenderVote_C::TeammatesSurrendering' has a wrong offset!");
static_assert(offsetof(UWI_SurrenderVote_C, SurrenderUnlockTime) == 0x000334, "Member 'UWI_SurrenderVote_C::SurrenderUnlockTime' has a wrong offset!");

}

