#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopPlayerResourcesV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_ShopPlayerResourcesV2.WI_ShopPlayerResourcesV2_C
// 0x0030 (0x0310 - 0x02E0)
class UWI_ShopPlayerResourcesV2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Purchase;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageMoneyIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResourcesIcon;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMoneyAmount;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextResourcesAmount;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_ShopPlayerResourcesV2(int32 EntryPoint);
	void SetMoneyAmount(int32 Amount);
	void SetResourceAmount(uint8 Amount);
	void ShopChanged_Event(const struct FShopViewModel& ShopViewModel);
	void Update_Widget(int32 MoneyAmount, uint8 ResourcesAmount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_ShopPlayerResourcesV2_C">();
	}
	static class UWI_ShopPlayerResourcesV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_ShopPlayerResourcesV2_C>();
	}
};
static_assert(alignof(UWI_ShopPlayerResourcesV2_C) == 0x000008, "Wrong alignment on UWI_ShopPlayerResourcesV2_C");
static_assert(sizeof(UWI_ShopPlayerResourcesV2_C) == 0x000310, "Wrong size on UWI_ShopPlayerResourcesV2_C");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_ShopPlayerResourcesV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, Purchase) == 0x0002E8, "Member 'UWI_ShopPlayerResourcesV2_C::Purchase' has a wrong offset!");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, ImageMoneyIcon) == 0x0002F0, "Member 'UWI_ShopPlayerResourcesV2_C::ImageMoneyIcon' has a wrong offset!");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, ImageResourcesIcon) == 0x0002F8, "Member 'UWI_ShopPlayerResourcesV2_C::ImageResourcesIcon' has a wrong offset!");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, TextMoneyAmount) == 0x000300, "Member 'UWI_ShopPlayerResourcesV2_C::TextMoneyAmount' has a wrong offset!");
static_assert(offsetof(UWI_ShopPlayerResourcesV2_C, TextResourcesAmount) == 0x000308, "Member 'UWI_ShopPlayerResourcesV2_C::TextResourcesAmount' has a wrong offset!");

}

