#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialFriendsList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_SocialFriendsList.WI_SocialFriendsList_C.ExecuteUbergraph_WI_SocialFriendsList
// 0x0004 (0x0004 - 0x0000)
struct WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList) == 0x000004, "Wrong alignment on WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList");
static_assert(sizeof(WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList) == 0x000004, "Wrong size on WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList");
static_assert(offsetof(WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList, EntryPoint) == 0x000000, "Member 'WI_SocialFriendsList_C_ExecuteUbergraph_WI_SocialFriendsList::EntryPoint' has a wrong offset!");

// Function WI_SocialFriendsList.WI_SocialFriendsList_C.OnHeaderClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong alignment on WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature");
static_assert(sizeof(WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature) == 0x000008, "Wrong size on WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature");
static_assert(offsetof(WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature, Widget) == 0x000000, "Member 'WI_SocialFriendsList_C_OnHeaderClick__DelegateSignature::Widget' has a wrong offset!");

}

