#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Scoreboard_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WI_Scoreboard_Entry.WI_Scoreboard_Entry_C.ExecuteUbergraph_WI_Scoreboard_Entry
// 0x0070 (0x0070 - 0x0000)
struct WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0030(0x0010)()
	struct FLinearColor                           CallFunc_GetTeamColorForTeamId_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast;    // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast_1;  // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentValue_NewValue_ImplicitCast_2;  // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry) == 0x000008, "Wrong alignment on WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry");
static_assert(sizeof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry) == 0x000070, "Wrong size on WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, EntryPoint) == 0x000000, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, Temp_bool_Variable) == 0x000004, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, Temp_struct_Variable) == 0x000008, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000028, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_Conv_NameToText_ReturnValue) == 0x000030, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_GetTeamColorForTeamId_ReturnValue) == 0x000040, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_GetTeamColorForTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, K2Node_Select_Default) == 0x000050, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_SetCurrentValue_NewValue_ImplicitCast) == 0x000060, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_SetCurrentValue_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_SetCurrentValue_NewValue_ImplicitCast_1) == 0x000064, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_SetCurrentValue_NewValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry, CallFunc_SetCurrentValue_NewValue_ImplicitCast_2) == 0x000068, "Member 'WI_Scoreboard_Entry_C_ExecuteUbergraph_WI_Scoreboard_Entry::CallFunc_SetCurrentValue_NewValue_ImplicitCast_2' has a wrong offset!");

}

