#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SeasonProgressionBarBreakpoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SeasonProgressionBarBreakpoint.WI_SeasonProgressionBarBreakpoint_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_SeasonProgressionBarBreakpoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       LevelText;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_SeasonProgressionBarBreakpoint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetLevel(int32 Level_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SeasonProgressionBarBreakpoint_C">();
	}
	static class UWI_SeasonProgressionBarBreakpoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SeasonProgressionBarBreakpoint_C>();
	}
};
static_assert(alignof(UWI_SeasonProgressionBarBreakpoint_C) == 0x000008, "Wrong alignment on UWI_SeasonProgressionBarBreakpoint_C");
static_assert(sizeof(UWI_SeasonProgressionBarBreakpoint_C) == 0x0002F8, "Wrong size on UWI_SeasonProgressionBarBreakpoint_C");
static_assert(offsetof(UWI_SeasonProgressionBarBreakpoint_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_SeasonProgressionBarBreakpoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SeasonProgressionBarBreakpoint_C, LevelText) == 0x0002E8, "Member 'UWI_SeasonProgressionBarBreakpoint_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWI_SeasonProgressionBarBreakpoint_C, Level) == 0x0002F0, "Member 'UWI_SeasonProgressionBarBreakpoint_C::Level' has a wrong offset!");

}

