#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemGrid

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopItemGrid.WI_ShopItemGrid_C.ExecuteUbergraph_WI_ShopItemGrid
// 0x0138 (0x0138 - 0x0000)
struct WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0128(0x0010)()
};
static_assert(alignof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid) == 0x000008, "Wrong alignment on WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid");
static_assert(sizeof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid) == 0x000138, "Wrong size on WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, EntryPoint) == 0x000000, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000B0, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, K2Node_MakeArray_Array_1) == 0x000108, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid, CallFunc_Format_ReturnValue_1) == 0x000128, "Member 'WI_ShopItemGrid_C_ExecuteUbergraph_WI_ShopItemGrid::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WI_ShopItemGrid.WI_ShopItemGrid_C.Get Item Color And Opacity
// 0x0048 (0x0048 - 0x0000)
struct WI_ShopItemGrid_C_Get_Item_Color_And_Opacity final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Category_Unlocked_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity) == 0x000004, "Wrong alignment on WI_ShopItemGrid_C_Get_Item_Color_And_Opacity");
static_assert(sizeof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity) == 0x000048, "Wrong size on WI_ShopItemGrid_C_Get_Item_Color_And_Opacity");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, Color) == 0x000000, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::Color' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, Temp_bool_Variable) == 0x000010, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, Temp_struct_Variable) == 0x000014, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, Temp_struct_Variable_1) == 0x000024, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, CallFunc_Is_Category_Unlocked_ReturnValue) == 0x000034, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::CallFunc_Is_Category_Unlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_Item_Color_And_Opacity, K2Node_Select_Default) == 0x000038, "Member 'WI_ShopItemGrid_C_Get_Item_Color_And_Opacity::K2Node_Select_Default' has a wrong offset!");

// Function WI_ShopItemGrid.WI_ShopItemGrid_C.Get_ItemCategoryName_ColorAndOpacity
// 0x0038 (0x0038 - 0x0000)
struct WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FLinearColor                           CallFunc_Get_Item_Color_And_Opacity_Color;         // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
};
static_assert(alignof(WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity) == 0x000004, "Wrong alignment on WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity");
static_assert(sizeof(WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity) == 0x000038, "Wrong size on WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity");
static_assert(offsetof(WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity, CallFunc_Get_Item_Color_And_Opacity_Color) == 0x000014, "Member 'WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity::CallFunc_Get_Item_Color_And_Opacity_Color' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'WI_ShopItemGrid_C_Get_ItemCategoryName_ColorAndOpacity::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WI_ShopItemGrid.WI_ShopItemGrid_C.Is Category Unlocked
// 0x0068 (0x0068 - 0x0000)
struct WI_ShopItemGrid_C_Is_Category_Unlocked final
{
public:
	class AGroundsKeeper*                         GroundsKeeper_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Abp_groundskeeper_C*                    K2Node_DynamicCast_AsBp_Groundskeeper;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRoomData                              CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemGrid_C_Is_Category_Unlocked) == 0x000008, "Wrong alignment on WI_ShopItemGrid_C_Is_Category_Unlocked");
static_assert(sizeof(WI_ShopItemGrid_C_Is_Category_Unlocked) == 0x000068, "Wrong size on WI_ShopItemGrid_C_Is_Category_Unlocked");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, GroundsKeeper_0) == 0x000000, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::GroundsKeeper_0' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, ReturnValue) == 0x000008, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, K2Node_DynamicCast_AsBp_Groundskeeper) == 0x000010, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::K2Node_DynamicCast_AsBp_Groundskeeper' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_Array_Get_Item) == 0x000028, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_Get_ClassLog_Name_name) == 0x000050, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000062, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemGrid_C_Is_Category_Unlocked, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000063, "Member 'WI_ShopItemGrid_C_Is_Category_Unlocked::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

}

