#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SocialListHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_SocialListHeader.WI_SocialListHeader_C
// 0x0020 (0x15C0 - 0x15A0)
class UWI_SocialListHeader_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          ButtonBorder;                                      // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WI_SocialListHeader(int32 EntryPoint);
	void SetHeader(const class FText& Header);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_SocialListHeader_C">();
	}
	static class UWI_SocialListHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_SocialListHeader_C>();
	}
};
static_assert(alignof(UWI_SocialListHeader_C) == 0x000010, "Wrong alignment on UWI_SocialListHeader_C");
static_assert(sizeof(UWI_SocialListHeader_C) == 0x0015C0, "Wrong size on UWI_SocialListHeader_C");
static_assert(offsetof(UWI_SocialListHeader_C, UberGraphFrame) == 0x0015A0, "Member 'UWI_SocialListHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_SocialListHeader_C, ButtonBorder) == 0x0015A8, "Member 'UWI_SocialListHeader_C::ButtonBorder' has a wrong offset!");
static_assert(offsetof(UWI_SocialListHeader_C, HeaderText) == 0x0015B0, "Member 'UWI_SocialListHeader_C::HeaderText' has a wrong offset!");

}

