#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_ShopItemEntry_Radial

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "E_ShopType_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ShopItem_structs.hpp"


namespace SDK::Params
{

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.AreAllRequirementsMet
// 0x00B0 (0x00B0 - 0x0000)
struct WI_ShopItemEntry_Radial_C_AreAllRequirementsMet final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEconomySubsystem*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0018(0x0038)(NoDestructor)
	int32                                         CallFunc_GetCurrentItemTierIndex_ItemTierIndex;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPurchaseRequirementMet_Return;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x0058(0x0050)()
	bool                                          CallFunc_CanAfford_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_AreAllRequirementsMet");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet) == 0x0000B0, "Wrong size on WI_ShopItemEntry_Radial_C_AreAllRequirementsMet");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, Return) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::Return' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_GetTeam_ReturnValue) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_GetCurrentItemTierIndex_ItemTierIndex) == 0x000050, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_GetCurrentItemTierIndex_ItemTierIndex' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_IsPurchaseRequirementMet_Return) == 0x000054, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_IsPurchaseRequirementMet_Return' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_Array_Get_Item) == 0x000058, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_CanAfford_ReturnValue) == 0x0000A8, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_CanAfford_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_AreAllRequirementsMet, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'WI_ShopItemEntry_Radial_C_AreAllRequirementsMet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.CalculateUpgradeCost
// 0x0100 (0x0100 - 0x0000)
struct WI_ShopItemEntry_Radial_C_CalculateUpgradeCost final
{
public:
	class UItemTiersDefinition*                   ItemTiersDefinition;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRoomData                              RoomData_0;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UItemInstance*                          FoundItemInstance;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x0030(0x0050)()
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ResidentCharacter_C*                K2Node_DynamicCast_AsBP_Resident_Character;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstance*                          CallFunc_GetFirstItemOfType_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_ClassLog_Name_name;                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_CalculateUpgradeCost");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost) == 0x000100, "Wrong size on WI_ShopItemEntry_Radial_C_CalculateUpgradeCost");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, ItemTiersDefinition) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::ItemTiersDefinition' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, RoomData_0) == 0x000008, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::RoomData_0' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, FoundItemInstance) == 0x000020, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::FoundItemInstance' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Array_Get_Item) == 0x000030, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000080, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000088, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, K2Node_DynamicCast_AsBP_Resident_Character) == 0x000090, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::K2Node_DynamicCast_AsBP_Resident_Character' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, K2Node_DynamicCast_AsItem_Definition) == 0x0000A0, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000B0, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_GetFirstItemOfType_ReturnValue) == 0x0000E0, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_GetFirstItemOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Less_IntInt_ReturnValue) == 0x0000E9, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_CalculateUpgradeCost, CallFunc_Get_ClassLog_Name_name) == 0x0000F0, "Member 'WI_ShopItemEntry_Radial_C_CalculateUpgradeCost::CallFunc_Get_ClassLog_Name_name' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Cheat Set Unlocked
// 0x0001 (0x0001 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked final
{
public:
	bool                                          Unlocked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked) == 0x000001, "Wrong alignment on WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked) == 0x000001, "Wrong size on WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked, Unlocked) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Cheat_Set_Unlocked::Unlocked' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.ExecuteUbergraph_WI_ShopItemEntry_Radial
// 0x0168 (0x0168 - 0x0000)
struct WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResourcePayload                       Temp_struct_Variable;                              // 0x0018(0x0028)(NoDestructor)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResourcePayload                       Temp_struct_Variable_1;                            // 0x0060(0x0028)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInitializationStateEnded*              CallFunc_ListenToInitializationStateEnded_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResourcePayload                       Temp_struct_Variable_3;                            // 0x00C0(0x0028)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FResourcePayload                       Temp_struct_Variable_4;                            // 0x0110(0x0028)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial) == 0x000168, "Wrong size on WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, EntryPoint) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CustomEvent_ProxyObject_1) == 0x000040, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CustomEvent_ActualChannel_1) == 0x000048, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable_1) == 0x000060, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable_2) == 0x000088, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_object_Variable) == 0x000090, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000098, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_GetPayload_ReturnValue) == 0x0000A0, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A4, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_ListenToInitializationStateEnded_ReturnValue) == 0x0000B8, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_ListenToInitializationStateEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable_3) == 0x0000C0, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000EC, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CustomEvent_ProxyObject) == 0x000100, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CustomEvent_ActualChannel) == 0x000108, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable_4) == 0x000110, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_struct_Variable_5) == 0x000138, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, Temp_object_Variable_1) == 0x000140, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000148, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_GetPayload_ReturnValue_1) == 0x000150, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_IsValid_ReturnValue_2) == 0x000151, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CustomEvent_Enable) == 0x000152, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000153, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial, K2Node_CreateDelegate_OutputDelegate_4) == 0x000154, "Member 'WI_ShopItemEntry_Radial_C_ExecuteUbergraph_WI_ShopItemEntry_Radial::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Get Button Purchase B Is Enabled
// 0x0002 (0x0002 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAllRequirementsMet_Return;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled) == 0x000001, "Wrong alignment on WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled) == 0x000002, "Wrong size on WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled, ReturnValue) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled, CallFunc_AreAllRequirementsMet_Return) == 0x000001, "Member 'WI_ShopItemEntry_Radial_C_Get_Button_Purchase_B_Is_Enabled::CallFunc_AreAllRequirementsMet_Return' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Get_Image_BG_ColorAndOpacity_0
// 0x0048 (0x0048 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAllRequirementsMet_Return;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0) == 0x000004, "Wrong alignment on WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0) == 0x000048, "Wrong size on WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, Temp_bool_Variable) == 0x000010, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, Temp_struct_Variable) == 0x000014, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, Temp_struct_Variable_1) == 0x000024, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, CallFunc_AreAllRequirementsMet_Return) == 0x000034, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::CallFunc_AreAllRequirementsMet_Return' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0, K2Node_Select_Default) == 0x000038, "Member 'WI_ShopItemEntry_Radial_C_Get_Image_BG_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Get_Text_RoomReqLevel_ColorAndOpacity_0
// 0x0098 (0x0098 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTeam                                  CallFunc_GetTeam_ReturnValue;                      // 0x0038(0x0038)(NoDestructor)
	bool                                          CallFunc_IsPurchaseRequirementMet_Return;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0084(0x0014)()
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0) == 0x000098, "Wrong size on WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, Temp_bool_Variable) == 0x000014, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, Temp_struct_Variable) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, Temp_struct_Variable_1) == 0x000028, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, CallFunc_GetTeam_ReturnValue) == 0x000038, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, CallFunc_IsPurchaseRequirementMet_Return) == 0x000070, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::CallFunc_IsPurchaseRequirementMet_Return' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, K2Node_Select_Default) == 0x000074, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000084, "Member 'WI_ShopItemEntry_Radial_C_Get_Text_RoomReqLevel_ColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Get_TextBlock_Build_ColorAndOpacity
// 0x00E8 (0x00E8 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	E_ShopType                                    Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0058(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0068(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0078(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAllRequirementsMet_Return;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C0(0x0014)()
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00D8(0x0010)()
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity) == 0x0000E8, "Wrong size on WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_byte_Variable) == 0x000014, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_1) == 0x000028, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_2) == 0x000038, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_3) == 0x000048, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_4) == 0x000058, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_5) == 0x000068, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_text_Variable_6) == 0x000078, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_bool_Variable) == 0x000088, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_struct_Variable) == 0x00008C, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, Temp_struct_Variable_1) == 0x00009C, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, CallFunc_AreAllRequirementsMet_Return) == 0x0000AC, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::CallFunc_AreAllRequirementsMet_Return' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, K2Node_Select_Default) == 0x0000B0, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, K2Node_MakeStruct_SlateColor) == 0x0000C0, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity, K2Node_Select_Default_1) == 0x0000D8, "Member 'WI_ShopItemEntry_Radial_C_Get_TextBlock_Build_ColorAndOpacity::K2Node_Select_Default_1' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.GetCurrentItemTierIndex
// 0x0108 (0x0108 - 0x0000)
struct WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex final
{
public:
	struct FRoomData                              RoomData_0;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FItemTier>                      ItemTiers;                                         // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ItemTierIndex;                                     // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HighestTierFound;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x0048(0x0050)()
	struct FItemTier                              CallFunc_Array_Get_Item_1;                         // 0x0098(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex) == 0x000108, "Wrong size on WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, RoomData_0) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::RoomData_0' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, ItemTiers) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::ItemTiers' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, ItemTierIndex) == 0x000028, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::ItemTierIndex' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, HighestTierFound) == 0x00002C, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::HighestTierFound' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Array_Get_Item) == 0x000048, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, Temp_int_Loop_Counter_Variable_1) == 0x0000EC, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F0, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F4, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Min_ReturnValue) == 0x0000F8, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000FC, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_Max_ReturnValue) == 0x000100, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000104, "Member 'WI_ShopItemEntry_Radial_C_GetCurrentItemTierIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WI_ShopItemEntry_Radial.WI_ShopItemEntry_Radial_C.Has Item in Inventory
// 0x00B8 (0x00B8 - 0x0000)
struct WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory final
{
public:
	class UItemTiersDefinition*                   ItemToFind;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Item;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTier                              CallFunc_Array_Get_Item;                           // 0x0018(0x0050)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemDefinition*                        K2Node_DynamicCast_AsItem_Definition;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UItemDefinition>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0088(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_Return;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory) == 0x000008, "Wrong alignment on WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory");
static_assert(sizeof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory) == 0x0000B8, "Wrong size on WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, ItemToFind) == 0x000000, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::ItemToFind' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, Has_Item) == 0x000008, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::Has_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, CallFunc_Array_Get_Item) == 0x000018, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, K2Node_DynamicCast_AsItem_Definition) == 0x000078, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::K2Node_DynamicCast_AsItem_Definition' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'WI_ShopItemEntry_Radial_C_Has_Item_in_Inventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
