#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SurrenderVote

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WI_SurrenderVote.WI_SurrenderVote_C.CheckboxClicked
// 0x0008 (0x0008 - 0x0000)
struct WI_SurrenderVote_C_CheckboxClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SurrenderVote_C_CheckboxClicked) == 0x000008, "Wrong alignment on WI_SurrenderVote_C_CheckboxClicked");
static_assert(sizeof(WI_SurrenderVote_C_CheckboxClicked) == 0x000008, "Wrong size on WI_SurrenderVote_C_CheckboxClicked");
static_assert(offsetof(WI_SurrenderVote_C_CheckboxClicked, Button) == 0x000000, "Member 'WI_SurrenderVote_C_CheckboxClicked::Button' has a wrong offset!");

// Function WI_SurrenderVote.WI_SurrenderVote_C.ExecuteUbergraph_WI_SurrenderVote
// 0x0210 (0x0210 - 0x0000)
struct WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_1;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTeamID_ReturnValue;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStateJP*>                 CallFunc_GetPlayersOfTeam_ReturnValue;             // 0x0060(0x0010)(ReferenceParm)
	class APlayerStateJP*                         CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_2;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0010)()
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP_MatchBP_C*               K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_3;   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateJP_Match*                     CallFunc_GetGameStateJP_Match_ReturnValue_1;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0200(0x0010)()
};
static_assert(alignof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote) == 0x000008, "Wrong alignment on WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote");
static_assert(sizeof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote) == 0x000210, "Wrong size on WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, EntryPoint) == 0x000000, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000038, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP) == 0x000040, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_1) == 0x000050, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetTeamID_ReturnValue) == 0x000059, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetPlayersOfTeam_ReturnValue) == 0x000060, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetPlayersOfTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Array_Get_Item) == 0x000070, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_2) == 0x000080, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_2' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000090, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E8, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_MakeArray_Array) == 0x000138, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Format_ReturnValue) == 0x000148, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_CustomEvent_Button) == 0x000158, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000160, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_3) == 0x000168, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_AsPlayer_State_JP_Match_BP_3' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_DynamicCast_bSuccess_3) == 0x000170, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, Temp_int_Loop_Counter_Variable) == 0x000174, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Less_IntInt_ReturnValue) == 0x000178, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Add_IntInt_ReturnValue_1) == 0x00017C, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetGameStateJP_Match_ReturnValue) == 0x000180, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetGameStateJP_Match_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Greater_IntInt_ReturnValue) == 0x000189, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_GetGameStateJP_Match_ReturnValue_1) == 0x000190, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_GetGameStateJP_Match_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000199, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Subtract_IntInt_ReturnValue) == 0x00019C, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0001A0, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A8, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, K2Node_MakeArray_Array_1) == 0x0001F0, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote, CallFunc_Format_ReturnValue_1) == 0x000200, "Member 'WI_SurrenderVote_C_ExecuteUbergraph_WI_SurrenderVote::CallFunc_Format_ReturnValue_1' has a wrong offset!");

}

