#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_SpecialAbilityDetailsPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.ExecuteUbergraph_WI_SpecialAbilityDetailsPanel
// 0x0060 (0x0060 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNeighborSpecialAbilityDefinition> K2Node_CustomEvent_SpecialAbilityDefinition;       // 0x0008(0x0028)(HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNeighborSpecialAbilityDefinition*      K2Node_DynamicCast_AsNeighbor_Special_Ability_Definition; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel) == 0x000060, "Wrong size on WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, EntryPoint) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, K2Node_CustomEvent_SpecialAbilityDefinition) == 0x000008, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::K2Node_CustomEvent_SpecialAbilityDefinition' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, Temp_object_Variable) == 0x000048, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, K2Node_DynamicCast_AsNeighbor_Special_Ability_Definition) == 0x000050, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::K2Node_DynamicCast_AsNeighbor_Special_Ability_Definition' has a wrong offset!");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WI_SpecialAbilityDetailsPanel_C_ExecuteUbergraph_WI_SpecialAbilityDetailsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.OnLoaded_C3A0BE3D430E7189847A86AA34D3789B
// 0x0008 (0x0008 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B) == 0x000008, "Wrong size on WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B, Loaded) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_OnLoaded_C3A0BE3D430E7189847A86AA34D3789B::Loaded' has a wrong offset!");

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.SetDescription
// 0x0010 (0x0010 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_SetDescription final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_SetDescription) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_SetDescription");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_SetDescription) == 0x000010, "Wrong size on WI_SpecialAbilityDetailsPanel_C_SetDescription");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_SetDescription, Name_0) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_SetDescription::Name_0' has a wrong offset!");

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.SetIcon
// 0x0028 (0x0028 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_SetIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon_0;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_SetIcon) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_SetIcon");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_SetIcon) == 0x000028, "Wrong size on WI_SpecialAbilityDetailsPanel_C_SetIcon");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_SetIcon, Icon_0) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_SetIcon::Icon_0' has a wrong offset!");

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.SetName
// 0x0010 (0x0010 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_SetName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_SetName) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_SetName");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_SetName) == 0x000010, "Wrong size on WI_SpecialAbilityDetailsPanel_C_SetName");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_SetName, Name_0) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_SetName::Name_0' has a wrong offset!");

// Function WI_SpecialAbilityDetailsPanel.WI_SpecialAbilityDetailsPanel_C.SetSpecialAbilityDefinition
// 0x0028 (0x0028 - 0x0000)
struct WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition final
{
public:
	TSoftObjectPtr<class UNeighborSpecialAbilityDefinition> SpecialAbilityDefinition;                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition) == 0x000008, "Wrong alignment on WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition");
static_assert(sizeof(WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition) == 0x000028, "Wrong size on WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition");
static_assert(offsetof(WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition, SpecialAbilityDefinition) == 0x000000, "Member 'WI_SpecialAbilityDetailsPanel_C_SetSpecialAbilityDefinition::SpecialAbilityDefinition' has a wrong offset!");

}

