#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TeamStatusBar_Team_Portrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TeamStatusBar_Team_Portrait.WI_TeamStatusBar_Team_Portrait_C
// 0x00C8 (0x04F8 - 0x0430)
class UWI_TeamStatusBar_Team_Portrait_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CharacterImage;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DeathOverlayBorder;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DeathTimerLabel;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           HealthbarProgressbar;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HealthBarSizeBox;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TeamColorBackground;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_LookAtMeEffect_C*                   WI_LookAtMeEffect;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_VoiceChatTeammate_C*                WI_VoiceChatTeammate;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETeamType                                     TeamType;                                          // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowHealthBar;                                     // 0x0479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NeighborID;                                        // 0x047C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Blue_Color;                                        // 0x0484(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Red_Color;                                         // 0x0494(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           None_Color;                                        // 0x04A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthBarFillColor;                                // 0x04B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HealthFraction;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStateJP*                         PlayerState;                                       // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead;                                              // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRespawnTimer;                                  // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RespawnTimeRemaining;                              // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CurrentRespawnTimerHandle;                         // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_WI_TeamStatusBar_Team_Portrait(int32 EntryPoint);
	void Handle_Character_Role_Changed(class APlayerStateJP* PlayerState_0, const struct FCharacterRoleData& CharacterRole);
	void Handle_PlayerState_Pawn_Death(class ACharacter* Character);
	void HandleDeathRespawnTimeWindowChanged(class APlayerStateJP_Match* PlayerState_0, const struct FDeathRespawnTimeWindow& DeathRespawnTimeWindow);
	void HandleHealthChanged(double CurrentHealth, double MaxHealth, double CurrentHealthFraction);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Respawn_Timer_Tick();
	void SetCharacterId(const struct FGameplayTag& NeighborID_0);
	void SetDead(bool Dead_0);
	void SetHealthFraction(double HealthFraction_0);
	void SetPlayerState(class APlayerStateJP* NewPlayerState);
	void SetRespawnTimeRemaining(double RespawnTimeRemaining_0);
	void SetShowHealthBar(bool ShowHealthBar_0);
	void SetShowRepawnTimer(bool ShowRespawnTimer_0);
	void SetTeam(ETeamType TeamType_0);
	void TryReadDeadStateFromPlayerStatePawn(bool* Success);
	void UpdateSpeakingState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TeamStatusBar_Team_Portrait_C">();
	}
	static class UWI_TeamStatusBar_Team_Portrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TeamStatusBar_Team_Portrait_C>();
	}
};
static_assert(alignof(UWI_TeamStatusBar_Team_Portrait_C) == 0x000008, "Wrong alignment on UWI_TeamStatusBar_Team_Portrait_C");
static_assert(sizeof(UWI_TeamStatusBar_Team_Portrait_C) == 0x0004F8, "Wrong size on UWI_TeamStatusBar_Team_Portrait_C");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, UberGraphFrame) == 0x000430, "Member 'UWI_TeamStatusBar_Team_Portrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, CharacterImage) == 0x000438, "Member 'UWI_TeamStatusBar_Team_Portrait_C::CharacterImage' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, DeathOverlayBorder) == 0x000440, "Member 'UWI_TeamStatusBar_Team_Portrait_C::DeathOverlayBorder' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, DeathTimerLabel) == 0x000448, "Member 'UWI_TeamStatusBar_Team_Portrait_C::DeathTimerLabel' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, HealthbarProgressbar) == 0x000450, "Member 'UWI_TeamStatusBar_Team_Portrait_C::HealthbarProgressbar' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, HealthBarSizeBox) == 0x000458, "Member 'UWI_TeamStatusBar_Team_Portrait_C::HealthBarSizeBox' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, TeamColorBackground) == 0x000460, "Member 'UWI_TeamStatusBar_Team_Portrait_C::TeamColorBackground' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, WI_LookAtMeEffect) == 0x000468, "Member 'UWI_TeamStatusBar_Team_Portrait_C::WI_LookAtMeEffect' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, WI_VoiceChatTeammate) == 0x000470, "Member 'UWI_TeamStatusBar_Team_Portrait_C::WI_VoiceChatTeammate' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, TeamType) == 0x000478, "Member 'UWI_TeamStatusBar_Team_Portrait_C::TeamType' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, ShowHealthBar) == 0x000479, "Member 'UWI_TeamStatusBar_Team_Portrait_C::ShowHealthBar' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, NeighborID) == 0x00047C, "Member 'UWI_TeamStatusBar_Team_Portrait_C::NeighborID' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, Blue_Color) == 0x000484, "Member 'UWI_TeamStatusBar_Team_Portrait_C::Blue_Color' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, Red_Color) == 0x000494, "Member 'UWI_TeamStatusBar_Team_Portrait_C::Red_Color' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, None_Color) == 0x0004A4, "Member 'UWI_TeamStatusBar_Team_Portrait_C::None_Color' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, HealthBarFillColor) == 0x0004B4, "Member 'UWI_TeamStatusBar_Team_Portrait_C::HealthBarFillColor' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, HealthFraction) == 0x0004C8, "Member 'UWI_TeamStatusBar_Team_Portrait_C::HealthFraction' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, PlayerState) == 0x0004D0, "Member 'UWI_TeamStatusBar_Team_Portrait_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, Dead) == 0x0004D8, "Member 'UWI_TeamStatusBar_Team_Portrait_C::Dead' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, ShowRespawnTimer) == 0x0004D9, "Member 'UWI_TeamStatusBar_Team_Portrait_C::ShowRespawnTimer' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, RespawnTimeRemaining) == 0x0004E0, "Member 'UWI_TeamStatusBar_Team_Portrait_C::RespawnTimeRemaining' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, CurrentRespawnTimerHandle) == 0x0004E8, "Member 'UWI_TeamStatusBar_Team_Portrait_C::CurrentRespawnTimerHandle' has a wrong offset!");
static_assert(offsetof(UWI_TeamStatusBar_Team_Portrait_C, Async_Action) == 0x0004F0, "Member 'UWI_TeamStatusBar_Team_Portrait_C::Async_Action' has a wrong offset!");

}

