#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TabPanelContent

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WI_TabPanelContent.WI_TabPanelContent_C.ExecuteUbergraph_WI_TabPanelContent
// 0x0050 (0x0050 - 0x0000)
struct WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InVisible;                            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InDirection;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_5;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent) == 0x000008, "Wrong alignment on WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent");
static_assert(sizeof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent) == 0x000050, "Wrong size on WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, EntryPoint) == 0x000000, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable) == 0x000004, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable_1) == 0x000005, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable) == 0x000006, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable_1) == 0x000007, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable_2) == 0x000008, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable_3) == 0x000009, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable_2) == 0x00000A, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable_3) == 0x00000B, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable_4) == 0x00000C, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable_4) == 0x00000D, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_byte_Variable_5) == 0x00000E, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Event_InVisible) == 0x00000F, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Event_InVisible' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Event_InDirection) == 0x000010, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Event_InDirection' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default) == 0x000014, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, CallFunc_Greater_IntInt_ReturnValue) == 0x000016, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default_1) == 0x000017, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, Temp_bool_Variable_5) == 0x000018, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default_2) == 0x000020, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default_3) == 0x000028, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default_4) == 0x000030, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Select_Default_5) == 0x000038, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent, K2Node_Event_Animation) == 0x000048, "Member 'WI_TabPanelContent_C_ExecuteUbergraph_WI_TabPanelContent::K2Node_Event_Animation' has a wrong offset!");

// Function WI_TabPanelContent.WI_TabPanelContent_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WI_TabPanelContent_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanelContent_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WI_TabPanelContent_C_OnAnimationFinished");
static_assert(sizeof(WI_TabPanelContent_C_OnAnimationFinished) == 0x000008, "Wrong size on WI_TabPanelContent_C_OnAnimationFinished");
static_assert(offsetof(WI_TabPanelContent_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WI_TabPanelContent_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WI_TabPanelContent.WI_TabPanelContent_C.SetTabVisibility
// 0x0008 (0x0008 - 0x0000)
struct WI_TabPanelContent_C_SetTabVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDirection;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_TabPanelContent_C_SetTabVisibility) == 0x000004, "Wrong alignment on WI_TabPanelContent_C_SetTabVisibility");
static_assert(sizeof(WI_TabPanelContent_C_SetTabVisibility) == 0x000008, "Wrong size on WI_TabPanelContent_C_SetTabVisibility");
static_assert(offsetof(WI_TabPanelContent_C_SetTabVisibility, InVisible) == 0x000000, "Member 'WI_TabPanelContent_C_SetTabVisibility::InVisible' has a wrong offset!");
static_assert(offsetof(WI_TabPanelContent_C_SetTabVisibility, InDirection) == 0x000004, "Member 'WI_TabPanelContent_C_SetTabVisibility::InDirection' has a wrong offset!");

}

