#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TabPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TabPanel.WI_TabPanel_C
// 0x0020 (0x0338 - 0x0318)
class UWI_TabPanel_C final : public UJPTabPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWI_JPArrowButton_C*                    NextTab;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_JPArrowButton_C*                    PrevTab;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FJPTabPanelViewModel& InViewModel);
	void BndEvt__WI_TabPanel_NextTab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WI_TabPanel_PrevTab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WI_TabPanel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TabPanel_C">();
	}
	static class UWI_TabPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TabPanel_C>();
	}
};
static_assert(alignof(UWI_TabPanel_C) == 0x000008, "Wrong alignment on UWI_TabPanel_C");
static_assert(sizeof(UWI_TabPanel_C) == 0x000338, "Wrong size on UWI_TabPanel_C");
static_assert(offsetof(UWI_TabPanel_C, UberGraphFrame) == 0x000318, "Member 'UWI_TabPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TabPanel_C, NextTab) == 0x000320, "Member 'UWI_TabPanel_C::NextTab' has a wrong offset!");
static_assert(offsetof(UWI_TabPanel_C, PrevTab) == 0x000328, "Member 'UWI_TabPanel_C::PrevTab' has a wrong offset!");
static_assert(offsetof(UWI_TabPanel_C, Title) == 0x000330, "Member 'UWI_TabPanel_C::Title' has a wrong offset!");

}

