#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_TwitchVoteResultHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_TwitchVoteResultHUD.WI_TwitchVoteResultHUD_C
// 0x0048 (0x0328 - 0x02E0)
class UWI_TwitchVoteResultHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimateIn;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   VoteSubject;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible)
	class FText                                   VoteDescription;                                   // 0x0308(0x0010)(Edit, BlueprintVisible)
	class FText                                   TextDescription;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WI_TwitchVoteResultHUD(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_TwitchVoteResultHUD_C">();
	}
	static class UWI_TwitchVoteResultHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_TwitchVoteResultHUD_C>();
	}
};
static_assert(alignof(UWI_TwitchVoteResultHUD_C) == 0x000008, "Wrong alignment on UWI_TwitchVoteResultHUD_C");
static_assert(sizeof(UWI_TwitchVoteResultHUD_C) == 0x000328, "Wrong size on UWI_TwitchVoteResultHUD_C");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_TwitchVoteResultHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, AnimateIn) == 0x0002E8, "Member 'UWI_TwitchVoteResultHUD_C::AnimateIn' has a wrong offset!");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, RichTextBlock) == 0x0002F0, "Member 'UWI_TwitchVoteResultHUD_C::RichTextBlock' has a wrong offset!");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, VoteSubject) == 0x0002F8, "Member 'UWI_TwitchVoteResultHUD_C::VoteSubject' has a wrong offset!");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, VoteDescription) == 0x000308, "Member 'UWI_TwitchVoteResultHUD_C::VoteDescription' has a wrong offset!");
static_assert(offsetof(UWI_TwitchVoteResultHUD_C, TextDescription) == 0x000318, "Member 'UWI_TwitchVoteResultHUD_C::TextDescription' has a wrong offset!");

}

