#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UpgradeRoomPromptRoomEntry

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_UpgradeRoomPromptRoomEntry.WI_UpgradeRoomPromptRoomEntry_C
// 0x0018 (0x02F8 - 0x02E0)
class UWI_UpgradeRoomPromptRoomEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlockRoomAndLevel;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ERooms                                        RoomType;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RoomLevel;                                         // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_UpgradeRoomPromptRoomEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_UpgradeRoomPromptRoomEntry_C">();
	}
	static class UWI_UpgradeRoomPromptRoomEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_UpgradeRoomPromptRoomEntry_C>();
	}
};
static_assert(alignof(UWI_UpgradeRoomPromptRoomEntry_C) == 0x000008, "Wrong alignment on UWI_UpgradeRoomPromptRoomEntry_C");
static_assert(sizeof(UWI_UpgradeRoomPromptRoomEntry_C) == 0x0002F8, "Wrong size on UWI_UpgradeRoomPromptRoomEntry_C");
static_assert(offsetof(UWI_UpgradeRoomPromptRoomEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_UpgradeRoomPromptRoomEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomPromptRoomEntry_C, TextBlockRoomAndLevel) == 0x0002E8, "Member 'UWI_UpgradeRoomPromptRoomEntry_C::TextBlockRoomAndLevel' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomPromptRoomEntry_C, RoomType) == 0x0002F0, "Member 'UWI_UpgradeRoomPromptRoomEntry_C::RoomType' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomPromptRoomEntry_C, RoomLevel) == 0x0002F4, "Member 'UWI_UpgradeRoomPromptRoomEntry_C::RoomLevel' has a wrong offset!");

}

