#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UnlockConfirmation

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.AddButtons
// 0x0010 (0x0010 - 0x0000)
struct WI_UnlockConfirmation_C_AddButtons final
{
public:
	TArray<struct FOnlineStoreItemCost>           Costs;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WI_UnlockConfirmation_C_AddButtons) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_AddButtons");
static_assert(sizeof(WI_UnlockConfirmation_C_AddButtons) == 0x000010, "Wrong size on WI_UnlockConfirmation_C_AddButtons");
static_assert(offsetof(WI_UnlockConfirmation_C_AddButtons, Costs) == 0x000000, "Member 'WI_UnlockConfirmation_C_AddButtons::Costs' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WI_UnlockConfirmation_C_BndEvt__WI_UnlockConfirmation_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.ExecuteUbergraph_WI_UnlockConfirmation
// 0x0158 (0x0158 - 0x0000)
struct WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemCost                   CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue; // 0x0018(0x000C)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRewardDataAsset*                 K2Node_DynamicCast_AsPlayer_Reward_Data_Asset;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOnlineStoreItemData                   K2Node_CustomEvent_StoreItemData;                  // 0x0040(0x0048)()
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlayerRewardDataAsset>  CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetPlayerRewardDataAsset_ReturnValue;  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOnlineStoreItemCost>           K2Node_CustomEvent_Costs;                          // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	struct FOnlineStoreItemData                   CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue; // 0x0100(0x0048)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation");
static_assert(sizeof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation) == 0x000158, "Wrong size on WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, EntryPoint) == 0x000000, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, Temp_object_Variable) == 0x000010, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue) == 0x000018, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_MakeOnlineStoreItemCostStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_DynamicCast_AsPlayer_Reward_Data_Asset) == 0x000028, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_DynamicCast_AsPlayer_Reward_Data_Asset' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_CustomEvent_StoreItemData) == 0x000040, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_CustomEvent_StoreItemData' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_CustomEvent_Loaded) == 0x000088, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset) == 0x000098, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_TryGetPlayerRewardDataAsset_OutSoftPlayerRewardDataAsset' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_TryGetPlayerRewardDataAsset_ReturnValue) == 0x0000C0, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_TryGetPlayerRewardDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_CustomEvent_Costs) == 0x0000C8, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_CustomEvent_Costs' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_Event_IsDesignTime) == 0x0000ED, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue) == 0x000100, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::CallFunc_MakeOnlineStoreItemDataVirtualCurrencyUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_ComponentBoundEvent_Button_1) == 0x000148, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation, K2Node_ComponentBoundEvent_Button) == 0x000150, "Member 'WI_UnlockConfirmation_C_ExecuteUbergraph_WI_UnlockConfirmation::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F
// 0x0008 (0x0008 - 0x0000)
struct WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F");
static_assert(sizeof(WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F) == 0x000008, "Wrong size on WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F");
static_assert(offsetof(WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F, Loaded) == 0x000000, "Member 'WI_UnlockConfirmation_C_OnLoaded_DC5C0A8C41B93F6D64C052B34E2B6B6F::Loaded' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WI_UnlockConfirmation_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_PreConstruct) == 0x000001, "Wrong alignment on WI_UnlockConfirmation_C_PreConstruct");
static_assert(sizeof(WI_UnlockConfirmation_C_PreConstruct) == 0x000001, "Wrong size on WI_UnlockConfirmation_C_PreConstruct");
static_assert(offsetof(WI_UnlockConfirmation_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WI_UnlockConfirmation_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.SetConfirmButtonInfo
// 0x0128 (0x0128 - 0x0000)
struct WI_UnlockConfirmation_C_SetConfirmButtonInfo final
{
public:
	struct FOnlineStoreItemCost                   StoreItemCost;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineStoreGameInstanceSubsystem*      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UOnlineCurrency>         CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineCurrency*                        K2Node_DynamicCast_AsOnline_Currency;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetAssetIdentifier_ReturnValue;           // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrencyAmount_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
};
static_assert(alignof(WI_UnlockConfirmation_C_SetConfirmButtonInfo) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_SetConfirmButtonInfo");
static_assert(sizeof(WI_UnlockConfirmation_C_SetConfirmButtonInfo) == 0x000128, "Wrong size on WI_UnlockConfirmation_C_SetConfirmButtonInfo");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, StoreItemCost) == 0x000000, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::StoreItemCost' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency) == 0x000020, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_TryGetCurrencyFromTagIdentifier_OutCurrency' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue) == 0x000048, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_TryGetCurrencyFromTagIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000098, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, K2Node_DynamicCast_AsOnline_Currency) == 0x0000A0, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::K2Node_DynamicCast_AsOnline_Currency' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_GetAssetIdentifier_ReturnValue) == 0x0000AC, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_GetAssetIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_GetCurrencyAmount_ReturnValue) == 0x0000B4, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_GetCurrencyAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B8, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_BooleanOR_ReturnValue) == 0x0000BA, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, K2Node_MakeArray_Array) == 0x000108, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetConfirmButtonInfo, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WI_UnlockConfirmation_C_SetConfirmButtonInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct WI_UnlockConfirmation_C_SetIcon final
{
public:
	class UPlayerRewardDataAsset*                 PlayerRewardDataAsset;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WI_UnlockConfirmation_C_SetIcon) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_SetIcon");
static_assert(sizeof(WI_UnlockConfirmation_C_SetIcon) == 0x000008, "Wrong size on WI_UnlockConfirmation_C_SetIcon");
static_assert(offsetof(WI_UnlockConfirmation_C_SetIcon, PlayerRewardDataAsset) == 0x000000, "Member 'WI_UnlockConfirmation_C_SetIcon::PlayerRewardDataAsset' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.SetInfo
// 0x0048 (0x0048 - 0x0000)
struct WI_UnlockConfirmation_C_SetInfo final
{
public:
	struct FOnlineStoreItemData                   StoreItemData;                                     // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WI_UnlockConfirmation_C_SetInfo) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_SetInfo");
static_assert(sizeof(WI_UnlockConfirmation_C_SetInfo) == 0x000048, "Wrong size on WI_UnlockConfirmation_C_SetInfo");
static_assert(offsetof(WI_UnlockConfirmation_C_SetInfo, StoreItemData) == 0x000000, "Member 'WI_UnlockConfirmation_C_SetInfo::StoreItemData' has a wrong offset!");

// Function WI_UnlockConfirmation.WI_UnlockConfirmation_C.SetPromptText
// 0x0078 (0x0078 - 0x0000)
struct WI_UnlockConfirmation_C_SetPromptText final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
static_assert(alignof(WI_UnlockConfirmation_C_SetPromptText) == 0x000008, "Wrong alignment on WI_UnlockConfirmation_C_SetPromptText");
static_assert(sizeof(WI_UnlockConfirmation_C_SetPromptText) == 0x000078, "Wrong size on WI_UnlockConfirmation_C_SetPromptText");
static_assert(offsetof(WI_UnlockConfirmation_C_SetPromptText, ItemName) == 0x000000, "Member 'WI_UnlockConfirmation_C_SetPromptText::ItemName' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetPromptText, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WI_UnlockConfirmation_C_SetPromptText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetPromptText, K2Node_MakeArray_Array) == 0x000058, "Member 'WI_UnlockConfirmation_C_SetPromptText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WI_UnlockConfirmation_C_SetPromptText, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WI_UnlockConfirmation_C_SetPromptText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

