#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_UpgradeRoomButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "JP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_UpgradeRoomButton.WI_UpgradeRoomButton_C
// 0x0100 (0x03E0 - 0x02E0)
class UWI_UpgradeRoomButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Upgrading;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Upgrade;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Ready;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTestButtonWI_C*                        Button_Upgrade;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Costs;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_41;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_62;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bokke;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CostBorder;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Upgrading;                                 // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_76;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressbarWI_C*                       ProgressbarWI;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_348;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RoomType;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextCostTitle;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMoneyCost;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMoneyCostAmount;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextResourceCostAmount;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextRessourceCost;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxRoomsRequired;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxUpgradeReady;                           // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_RoomManager_C*                      RoomManager;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             On_HoldButtonComplete;                             // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAudioComponent*                        UpgradeAudioComponent;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             On_ButtonPressed;                                  // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             On_ButtonReleased;                                 // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ButtonHeld;                                        // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_Hold_Upgrade();
	void Audio_Upgrade_Complete();
	void Audio_Upgrade_Release_Early();
	void BndEvt__WI_UpgradeRoomButton_TestButtonWI_K2Node_ComponentBoundEvent_0_ButtonPressed__DelegateSignature();
	void BndEvt__WI_UpgradeRoomButton_TestButtonWI_K2Node_ComponentBoundEvent_1_ButtonReleased__DelegateSignature();
	bool CanAffordUpgrade();
	void Construct();
	void ExecuteUbergraph_WI_UpgradeRoomButton(int32 EntryPoint);
	struct FLinearColor Get_Button_Upgrade_ColorAndOpacity();
	class FText Get_Text_TimeRemaining();
	class FText Get_TextBlock_RoomType();
	class FText Get_TextCostTitle();
	class FText Get_TextMoneyCostAmount();
	class FText Get_TextResourceCostAmount();
	class FText Get_TextRoomsRequired();
	void GetGroundsKeeperBP(class Abp_groundskeeper_C** AsBp_Groundskeeper);
	float GetPercent();
	void IsAmountOfRoomLevelsMet(class Abp_groundskeeper_C* GroundskeeperBP, bool* Return);
	void On_ButtonPressed__DelegateSignature();
	void On_ButtonReleased__DelegateSignature();
	void On_HoldButtonComplete__DelegateSignature();
	void On_Upgrade_Timer_Elapsed();
	void PreConstruct(bool IsDesignTime);
	void Set_Rooms_Required(class ABP_RoomManager_C* RoomManager_0);
	ESlateVisibility SetOverlayUpgradingVisibility();
	ESlateVisibility SetUpgradeOverlayVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_UpgradeRoomButton_C">();
	}
	static class UWI_UpgradeRoomButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_UpgradeRoomButton_C>();
	}
};
static_assert(alignof(UWI_UpgradeRoomButton_C) == 0x000008, "Wrong alignment on UWI_UpgradeRoomButton_C");
static_assert(sizeof(UWI_UpgradeRoomButton_C) == 0x0003E0, "Wrong size on UWI_UpgradeRoomButton_C");
static_assert(offsetof(UWI_UpgradeRoomButton_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_UpgradeRoomButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Upgrading) == 0x0002E8, "Member 'UWI_UpgradeRoomButton_C::Upgrading' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Upgrade) == 0x0002F0, "Member 'UWI_UpgradeRoomButton_C::Upgrade' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Border_Ready) == 0x0002F8, "Member 'UWI_UpgradeRoomButton_C::Border_Ready' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Button_Upgrade) == 0x000300, "Member 'UWI_UpgradeRoomButton_C::Button_Upgrade' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, HorizontalBox_Costs) == 0x000308, "Member 'UWI_UpgradeRoomButton_C::HorizontalBox_Costs' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Image_2) == 0x000310, "Member 'UWI_UpgradeRoomButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Image_41) == 0x000318, "Member 'UWI_UpgradeRoomButton_C::Image_41' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Image_62) == 0x000320, "Member 'UWI_UpgradeRoomButton_C::Image_62' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Image_Bokke) == 0x000328, "Member 'UWI_UpgradeRoomButton_C::Image_Bokke' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Image_CostBorder) == 0x000330, "Member 'UWI_UpgradeRoomButton_C::Image_CostBorder' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Overlay_Upgrading) == 0x000338, "Member 'UWI_UpgradeRoomButton_C::Overlay_Upgrading' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, ProgressBar_76) == 0x000340, "Member 'UWI_UpgradeRoomButton_C::ProgressBar_76' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, ProgressbarWI) == 0x000348, "Member 'UWI_UpgradeRoomButton_C::ProgressbarWI' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, Spacer_348) == 0x000350, "Member 'UWI_UpgradeRoomButton_C::Spacer_348' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextBlock_RoomType) == 0x000358, "Member 'UWI_UpgradeRoomButton_C::TextBlock_RoomType' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextCostTitle) == 0x000360, "Member 'UWI_UpgradeRoomButton_C::TextCostTitle' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextMoneyCost) == 0x000368, "Member 'UWI_UpgradeRoomButton_C::TextMoneyCost' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextMoneyCostAmount) == 0x000370, "Member 'UWI_UpgradeRoomButton_C::TextMoneyCostAmount' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextResourceCostAmount) == 0x000378, "Member 'UWI_UpgradeRoomButton_C::TextResourceCostAmount' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, TextRessourceCost) == 0x000380, "Member 'UWI_UpgradeRoomButton_C::TextRessourceCost' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, VerticalBoxRoomsRequired) == 0x000388, "Member 'UWI_UpgradeRoomButton_C::VerticalBoxRoomsRequired' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, VerticalBoxUpgradeReady) == 0x000390, "Member 'UWI_UpgradeRoomButton_C::VerticalBoxUpgradeReady' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, RoomManager) == 0x000398, "Member 'UWI_UpgradeRoomButton_C::RoomManager' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, On_HoldButtonComplete) == 0x0003A0, "Member 'UWI_UpgradeRoomButton_C::On_HoldButtonComplete' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, UpgradeAudioComponent) == 0x0003B0, "Member 'UWI_UpgradeRoomButton_C::UpgradeAudioComponent' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, On_ButtonPressed) == 0x0003B8, "Member 'UWI_UpgradeRoomButton_C::On_ButtonPressed' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, On_ButtonReleased) == 0x0003C8, "Member 'UWI_UpgradeRoomButton_C::On_ButtonReleased' has a wrong offset!");
static_assert(offsetof(UWI_UpgradeRoomButton_C, ButtonHeld) == 0x0003D8, "Member 'UWI_UpgradeRoomButton_C::ButtonHeld' has a wrong offset!");

}

