#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_VoiceChat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_VoiceChat.WI_VoiceChat_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_VoiceChat_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GlobalChat;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_SpeechBubble;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TeamChat;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WI_VoiceChat(int32 EntryPoint);
	void OnMessageReceived_AA0212E84A60C3FEC037BD8B26D628E9(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_D112E3B74ECE40A66BD8CB8ED95C8E2A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_VoiceChat_C">();
	}
	static class UWI_VoiceChat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_VoiceChat_C>();
	}
};
static_assert(alignof(UWI_VoiceChat_C) == 0x000008, "Wrong alignment on UWI_VoiceChat_C");
static_assert(sizeof(UWI_VoiceChat_C) == 0x000300, "Wrong size on UWI_VoiceChat_C");
static_assert(offsetof(UWI_VoiceChat_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_VoiceChat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_VoiceChat_C, GlobalChat) == 0x0002E8, "Member 'UWI_VoiceChat_C::GlobalChat' has a wrong offset!");
static_assert(offsetof(UWI_VoiceChat_C, Image_BG_SpeechBubble) == 0x0002F0, "Member 'UWI_VoiceChat_C::Image_BG_SpeechBubble' has a wrong offset!");
static_assert(offsetof(UWI_VoiceChat_C, TeamChat) == 0x0002F8, "Member 'UWI_VoiceChat_C::TeamChat' has a wrong offset!");

}

