#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WinscreenNameplate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_WinscreenNameplate.WI_WinscreenNameplate_C
// 0x0020 (0x0300 - 0x02E0)
class UWI_WinscreenNameplate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Name_0;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Portrait;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WI_WinscreenNameplate(int32 EntryPoint);
	void SetPortraitAndName(TSoftObjectPtr<class UTexture2D> Texture, const class FText& InText);
	void SetTalkingVisibility(bool IsTalking);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_WinscreenNameplate_C">();
	}
	static class UWI_WinscreenNameplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_WinscreenNameplate_C>();
	}
};
static_assert(alignof(UWI_WinscreenNameplate_C) == 0x000008, "Wrong alignment on UWI_WinscreenNameplate_C");
static_assert(sizeof(UWI_WinscreenNameplate_C) == 0x000300, "Wrong size on UWI_WinscreenNameplate_C");
static_assert(offsetof(UWI_WinscreenNameplate_C, UberGraphFrame) == 0x0002E0, "Member 'UWI_WinscreenNameplate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_WinscreenNameplate_C, Name_0) == 0x0002E8, "Member 'UWI_WinscreenNameplate_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWI_WinscreenNameplate_C, Portrait) == 0x0002F0, "Member 'UWI_WinscreenNameplate_C::Portrait' has a wrong offset!");
static_assert(offsetof(UWI_WinscreenNameplate_C, VoiceIcon) == 0x0002F8, "Member 'UWI_WinscreenNameplate_C::VoiceIcon' has a wrong offset!");

}

