#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_WelcomePassFull

#include "Basic.hpp"

#include "JP_structs.hpp"
#include "JP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_WelcomePassFull.WI_WelcomePassFull_C
// 0x0040 (0x0378 - 0x0338)
class UWI_WelcomePassFull_C final : public USeasonPassContainerWidgetFull
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                NavigateLeft;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NavigateRight;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSeasonPassContainerViewModel          View_Model;                                        // 0x0350(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSeasonPassTierViewModel>       DesignTiers;                                       // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentFocusedIndex;                               // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemsDisplayedAtOnce;                              // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentFocusLength;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyViewModel(const struct FSeasonPassContainerViewModel& ViewModel);
	void BndEvt__WI_WelcomePassFull_NavigateLeft_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WI_WelcomePassFull_NavigateRight_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WI_WelcomePassFull(int32 EntryPoint);
	void FocusOnHighestTierUnlocked();
	double GetBackOffset();
	double GetForwardOffset();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateButtonVisibilityAfterBackScroll();
	void UpdateButtonVisibilityAfterForwardScroll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_WelcomePassFull_C">();
	}
	static class UWI_WelcomePassFull_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_WelcomePassFull_C>();
	}
};
static_assert(alignof(UWI_WelcomePassFull_C) == 0x000008, "Wrong alignment on UWI_WelcomePassFull_C");
static_assert(sizeof(UWI_WelcomePassFull_C) == 0x000378, "Wrong size on UWI_WelcomePassFull_C");
static_assert(offsetof(UWI_WelcomePassFull_C, UberGraphFrame) == 0x000338, "Member 'UWI_WelcomePassFull_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, NavigateLeft) == 0x000340, "Member 'UWI_WelcomePassFull_C::NavigateLeft' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, NavigateRight) == 0x000348, "Member 'UWI_WelcomePassFull_C::NavigateRight' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, View_Model) == 0x000350, "Member 'UWI_WelcomePassFull_C::View_Model' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, DesignTiers) == 0x000358, "Member 'UWI_WelcomePassFull_C::DesignTiers' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, CurrentFocusedIndex) == 0x000368, "Member 'UWI_WelcomePassFull_C::CurrentFocusedIndex' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, ItemsDisplayedAtOnce) == 0x00036C, "Member 'UWI_WelcomePassFull_C::ItemsDisplayedAtOnce' has a wrong offset!");
static_assert(offsetof(UWI_WelcomePassFull_C, CurrentFocusLength) == 0x000370, "Member 'UWI_WelcomePassFull_C::CurrentFocusLength' has a wrong offset!");

}

