#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WI_Winscreen_ReturnScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WI_WinscreenSubBase_classes.hpp"
#include "CommonGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WI_Winscreen_ReturnScreen.WI_Winscreen_ReturnScreen_C
// 0x0028 (0x0478 - 0x0450)
class UWI_Winscreen_ReturnScreen_C final : public UWI_WinscreenSubBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WI_Winscreen_ReturnScreen_C;        // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_45;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_ReturnPanel_C*                      WI_ReturnPanel;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWI_WelcomePassPreview_Winscreen_V2_C*  WI_WelcomePassPreview_Winscreen_V2;                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ClearChatOnExit();
	void Construct();
	void ExecuteUbergraph_WI_Winscreen_ReturnScreen(int32 EntryPoint);
	class FString GetLeaveMessage();
	void OnLeaveClicked(class UCommonButtonBase* Button);
	void OnPlayAgainClicked(class UCommonButtonBase* Button);
	void OnResult_A9AC10C64969E1B866B04F9AF574A3BE(ECommonMessagingResult Result);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WI_Winscreen_ReturnScreen_C">();
	}
	static class UWI_Winscreen_ReturnScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWI_Winscreen_ReturnScreen_C>();
	}
};
static_assert(alignof(UWI_Winscreen_ReturnScreen_C) == 0x000008, "Wrong alignment on UWI_Winscreen_ReturnScreen_C");
static_assert(sizeof(UWI_Winscreen_ReturnScreen_C) == 0x000478, "Wrong size on UWI_Winscreen_ReturnScreen_C");
static_assert(offsetof(UWI_Winscreen_ReturnScreen_C, UberGraphFrame_WI_Winscreen_ReturnScreen_C) == 0x000450, "Member 'UWI_Winscreen_ReturnScreen_C::UberGraphFrame_WI_Winscreen_ReturnScreen_C' has a wrong offset!");
static_assert(offsetof(UWI_Winscreen_ReturnScreen_C, Image_45) == 0x000458, "Member 'UWI_Winscreen_ReturnScreen_C::Image_45' has a wrong offset!");
static_assert(offsetof(UWI_Winscreen_ReturnScreen_C, Overlay_1) == 0x000460, "Member 'UWI_Winscreen_ReturnScreen_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWI_Winscreen_ReturnScreen_C, WI_ReturnPanel) == 0x000468, "Member 'UWI_Winscreen_ReturnScreen_C::WI_ReturnPanel' has a wrong offset!");
static_assert(offsetof(UWI_Winscreen_ReturnScreen_C, WI_WelcomePassPreview_Winscreen_V2) == 0x000470, "Member 'UWI_Winscreen_ReturnScreen_C::WI_WelcomePassPreview_Winscreen_V2' has a wrong offset!");

}

